[
    {
        "title": "A",
        "desc": "<p>To see the letter &quot;A&quot; in your dream represents the beginning of a new stage. You are moving on to something new and grand. Alternatively, the letter &quot;A&quot; invokes feelings of superiority and grandeur. It may indicate the name or initial of a person.<\/p>"
    },
    {
        "title": "Aardvark",
        "desc": "<p>To see an aardvark in your dream indicates that you are being very secretive and cautious about your business.<\/p>"
    },
    {
        "title": "Abacus",
        "desc": "<p>To see or use an abacus in your dream refers to your outdated views. You have an old fashion perspective on certain issues.<\/p>"
    },
    {
        "title": "Abalone",
        "desc": "<p>To see or eat abalone in your dream indicates a transitional period in your life. The symbol may also be a play on words to indicate feelings of &quot;loneliness&quot;.<\/p>"
    },
    {
        "title": "Abandonment",
        "desc": "<p>To dream that you are abandoned suggests that it is time to leave behind past feelings and characteristics that are hindering your growth. Let go of your old attitudes. A more direct and literal interpretation of this dream indicates you have a fear of being deserted, abandoned, or even betrayed. It may stem from a recent loss or a fear of losing a loved one. The fear of abandonment may manifest itself into your dream as part of the healing process and dealing with losing a loved one. It may also stem from unresolved feelings or problems from childhood. Alternatively, the dream indicates that you are feeling neglected or that your feelings are being overlooked. Perhaps the dream is a metaphor that you need to approach life with &quot;reckless abandon&quot; and live more freely.<\/p><p>To abandon others in your dream suggests that you are overwhelmed by the problems and decisions in your life.<\/p>"
    },
    {
        "title": "Abbey",
        "desc": "<p>To see an abbey in your dream signifies spirituality, peace of mind and freedom from anxiety. You are in a state of contentment and satisfaction. Help for you is always around the corner.<\/p><p>To see an abbey in ruins indicates feelings of hopelessness. You have a tendency to not finish what you started.<\/p>"
    },
    {
        "title": "Abbot",
        "desc": "<p>To see an abbot in your dream suggests that someone has power over you and are making you do things that you do not necessarily want to do. You are feeling confined or restricted. The dream indicates that you will experience many obstacles and setback before achieving success and prestige.<\/p>"
    },
    {
        "title": "Abbreviations",
        "desc": "<p>To see abbreviations in your dream may represent the initials of someone in your life. The abbreviations could stand for an organization or a common acronym or it may spell out some hidden message or advice. The dreaming mind likes to make use of puns, as well as shorthand messages. For example, &quot;CD&quot; could be a pun on a &quot;seedy&quot; situation. &quot;AA&quot; could stand for Alcoholics Anonymous and thus point to the dangers or your excesses and negative behaviors. &quot;Inc&quot; may represent an &quot;inkling&quot;, hunch or suspicious you have about a situation.<\/p><p>The initails DM may refer to a direct message or perhaps that you need to check Dream Moqds for your dream anaylsis.<\/p>"
    },
    {
        "title": "Abdomen",
        "desc": "<p>To see your abdomen in a dream refers to your natural instincts and repressed emotions. There is something in your real life that you &quot;cannot stomach&quot; or have difficulties accepting. You need to get it out of your system. Alternatively, the dream symbol may be strictly physiological and you may just be experiencing constipation or indigestion.<\/p><p>To dream that your abdomen is exposed represents issues you have with trust and feelings of vulnerability. You are expressing your primal emotions and instincts.<\/p><p>To dream that your abdomen is swollen indicates that some new project is in the works.<\/p>"
    },
    {
        "title": "Abduction",
        "desc": "<p>To dream of being abducted indicates that you are being manipulated by your circumstances or by someone. You lack control of your own life.<\/p><p>To witness an abduction in your dream signifies feelings of helplessness.<\/p><p>To dream that you are abducting someone implies that you are holding on to something that you need to let go.<\/p><p>You may be forcing your views and opinions on others.<\/p>"
    },
    {
        "title": "Abhorrence",
        "desc": "<p><span style=\"mso-fareast-font-family: Times New Roman; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA\">To dream that you abhor a person represents your waking dislike for that person. You are harboring feelings of resentment or aggression and feel that this person has acted in a less than honorable way.<\/p><p>To dream that you are abhorred by others suggests that you may be forcing your views and opinions on others. You are rubbing others the wrong way.<\/p>"
    },
    {
        "title": "Abnormal",
        "desc": "<p>To dream of some abnormality or of abnormal objects indicate that the problems that have been preoccupying your mind will soon be resolved. Note that anything appearing abnormal draws attention to that particular aspect. Something in your life may not be consistent with how you feel things should be.<\/p>"
    },
    {
        "title": "Abode",
        "desc": "<p>*Please See: <a href=\"#Home\">Home<\/a>.<\/p>"
    },
    {
        "title": "Abominable Snowman",
        "desc": "<p>*Please See: <a href=\"#Yeti\">Yeti<\/a>.<\/p>"
    },
    {
        "title": "Aborigine",
        "desc": "<p>To see an Aborigine in your dream represents both your untamed, natural self and your pure, innocent side. You need to be more in touch with your intuition and inner forces. It also suggests that you are being overindulgent or overly emotional. You may be harming yourself and jeopardizing your well-being due to your unrestraint.<\/p>"
    },
    {
        "title": "Abortion",
        "desc": "<p>To dream that you have an abortion suggests that you are hindering and blocking your own growth. You may be hesitant in pursuing a new direction in your life due to fear, pressure, personal conflict or moral obligation. The dream may also be a reflection of your own real-life abortion and thus serves as a way of healing from the trauma and working towards self-acceptance.<\/p><p>Alternatively, this dream may also be a message for you to take care and look after your health.<\/p><p>To dream that someone has an abortion refers to an aspect of your relationship with this person is not growing or maturing. If you do not know this person, then the dream may be about your own personal views on abortion.<\/p><p>To dream that you or someone has an illegal abortion indicates that you are desperate to keep things the exact same. If the abortion results in death, then it means that your approach to a problem is all wrong.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=abortiondream1\">Boiling A Rabbit<\/a>&quot;<\/p>"
    },
    {
        "title": "Above",
        "desc": "<p>To see something above you in your dream suggests that you need to set your goals higher. Aim high!<\/p><p>Alternatively, the dream indicates that you are feeling inferior or inadequate.<\/p>"
    },
    {
        "title": "Abraham Lincoln",
        "desc": "<p>To see Abraham Lincoln in your dream refers to your solid character and leadership ability. Known as &quot;Honest Abe&quot;, the dream may also be telling you to be truthful or to come clean about something.<\/p>"
    },
    {
        "title": "Abroad",
        "desc": "<p>To dream of being or going abroad indicates unbalance and chaos in your current situation and condition. Consequently, your dream may represent your need for a change in scenery or a desire to escape from a current situation. You need to make some drastic changes in your life.<\/p><p>Alternatively, the dream may suggest that you need to expand your horizons or experience a new sense of spirituality.<\/p>"
    },
    {
        "title": "Absence",
        "desc": "<p>To dream that someone is absent, especially if you expect to find them, suggests that you are looking for something that is already lost to you. Alternatively, you may be looking to fill a void in your life. Something is missing from your life.<\/p>"
    },
    {
        "title": "Abscess",
        "desc": "<p>To dream that you have an abscess suggests that there is something that you need to express and get out into the open.<\/p><p>*Please see: <a href=\"#Sores\">Sores<\/a>.<\/p>"
    },
    {
        "title": "Abscond",
        "desc": "<p>To dream that you have absconded with something indicates your failed accomplishments. You may also be feeling insecure about your achievements. You feel that you are never good enough. Consider the significance or value of what you have absconded.<\/p>"
    },
    {
        "title": "Absorb",
        "desc": "<p>To be absorbed in whatever you are doing suggests that you may be too focused on your own thing and risk alienating others around you. The dream may also be a metaphor that you need to integrate and adapt to your various surroundings.<\/p>"
    },
    {
        "title": "Abstinence",
        "desc": "<p>To dream that you practice abstinence from drinking, sex or any other sort of sensual temptation is a warning against being over confidant. You need to take things more slowly.<\/p>"
    },
    {
        "title": "Abundance",
        "desc": "<p>To dream of having an abundance of a certain item indicates that you need to conserve your resources and energies.<\/p><p>This dream may be a compensatory dream for something that you are lacking in life. More directly, abundance signifies happiness.<\/p>"
    },
    {
        "title": "Abuse",
        "desc": "<p>To dream you are abusing someone suggests that your past actions will come back to haunt you. You may be expressing some regret or remorse over your actions.<\/p><p>To dream you are being verbally or physically abused suggests that you are feeling victimized in a waking situation. You are being taking advantage of.<\/p><p>To see children being abused in your dream implies that you are lacking a voice for your own inner child. You feel that a part of your own childhood is lost.<\/p>"
    },
    {
        "title": "Abyss",
        "desc": "<p>To dream of an abyss signifies an obstacle that is creating much anxiety for you. You need to work through the difficulty and overcome this obstacle in your life. Perhaps you are afraid of &quot;taking the plunge&quot;.<\/p><p>To dream that you are falling into an abyss symbolizes the depths of your subconscious. You are afraid and\/or uncertain as to what you will discover about yourself and about your hidden feelings and fears. The abyss may also represent your primal fears and feelings of &quot;falling into a pit of despair&quot;. Perhaps you are in a state of depression or wallowing in your negative feelings. Alternatively, the dream could denote your lack of spirituality.<\/p>"
    },
    {
        "title": "Acacia",
        "desc": "<p>To see an acacia tree in your dream symbolizes your attitudes with death and your sense of mortality.<\/p>"
    },
    {
        "title": "Academy",
        "desc": "<p>To dream of an academy signifies new friendships and opportunities.<\/p>"
    },
    {
        "title": "Academy Awards",
        "desc": "<p>Todream that you at the Academy Awards indicates that you need to add some glamour into your life. If you win an Oscar, then it implies that you are looking for some sort of acknowledgment in your waking life.<\/p>"
    },
    {
        "title": "Accelerator",
        "desc": "<p>To see an accelerator in your dream indicates that you will achieve your goals through your own efforts. The dream may also be telling you to slow down.<\/p><p>To dream that the accelerator is jammed or broken indicates a loss of control in some aspect of your life.<\/p><p>You maybe trying to rush through things.<\/p>"
    },
    {
        "title": "Accent",
        "desc": "<p>To speak with an accent in your dream suggests that you are having difficulties conveying your thoughts. Consider how you feel about the accent. If you feel the accent makes you stand out in a negative way, then it signifies feelings of insecurities. If the accent makes you stand out in a positive way, then it symbolizes an air of confidence.<\/p><p>To hear someone speaking with an accent in your dream represents something familiar yet different. You are getting the gist of a message, but you still do not completely understand all of it.<\/p>"
    },
    {
        "title": "Acceptance",
        "desc": "<p>To dream about acceptance indicates issues of self-esteem and measuring up to the expectations of others. There is a waking situation where you are seeking acceptance and wanting to be a part of.<\/p>"
    },
    {
        "title": "Accessory",
        "desc": "<p>To dream of accessorizing yourself suggests that you are feeling incomplete. Something is missing in your life.<\/p>"
    },
    {
        "title": "Accident",
        "desc": "<p>To dream that you are in an accident signifies pent-up guilt in which you are subconsciously punishing yourself over.<\/p><p>Perhaps you are not proud of something you have done. Alternatively, the accident may symbolize an error or mistake you have made. Accident dreams also represent your fears of being in an actual, physical accident. You may simply be nervous about getting behind the wheel. Or the dream is trying to warn you of some accident.<\/p><p>To dream of a car accident symbolizes your emotional state. You may be harboring deep anxieties and fears. Are you &quot;driving&quot; yourself too hard? Perhaps you need to slow down before you hit disaster. You need to rethink or re-plan your course of actions and set yourself on a better path.<\/p><p>Dreaming that someone is injured in a car accident means that you cannot control the action of others. They have to live with the consequences of their own decisions.<\/p><p>To dream that a loved one dies in an accident indicates that something within your own Self is no longer functional and is &quot;dead&quot;. It is also symbolic of your own relationship with that person. Perhaps you need to let go of this relationship.<\/p><p>If you dream that you die from a car accident and actually see the reactions of your loved ones, then it suggests that your reckless activity is affecting those around you. This dream is a wake-up call.<\/p>"
    },
    {
        "title": "Accomplice",
        "desc": "<p>To dream that you are an accomplice to a crime suggests that someone in your waking life is having a negative influence on you. You may be experiencing feelings of guilt with something that you have done.<\/p><p>To dream that you have an accomplice implies that others are enabling your negative habits or behavior.<\/p>"
    },
    {
        "title": "Accordion",
        "desc": "<p>To hear the music of an accordion signifies some saddening and depressing matter. You need to focus on more joyous moments.<\/p><p>To dream that you play the accordion denotes intense emotions that are causing physical strain to your body. You are feeling weary. Alternatively, the dream suggests that you need to work hard to achieve your goals.<\/p>"
    },
    {
        "title": "Accountant",
        "desc": "<p>To see or dream that you are an accountant represents your objectivity toward some situation. You are taking a step back and looking carefully at the facts."
    },
    {
        "title": "Accounts",
        "desc": "<p>To dream about your bank accounts indicates financial worries.<\/p>"
    },
    {
        "title": "Accuse",
        "desc": "<p>To dream that you are being accused of something indicates overwhelming feelings of guilt. It may also mean that you are having some doubts about yourself and the choices you are making.<\/p><p>To dream that you accuse others signifies disagreements and dissension with those around you.<\/p>"
    },
    {
        "title": "Ace",
        "desc": "<p>To see the ace in the deck of cards suggests ambiguity in your life. You need some clarity.<\/p><p>In particular, the ace of hearts means that you are involved in some love affair. If you see the ace of spades in your dream, then it means that you are involved in a scandal. If you see the ace of diamonds, then it symbolizes your legacy or reputation. And if you see the ace of clubs, then it indicates that you will be involved in some legal matter.<\/p><p>Alternatively, the dream may be a metaphor that you are an &quot;ace&quot;. Or the dream is a pun on &quot;acing&quot; a test.<\/p>"
    },
    {
        "title": "Aches",
        "desc": "<p>To dream that you have aches indicate some hesitation and reluctance in the pursuit of your goals. If you wait too long, then the opportunity may escape.<\/p>"
    },
    {
        "title": "Achievement",
        "desc": "<p>To dream of an achievement denotes that you will be greatly satisfied with the outcome of a situation or project. The bigger the achievement, the greater the satisfaction.<\/p>"
    },
    {
        "title": "Acid",
        "desc": "<p>To see acid in your dream represents feelings of hatred, rage, and\/or revenge. Your integrity may be compromised or called into question. Alternatively, seeing acid in your dream indicates that you are being manipulated by a situation or by someone. The dream may also be a metaphor to symbolize a negative influence in your life. Something or someone is eating away at you.<\/p><p>To dream that you drink acid indicates that you are emotionally paralyzed and need to learn how to express yourself.<\/p><p>Dreaming of acid rain indicates that you have been mislead. You are letting hatred and revenge take over and define you.<\/p>"
    },
    {
        "title": "Acne",
        "desc": "<p>*Please See: <a href=\"#Pimples\">Pimples<\/a>.<\/p>"
    },
    {
        "title": "Acorn",
        "desc": "<p>To see an acorn in your dream symbolizes strength and durability. Seemingly small beginnings will have the greatest potential for growth. Don't underestimate your minor goals. Alternatively, the dream means that you are about to enter a new phase in your life.<\/p><p>To dream that you are eating acorns or picking them from the ground suggests that you will enjoy the benefits of your success after long and hard work.<\/p><p>To dream that you are shaking acorns from a tree indicates that you have significant influence on others.<\/p>"
    },
    {
        "title": "Acquaintance",
        "desc": "<p>To see an acquaintance in your dream represents aspects of yourself that you are still trying to get to know.<\/p><p>To dream that you are disputing with an acquaintance represents aspects of yourself that you are rejecting. You are refusing to accept certain things about yourself.<\/p>"
    },
    {
        "title": "Acquit",
        "desc": "<p>To dream that you are acquitted of a crime represents a valuable lesson to be learned.<\/p><p>To see others acquitted in your dream indicates that you need to balance your hard work with fun and pleasure.<\/p>"
    },
    {
        "title": "Acrobat",
        "desc": "<p>To see or do acrobats in your dream suggest that you need to better balance aspects of your life. It could also mean that fears will prevent you from achieving your goals. Alternatively, acrobatics in your dream may be a metaphor for sexual intercourse.<\/p>"
    },
    {
        "title": "Acrylic Nails",
        "desc": "<p>If you are wearing fake fingernails in your dream then it suggest that you are reaching out to others, but do not have their best interest in mind. You may be acting in a disingenuous way.<\/p>"
    },
    {
        "title": "Acting",
        "desc": "<p>To dream that you are acting indicates that you are putting up a front and pretending to be someone you are not in some waking situation.<\/p>"
    },
    {
        "title": "Action Figure",
        "desc": "<p>To see or dream that you are playing with an action figure suggests that you are being manipulated in some way. Or you tend to do what other people expect of you. Consider the significance of the way that the action figure is dressed.<\/p>"
    },
    {
        "title": "Actor\/Actress",
        "desc": "<p>Tosee an actor or actress in your dream represents your pursuit for pleasure. Your admiration of a particular celebrity may lead to a desire to have some of their physical or personality traits. Consider also who this actor\/actress is and what characteristics you associatewith her or him. These may be the same characteristics that you need to acknowledge or incorporate into yourself. The dream may also be a pun on her or his name.<\/p><p>To dream that you are an actor denotes that your hard work and labor will be well worth it in the end. It also indicates your strong desires to be recognized and acknowledged.<\/p><p>Perhaps you are putting too much emphasis on your outward appearances. Alternatively, the dream may be analogous to the role that you are playing in your real life, whether it be the role of a parent, sibling, co-worker, etc. Or perhaps you are putting on an act or a facade.<\/p><p>More specifically, if you dream that you are a supporting actor or supporting actress implies that you need to be supportive to those around you. It may seem that your presence doesn't matter, but you play an important part to someone's life. To dream that you are an extra in a movie means that you feel unimportant and unnoticed. Sometimes you feel you are blending in with the background.<\/p><p>To see a particular actor or actress in your dream look at the role they are playing. Even though you may not know them on a personal level, how you perceive them or the characters they play can provide understanding in how it relates to you. See also: <a href=\"#Celebrities\">Celebrities<\/a>.<\/p>"
    },
    {
        "title": "cupuncture",
        "desc": "<p>To dream that you are getting acupuncture suggests that you are in need of healing. You may need to divert your energies to different pursuits. Alternatively, the dream may be a metaphor for a problem or issue that you need to pinpoint.<\/p>"
    },
    {
        "title": "Adam And Eve",
        "desc": "<p>To see Adam and Eve in your dream, suggests that you are ignoring the masculine aspect of yourself (if you are female) or the feminine aspect of yourself (if you are male). Adam and Eve are classic symbols of the animus and anima. Alternatively, the dream indicates an occurrence in your life that will cause you to lose your hopes and chances of success.<\/p>"
    },
    {
        "title": "Adamant",
        "desc": "<p>To dream that you are adamant signifies that you will be thwarted in some desire that you held ever so highly in your life.<\/p>"
    },
    {
        "title": "Adder",
        "desc": "<p>To see an adder in your dream symbolizes a sly or cunning person. This person cannot be trusted. It may also represent something or someone who has slipped out of your hands. The dream may also be a pun on something that you need to add to your life.<\/p>"
    },
    {
        "title": "Addict",
        "desc": "<p>To dream that you are an addict indicates that you are no longer in control of a situation. You have surrendered your power and denied responsibility for your actions. The dream is also representative of fear, low self-esteem issues, and insecurities.<\/p>"
    },
    {
        "title": "Addiction",
        "desc": "<p>To dream that you have an addiction or become addicted represents an obsessive behavior. A situation or a person may be trying to take over your sense of control. The dream also suggests that you have difficulty relating to the world around you.<\/p>"
    },
    {
        "title": "Addition",
        "desc": "<p>To dream that you are solving an addition problem represents something that is straightforward or obvious. Do not read too much into a problem.<\/p><p>To dream that you cannot add correctly indicates confusion and chaos. A more directly interpretation suggests that something in your waking life does not add up.<\/p>"
    },
    {
        "title": "Address",
        "desc": "<p>To dream of your old address suggests that you need to take a look back at the past and learn from it. To dream of a new address indicates the need for change.<\/p><p>To dream that you are addressing an envelope represents your need to explore more possibilities. Weigh your options carefully before making a final decision. Alternatively, the dream suggests that you have found your direction in life and are ready to pursue your goals.<\/p>"
    },
    {
        "title": "Adieu",
        "desc": "<p>*Please See: <a href=\"#Goodbye\">Goodbye<\/a>.<\/p>"
    },
    {
        "title": "Admiral",
        "desc": "<p>To see or dream that you are an admiral represents your ability to tackle life's issues and problems with confidence and decisiveness. The admiral may also symbolize a father figure or authoritative person.<\/p>"
    },
    {
        "title": "Admire",
        "desc": "<p>To dream that you are admiring someone indicates that you need to incorporate the qualities of that person into your Self.<\/p><p>To dream that you are admiring yourself suggests that you are in need of approval and affirmation from others. Alternatively, it may mean that you have a large ego or think overly highly of yourself.<\/p>"
    },
    {
        "title": "Adobe",
        "desc": "<p>To see an adobe structure in your dream symbolizes protection. It also implies that you are well insulated from life's problems. Perhaps you are being too sheltered and are lacking experience in certain areas of your life. Alternatively, an adobe building represents tradition, hard work and a simple way of life. Maybe you need to incorporate these qualities into your waking life.<\/p>"
    },
    {
        "title": "Adolescent",
        "desc": "<p>*Please see: <a href=\"#Teenager\">Teenager<\/a>.<\/p>"
    },
    {
        "title": "Adopt",
        "desc": "<p>To dream that you or others are adopting a child indicates that you are taking on something new and different. Ask yourself what is missing in your life that would make you happy.<\/p><p>To dream that you are adopted suggests that you are longing for the child within you.<\/p><p>Dreaming of adopting a dog symbolizes your desire for a loyal relationship. If you are adopting a cat, then it means that you are embracing a newfound independence.<\/p>"
    },
    {
        "title": "Adulation",
        "desc": "<p>To dream that you seek adulation signifies that you will arrogantly step up to undeserved position of honor.<\/p><p>To dream that you are offering adulation denotes that you are willing to part with something near and dear to you in the hopes of material advancement.<\/p>"
    },
    {
        "title": "Adult",
        "desc": "<p>If you are a child or teenager and dream that you are an adult, then it implies that you need to be more mature about some situation. Perhaps you have some growing up that you need to do. Alternatively, the dream may be reinforcing your sense of responsibility.<\/p>"
    },
    {
        "title": "Adultery",
        "desc": "<p>To dream that you commit adultery or have an affair signifies your sexual urges and desires that are longing to be expressed. Alternatively, it indicates self-betrayal of your subconscious. You may find yourself entangled in a situation that is not in your best interest, perhaps even illegal.<\/p><p>To dream that your mate, spouse, or significant other is cheating on you highlights your insecurities and your fears of being abandoned. You feel that you are being taken for granted. You are lacking attention in the relationship or that he or she is being less affectionate. Alternatively, you feel that you are not measuring up to the expectations of others.<\/p><p>***Go to: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/cheating-dreams.html\">Common Dreams: Cheating Dreams<\/a> for further analysis.<\/p>"
    },
    {
        "title": "Advancement",
        "desc": "<p>To dream that you are advancing in some situation signifies your rapid rise to success and honor. Affairs of the heart will also be in your favor.<\/p><p>To see others advancing ahead of you denotes that others have more important and favorable positions. You need to stop constantly comparing yourself to others.<\/p>"
    },
    {
        "title": "Adventurer",
        "desc": "<p>To dream that you are an adventurer indicates that you are lacking adventure in your waking life. You need some excitement and variety. Alternatively, the dream suggests that you are too absorbed with your ambition that you do not take the time to acknowledge those who have helped you along the way.<\/p>"
    },
    {
        "title": "Adversary",
        "desc": "<p>To dream that you are confronted by an adversary represents a conflict or a fear that you are facing in your waking life. You are in denial or are rejecting an aspect of yourself.<p>To dream that you overcome an adversary indicates a resolution to some inner conflict or waking life problem."
    },
    {
        "title": "Adversity",
        "desc": "<p>To dream that you are met with adversity represents the obstacles that you are facing in your waking life. You feel that you have failed.<\/p><p>To dream that others are in adversity signifies your pessimistic outlook in life. You need to learn to see the brighter side of things.<\/p>"
    },
    {
        "title": "Advertisement",
        "desc": "<p>To dream that you are looking through advertisements represents a message conveyed to you via your subconscious. You need to act on some problem, decision or opportunity. Consider the content of the ads to determine what area of your life needs to be recognized or acknowledged. If someone you know is advertising themselves, then it suggests that this person can help you in your current situation. You may need to learn to ask for help when you need it.<\/p><p>To dream that you are putting out an advertisement indicates hard work is needed to achieve your goals.<\/p>"
    },
    {
        "title": "Advice",
        "desc": "<p>To dream that you are receiving advice suggests that you need to listen to your instinct and gut.<\/p><p>To dream that you are giving advice indicates that you have the knowledge and information to help others.<\/p>"
    },
    {
        "title": "Advisor",
        "desc": "<p>*Please See: <a href=\"#Counselor\">Counselor<\/a>.<\/p>"
    },
    {
        "title": "Advocate",
        "desc": "<p>To dream that you are an advocate for a cause signifies your faithfulness and conviction towards your interest and your loyalty to your friends.<\/p>"
    },
    {
        "title": "erobics",
        "desc": "<p>To dream that you are doing aerobics suggests that you need to get out there and be more active. You need to exercise more.<\/p>"
    },
    {
        "title": "Aerosol",
        "desc": "<p>To see an aerosol can in your dream indicates that you may be feeling under pressure. You need a release.<\/p>"
    },
    {
        "title": "Affair",
        "desc": "<p>*Please see: <a href=\"#Adultery\">Adultery<\/a>.<\/p>"
    },
    {
        "title": "Affection",
        "desc": "<p>To dream that you are showing your affections for someone represents your satisfaction and happiness with a current relationship. It may also indicate your need to be more affectionate to the ones you love and care about. Alternatively, dreaming about affection may be an indicator that you are lacking affection in your waking life.<\/p>"
    },
    {
        "title": "Afraid",
        "desc": "<p>*Please see: <a href=\"#scared\">Scared<\/a>.<\/p>"
    },
    {
        "title": "Afterlife",
        "desc": "<p>To dream of an afterlife refers to your desire of escaping from your own reality. You are feeling disconnected from life and society and want to make a fresh start.<\/p>"
    },
    {
        "title": "Afternoon",
        "desc": "<p>To dream of the afternoon time suggest that it is time to put your energies to good use. Draw and learn from your past experiences and lessons. Alternatively, it symbolizes clarity to a situation.<\/p>"
    },
    {
        "title": "Affliction",
        "desc": "<p>To dream that you have an affliction signifies bad news and possible disaster.<\/p><p>To dream others afflicted in your dream denotes that you will find yourself surrounded by grief and misfortune.<\/p>"
    },
    {
        "title": "Affluence",
        "desc": "<p>To dream that you are affluent represents your achievements and the rewards you reap for your hard work. The dream may be a metaphor for your enriching and fulfilling life.<\/p>"
    },
    {
        "title": "Affront",
        "desc": "<p>To dream that you are affronted suggests that someone is working against you and taking advantage of your ignorance or naivet�. You may find yourself in a compromising situation.<\/p>"
    },
    {
        "title": "rica",
        "desc": "<p>To dream about or that you in Africa reflects your desires to return to your roots. You want to find out more about your heritage. If you are traveling to Africa or thinking about visiting Africa, then your dream may indicate your anticipation of such a trip. Or if you have lived in Africa or been there, then the dream reflects your personal feelings and memories about the continent.<\/p>"
    },
    {
        "title": "African American",
        "desc": "<p>To see an African American in your dream signifies your roots and heritage. You may need to discover the soul within your own self.<\/p><p>Alternatively, the dream may mean that you need to be more expressive and creative.<\/p>"
    },
    {
        "title": "Afro",
        "desc": "<p>To dream that you have an afro signifies creative freedom. You need to be more expressive with your ideas.<\/p>"
    },
    {
        "title": "Agate",
        "desc": "<p>To see a black agate in your dream symbolizes wealth, vigor, and courage.<\/p><p>To see a red agate in your dream represents peace, longevity, and health.<\/p>"
    },
    {
        "title": "Age",
        "desc": "<p>To dreamof your age signifies you anxiety and concern of growing older. It may also represent some regret or failure in your endeavors.<\/p><p>To dream that you are older than you really are signifies wisdom. Perhaps you need to be more sensible. Negatively, it may mean your unyielding ways and rigid thinking.<\/p><p>To dream that you are younger than you really are suggests that you need to be more carefree and be young at heart. Live a little!<\/p><p>If you are a parent and dream that your child is younger than he or she really is, then it means that you are longing for the past. Perhaps you feel that you are no longer important and wish to regress back to a period where you were more needed. Time is passing you by.<\/p>"
    },
    {
        "title": "Aggression",
        "desc": "<p>To dream that you exhibit aggression in your dream denotes repressed sexual needs. It is also a reflection of conflict in your waking life.<\/p>"
    },
    {
        "title": "Agony",
        "desc": "<p>To dream that you are in agony suggests that some decision or nagging problem from your waking life has crept into your dream. It will continue to torment you until it is resolved.<\/p>"
    },
    {
        "title": "Agoraphobia",
        "desc": "<p>To dream that you have agoraphobia signifies a fear of being exposed or seen. You don't like being the center of attention or being the focus. The dream may symbolize a real life phobia or highlight feelings of anxiety.<\/p>"
    },
    {
        "title": "Agreement",
        "desc": "<p>To dream of an agreement indicates resolution to a conflict or problem. Your subconscious is working in accordance with your conscious.<\/p>"
    },
    {
        "title": "Ague",
        "desc": "<p>To dream that you are shivering with an ague forewarns that you will suffer from a physical disorder.<\/p><p>To see others affected with ague in your dreamsuggests that others are offended by your indifference or lack of compassion in some situation.<\/p>"
    },
    {
        "title": "AIDS",
        "desc": "<p>To dream that you have AIDS indicates that your psychological integrity is being attacked. You feel defenseless, weak and powerless.<\/p><p>To dream that your mate has AIDS suggests that you are in an unhealthy or destructive relationship.<\/p><p>There is something that you are not expressing to each other.<\/p><p>To dream that someone else has AIDS signifies your need to be more compassionate and sympathetic to others. Alternatively, the dream may be a pun on &quot;aid&quot;. Perhaps someone is looking for your help in something.<\/p>"
    },
    {
        "title": "Aim",
        "desc": "<p>To dream that you are aiming for something indicates that you need to direct your energies better. Keep your sight on the main goal. If you are aiming a gun or weapon, then it represents feelings of anger or pent up sexuality.<\/p>"
    },
    {
        "title": "Air",
        "desc": "<p>To dream about the air symbolizes creativity and intelligence. If the air is foggy or polluted, then it suggests that your thought process or mind is clouded.<\/p><p>To feel cold air in your dream signifies discordance in your domestic relations and setbacks in your business affairs. You may be in danger of losing touch with reality.<\/p><p>To dream that you are breathing hot air signifies the influence of evil around you.<\/p><p>To dream that you are walking on air refers to your carefree and upbeat attitude. It also signifies confidence; you feel almost invincible. You achieve your goals with relative ease. This dream is a variant of a <a href=\"http:\/\/dreammoods.com\/cgibin\/flyingdreams.pl?method=exact&amp;header=dreamid&amp;search=flyingintro\">flying dream<\/a>. Alternatively, the dream may be telling you that you have lost grasped of reality.<\/p><p>To dream that you can bend air refers to your ability to control and watch what you say. You are careful in how you choose your words.<\/p>"
    },
    {
        "title": "Air Conditioner",
        "desc": "<p>To dream that the air conditioner is not working suggests that you are not able to relax and breathe freely. You may be overly worried about a situation.<\/p><p>To see or feel the air conditioner in your dream represents purification and relief. You have cooled off from some heated argument.<\/p>"
    },
    {
        "title": "Air Gun",
        "desc": "<p>To see or use an air gun in your dream symbolizes an unperceived threat. You are letting your guard down in some situation where you need to be vigilant. .<\/p>"
    },
    {
        "title": "Air Freshener",
        "desc": "<p>To smell air freshener in your dream suggests that you are enjoying life's little pleasure. The dream may bring about the past or certain memories. If the air freshener is too overpowering, then it indicates that your mind is not clear.<\/p><p>You are exhibiting a lack of judgment.<\/p>"
    },
    {
        "title": "Air Force",
        "desc": "<p>To dream that you are in the air force suggests that you need to be more spiritually disciplined.<\/p>"
    },
    {
        "title": "Air Hockey",
        "desc": "<p>To see or play air hockey in your dream refers to something that you need to act quickly on or someone else will.<\/p>"
    },
    {
        "title": "Air Horn",
        "desc": "<p>To hear or sound an air horn in your dream suggests that you are not taking a matter seriously enough. It is time to focus. Alternatively, an air horn is way for your subconscious to get you to pay attention to an important aspect of the dream.<\/p>"
    },
    {
        "title": "Air Raid",
        "desc": "<p>To dream that you are caught in an air raid indicates that you are feeling overwhelmed by things that are seemingly coming out of the blue. You feel a lack of control in your life.<\/p>"
    },
    {
        "title": "Air Show",
        "desc": "<p>To dream that you are in an air show implies that you are showing off your accomplishments to others. You have achieved your goals and want everyone to know it.<\/p>"
    },
    {
        "title": "Airbag",
        "desc": "<p>To see the airbag in a vehicle deploy in your dream forewarns that you will run into a major setback if you keep the pace of your current life path. You need to slow down and take your time. Alternatively, the air bag is symbolic of your support system in your time of need.<\/p>"
    },
    {
        "title": "Aircraft Carrier",
        "desc": "<p>To see an aircraft carrier in your dream suggests that you are preparing to confront your emotions. You are addressing feelings that you have been ignoring or suppressing for too long.<\/p>"
    },
    {
        "title": "Airdancer",
        "desc": "<p>To see an airdancer in your dream represents someone who wants your full attention. Alternatively, dreaming of an airdancer indicates that you are too yielding in a situation. Stand up for yourself.<\/p>"
    },
    {
        "title": "Airplane",
        "desc": "<p>To see an airplane in your dream indicates that you will overcome your obstacles and rise to a new level of prominence and status. You may experience a higher consciousness, new-found freedom and greater awareness. Perhaps you need to gain a better perspective or wider view on something. If the airplane is taking off, then it suggests that an idea or plan is about to &quot;take off&quot; and be put into action. It may also represent your need to get away and escape from your daily life.<\/p><p>Dreaming that the airplane sits on the runway and never takes off refers to a real life project or idea that has failed to get off the ground. You are having difficulties getting started on a project.<\/p><p>To dream that you are flying an airplane suggests that you are in complete control of your destination in life. You are confident and self-assured in your decisions and accomplishments.<\/p><p>To dream that you transfer planes implies an important transitional phase in your life which will take you away from your intended path. These changes will take you to new directions and new heights of status and recognition.<\/p><p>To dream that you miss your connection flight indicates that you are feeling helpless and trapped by some situation. You feel that you are being held back, either physically or mentally. Alternatively, the dream may also suggest that you are feeling disconnected in some aspect of your life - work, relationship or home life.<\/p><p>To dream that a plane crashes suggests that you have set overly high and unrealistic goals for yourself. Your goals may be too high and are impossible to realize. You are in danger of having it come crashing down. Alternatively, your lack of confidence, self-defeating attitude and self-doubt toward the goals you have set for yourself is represented by the crashing airplane; you do not believe in your ability to attain those goals. Loss of power and uncertainty in achieving your goals are also signified.<\/p><p>To dream that an airplane is hijacked signifies disturbing feelings and past emotions in your subconscious mind.<\/p><p>Dreaming of airplanes flying in formation represents working together toward a common goal.<\/p><p>To see an airplane landing in your dream signifies completion of a journey or some task. Some issues that were previously out of control have been resolved.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=airplanedream1\">On The Airplane<\/a>&quot; &amp; &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=airplanedream2\">Plane Crash<\/a>&quot;<\/p>"
    },
    {
        "title": "Airport",
        "desc": "<p>To see an airport in your dream symbolizes birth (arrivals) and death (departures). If the airport is busy, then it signifies the desire for freedom, high ideals, ambition, and hopes. It is an indication that you are approaching a new departure in your life. Some new idea is taking off or is ready to take off. You may be experiencing a new relationship, new career path or new adventure.<\/p><p>To dream of a deserted airport indicates that your plans or goals will be changed or delayed. You are having to put some aspect of your life on hold.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=airportdream1\">Online Encounter<\/a>&quot;<\/p>"
    },
    {
        "title": "Aisle",
        "desc": "<p>To dream that you are walking down or through an aisle represents your ability to move forward in life with confidence. There is balance in your life. Alternatively, the dream indicates dissension and disagreements. You are stuck in the middle between two diverging viewpoints.<\/p>"
    },
    {
        "title": "Alabaster",
        "desc": "<p>To see alabaster in your dream represents success in your love life. You have healthy personal relationships.<\/p><p>To dream that you break an alabaster figurine signifies grief, sorrow, and regrets.<\/p>"
    },
    {
        "title": "Aladdin",
        "desc": "<p>To see or dream that you are Aladdin represents realization of your goals or dreams.<\/p>"
    },
    {
        "title": "Alarm",
        "desc": "<p>To hear or pull an alarm in your dream suggests that you are experiencing a conflict in a relationship or situation which is giving your much anxiety. You may be questioning the decisions you have made.<\/p><p>Alternatively, the dream may be a pun on an &quot;alarming&quot; situation which needs your immediate attention. You need to spring into action quickly.<\/p>"
    },
    {
        "title": "Alarm Clock",
        "desc": "<p>To see or hear an alarm clock in your dream represents your anxieties and fixation with time. You fear that you do not have enough time to meet your deadlines or accomplish your goals.<\/p>"
    },
    {
        "title": "Albatross",
        "desc": "<p>To see an albatross in your dream represents endurance and freedom.<\/p><p>To see a dying or dead albatross in your dream symbolizes bad luck and harsh, vulnerable times.<\/p>"
    },
    {
        "title": "Albino",
        "desc": "<p>To see an albino in your dream represents purity or eternal life. You need to be more accepting and tolerant.<\/p><p>To dream that you are afraid of the albino figure suggests that you are irrationally concerned about the well-being of a loved one. It may also mean denial.<\/p>"
    },
    {
        "title": "Album",
        "desc": "<p>To see an album in your dream indicates that you are surrounded by true friends.<\/p><p>To dream that you are looking through a photo album suggests that you are unwilling to let go of your memories and the past. You are idealizing about the past.<\/p>"
    },
    {
        "title": "Alchemy",
        "desc": "<p>To dream of alchemy suggests that you are going through a period of turmoil, inner transformation, and self-renewal. You are striving toward perfection. Although these may be tough and difficult times, it will have a positive outcome.<\/p>"
    },
    {
        "title": "Alcohol",
        "desc": "<p>To dream that you are enjoying alcohol in moderation denotes contentment and satisfaction in the decisions that you have made. Success is within your grasp. The dream may also be a metaphor for &quot;spirits&quot; and your need for spiritual enrichment.<\/p><p>To dream that you are consuming alcohol in excess signifies feelings of inadequacy, worries, regrets and fears of being discovered for who you really are. You are using alcohol as a way to escape or as an excuse for something you did. Alternatively, the dream may be reflective of waking issues and problems of alcoholism.<\/p><p>Recovering alcoholics often have dreams of drinking which results in feelings of guilt. Such dreams help to reinforce their sobriety.<\/p><p>To dream that someone is an alcoholic (and he\/she is not one in real life) indicates that this person is in desperate need for an outlet to express himself or herself.<\/p><p>He or she may be indirectly asking for help.<\/p>"
    },
    {
        "title": "Alder",
        "desc": "<p>To see an alder tree in your dream symbolizes joy and happiness.<\/p>"
    },
    {
        "title": "Alfred E. Neuman",
        "desc": "<p>To see Alfred E. Newman in your dream suggests that you are being self-conscious. You are in a situation where you fear being ridiculed or mocked.<\/p>"
    },
    {
        "title": "Algae",
        "desc": "<p>To see algae in your dream indicates that you need to leave your emotions out of some matter.<\/p>"
    },
    {
        "title": "Alice In Wonderland",
        "desc": "To dream about Alice in Wonderland indicates that you have a distorted self image. Alternatively, the dream refers to your desire to escape from the routine and mundaness of your daily life. You are looking for some excitement."
    },
    {
        "title": "Alien",
        "desc": "<p>To dream that you are an alien symbolizes the undiscovered part of yourself. Your manifestation as an alien may be your way of &quot;escaping&quot; from reality. Dreams of this nature also symbolize your outlandish ideas and your wild imagination.<\/p><p>To dream that you are being invaded or abducted by aliens indicates your fear of your changing surroundings or your fear of losing your home and family. You feel that your space and\/or privacy is being invaded.<\/p><p>To see aliens in your dream signify that you are having difficulties adapting and adjusting to your new surroundings. You are feeling &quot;alienated&quot; and disconnected. You may also be having difficulties with how to handle or deal with a certain situation or person. On a psychological level, seeing aliens represent an encounter with an unfamiliar or neglected aspect of your own self.<\/p><p>Dreaming that you are having sex with an alien indicates a desire for something new and different in your sex life.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=aliendream1\">Kidnapped By Aliens<\/a>&quot;<\/p>"
    },
    {
        "title": "Alimony",
        "desc": "<p>To dream that you are paying alimony means that you are paying for your past actions and mistakes.<\/p>"
    },
    {
        "title": "All-Seeing Eye",
        "desc": "<p>*Please See: <a href=\"#Eye%20Of%20Providence\">Eye of Providence<\/a>.<\/p>"
    },
    {
        "title": "Allergy",
        "desc": "<p>To dream that you have allergies signify your sensitively to some situation. You may feel that you are physically or emotionally restrained from doing something.<\/p>"
    },
    {
        "title": "Alley",
        "desc": "<p>To see an alley in you dream suggests that you have limited options. Consider the phrase &quot;something is right up your alley&quot; to mean that something may be perfect for you. Learn to be more open minded. Alternatively, an alley indicates that you are sidetracked from your goals due to your domestic duties and communal responsibilities. You are experiencing a dilemma in your waking life.<\/p><p>To dream that you are walking through an alley represents a dead-end. You feel that you have missed out on some opportunity in life. Alternatively, the dream denotes that your reputation is in jeopardy.<\/p><p>You feel that you are on the outside.<\/p>"
    },
    {
        "title": "Alligator",
        "desc": "<p>To see an alligator in your dream symbolizes treachery, deceit, and hidden instincts. It may be a signal for you to take on a new perspective on a situation. It may also represent your ability to move between the physical, material world of waking life and the emotional, repressed world of the subconscious. Alternatively, the alligator represents healing powers and qualities.<\/p><p>An alligator also suggests that you are thick-skinned or insensitive.<\/p><p>To dream that you are running away from the alligator indicates that you are unwilling to confront some painful and disturbing aspect of your subconscious. There is some potentially destructive emotion that you are refusing to acknowledge and owning up to.<\/p><p>Dreaming of a baby alligator implies that you are too trusting. If you are bitten by an alligator in your dream, then it indicates that you have not learned from your past mistakes.<\/p><p>To dream that you are raped by an alligator indicates that you feel violated or taken advantage of in some way. The alligator is symbolic of someone who is ruthless, insensitive and treacherous. This person has a strong hold on you despite your efforts to break free from the unhealthy relationship.<\/p><p>According to biblical interpretations, an alligator suggests that leviathan is king over the children of pride. (Psa 74:14, Job 41:1,Isa 27:1)<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/www.dreammoods.com\/commondreams\/chasedream4.htm\">Alligator In Ostrich Suit<\/a>&quot;<\/p>"
    },
    {
        "title": "Allowance",
        "desc": "<p>To dream of getting an allowance symbolizes the rewards of your work. It may be a pun on &quot;allowing&quot;. You need to be more yielding to others.<\/p>"
    },
    {
        "title": "Alloy",
        "desc": "<p>To see an alloy in your dream indicates that you will experience some complications in your professional life.<\/p>"
    },
    {
        "title": "Almanac",
        "desc": "<p>To see an almanac in your dream represents the ups and downs of life. You are experiencing fleeting pleasures and unsteady finances.<\/p>"
    },
    {
        "title": "Almonds",
        "desc": "<p>To see or eat almonds in your dream represent success and richness.<\/p><p>To see an almond tree in your dream signifies happiness. Wedded bliss is also in your near future. Alternatively, it symbolizes your resilience and your ability to bounce back from some adversity or hardship. I<\/p>"
    },
    {
        "title": "Alms",
        "desc": "<p>To dream that you are giving alms represent your giving nature.<\/p>"
    },
    {
        "title": "Aloe",
        "desc": "<p>To use aloe in your dream suggests that you are ready to heal from some emotional wound. You are ready to forgive or forget about someone's betrayal.<\/p>"
    },
    {
        "title": "Alone",
        "desc": "<p>To dream that you are alone indicates feelings of rejection. You may be feeling that no one understand you.<\/p><p>To dream that want to be left alone suggests that you are not getting enough alone time in your waking life. Perhaps you feel suffocated or smothered by those around you. You just want time alone with your thoughts or ideas.<\/p>"
    },
    {
        "title": "Alphabet",
        "desc": "<p>*Please see: <a href=\"#Letters\">Letters<\/a>.<\/p>"
    },
    {
        "title": "Altar",
        "desc": "<p>To see the altar in your dream suggests that you are making a great personal sacrifice. You may also be expressing concerns about your spirituality.<\/p><p>The dream may also be a pun on your need to &quot;alter&quot; some behavior, attitude or aspect of your life.<\/p><p>To see a priest at the altar in your dream signifies strife and disharmony in both your work and home. The dream may also point to some guilt that you are suppressing and refusing to acknowledge.<\/p><p>To dream that you are kneeing in front of the altar represents unfulfilled desires.<\/p><p>In particular, seeing a satanic altar in your dream indicates that a dark power or energy is at work.<\/p>"
    },
    {
        "title": "Altar Boy",
        "desc": "<p>To see or dream that you are an altar boy symbolizes innocence and purity.<\/p>"
    },
    {
        "title": "Alum",
        "desc": "<p>To see alum in your dream signifies frustrations on plans that you have set for yourself.<\/p><p>To dream that you taste alum denotes that you have feelings of regret and remorse over the evil you have done onto an innocent person.<\/p>"
    },
    {
        "title": "Aluminum",
        "desc": "<p>To see aluminum in your dream signifies your ability to retain what is valuable to you. You are happy with what you have. What may seem insignificant to others is important to you.<\/p>"
    },
    {
        "title": "Alumni",
        "desc": "<p>To dream of being an alumni represents completion and a sense of pride or accomplishment. If you dream of being an alumni of a school that you did not attend in real life, then it indicates that you are dealing with past regrets. You are wondering how your life would be had you made different choices.<\/p>"
    },
    {
        "title": "Alzheimer's Disease",
        "desc": "<p>To dream that you or someone has Alzheimer's Disease refers to your fear of letting go of the past. You are holding on to old memories for fear of forgetting about them. Alternatively, the dream may be an anxiety dream where you are overly worried about forgetting an important date, appointment or event. If someone in your waking life is suffering from Alzheimer's Disease, then the dream may represent the stress and\/or sadness of dealing with the disease.<\/p>"
    },
    {
        "title": "Ambassador",
        "desc": "<p>To dream that you are an ambassador suggests that you need to be more diplomatic in a situation.<\/p>"
    },
    {
        "title": "Amber",
        "desc": "<p>To see amber in your dream symbolizes the sun and positive energy. Amber is said to have natural healing power. Some believe that the amber can heal sore eyes, sprained limbs or arthritis. Thus the amber in your dream could mean you need to be healed in some way.<\/p><p>Alternatively, to see amber in your dream represents resurrection. Something in your past will prove to be extremely important to your future.<\/p><p>It could mean a situation or relationship in your waking life that was once lively, is now non-existent. You feel trapped or that your life is too rigid and inflexible. You need to change your outdated way of thinking and old ideas.<\/p>"
    },
    {
        "title": "Amber Alert",
        "desc": "<p>To dream about an Amber Alert means that you need to be more aware of your surroundings. Perhaps you are overlooking some detail. Consider the significance of the numbers or other information that you see in the Amber Alert and how it relates to an aspect of your waking life.<\/p>"
    },
    {
        "title": "Ambulance",
        "desc": "<p>To see an ambulance in your dream indicates that your careless activities and indiscretion may lead to major problems and complications. This dream may also stem from your own fears of contracting a disease or your deteriorating health. Perhaps, you should cease what you are doing and pay closer attention to some waking situation.<\/p><p>To see an ambulance full of wounded passengers signifies a fear of letting go your old Self and making space for the new you. You are projecting your emotional wounds and painful experiences onto others. Alternatively, it may also mean that you are hanging around the wrong crowd and are doing yourself more harm than good.<\/p><p>To dream that someone is hit by an ambulance suggests that some aspect of your psyche is injured and needs immediate care and attention.<\/p><p>Dreaming that you are driving an ambulance indicates that you are putting the needs of others before your own. Perhaps you are letting others dictate your direction or goals in life.<\/p>"
    },
    {
        "title": "Ambush",
        "desc": "<p>To dream that you have been ambushed forewarns of a danger lurking near you. Your situation has taken an unanticipated turn for the worse. You have been prevented from reaching your goals or destination.<\/p><p>To dream that you are lying in ambush indicates that you will use underhanded means to achieve your goals.<\/p>"
    },
    {
        "title": "America",
        "desc": "<p>If you are from America and dream of America then the dream symbolizes independence and freedom to do what you want. If you are from outside of America, then the dream may represent commercialism, riches, or abundance. Your own political views will also strongly influence this imagery.<\/p>"
    },
    {
        "title": "Amethyst",
        "desc": "<p>To see an amethyst in your dream signifiespeace of mind and satisfaction in your professional and personal life. You are content with where you are in your life. It does not take much to make you happy.<\/p><p>To dream that you lose an amethyst signifies heartbreaks and disappointments in love.<\/p>"
    },
    {
        "title": "Amish",
        "desc": "<p>To see or dream that you are Amish suggests that you need to concentrate on the more important things and basic necessities in life. Alternatively, the dream indicates that you are wishing for a more simplified life.<\/p>"
    },
    {
        "title": "Ammonia",
        "desc": "<p>To see or smell ammonia in your dream indicates that there is some distressing or offensive matter that you need to confront.<\/p>"
    },
    {
        "title": "Ammunition",
        "desc": "<p>To see ammunition in your dream suggests that you are utilizing your power to persuade or protect. Alternatively, it may indicates that you are trying to get your way via destructive means.<\/p>"
    },
    {
        "title": "Amnesia",
        "desc": "<p>To dream that you have amnesia suggests that you are trying to block out the rejected or negative aspect of yourself. You are afraid of change.<\/p>"
    },
    {
        "title": "Amoeba",
        "desc": "<p>To see an amoeba in your dream implies that you need to be more flexible in your situation and adapt to changes.<\/p>"
    },
    {
        "title": "Amorous",
        "desc": "<p>To dream that you are amorous symbolizes temptations. Your personal desires and illicit pleasures may land you into trouble. You will find yourself engulfed in scandal.<\/p><p>To dream that others are amorous signifies that others will try to persuade you into illicit pleasures and abandon your own sense ofmorality.<\/p><p>To see animals amorous in your dream represent animalistic desires. Do not give in to temptation as they will be unfulfilling and unsatisfying.<\/p>"
    },
    {
        "title": "Amphisbaena",
        "desc": "<p>To see an Amphisbaena in your dream suggests that you are being pulled in two different directions. You are feeling overburdened and do not know whether you are coming or going. Your actions are counterproductive. Perhaps the dream represents some complicated love triangle. Alternatively, the dream signifies your desires for children.<\/p>"
    },
    {
        "title": "Amphitheater",
        "desc": "<p>To see or be in an amphitheater in your dream refers to the spreading of some wisdom or knowledge.<\/p>"
    },
    {
        "title": "Amplifier",
        "desc": "<p>To see an amplifier in your dream represents your need to be heard. You need to voice your opinion.<\/p>"
    },
    {
        "title": "Amputation",
        "desc": "<p>To dream that your limbs are amputated signifies abandoned talents and serious, permanent losses. It indicates your feelings of frustration, powerlessness and helplessness.<\/p><p>Sometimes amputation may also represent a situation that you have been ignoring and has finally reached a crisis point. In particular, to dream that your arms are amputated suggests that you lack motivation. Dreaming that your legs are amputated suggests that you are being limited. Something or someone is hindering your progress and where you want to go in life.<\/p>"
    },
    {
        "title": "Amulet",
        "desc": "<p>To see or wear an amulet in your dream indicates your need to feel protected. You are gathering your strength together.<\/p>"
    },
    {
        "title": "Amusement Park",
        "desc": "<p>To see or be in an amusement park in your dream indicates that you need to set some time for more relaxation and enjoyment in your life. The rides, booths and elements in the amusement park are an expression of some aspect of yourself or some area in your life. Look up the symbolism of specific rides for more details. Alternatively, the dream indicates that you are too easily distracted lately.<\/p><p>To dream that the amusement park is empty or abandoned suggests that you need to open yourself to more fun and adventure.<\/p><p>To dream that the rides at the amusement park are breaking down means that something in your life is not going as expected.<\/p><p>To dream that the amusement park is closed suggests that you are denying yourself your time for fun and leisure. You need a break.<\/p>"
    },
    {
        "title": "Anaconda",
        "desc": "<p>To see an anaconda in your dream symbolizes your creativity and potential. This snakes also calls attention to your sexuality and your need to be more in tune with your own sexuality.<\/p><p>*Please See Also: <a href=\"#Snake\">Snake<\/a>.<\/p>"
    },
    {
        "title": "Anal Sex",
        "desc": "<p>To dream about anal sex represents submission. You may be afraid to yield to the wants and desires of others.<\/p>"
    },
    {
        "title": "Analyst",
        "desc": "<p>To dream that you are an analyst suggests that you need to take a closer look at your behavior and actions.<\/p><p>To see an analyst in your dream indicates that you are not acting appropriately in some situation in your life.<\/p>"
    },
    {
        "title": "Anarchy",
        "desc": "<p>To see anarchy in your dream suggests that you need to show some restraint when expressing yourself.<\/p>"
    },
    {
        "title": "Ancestors",
        "desc": "<p>To dream about your ancestors suggest that you are acknowledging your inherited traits and tradition. You may be trying to hold on to the past and preserve it.<\/p>"
    },
    {
        "title": "Anchor",
        "desc": "<p>To see an anchor in your dream signifies stability and security. You may be in search for a solid foundation or a firmer ground in your life. Alternatively, an anchor indicates that you are someone who stands firmly on your views and opinions.<\/p><p>On the other hand, an anchor may be seen as a symbol for something that is holding you back and restraining your freedom. Consider a relationship that may not be working or a career that is going nowhere for you.<\/p>"
    },
    {
        "title": "Ancient",
        "desc": "<p>To dream of an ancient theme symbolizes your sense of foundation. You are well-grounded and are able to learn from your past.<\/p>"
    },
    {
        "title": "Andirons",
        "desc": "<p>To see andirons supporting burning logs in your dream indicate that you have the support of your friends and family. They are there for you.<\/p>"
    },
    {
        "title": "Androgynous",
        "desc": "<p>To see an androgynous person in your dream suggests that you are looking to bring together opposing sides and views. Some aspect of your life requires integration.<\/p>"
    },
    {
        "title": "Androids",
        "desc": "<p>To see or dream that you are an android suggests that you have lost your liveliness and sense of spirit. Your life is becoming to monotonous. Alternatively, the dream indicates that you are acting without thinking.<\/p>"
    },
    {
        "title": "Anecdote",
        "desc": "<p>To tell or read an anecdote in your dream indicates that there is some life lesson or moral that you need to learn or recognize. Alternatively, it refers to your idealistic notions.<\/p>"
    },
    {
        "title": "Anemone",
        "desc": "<p>To see anemones in your dream represent distrust and\/or death. It is indicative of a transitional phase in your life.<\/p>"
    },
    {
        "title": "Anesthesia",
        "desc": "<p>To be under anesthesia in your dream suggests that you are trying to suppress your emotions instead of confronting them. There may be situation in your life that you are desperately trying to avoid. You are refusing to take responsibility for your actions.<\/p>"
    },
    {
        "title": "Aneurysm",
        "desc": "<p>To dream that you have an aneurysm indicates that you are under some sort of pressure. There is a situation or problem that is causing you a lot of stress. If the aneurysm is in your brain, then it implies that you are under mental stress. If it is near your heart, then it indicates emotional stress.<\/p>"
    },
    {
        "title": "Angels",
        "desc": "<p>To see angels in your dream symbolize goodness, purity, protection, comfort and consolation. Pay careful attention to the message that the angels are trying to convey. These messages serve as a guide toward greater fulfillment and happiness. Alternatively, it signifies an unusual disturbance in your soul. Angels may appear in your dream as a result of your wicked and mean-hearted activities.<\/p><p>To dream that you are an angel suggests that you are feeling good about something your said or did.<\/p><p>In particular, to see three angels in your dream symbolize some sort of divinity. It is considered a particularly spiritual and holy dream.<\/p><p>To see an angel holding a scroll in your dream indicates a highly spiritual dream. Your future and goals are more clearer to you. The message on the scroll is particularly significant.<\/p><p>To see an angel of death in your dream refers to some abrupt end to a situation, habit or relationship in your waking life. Alternatively, the angel of death represents aspects of yourself that you have rejected or repressed.<\/p>"
    },
    {
        "title": "Anger",
        "desc": "<p>To dream that you are holding or expressing anger symbolizes frustrations and disappointments in your Self. You tend to repress your negative emotions or project your anger onto others. You need to look within yourself.<\/p><p>Being angry in your dream may have been carried over from your waking life. Dreams function as a safe outlet where you can express your strong and\/or negative emotions. You are suppressing your anger and aggression, instead of consciously acknowledging them.<\/p>"
    },
    {
        "title": "Angling",
        "desc": "<p>To dream that you are angling is a good omen of fortune and luck.<\/p>"
    },
    {
        "title": "Animal",
        "desc": "<p>To see animals in your dream represent your own physical characteristic, primitive desires, and sexual nature, depending on the qualities of the particular animal. Animals symbolize the untamed and uncivilized aspects of yourself. Thus, to dream that you are fighting with an animal signifies a hidden part of yourself that you are trying to reject and push back into your subconscious. Refer to the specific animal in your dream. If you dream of two animals fighting, then it points to some sort of sexual tension.<\/p><p>Dreaming of animals being abused indicates that your own primal desires are being suppressed. You are unable to fully express an important part of who you are. Alternatively, the dream represents your helplessness in a situation.<\/p><p>To dream that animals can talk represent superior knowledge. Its message is often some form of wisdom. Alternatively, a talking animal denotes your potential to be all that you can be.<\/p><p>To dream that you are saving the life of an animal suggests that you are successfully acknowledging certain emotions and characteristics represented by the animal. The dream may also stem from feelings of inadequacy or being overwhelmed. If you are setting an animal free, then it indicates an expression and release of your own primal desires.<\/p><p>To see lab animals in your dream suggest that an aspect of yourself is being repressed. You feel that you are not able to fully express your desires and emotions. Alternatively, it suggests that you need to experiment with your fears, choices, and beliefs. Try not to limit yourself.<\/p><p>A dream about a baby animal is often symbolic of your own child.<\/p><p>*See Also: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/animals.htm\">Dream Themes: Animals<\/a><\/p>"
    },
    {
        "title": "Animal Shelter",
        "desc": "<p>To dream that you are at an animal shelter indicates that you are feeling shut out of some situation or relationship. It may also represent feelings of being unwanted or unloved.<\/p>"
    },
    {
        "title": "Animation",
        "desc": "<p>To dream that you are watching animation suggests that you can find the humor and comedy in most situations. You are taking things light-heartedly.<\/p><p>*Please See Also: <a href=\"#Cartoon\">Cartoon<\/a>.<\/p>"
    },
    {
        "title": "Anime",
        "desc": "<p>To dream that you are watching anime represents your carefree attitude.<\/p><p>To dream that you are an anime character suggests that you need to be more expressive. You need to convey your emotions more clearly.<\/p>"
    },
    {
        "title": "Animosity",
        "desc": "<p>To dream that there is animosity towards you suggests that you need to reevaluate a situation and rethink your issues of morality.<\/p>"
    },
    {
        "title": "Ankh",
        "desc": "<p>To see an ankh in your dream symbolizes empowerment, infinite knowledge, sexual connection or eternity.<\/p>"
    },
    {
        "title": "Ankle",
        "desc": "<p>To dream about your ankles indicates that you are seeking support and direction in your life. Ask yourself where you want to be headed.<\/p><p>To sprain your ankle in your dream suggests that you are experiencing some obstacles or difficulties in your progress.<\/p><p>To dream that your ankles are swollen indicates that you are headed down the wrong path. Alternatively, the dream is telling you to get off your feet and relax. You are pushing yourself too hard.<\/p>"
    },
    {
        "title": "Ankle Monitor",
        "desc": "<p>To see or dream that you are wearing an ankle monitor indicates that you are feeling scrutinized about every step or decision your make. You are afraid of making a wrong move.<\/p>"
    },
    {
        "title": "Anklet",
        "desc": "<p>To see or wear an anklet in your dream refers to the way that your life going and the decisions you made to get to where you are. It also signifies passion and lust.<\/p>"
    },
    {
        "title": "Anniversary",
        "desc": "<p>To dream about your anniversary represents acceptance or appreciation of some aspect of yourself. Consider the type of anniversary. If it is a wedding anniversary, then it symbolizes a celebration of love.<\/p><p>You need to accept love into your life. If it is an anniversary of a death or some solemn occasion, then it suggests a new start. The dream may simply mean a reminder of some important date.<\/p>"
    },
    {
        "title": "Announcer",
        "desc": "<p>To hear an announcer in your dream indicates that you are being watched. Someone is watching your moves or are taking interest in your actions. Alternatively, hearing an announcer in your dream represents a voice from your subconscious.<\/p><p>If you dream that you hear an announcer at a sporting event, then it parallels the actions that you need to take in some area of your waking life.<\/p><p>To dream that you are an announcer means that you are busy observing things going around you instead of partaking in the action.<\/p>"
    },
    {
        "title": "Annoy",
        "desc": "<p>To feel annoyed in your dream represents annoyances that you are feeling in your waking life. Something in your mind is bothering you and you need to express them.<\/p>"
    },
    {
        "title": "Annulment",
        "desc": "<p>To dream that you are getting an annulment suggests that you are in denial about something.<\/p>"
    },
    {
        "title": "Anorexia",
        "desc": "<p>To dream that you have anorexia represents your lack of self-acceptance and self-esteem. You need to learn to love yourself and accept who you are instead of punishing yourself. The dream symbolizes your quest for perfection.<\/p>"
    },
    {
        "title": "Answering Machine",
        "desc": "<p>To see an answering machine in your dream suggests that you are not listening to a message that someone around you is trying to convey. Perhaps you are experiencing difficulties and frustration in understanding some idea or viewpoint.<\/p>"
    },
    {
        "title": "Antarctica",
        "desc": "<p>To dream that you are in Antarctica represents the challenges and hardships in your waking life and your ability to endure it all.<\/p><p>To dream that you live in Antarctica symbolizes your tenacity and drive, even though the odds may be against you.<\/p>"
    },
    {
        "title": "Anteater",
        "desc": "<p>To see an anteater in your dream indicates that you need to proceed with caution in some endeavor.<\/p>"
    },
    {
        "title": "Antelope",
        "desc": "<p>To see an antelope in your dream suggests that your high ambitions will only be achieved through a great expenditure of energy.<\/p><p>You will experience much success as a result of your dedication. Alternatively, the dream may be telling you to flee or retreat from some situation.<\/p><p>To see an antelope collapse in your dream means that you are at fault for a broken-up love affair.<\/p>"
    },
    {
        "title": "Antenna",
        "desc": "<p>To see an antenna in your dream represents your communication with your surroundings. Consider the condition of the antenna to determine your ability to transmit your ideas and convey your thoughts to others.<\/p>"
    },
    {
        "title": "Anthill",
        "desc": "<p>To see an anthill in your dream suggests that you are trying to avoid doing any hard work. You are feeling lazy.<\/p>"
    },
    {
        "title": "Antibiotics",
        "desc": "<p>To dream that you are taking antibiotics suggests that there is some negativity that you are trying to protect yourself against.<\/p>"
    },
    {
        "title": "Antidote",
        "desc": "<p>To dream that you need an antidote suggests that you are seeking some sort of balance in your life. You may be looking to right a wrong that you have done in the past.<\/p>"
    },
    {
        "title": "Antifreeze",
        "desc": "<p>To see or use antifreeze in your dream suggests that you are being emotionally cold and perhaps need to warm up to others more.<\/p>"
    },
    {
        "title": "Antique",
        "desc": "<p>To see antiques in your dream represent your time honored values, tradition, wisdom and inherited personal characteristics. It symbolizes something genuine or proven. Certain things in your past are worth holding onto or worth keeping. If you do not like or appreciate antiques, then is suggests that you are moving away from outdated childhood conditioning or old modes of thinking. On a negative note, you may be discarding or rejecting something of value that you should really be embracing and heeding.<\/p>"
    },
    {
        "title": "Antiseptic",
        "desc": "<p>To dream that you are using an antiseptic symbolizes healing and cleansing. You need to stay away from negative thoughts and think more positively.<\/p>"
    },
    {
        "title": "Antisocial",
        "desc": "<p>To dream that you are feeling or being antisocial suggests that you are not getting enough alone time in your waking life. Perhaps you feel suffocated or smothered by those around you. You just want time alone with your thoughts or ideas. Alternatively, antisocial sentiments points to feelings of being misunderstand.<\/p>"
    },
    {
        "title": "Antlers",
        "desc": "<p>To see antlers in your dream are representative of masculine sexuality, male aggression and assertiveness. It may also be symbolic of a trophy or prize.<\/p>"
    },
    {
        "title": "Ants",
        "desc": "<p>To see ants in your dream signify your general dissatisfaction in your daily life. You are feeling neglected and insignificant. Or petty things will annoy you throughout the following day. The dream may also be a metaphor on feeling antsy or restless. It may also be a pun on your &quot;aunt&quot;.<\/p><p>Ants also symbolize hard work, diligence, cooperation and industry. Increase business activities are expected. On a less positive note, ants symbolize social conformity and mass action. In this regard, you may feel that your life is too structured and orderly.<\/p><p>According to the biblical interpretations, ants symbolize diligence concerning the things of God. Despite its small size, the ant lays up substance during times of plenty. (Prov 30:25)<\/p>"
    },
    {
        "title": "Anubis",
        "desc": "<p>To see Anubis in your dream indicates you are in search of clarity. You need some spiritual guidance. Alternatively, it suggests that death is near.<\/p>"
    },
    {
        "title": "Anus",
        "desc": "<p>To see your anus in your dream signifies negative emotions that you may be holding in and repressing. It represents feelings of guilt, shame, and self-worth. Alternatively, the anus is associated with either your generosity or stinginess. Consider also you or someone in your life who may be anal retentive and perhaps need to loosen up a bit.<\/p>"
    },
    {
        "title": "Anvil",
        "desc": "<p>To see an anvil in your dream signifies that you hold the power and key to your own success, although you will surely have to go through some struggle and difficulty to achieve your success.<\/p><p>To see a broken anvil in your dream denotes that you have let promising opportunities pass you by forever.<\/p>"
    },
    {
        "title": "Anxiety",
        "desc": "<p>To experience anxiety in your dream is a reflection of what you may be feeling during your waking life. You may have repressed thoughts, unexpressed emotions, resentment, or hostility that are triggering your anxiety dream. This dream also suggests that you are taking on too many responsibilities.<\/p>"
    },
    {
        "title": "Apartment",
        "desc": "<p>To dream about an apartment refers to your financial or emotional state. To dream of a large and lavish apartment means that you are headed in the right direction in life. Things will improve for you. To dream of a rundown or messy apartment indicates some financial or emotional turmoil in your life.<\/p>"
    },
    {
        "title": "Apes",
        "desc": "<p>To see an ape in your dream indicates deception, mischievous, and falsehood. Alternatively, it may refer that you or someone have gone &quot;ape&quot;. You need to calm down. The ape may also symbolize your wild inner nature, particularly your sexual nature.<\/p>"
    },
    {
        "title": "Apocalypse",
        "desc": "<p>To dream of the apocalypse signifies an emotional and dramatic change taken place within yourself. The dream may also indicate the end of one kind of lifestyle and the beginning of another.<\/p>"
    },
    {
        "title": "Apollo",
        "desc": "<p>To see Apollo in your dream represents growth. As the sun god, he also signifies enlightenment and insight.<\/p>"
    },
    {
        "title": "Apologize",
        "desc": "<p>To dream that you are apologizing to someone refers to your desire for harmony and truth in your waking life. Perhaps you are feeling guilty about something. Or the dream is a way for your subconscious to alert you to some wrongdoing that you are responsible for. Alternatively, an apology symbolizes forgiveness. You need to let go of some grudge.<\/p><p>To dream that someone is apologizing to you implies that you feel mistreated or wronged. Consider the significance of who is apologizing to you. Perhaps you feel you have betrayed an aspect of your own character.<\/p>"
    },
    {
        "title": "Apparel",
        "desc": "<p>*Please See: <a href=\"#Clothing\">Clothing<\/a>.<\/p>"
    },
    {
        "title": "Apparition",
        "desc": "<p>To see an apparition in your dream symbolizes your spirit for life. It may also be a message from your subconscious. Alternatively, the dream indicates that someone in your life in not really there for you. Although they are physically present, they are not mentally or emotionally there for you.<\/p>"
    },
    {
        "title": "Appear",
        "desc": "<p>To dream that things appear out of no where suggests that you need to utilize your intellect in a more creative and productive way. You need to think clearly and logically. Consider the symbolism of the objects that appear in your dreams for better understanding of your mind and its intellectual power.<\/p>"
    },
    {
        "title": "Appearance",
        "desc": "<p>To dream about your appearance indicates concerns over how others perceive you.<\/p><p>If you appear disheveled in your dream, then it implies low self-esteem issues. If you have a good appearance, then it relates to your positive attitude and self confidence.<\/p>"
    },
    {
        "title": "Appendix",
        "desc": "<p>To dream about your appendix points to a growing issue that you have been overlooking and requires your immediate attention.<\/p><p>Dreaming that you have appendicitis means that you are keeping too many feelings bottled up.<\/p><p>If you dream that you are having your appendix removed, then it indicates that you are confronting some internal hurt that you have been suppressing.<\/p>"
    },
    {
        "title": "Appetite",
        "desc": "<p>To dream of your appetite suggests that there is an area if your life that remains unfulfilled. If you feel hungry or thirsty, then it symbolizes lust and sexual desire.<\/p>"
    },
    {
        "title": "Applause",
        "desc": "<p>To hear applause in your dream indicates that you are seeking acclaim and recognition. You need to acknowledge yourself in some area or situation in your life.<\/p><p>To dream that you are applauding another suggests that you need show more appreciation and praise. Try to be a motivator.<\/p>"
    },
    {
        "title": "Apple Tree",
        "desc": "<p>To see an apple tree in your dream symbolizes grandeur and magnificence. You are feeling larger than life.<\/p>"
    },
    {
        "title": "Apple",
        "desc": "<p>To see apples growing in a tree in your dream symbolize knowledge, wisdom and great prosperity. Rewards are on the horizon for you. Consider also the common phrase, &quot;an apple a day keeps the doctor away&quot; which may imply that you need to take better care of your health. Perhaps you need to go to the doctor. Or the dream may also be a metaphor for a product from Apple.<\/p><p>To dream that you are eating an apple denotes harmony, pleasure, and fertility. Alternatively, eating an apple in you dream symbolizes your sexual appetite, lustful desires, and sexual awareness.<\/p><p>To see green apples represent developing love or love that has yet to blossom.<\/p><p>To see rotten or eaten apples in your dream, indicates that whatever you are striving and aiming for may not be fulfilling, and even harmful to you. It may also represent neglect and carelessness.<\/p><p>If you dream that you are picking apples, then it implies that your hard work and dedication will pay off.<\/p>"
    },
    {
        "title": "Applesause",
        "desc": "<p>To make applesauce in your dream indicates that you are finding more acceptable ways of expressing your sexual desires.<\/p><p>Dreaming of eating applesauce reflects your simple tastes.<\/p>"
    },
    {
        "title": "Appliance",
        "desc": "<p>To fix an appliance in your dream represents your need to work on your relationship and prevent it from falling apart. Consider the significance of the appliance for clues on specific area of the relationship.<\/p>"
    },
    {
        "title": "Application",
        "desc": "<p>To dream that you are filling out an application indicates that you are lacking something in your life. Consider the significance of what the application is for and how it relates to your waking life. Alternatively, the dream may be a pun that you need to &quot;apply&quot; yourself. You need to put forth some effort in order to excel or succeed.<\/p>"
    },
    {
        "title": "Appointment",
        "desc": "<p>To dream that you are going to an appointment suggests that you need to be more goal-oriented. If you dream that you miss an appointment, then it indicates that you are not paying enough attention to some minor details and little things in life.<\/p>"
    },
    {
        "title": "Apprentice",
        "desc": "<p>To dream that you are an apprentice suggests that you will have to prove yourself in order to gain acceptance from your colleagues.<\/p>"
    },
    {
        "title": "Approach",
        "desc": "<p>To dream that you are approaching something or someone signifies a careful and well-thought out plan. The dream is telling you that it is time to move forward.<\/p><p>To dream that you are being approached means that you tend to wait for things to happen instead of making things happen. Be more proactive. Consider the significance of what or who is approaching you.<\/p>"
    },
    {
        "title": "Approval",
        "desc": "<p>To dream that you are looking for approval from someone indicates that you have some dependency issues. You need to stop pleasing others and start thinking about what is best for you.<\/p><p>To see the word &quot;approved&quot; in your dream indicates that you are making the right choice or decision in life. You are on the right track.<\/p><p>To dream that you approve something represents your sense of power.<\/p>"
    },
    {
        "title": "Apricot",
        "desc": "<p>To see apricots in your dream indicate that something is not what it seems. Perhaps you are in denial about something.<\/p><p>To dream that you are eating an apricot forewarns of approaching misfortune. If others are eating apricots, then it suggest that you will be surrounded by unpleasantness.<\/p>"
    },
    {
        "title": "April",
        "desc": "<p>To dream of the month of April denotes pleasure and profit are in store for you. In particular, to dream about April Fool's day indicates that you are acting like a fool or being foolish.<\/p>"
    },
    {
        "title": "Apron",
        "desc": "<p>To see an apron in your dream suggests that you or someone is making a commitment to work on some familial task. You are trying to nurture some project. Alternatively, an apron symbolizes protection and secrecy.<\/p><p>To wear an apron in your dream indicates that you are in a submissive position. You are letting others tell you what to do.<\/p>"
    },
    {
        "title": "Aquamarine",
        "desc": "<p>To see aquamarine in your dream symbolizes youth, vitality, creativity, and hope. The dream may be telling you that you need to open the line of communication with someone. It may also share some significance with the symbol for water.<\/p>"
    },
    {
        "title": "Aquarium",
        "desc": "<p>To see an aquarium in your dream signifies that you have acknowledged your emotions but have not yet confronted them. Thus, it may refer to your subconscious thoughts or repressed sexual desires. Also, you may feel that your life is going nowhere or that you feel it is going in circles. Alternatively, the aquarium may indicate that you need to calm down and set some time for yourself to relax and unwind.<\/p>"
    },
    {
        "title": "Aquarius",
        "desc": "<p>To dream that someone is an Aquarius represents new ideas, individuality and innovation. You are looking ahead and preparing yourself for the future. It also refers to an aspect of yourself that wants everyone within a group to be happy and satisfied.<\/p>"
    },
    {
        "title": "Aqueduct",
        "desc": "<p>To see an aqueduct in your dream symbolizes your spiritual path.<\/p>"
    },
    {
        "title": "Arbiter",
        "desc": "<p>To dream that you are an arbiter refers to your control and power over some matter. You feel that you are above the rules.<\/p><p>To see or work with an arbiter in your dream implies that you are feeling powerless. Alternatively, the dream indicates that you are looking for a resolution to some conflict or problem in your life. The arbiter may represent a spiritual message.<\/p>"
    },
    {
        "title": "Arc",
        "desc": "<p>To see or draw an arc in your dream implies that you are experiencing some setbacks in your plans or goals.<\/p>"
    },
    {
        "title": "Arcade",
        "desc": "<p>To see or dream that you are at an arcade suggests that you need to look back to a previous event or experience that brought you much joy and amusement.<\/p><p>You want to go back to the good 'ole days. The dream arcade also serves as a temporary escape from reality. You are trying to numb and block out your problems. Alternatively, the dream indicates that you are manipulating others or that you feel manipulated.<\/p>"
    },
    {
        "title": "Arch",
        "desc": "<p>To see an arch in your dream represents your support system.<\/p><p>To dream that you are passing under an arch signifies new opportunities. You are headed toward a different direction or phase in your life.<\/p>"
    },
    {
        "title": "Archaeology",
        "desc": "<p>To dream about archaeology indicates your discovery and acknowledgement of your subconscious.<\/p>"
    },
    {
        "title": "Archaeologist",
        "desc": "<p>To dream that you are an archaeologist suggests that you need to learn from past experiences or that you need to look to the past to find answers to present issues.<\/p>"
    },
    {
        "title": "Archbishop",
        "desc": "<p>To see an archbishop in your dream suggests that someone has power over you and are making you do things that you do not necessarily want to do. Alternatively, you are feeling confined or restricted. You will experience many obstacles and setbacks before achieving success and prestige.<\/p>"
    },
    {
        "title": "Archery",
        "desc": "<p>To see archery in your dream suggests that you are setting your goals and planning your direction in life. It signifies attainment and fulfillment of your goals.<\/p>"
    },
    {
        "title": "Architect",
        "desc": "<p>To see an architect in your dream indicates that your creativity is being put to work. You are taking on a new project which will require such creativity.<\/p><p>To dream that you are an architect suggests your need for visual stimulation.<\/p>"
    },
    {
        "title": "Architecture",
        "desc": "<p>*Please See: <a href=\"#Building\">Building<\/a>.<\/p>"
    },
    {
        "title": "Arctic",
        "desc": "<p>To dream that you are in the Arctic symbolizes your emotional state. You may be feeling cold and rigid. Alternatively, it suggests that you are feeling isolated and lonely.<\/p>"
    },
    {
        "title": "Arena",
        "desc": "<p>To see or dream that you are in an arena indicates that you need to be in an environment where you can freely express yourself. You need a stage or platform for your self-expression. Alternatively, the dream may indicate that there is some issue or problem that needs to be brought into the open.<\/p>"
    },
    {
        "title": "Argument",
        "desc": "<p>To dream that you are arguing suggests that you are trying to resolve some internal conflict or some unsettled issue in your waking life.<\/p><p>Consider the symbolism of whom you are arguing with and what you are arguing about. How does he or she reflect some person or some aspect of yourself in your waking life?<p>To hear someone arguing represents issues that are not being openly discussed or acknowledged. You feel overlooked and that your ideas are unimportant insignificant. Sometimes if you hear family members arguing in real life, it can be incorporated into your own dream."
    },
    {
        "title": "Argyle",
        "desc": "<p>To see argyle in your dream refers to your methodical thinking and analytical mind. Perhaps you are overly analytical. Alternatively, argyle indicates monotony. Your life is becoming too routine and repetitious."
    },
    {
        "title": "Aries",
        "desc": "<p>To dream that someone is an Aries suggests new beginnings and growth. It is representative of your leadership, your courage, your passion and your enthusiasm. As represented by the ram, the dream may be telling you that you need to approach an issue or emotion head on. Alternatively, the dream may indicate some mental problem.<\/p>"
    },
    {
        "title": "Arithmetic",
        "desc": "<p>To dream about arithmetic indicates that you are evaluating a situation in your waking life where you need to be more rational in your thinking. Try not to act on your emotions<\/p><p>To dream that you are unable to solve an arithmetic problem or equation, parallels a waking problem where you may be confused about. The dream may offer a hint toward a new approach to the waking problem.<\/p><p>Something does not add up in your life.<\/p>"
    },
    {
        "title": "Ark",
        "desc": "<p>To see an ark in your dream represents rebirth preservation and protection of something valuable. It is symbolic of wholeness.<\/p>"
    },
    {
        "title": "Ark of the Covenant",
        "desc": "<p>To see or find the Ark of the Covenant refers to the strength of your faith and spirituality.<\/p>"
    },
    {
        "title": "Arm",
        "desc": "<p>To see your arms as the emphasis in your dream indicate your nurturance side and your ability to reach out and care for people. Alternatively, it may represent the struggles and challenges in your life. Consider the phrase of \"arming yourself\" which implies that you need to protect yourself, be more aggressive and take a firmer stance on things or the pun &quot;up in arms&quot;, representing anger and your readiness to argue.<\/p><p>To dream that your arm has been injured signifies your inability to care for yourself or your helplessness in reaching out to others. You may have been feeling limited and restricted in terms of your freedom or activities. The right arm signifies your outgoing nature and is associated with masculine energy, while your left arm signifies your supportive or nurturing nature and is associated with feminine qualities. Losing either arm may suggest that you are failing to recognize its respective characteristics.<\/p><p>To dream that you rip someone else's arms out indicates that you are extremely upset with something that this person has done, but you have not been able to fully express your anger. Because you tend to keep your emotions inside, it is finding expression in your dreams in a violent way.<\/p><p>Dreaming that someone has more than two arms symbolizes acceptance, receptiveness or being open minded.<\/p>"
    },
    {
        "title": "Arm Wrestling",
        "desc": "<p>To dream that you are arm wrestling implies that there is a waking situation that requires you to be more hands on.<\/p>"
    },
    {
        "title": "Armadillo",
        "desc": "<p>To see an armadillo in your dream represents your need to establish certain boundaries. You may be putting up walls between you and those who want to know you better. Alternatively, it indicates codependency. You need to be more assertive and not let others step all over you.<\/p>"
    },
    {
        "title": "Armageddon",
        "desc": "<p>To dream about Armageddon suggests that you are feeling hopeless and out of control. The dream may be triggered from the deep emotional stress that you are experiencing in your waking life.<\/p>"
    },
    {
        "title": "Armchair",
        "desc": "<p>To see or sit in an armchair in your dream indicates that you are completely secure about your status and position in your waking life. You have established yourself and deserve respect.<\/p>"
    },
    {
        "title": "Armor",
        "desc": "<p>To dream that you are wearing an armor symbolizes your defense mechanisms. You have developed a way of shielding yourself from things that may hurt you. Alternatively, it means that you are feeling invincible and superior.<\/p><p>To see armor in your dream indicates insecurity. You are worried about your well being.<\/p>"
    },
    {
        "title": "Armored Car",
        "desc": "<p>To see or drive an armored car in your dream suggests that you are feeling insecure about the progress you have made so far in life. Perhaps you feel that you are not measuring up to others. You are building a protective barrier or emotional wall around yourself. Alternatively, the dream means that you need to be careful of your spending and that you need to protect your finances.<\/p>"
    },
    {
        "title": "Armory",
        "desc": "<p>To see an armory in your dream indicates that you are feeling defensive or protective about something. Alternatively, dreaming of an armory symbolizes your energy reserve. There is still a lot of fighting power in you; don't give up.<\/p>"
    },
    {
        "title": "Armpit",
        "desc": "<p>To see\/notice your or someone else's armpit in your dream represents your social connections and your relationships to others. It is the characteristics and personality that you chose to display to the public. Alternatively, the dream may refer to something or some place that is smelly.<\/p><p>To smell your armpit in your dream indicates that you are making some character adjustments in order to smooth over a situation or relationship. Alternatively, it suggests that you are looking for acceptance.<\/p>"
    },
    {
        "title": "Army",
        "desc": "<p>To see the army in your dream symbolizes an overpowering force working against you. You may feel outnumbered or pressured and are unable to deal with this situation.<\/p><p>To dream that you join the army suggests your feelings of superiority. You feel that no one is any match for you.<\/p>"
    },
    {
        "title": "Aroma",
        "desc": "<p>To smell certain aromas in your dream represents past experiences and feelings that you associate with that particular aroma. Something in your waking life may be triggering this past experience. In particular, if the aroma is sweet, then it symbolizes pleasure and joy.<\/p>"
    },
    {
        "title": "Arranged Marriage",
        "desc": "<p>To dream that you are in an arranged marriage suggests that you are feeling forced to do something you do not want to do. You are reluctantly moving into a new stage in your life. You feel that you have no voice or no choice in a situation. Consider how a waking situation may be making you feel voiceless.<\/p>"
    },
    {
        "title": "Arrested",
        "desc": "<p>To dream that you are being arrested indicates issues of control and restraint. Some aspect of your Self may have been prevented from fully developing. Alternatively, it suggests feelings of guilt.<\/p>"
    },
    {
        "title": "Arrow",
        "desc": "<p>To see an arrow in your dream represents the targets you are reaching for and the goals you are setting for yourself.<\/p><p>If you are hit by an arrow, then it refers to a release or exposure of some tension and pressure. Consider the body part that the arrow hits.<\/p><p>To see an old or broken arrow symbolizes disappointments and severed relationships. Alternatively, it may indicate that you have changed your mind about some decision.<\/p><p>To see a two-headed arrow in your dream signifies opposing ideas and viewpoints. You need to consider both sides.<\/p><p>In the Freudian school of thought an arrow symbolizes the penis and its ability to penetrate.<\/p>"
    },
    {
        "title": "Arrowhead",
        "desc": "<p>To see an arrowhead in your dream symbolizes your determination, direction and goal. You are planning a path toward success.<\/p><p>To see a broken arrowhead in your dream represents failure in moving toward your goals.<\/p><p>To dream that you find arrowheads refer to your abandoned goals. They symbolize your ideas that never took off or came to fruition.<\/p>"
    },
    {
        "title": "Arson",
        "desc": "<p>To dream about an arson represents unexpressed rage that has the potential to become destructive. It is best to express your anger instead of keeping it bottled up inside.<\/p>"
    },
    {
        "title": "Art Class",
        "desc": "<p>To dream that you are in an art class means that you need to learn to express yourself in a more creative way. Perhaps you have been suppressing your creative energy and need to let it out.<\/p>"
    },
    {
        "title": "Art Gallery",
        "desc": "<p>To dream that you are in an art gallery represents your past experiences. Something in your past is having an impact in your current situation. Alternatively, the dream may be telling you that you need to capture some moment and preserve it.<\/p>"
    },
    {
        "title": "Art Supply",
        "desc": "<p>To see art supplies in your dream suggest that you are looking for an outlet to express your creativity. It is also a symbol of possibilities and of your imagination.<\/p>"
    },
    {
        "title": "Arteries",
        "desc": "<p>To see your arteries in your dream symbolize how well you carry yourself and your ability to reach out to others. If you dream that your arteries are clogged, then it indicates that some aspect of your personality is hindering your progress or expression.<\/p><p>To dream that your artery is severed suggests that you still have a lot to learn in life.<\/p>"
    },
    {
        "title": "Arthritis",
        "desc": "<p>To dream that you have arthritis indicates that you are having difficulties achieving your goals. You are feeling helpless to do anything or are lacking motivation and\/or desire to move forward with your plans. Alternatively, it signifies your rigid attitudes.<\/p>"
    },
    {
        "title": "Artichoke",
        "desc": "<p>To see or eat an artichoke in your dream suggests that you need to get to the heart of some matter. It is also representative of your potential and creativity. Perhaps you are holding back in how you want to express yourself.<\/p>"
    },
    {
        "title": "Artifact",
        "desc": "<p>To see or find an artifact in your dream symbolizes an aspect of your former self that you still have not completely let go. Although you may grow and evolve, you never forget where you came from. The artifact may also refer to a prior relationship that you still cherish and look back fondly on.<\/p>"
    },
    {
        "title": "Artist",
        "desc": "<p>To dream that you are an artist painting a picture signifies the creative and intuitive side of your character. The picture that you are painting in your dream may symbolize the way that you are visualizing your current situation in your waking life.<\/p>"
    },
    {
        "title": "Artwork",
        "desc": "<p>To dream that you are buying artwork suggests that you are willing to work hard and follow directions. However, you lack leadership abilities.<\/p><p>To dream that you are selling artwork represents your ability to express yourself and your beliefs.<\/p>"
    },
    {
        "title": "Asbestos",
        "desc": "<p>To dream that you have been exposed to asbestos refers to some pent up anger that is on the verge of erupting. You have been holding back some of your true feelings for too long. Alternatively, dreaming of asbestos symbolizes a hidden threat. Someone may be trying to keep you from learning the truth.<\/p><p>Dreaming of removing asbestos indicates regret of something you have done in the past.<\/p>"
    },
    {
        "title": "Ascend",
        "desc": "<p>To see something ascend in your dream indicates that you need to have a better or broader outlook on life. It is also symbolic of your lofty aspirations. Or the dream may be a metaphor of your ability to rise above any situation.<\/p>"
    },
    {
        "title": "Ash Tree",
        "desc": "<p>To see an ash tree in your dream represents stability, protection, unity and solidarity. The dream could be telling you that someone in your walking life is offering you protection and stability. The ash tree may also be a pun on &quot;ashes&quot; and of issues related to the past.<\/p>"
    },
    {
        "title": "Ashes",
        "desc": "<p>To see ashes in your dream signify disappointments, regrets, bitter changes and disruptions. Ashes also represent a failed relationship or a failed business endeavor. You feel that the good times are over and nothing of value is left in your life. Alternatively, ashes indicates that you are dwelling too much on the past. You need to learn to let go.<\/p><p>In particular, to see or clean ashes in a fireplace or stove indicates that you are unsatisfied with aspects of your life. You may be in a rut and feel trapped by your daily routine.<\/p>"
    },
    {
        "title": "Ashram",
        "desc": "<p>To see or dream that you are in an ashram refers to your need for spiritual renewal and healing. You need to take a break from life's demands so you can replenish your energy.<\/p>"
    },
    {
        "title": "Ashtray",
        "desc": "<p>To see or use an ashtray in your dream suggests that you are trying to rid yourself of former feelings\/memories and your old ways. It symbolizes relationships that have been extinguished and no longer intact. Alternatively, it may be related to feelings of anxieties or connected to your smoking habit, especially if you are trying to quit.<\/p>"
    },
    {
        "title": "Asia",
        "desc": "<p>To dream that you are in Asia suggests that you need to adjust to some situation. If you are traveling to Asia or thinking about visiting Asia, then your dream may indicate your anticipation of such a trip.<\/p><p>To see an Asian person in your dream represents an aspect of your own self that is unknown to you. Additionally, to see an elderly Asian person represents tradition, wisdom and knowledge.<\/p>"
    },
    {
        "title": "Ask",
        "desc": "<p>To dream that you are asking someone out on a date reflects your anxieties about really asking this person out. The dream serves as a &quot;rehearsal&quot; to help you with your approach. Dreaming of asking someone out may be your unconscious pushing you to go ahead and ask her or him out.<\/p>"
    },
    {
        "title": "Asp",
        "desc": "<p>To see an asp in your dream symbolizes misfortune, loss of honor and respect, and hostility amongst friends and loved ones.<\/p>"
    },
    {
        "title": "Asparagus",
        "desc": "<p>To see asparagus in your dream symbolizes prosperity.<\/p><p>To eat asparagus in your dream indicates that your actions will result in an unpleasant outcome.<\/p>"
    },
    {
        "title": "Aspen",
        "desc": "<p>To see an aspen in your dream indicates loneliness.<\/p>"
    },
    {
        "title": "Asphalt",
        "desc": "<p>*Please See: <a href=\"#Concrete\">Concrete<\/a>.<\/p>"
    },
    {
        "title": "Asphyxiation",
        "desc": "<p>To dream that you are being asphyxiated implies that you are being smothered or suffocated by a situation or relationship. In particular, if you are in a room or space with no air, then it means that you are feeling trapped by this situation or relationship.<\/p>"
    },
    {
        "title": "Ass",
        "desc": "<p>To see an ass in your dream signifies a lack of understanding. It also suggests that you will come upon many annoyances. The dream may be a metaphor for someone who is being an ass.<\/p><p>To see an ass carrying burdens in your dream signifies that after much patience and hard work, you will succeed in your professional and personal life.<\/p><p>*Please also see: <a href=\"#donkey\">Donkey<\/a>.<\/p>"
    },
    {
        "title": "Assassin",
        "desc": "<p>To dream that you have been assassinated represents a hopeless situation that needs your immediate attention and action.<\/p><p>To dream that you are a witness to an assassination indicates that you need to pay more attention to some small detail. Do not overlook the seemingly insignificant things in life. In particular, to dream that an important political figure is assassinated on your watch implies that you are lacking support in your waking life. You feel you are alone in your views and decisions.<\/p><p>To dream that you are an assassin implies that you are trying to kill an aspect of yourself. Perhaps you are trying to put an end to a habit or relationship. Consider the characteristics of the person you are trying to assassinate and how these qualities relate to you.<\/p>"
    },
    {
        "title": "Assault",
        "desc": "<p>To dream that you have been assaulted refers to a waking situation where you feel vulnerable or helpless. Something in your life is out of your control. In particular, if you dream of being sexually assaulted, then it refers to a situation where you feel violated or victimized. If you have been assaulted in real life, then such dreams may also be a flashback to the actual assault.<\/p>"
    },
    {
        "title": "Assembly",
        "desc": "<p>To dream that you are at an assembly suggests that you are learning to accept and integrate the various aspects of yourself. The dream may also be telling you that you need to schedule a meeting. There is something that needs to be discussed.<\/p>"
    },
    {
        "title": "Assistance",
        "desc": "<p>To dream that you are giving assistance to someone suggests that you are being called on for support, either emotional support or physical support.<\/p><p>To dream that you are being assisted denotes your helplessness in a situation.<\/p>"
    },
    {
        "title": "Asteroid",
        "desc": "<p>To see an asteroid in your dream represents a spiritual message from above. You are about to be enlightened with some knowledge. Alternatively, it signifies a brainstorming of ideas and thoughts. If the asteroid hits the earth, then it indicates that your idealistic notions are deteriorating or being shattered apart.<\/p>"
    },
    {
        "title": "Asters",
        "desc": "<p>To see asters in your dream symbolize your hopes, wishes, and your dreams.<\/p>"
    },
    {
        "title": "Asthma",
        "desc": "<p>If you do not have asthma in your waking life and dream that you have asthma, then it refers to insecurity and emotional instability. There is a lot of stress and tension around you.<\/p><p>Alternatively, the dream suggests that you need to take a long deep breath in between your problems. If you have asthma, then the dream may be concerns and fears over your waking condition.<\/p>"
    },
    {
        "title": "Astral Projection",
        "desc": "<p>To dream of astral projection suggests that you are looking at things from a whole new perspective. You may be feeling liberated and free. Alternatively, it indicates that you are physically or emotionally disconnected from those around you.<\/p>"
    },
    {
        "title": "Astrology",
        "desc": "<p>To dream about astrology suggests that you are concerned about your future. You are looking for some reassurance. Your dream astrological forecast may offer a significant message which should be analyzed closely as it relates to your waking life.<\/p>"
    },
    {
        "title": "Astronaut",
        "desc": "<p>To see or dream that you are an astronaut indicates that you are expanding your awareness and consciousness. You are utilizing the information you have and making the best of it. Alternatively, the astronaut symbolizes your ambition. You are reaching for the stars.<\/p><p>Or it may mean that you are experiencing some communication issues.<\/p>"
    },
    {
        "title": "Astronomer",
        "desc": "<p>To see or dream that you are an astronomer indicates that you will achieve your goals slowly but surely. You are methodical and careful in your approach to life's obstacles and problems.<\/p>"
    },
    {
        "title": "Aswang",
        "desc": "<p>To see an aswang in your dream indicates that you are feeling vulnerable and\/or untrusting of others. You are unsure of who are your enemies and friends.<\/p><p>To dream that you are an aswang implies that you are utilizing deception and underhanded means to get what you want. You are taking advantage of the innocent and the vulnerable.<\/p>"
    },
    {
        "title": "Asylum",
        "desc": "<p>To dream that you are at an asylum suggests that you are feeling tremendous mental strain and are trying to reach out for help. You are acknowledging your need for help.<\/p>"
    },
    {
        "title": "Athlete",
        "desc": "<p>To dream that you are an athlete suggests that you have pushed yourself to the limits. You have achieved something which you thought you could not do. Just be careful not to overextend yourself.<\/p><p>To see a famous athlete in your dream refers to a larger than life attitude. Consider the significance of the sport that the athlete is famous for. Famous athletes are also seen as modern day hero archetypes who symbolize champion, courage, and self-sacrifice.<\/p>"
    },
    {
        "title": "Athletic Field",
        "desc": "<p>To see or dream that you are on an athletic field represents the challenges that you are facing in your waking life. It also refers to your competitive nature.<\/p>"
    },
    {
        "title": "Atlas",
        "desc": "<p>To dream that you are looking at an atlas indicates your attention to details. You need to plan out your path before moving forward.<\/p>"
    },
    {
        "title": "ATM Machine",
        "desc": "<p>To see or use an ATM Machine in your dream represents your desires for financial security. The dream may be trying to offer reassurance; your fears of financial instability are unfounded. If you are withdrawing money from the ATM Machine, then it suggests that you are expending too much energy on fruitless endeavors and are in danger of depleting your inner resources. If you are depositing money into the ATM Machine, then it symbolizes the energies that you are investing into a project.<\/p><p>To dream that the ATM Machine gives you more money that you were due refers to your inflated ego. You have a sense of entitlement to certain things.<\/p><p>Dreaming that the ATM Machine is spitting out something else instead of money highlights your financial concerns. You are spending money on something that could be used towards something more worthwhile. The dream could also be analogous to spending time on something or someone not worthwhile.<\/p>"
    },
    {
        "title": "Atom",
        "desc": "<p>To see an atom in your dream symbolizes unlimited potential. Do not underestimate yourself or others. Alternatively, the dream may be a pun on someone whose name is Adam.<\/p>"
    },
    {
        "title": "Atomic Bomb",
        "desc": "<p>*Please see: <a href=\"#Nuclear%20Bomb\">Nuclear Bomb<\/a>.<\/p>"
    },
    {
        "title": "Attack",
        "desc": "<p>To dream that you attack someone represents pent-up frustration and anger. You feel that you have been wronged. Your dream serves as an easy and safe way to express your anger.<\/p><p>To dream that you are being attacked by someone indicates your character is being questioned. You feel the need to defend yourself. You are feeling stressed, vulnerable and helpless. You may also be facing difficult changes in your waking life. Dreaming of an attack provides a way for you to confront these situations that you may be avoiding in real life.<\/p><p>To dream that you are being attacked by an animal is a warning to be careful with those around you. Take notice of who you know in your waking life that shares and exhibits the same qualities of the animal that attacked you in your dream.<\/p><p>To dream that you kill an attacking animal suggests that you are going against your instincts or gut feeling.<\/p>"
    },
    {
        "title": "Attic",
        "desc": "<p>To see an attic in your dream represents hidden memories or repressed thoughts that are being revealed. It also symbolizes your mind, spirituality, and your connection to the higher Self. Alternatively, it signifies difficulties in your life that may hinder you from attaining your goals and aspirations. However, after a long period of struggle, you will overcome these difficulties.<\/p><p>To see a cluttered attic in your dream is a sign to organize your mind and thoughts. Perhaps, you need to rid yourself of the past and let go of the past emotions that are holding you back.<\/p>"
    },
    {
        "title": "Attorney",
        "desc": "<p>To see an attorney in your dream suggests that you are seeking guidance and advice.<\/p>"
    },
    {
        "title": "ATV",
        "desc": "<p>To see or ride an ATV in your dream indicates your desire to get off the beaten path. You want create your own path and do things your way. Alternatively, the dream suggests that you need to find time for some solitude in your life.<\/p>"
    },
    {
        "title": "Auction",
        "desc": "<p>To dream that you are at an auction indicates that you may be undervaluing or overvaluing something or some relationship. It may also mean that you have learned from your past experiences and are ready to move on.<\/p><p>To dream that someone outbid you in an auction suggests that you are being denied something that you have earned.<\/p><p>To dream that no one is bidding at an auction suggests that your opinions and ideas are not appreciated. Your opinions are being ignored.<\/p>"
    },
    {
        "title": "Audience",
        "desc": "<p>To dream that you are in front of an audience represents the world around you and how it is paying close attention to your actions. Alternatively, it signifies your fears of having your personal feelings and private thoughts discovered or revealed. If the audience is rowdy or noisy, then it suggests cluttered thoughts and confusion of ideas.<\/p><p>To dream that you have no audience denotes that you are not being acknowledged for your work or achievements. Perhaps you are feeling ignored or neglected.<\/p><p>Dreaming that you are the only person in the audience means that there is an important lesson that you and only you need to learn. Perhaps you have been oblivious to something that everyone else had already realized or notice.<\/p>"
    },
    {
        "title": "Audition",
        "desc": "<p>To dream that you are at an audition indicates feelings of insecurity and vulnerability. You have trouble expressing yourself and feel that you are being put to a test. The attitude and behavior of the audience will also guide you in how you think others perceive you.<\/p>"
    },
    {
        "title": "Auditorium",
        "desc": "<p>To dream that you are in an auditorium indicates that there is something that you need to learn from others. Pay attention to those around you.<\/p>"
    },
    {
        "title": "Auger",
        "desc": "<p>To see an auger in your dream signifies difficulties hard work and struggles. The dream may also have sexual connotations.<\/p>"
    },
    {
        "title": "August",
        "desc": "<p>To dream of the month of August suggests that there is some misunderstanding in a personal relationship or business situation.<\/p>"
    },
    {
        "title": "Aunt",
        "desc": "<p>To see your aunt in your dream represents family connection, heritage and value. The aunt may also represent aspects of yourself that you like or dislike. She can also be seen as a substitute mother.<\/p>"
    },
    {
        "title": "Aura",
        "desc": "<p>To see an aura around you or someone else indicates that some important information is being relayed to you in the dream. You need to pay close attention to the message. You need to draw on this energy for strength.<\/p>"
    },
    {
        "title": "Auriscope",
        "desc": "<p>**Please See: <a href=\"#Otoscope\">Otoscope<\/a>.<\/p>"
    },
    {
        "title": "Aurora Borealis",
        "desc": "<p>To see the aurora borealis in your dream represents renewed energy, vitality, awe, insight and youth. You will experience clarity in some situation or relationship. A positive spiritual experience will fill you with warmth and love. In addition, you will also gain some amazing new wisdom and knowledge. Alternatively, the dream indicates that you know what you need to do, but may be too lazy or too afraid to jump into action.<\/p>"
    },
    {
        "title": "Australia",
        "desc": "<p>To dream about or that you are in Australia suggests that you are being pulled toward opposite directions. The dream may also indicate self-exploration into your natural and uninhibited self.<\/p><p>Often referred to as the land down under, the dream may be a metaphor to represent your subconscious and your underlying thoughts.<\/p>"
    },
    {
        "title": "Author",
        "desc": "<p>To see an author in your dream suggests that your mind is preoccupied with some story, essay, or report that you are working on.<\/p><p>To dream that you are an author indicates that you need to better express your opinions. Others are paying attention to what you have to say.<\/p>"
    },
    {
        "title": "Autism",
        "desc": "<p>To dream that you or someone has autism indicates that you are having problems communicating your feelings and thoughts to others. If you know someone with autism in real life, then the dream may be a reflection of how you are coping with this condition. It is indicative of stress.<\/p>"
    },
    {
        "title": "Autograph",
        "desc": "<p>To dream that you are asking for an autograph indicates your desire to be like the person whose autograph you seek. You may be looking for some form of approval.<\/p><p>To dream that someone is asking for your autograph suggests that you are giving your consent or approval to someone.<\/p>"
    },
    {
        "title": "Autumn",
        "desc": "<p>To dream of autumn represents the cycle of life - something is about to come to an end and something new will begin. Alternatively, autumn symbolizes abundance and hospitality. It is time to collect the benefits and rewards that you've worked so hard for.<\/p>"
    },
    {
        "title": "Automobile",
        "desc": "<p>*Please See: <a href=\"#Car\">Car<\/a>.<\/p>"
    },
    {
        "title": "Autopsy",
        "desc": "<p>To see an autopsy in your dream suggests that you are disconnected from your feelings or devoid of emotions. You need to carefully evaluate the consequences of your actions.<\/p>"
    },
    {
        "title": "Avalanche",
        "desc": "<p>To see an avalanche in your dream signifies your raging emotions which have been held back and repressed for a long time. These emotions have not been dealt with in a productive manner and now are being expressed in a sudden and violent anger. Alternatively, the dream symbolizes the inescapable stresses and overwhelming pressures in your life.<\/p><p>You are feeling the weight of life's daily demands piled onto you.<\/p>"
    },
    {
        "title": "Avatar",
        "desc": "<p>To dream about an avatar signifies how you want others to see you. You are putting up a front instead of being your true self.<\/p>"
    },
    {
        "title": "Avenue",
        "desc": "<p>*Please See: <a href=\"#Street\">Street<\/a>.<\/p>"
    },
    {
        "title": "Aviary",
        "desc": "<p>To dream that you are in an aviary indicates a decreased sense of freedom. You feel you are unable to fully express yourself.<\/p>"
    },
    {
        "title": "Avocado",
        "desc": "<p>To see or eat an avocado in your dream symbolizes lust, sexuality, fertility, potential, and continuity of life. Alternatively, an avocado symbolizes richness and indulgence.<\/p><p>To see an avocado tree in your dream suggests that you will be well rewarded if you devote some time and effort to some goal or project.<\/p>"
    },
    {
        "title": "Avoid",
        "desc": "<p>To dream that you are avoiding a person in your dream suggest that you are not confronting some aspect of yourself. Consider what aspects and characteristics of the person you are avoiding which you are not recognizing in yourself. Alternatively, this word may also be a pun for &quot;a void&quot; in your life that you have been unable to fill.<\/p>"
    },
    {
        "title": "Awaken",
        "desc": "<p>To awaken in your dream represents a spiritual rebirth. You may be acknowledging and embracing both your feminine and masculine aspects of Self. You are utilizing your fullest potential. Consider also who or what awakened you. This is an indication of what is lacking or missing in your life.<\/p><p>To dream that you awaken someone up suggests that you are acknowledging core aspects of that person within your own self.<\/p>"
    },
    {
        "title": "Awakening",
        "desc": "<p>To dream that you have an awakening signifies that new ideas will be realized. You are experiencing new awareness that is unfolding in your life.<\/p><p>You may also be on the verge of lucid dreaming.<\/p>"
    },
    {
        "title": "Award",
        "desc": "<p>To dream that you receive an award indicates that you feel you deserve some recognition or some acknowledgment of your work. To dream that you do not win an award symbolizes feelings of inadequacy.<\/p>"
    },
    {
        "title": "Ax",
        "desc": "<p>To see an ax in your dream indicates that you are overly controlling. It is symbolic of destruction, hostility, and the frustrations that you are experiencing. Perhaps you &quot;have an ax to grind&quot; with someone. Or the dream can be a metaphor that you are ready to &quot;bury the ax&quot; and make amends.<\/p><p>To dream that you are chopping wood with an ax suggests that you need to divide your problems into smaller, more manageable sizes. Break down your problems into pieces you can handle. Alternatively, it indicates that your strength and power have been cut down to size.<\/p>"
    },
    {
        "title": "Axle",
        "desc": "<p>To see an axle in your dream suggests that you need to concentrate on the more important things in life. Do not lose focus.<\/p><p>To dream that you have a broken axle indicates a lack of confidence, independence and control in your life. You are having difficulty navigating through life. The dream may also mean that you are feeling vulnerable.<\/p>"
    }
]