[
    {
        "title": "B",
        "desc": "<p>To see the letter B in your dream is a pun on &quot;to be&quot;. Perhaps the dream is telling you to &quot;let it be&quot;.<\/p>"
    },
    {
        "title": "Baboon",
        "desc": "<p>To see a baboon in your dream suggests that you need to be more expressive in your feelings. You need to be more direct in telling others how you feel. On the hand, it could be saying that you are expressing yourself in an inappropriate manner.<\/p><p>In particular, dreaming of a white baboon means that you are completely devoid of emotions.<\/p>"
    },
    {
        "title": "Baby",
        "desc": "<p>To see a baby in your dream signifies innocence, warmth and new beginnings. Babies symbolize something in your own inner nature that is pure, vulnerable, helpless and\/or uncorrupted. If you dream that the baby is smiling at you, then it suggests that you are experiencing pure joy. You do not ask for much to make you happy. If you find a baby in your dream, then it suggests that you have acknowledged your hidden potential. If you dream that you forgot you had a baby, then it suggests that you are trying hide your own vulnerabilities; you do not want to let others know of your weaknesses. Alternatively, forgetting about a baby represents an aspect of yourself that you have abandoned or put aside due to life's changing circumstances. The dream may serve as a reminder that it is time for you to pick up that old interest, hobby, or project again. Dreaming of holding a baby is analogous to holding onto an earlier part of yoru life where you felt more depended on and more needed.<\/p><p>If you dream that you are on your way to the hospital to have a baby, then it signifies your issues of dependency and your desires to be completely cared for. Perhaps you are trying to get out of some responsibility. If you are pregnant in real life, then a more direct interpretation may simply mean that you are experiencing some anxieties of making it to the hospital when the time comes.<\/p><p>To dream of a crying baby symbolizes a part of yourself that is deprived of attention and needs to be nurtured. Alternatively, it represents your unfulfilled goals and a sense of lacking in your life. If you dream that a baby is neglected, then it suggests that you are not paying enough attention to yourself. You are not utilizing your full potential. Alternatively, this dream could represent your fears about your own children and your ability to protect and to provide for them.<\/p><p>To dream about a starving baby represents your dependence on others. You are experiencing some deficiency in your life that needs immediate attention and gratification.<\/p><p>To see yourself or someone as a baby in your dream refers to your desire to be cared for and nurtured. Alternatively, the dream may mean that you or someone is behaving immaturely.<\/p><p>To dream that a baby is walking or dancing refers to the potential and possibilities that life has in stored for you. The future looks bright. The dream may also be a metaphor that you need to take baby steps in your relationship, toward your goal, in a work project or whatever undertaking. If you have a baby in real life, then the dream is a reflection of your hopes for that baby.<\/p><p>To dream of an extremely small baby symbolizes your helplessness and your fears of letting others become aware of your vulnerabilities and incompetence. You may be afraid to ask for help and as a result tend to take matters into your own hands.<\/p><p>To see a dead baby in your dream symbolizes the ending of something that was once a part of you. If you dream that you are trying to snort up a dead baby, then it means that you are refusing to move onto a new stage of life. You are holding onto a dead past.<\/p><p>To dream that you are dipping a baby in and out of water signifies regression. You are regressing to a time where you had no worries and responsibilities. Alternatively, such a scenario is reminisce of when the baby is in the fetus and in its comfort zone. In fact, some expectant mothers even give birth in a pool, because the environment in the water mimics the environment in the uterus. It is less traumatic for the baby as it emerges into the world. So perhaps, the dream represents your search for your own comfort zone.<\/p><p>Dreaming of rescuing a drowning baby means that you are allowing yourself to be vulnerable and accepting help from others.<\/p><p>If you dream of having or adopting a baby of a different race, then it means that you are acknowledging and\/or embracing other's physical differences. Everyone started out as a baby who is pure and innocent.<\/p><p>Seeing an evil baby or a demon baby in your dream implies that you are apprehensive or afraid of a new project that you are undertaking. You may be taking on more than you can handle. If you dream that a baby has a third eye on the back of the head, then it means getting caught. You are acting carelessly when you think no on is watching.<\/p><p>***Read DreamMoods' section on: <a href=\"http:\/\/www.dreammoods.com\/dreaminformation\/pregnancy-dreams.htm\">Dreaming While Pregnant<\/a>.<\/p>"
    },
    {
        "title": "Baby Bottle",
        "desc": "<p>To see a baby bottle in your dream represents your issues of dependency. You are relying too much on others. If you are drinking from a baby bottle, then the dream means that you need are emotionally immature. You need to grow up.<\/p>"
    },
    {
        "title": "Baby Carriage",
        "desc": "<p>To see a baby carriage in your dream symbolizes your desire for a family or longing for a baby. If the baby carriage is empty, then it indicates sadness or an unfulfilled goal. Alternatively, it suggests that you need to cater to the needs of your own inner child.<\/p>"
    },
    {
        "title": "Baby Clothes",
        "desc": "<p>To see baby clothes in your dream suggests that you are expressing yourself in a more subtle way. Alternatively, baby clothes represent your former ways of thinking or old habits which you have outgrown.<\/p>"
    },
    {
        "title": "Baby Food",
        "desc": "<p>To see or feed baby food in your dream indicates that nurturance and care is needed in a waking situation. Alternatively, the dream may be a metaphor to indicate that you need to eat smaller portions of food.<\/p><p>To eat or dream that you are being fed baby food indicates that you are being forced to re-learn something that you already know.<\/p>"
    },
    {
        "title": "Baby Shower",
        "desc": "<p>To dream of a baby shower suggests that you are welcoming a new start. You are given a chance to start over again and do things differently this time around. You have a new found faith in life itself.<\/p>"
    },
    {
        "title": "Babysitter",
        "desc": "<p>To dream that you are babysitting suggests that you need to care for the child within yourself.<\/p><p>To see or call for a babysitter in your dream indicates that you need to acknowledge and work on your inner child.<\/p>"
    },
    {
        "title": "Bachelor",
        "desc": "<p>To meet a bachelor in your dream suggests that you are seeking freedom in your love life. For a man to dream that he is a bachelor indicates that he is having difficulty with gaining his own sense of self or freedom in a relationship. Alternatively, the bachelor represents your masculine side.<\/p>"
    },
    {
        "title": "Back-biting",
        "desc": "<p>To dream of back-biting about someone warns that you will cause harm to someone if you continue on your current course. Think twice over your actions and its consequences.<\/p><p>To dream that someone is back-biting you signifies that you will have some family problems.<\/p>"
    },
    {
        "title": "Back",
        "desc": "<p>To dream of your back represents your attitudes, strengths, burdens and stance in the world. It may also relate to stress and pressure that someone is putting on you.<\/p><p>To see a naked back in your dream symbolizes secrets that you may have kept from others or aspects of yourself that you have kept hidden and shielded away. Consider the phrase, &quot;watch your back!&quot;; this dream may be telling you to do just that. Traditionally, seeing a back in your dream forewarns that you should not lend money to anyone. In particular, lending money to friends will cause a rift in your relationship.<\/p><p>To see a person turn their back on you signifies that you will be deeply hurt as a result of envy and jealousy.<\/p><p>If you suffer from back pain, then you may have dreams of breaking your back or throwing your back out. Your dreams incorporate things from your waking life, even physical pain.<\/p>"
    },
    {
        "title": "Backbone",
        "desc": "<p>*Please see: <a href=\"#Spine\">Spine<\/a>.<\/p>"
    },
    {
        "title": "Backdoor",
        "desc": "<p>To see a backdoor in your dream suggests that you need to search a little harder to find an answer to your problem. Sometimes the solution may not be obvious. Alternatively, the dream indicates that you are trying to find short cuts to do things.<\/p>"
    },
    {
        "title": "Backflips",
        "desc": "<p>To dream that you are doing backflips suggests that you are going out of your way to help or please someone. You may feel under-appreciated or that your work is going unnoticed.<\/p><p>*Please see also: <a href=\"#Cartwheels\">Cartwheels<\/a>.<\/p>"
    },
    {
        "title": "Backgammon",
        "desc": "<p>To see a backgammon game in your dream represents an unwelcome guest.<\/p><p>To dream that you lose at backgammon symbolizes misfortune and unlucky in love. You seem to seek out the wrong type of people and your pursuit for love will be a rocky path.<\/p>"
    },
    {
        "title": "Background",
        "desc": "<p>*Please See: <a href=\"#Landscape\">Landscape<\/a>.<\/p>"
    },
    {
        "title": "Backpack",
        "desc": "<p>To see or carry a backpack in your dream represents the decisions and responsibilities that are weighing your down.<\/p>"
    },
    {
        "title": "Backpacking",
        "desc": "<p>To dream that you are backpacking symbolizes your self-sufficiency and survival skills. You may be reflecting on all the obstacles and adversities that you have overcame.<\/p>"
    },
    {
        "title": "Backseat",
        "desc": "<p>To dream that you are sitting in the backseat of a car suggests that you are no longer in control of your life. You may be feeling overpowered, dominated and being told what to do. You need to start taking back control of your life.<\/p><p>To dream that someone is sitting in your backseat highlights your own position of power and control. Someone else's destiny or fate is in your hands.<\/p>"
    },
    {
        "title": "Backstab",
        "desc": "<p>To dream that you are backstabbing someone represents your ruthlessness. Your character is being called into question.<\/p><p>To dream that someone has backstabbed you signifies feelings of insecurity. You have a lot going on in your life at the moment and believe someone is out to get you.<\/p>"
    },
    {
        "title": "Backstage",
        "desc": "<p>To dream that you are backstage symbolizes opportunities and access. You need to make sure to take advantage of this limited time opportunity. Alternatively, the dream indicates that there are aspects of yourself that you are reluctant to express or show. Or it may also mean that you need to look at some situation or problem from a new perspective.<\/p>"
    },
    {
        "title": "Backstroke",
        "desc": "<p>To dream that you are doing the backstroke suggests that although you are acknowledging your emotions, you are not confrontingthem head on.<\/p>"
    },
    {
        "title": "Backward",
        "desc": "<p>To dream that you are walking or moving backwards indicates that your current course of action may be counter-productive. Whatever you are looking for in life seems to be moving away from you. Thus, you may feel a sense of failure or belief that you are unable to achieve your goals and aspirations. On the other hand, moving backwards in your dream indicate that you need to back off or retreat from a situation that you are currently facing in your waking life.<\/p><p>Dreaming that you fall backwards suggests that you prevented yourself from making a bad decision or mistake. It may also mean that you are not ready to move forward and need to take a step back."
    },
    {
        "title": "Backyard",
        "desc": "<p>To dream about your backyard represents your childhood memories or your subconscious. Alternatively, dreaming of your backyard refers to the secrets you are keeping. There are some aspects of your life which you want to keep hidden and out of the view of others. The dream also represents some aspect of your life that you have taken for granted. Consider also the phrase &quot;not in my backyard.&quot; In other words, everything is okay as long as it does not happen to you or occur in your own home. The condition of the yard is also symbolic of how well you maintain and balance aspects of your life.<\/p>"
    },
    {
        "title": "Bacon",
        "desc": "<p>To see bacon in your dream symbolizes essentials, staples, and life's supply. It may also be a play on the common phase &quot;bringing home the bacon&quot; to refer to earning a living.<\/p><p>To see bacon that has gone rancid in your dream suggests a forbidden situation.<\/p>"
    },
    {
        "title": "Bad",
        "desc": "<p>To dream that you are feeling bad suggests that you are off balance, off centered, or even feeling worthless.<\/p>"
    },
    {
        "title": "Bad Breath",
        "desc": "<p>To dream that you have bad breath suggests that you need to think twice before opening your mouth. Think about what you are saying first before expressing yourself and offending others.<\/p>"
    },
    {
        "title": "Badge",
        "desc": "<p>To see or flash a badge in your dream represents recognition of your position. You are held in high honor and prestige. You regard yourself highly. Alternatively, it signifies your need to belong and to be part of something.<\/p>"
    },
    {
        "title": "Badger",
        "desc": "<p>To see a badger in your dream signifies your persistence and final victory over your opponents. The dream may also be a pun on how you are badgering others or vice versa. Perhaps someone, especially someone of power is bothering you and giving you a difficult time.<\/p>"
    },
    {
        "title": "Badminton",
        "desc": "<p>To play or watch a badminton game in your dream indicates that you need to make a decision quickly or else opportunities will pass you by. You need to learn to keep up.<\/p>"
    },
    {
        "title": "Bag",
        "desc": "<p>To see a bag in your dream represents the responsibilities that you carry. If the bag is ripped or torn, then it indicates that you are carrying a lot of burden. The symbol may be a metaphor for an &quot;old bag&quot; and refer to someone who is old.<\/p><p>To dream of a bag full of junk symbolizes that you are burdened with worries and problems; you have to find a way on unloading some of this burden.<\/p>"
    },
    {
        "title": "Bagel",
        "desc": "<p>To see or eat a bagel in your dream suggests that there is key element missing from your life. You are not completely whole. Alternatively, it refers to sexual urges.<\/p>"
    },
    {
        "title": "Baggage",
        "desc": "<p>To see or carry baggage in your dream refers to the problems and things that you are carrying on your shoulders and weighing your down. You feel that you are being held back by past emotions or problems. Alternatively, baggage symbolizes your identity.<\/p>"
    },
    {
        "title": "Baggage Claim",
        "desc": "<p>To dream that you are at baggage claim suggests that you are experiencing a lack of identity. You are not sure who you are or who you want to be.<\/p>"
    },
    {
        "title": "Baggage Scanner",
        "desc": "<p>To see a baggage scanner or have your baggage scanned in your dream implies that your identity is under scrutiny. You feel you are being judge. Alternatively, the dream refers to a lack of privacy. You feel exposed.<\/p>"
    },
    {
        "title": "Bagpipe",
        "desc": "<p>To see or hear bagpipes in your dream signify strength and virility. You will overcome your struggles.<\/p>"
    },
    {
        "title": "Bail",
        "desc": "<p>To dream that you are making bail symbolizes your need to accept help in your business dealings. This dream is trying to make you acknowledge that it is perfectly all right to accept a helping hand.<\/p>"
    },
    {
        "title": "Bailiff",
        "desc": "<p>To see a bailiff in your dream suggests that you have crossed a certain boundary and now must be held accountable for your actions.<\/p><p>To dream that a bailiff is arresting you signifies your need to improve your business ethics. Your integrity is being called into question. Alternatively, the dream points to conflict in your waking life.<\/p>"
    },
    {
        "title": "Bait",
        "desc": "<p>To see bait in your dream suggests that you may be fishing for a deal or a compliment. It may also indicate your desire to lure or entice someone.<\/p>"
    },
    {
        "title": "Bake-house",
        "desc": "<p>To see a bake-house in your dream signifies danger and pitfalls that you may be encountering in your waking life.<\/p>"
    },
    {
        "title": "Bakery",
        "desc": "<p>To see a bakery in your dream signifies richness and success. Your future will be an enjoyable, pleasant and filled with satisfaction.<\/p>"
    },
    {
        "title": "Baking",
        "desc": "<p>To dream that you are baking represents your creative self and your ability to make things happen. If you are mixing ingredients together that you normally would not combine, then it suggests that you need to find a connection between two seemingly different things. Perhaps these things that seem incompatible may yield surprisingly but positive results.<\/p>"
    },
    {
        "title": "Balaclava",
        "desc": "<p>To see or wear a balaclava in your dream refers to a sinister or painful secret you are keeping. This secret is creating a burden for you and becoming too hard to keep. Alternatively, wearing a balaclava refers to your desire for anonymity in a situation.<\/p><p>To see someone in a balaclava represents the shadow aspect of your persona. It also points to fear that you have suppressed.<\/p>"
    },
    {
        "title": "Balance",
        "desc": "<p>To dream that you lose your balance suggests that you are having difficulty weighing your options and choices in some situation.<\/p>"
    },
    {
        "title": "Balance Beam",
        "desc": "<p>To dream that you are walking on a balance beam indicates that there is a situation that requires your focus and full attention. Alternatively, the dream may be a metaphor for the various aspects that you are trying to balance in your life.<\/p>"
    },
    {
        "title": "Balcony",
        "desc": "<p>To see or dream that you are on a balcony refers to your desire to be seen and noticed. You are searching for prestige and higher status. It may also mean that you are on your way up the social ladder. If the balcony is clean, then it indicates that you are looked up to by others. If the balcony is old, then it suggests that your public image is in need of repair. Alternatively, the balcony could signify your ambivalence regarding a situation. You are feeling torn or undecided.<\/p>"
    },
    {
        "title": "Bald",
        "desc": "<p>To dream that you are going bald suggests a lack of self-esteem or worries about getting older. Alternatively, baldness symbolizes humility, purity, and personal sacrifice. You are at a stage in your life where you are confident in fully exposing yourself.<\/p><p>*Please see also: <a href=\"#hair\">Hair<\/a>.<\/p>"
    },
    {
        "title": "Ball",
        "desc": "<p>To see or play with a ball in your dream symbolizes completeness and wholeness. It may also indicate that you need to be more in tune with the inner child within. The dream may also be a metaphor for the testicles. Consider also the phrase, &quot;he's got balls&quot; to indicate guts and strength.<\/p><p>If you dream of rolling a ball or see a ball rolling, then the dream may be metaphor that you need to put your plan into action. It is time to stop idling and start moving things along.<\/p><p>To dream that you are watching a ball game indicates that you need to take more initiative. Your lack of action may stem from your shyness which you must overcome. Perhaps you are too overly self-conscious.<\/p><p>To attend a ball in your dream refers to your celebration of life. You are in a good place and are embracing what life has to offer.<\/p>"
    },
    {
        "title": "Ball Pit",
        "desc": "<p>To see a ball pit in your dream symbolizes celebration, joy and youth, especially if there are children playing inside it. It is a reminder to be more carefree and spontaneous.<\/p><p>Dreaming that you are inside a ball pit implies that you need to put in your full effort toward a relationship or goal. Give it your all.<\/p>"
    },
    {
        "title": "Ballerina",
        "desc": "<p>To dream that you are a ballerina suggests that you are moving through the obstacles of your life effortlessly. You feel unrestricted. It is also a symbol of innocence, frailty, and vulnerability. Alternatively, you may feel unable to attain and measure up to society's ideals of beauty.<\/p><p>To see someone you know as a ballerina indicates that this person is tiptoeing around certain issues instead of confronting it.<\/p>"
    },
    {
        "title": "Ballet",
        "desc": "<p>To dream that you are watching a ballet symbolizes balance, cooperation, and harmony.<\/p><p>To see or wear ballet slippers in your dream represents your understanding of the principles of balance and grace. You carry yourself with much poise and get along well with others.<\/p>"
    },
    {
        "title": "Ballet Shoes",
        "desc": "<p>To see or wear ballet shoes in your dream means that you need to approach a certain problem or situation with attention, care and decisiveness. Wearing ballet shoes can also imply that you are well balanced and level headed.<\/p>"
    },
    {
        "title": "Balloon",
        "desc": "<p>To see balloons in your dream indicate declining hopes and disappointments in your search for love. A situation in your life will take a turn downward. Balloons also represent arrogance and an inflated opinion of yourself.<\/p><p>To dream that you or someone is blowing up a balloon represents your aspirations, goals and ambitions. You are experiencing renewed hope.<\/p><p>To see black balloons in your dream symbolizes depression, especially if the balloons are descending.<\/p><p>To see an ascending balloon in your dream signifies frustrating conditions in your life in which you are seeking to rise above. You are expressing a desire to escape. On a positive note, balloons symbolize celebration and festivities. You need to acknowledge your inner child.<\/p><p>To see a balloon pop in your dream symbolizes an unrealized goal or dream. It may also represent the stresses in your life. The pressure may be starting to be too great for you to bear.<\/p><p>To see or dream that you are in a hot air balloon suggests that it is time to overcome your depression. The dream may be a metaphor indicating that you are losing your ground or your foothold on some situation\/problem. Alternatively, it represents the process of individuation and your quest to fulfill some spiritual needs. You feel the need to be elevated in someone's eyes.<\/p>"
    },
    {
        "title": "Ballot",
        "desc": "<p>To see a ballot in your dream represents a decision that needs to be made. If your name is on a ballot, then it indicates that you are seeking support, approval or acceptance.<\/p>"
    },
    {
        "title": "Ballroom",
        "desc": "<p>To dream that you are in a ballroom refers to some festivity or celebration. You are having a good time and enjoying life. Alternatively, the dream implies openness. There are some aspect of your life that you need to be more open about.<\/p>"
    },
    {
        "title": "Ballroom Dancing",
        "desc": "<p>To dream that you are ballroom dancing indicates success in your endeavors. You have a positive outlook in life and are willing try anything and give it your all.<\/p>"
    },
    {
        "title": "Baloney",
        "desc": "<p>*Please See: <a href=\"#Bologna\">Bologna<\/a>.<\/p>"
    },
    {
        "title": "Bamboo",
        "desc": "<p>To see bamboo in your dream symbolizes trustworthiness, strength and resilience. You are able to easily bounce back from setbacks and disappointments in your life. Alternatively, it refers to strong ties\/bonds and fair dealings.<\/p><p>To dream that the bamboo is soft or rotting suggests that there is imbalance in your waking life.<\/p>"
    },
    {
        "title": "Bananas",
        "desc": "<p>To see bananas in your dream may be a metaphor for repressed sexual urges and desires. It is a phallic symbol and represents masculine sexuality.<\/p><p>To dream that you are eating bananas indicate that your hard work will be met with little rewards or gains.<\/p><p>To see banana peels in your dream implies that you need to be careful about slipping up and making a mistake. If the banana peels are rotting, then it represents some irreversible mistake.<\/p>"
    },
    {
        "title": "Band",
        "desc": "<p>To see a band or play with a band in your dream represents a sense of community and belonging. The dream may also be a pun on banding together and need for cooperation\/unity.<\/p>"
    },
    {
        "title": "Bandages",
        "desc": "<p>To dream that you have bandages indicate your need to heal. You may be feeling emotionally wounded and are trying to cover\/shield your hurt from others. Consider where on the body was the bandage for more additional clues.<\/p><p>To dream that someone is throwing bandages at you suggests that someone is causing you some emotional pain. You are hurting on the inside, but manage to keep a happy appearance on the outside.<\/p>"
    },
    {
        "title": "Bandana",
        "desc": "<p>To see or wear a bandana in your dream suggests that you need to look at issue or problem more objectively. You need to think through your options more carefully.<\/p>"
    },
    {
        "title": "Bandit",
        "desc": "<p>To see or dream that you are a bandit indicates primitive sexuality and primal lust.<\/p>"
    },
    {
        "title": "Banish",
        "desc": "<p>*Please See: <a href=\"#Exile\">Exile<\/a>.<\/p>"
    },
    {
        "title": "Banjo",
        "desc": "<p>To dream that you are playing a banjo represents togetherness. You need to cherish your time spent with friends.<\/p><p>To hear or see someone playing a banjo in your dream signifies a joyous and happy occasion.<\/p>"
    },
    {
        "title": "Bank",
        "desc": "<p>To see a bank in your dream denotes your desires for financial security. The dream may be trying to offer reassurance and that your fears of financial instability are unfounded.<\/p><p>To dream that you are robbing a bank signifies that you are expending too much energy and are in danger of depleting your inner resources. Alternatively, it indicates that money that is due to you is being delayed.<\/p><p>Dreaming that someone is robbing a bank or that you witness a bank robbery symbolizes lack of financial stability in your waking life.<\/p><p>*Please see also: <a href=\"http:\/\/www.dreammoods.com\/v.htm#vault\">Vault<\/a>.<\/p>"
    },
    {
        "title": "Banker",
        "desc": "<p>To see a banker in your dream suggests that you are experiencing financial difficulties or money problems and may be too proud to get help. You are feeling out of control.<\/p>"
    },
    {
        "title": "Bankrupt",
        "desc": "<p>To dream that you are bankrupt indicates that you need to start taking measures to protect yourself and your resources. You may be feeling emotionally drained or physically overworked. The dream may be a sign of depression. Alternatively, to dream that you are bankrupt symbolizes feelings of insecurity.<\/p>"
    },
    {
        "title": "Banner",
        "desc": "<p>To see a banner in your dream indicates your willingness to stand up and fight for a cause or common goal. A banner also means the need for better organization and planning.<\/p>"
    },
    {
        "title": "Banquet",
        "desc": "<p>To dream that you are at a banquet indicates that you are emotionally malnourished. You are seeking emotional stimulation.<\/p><p>*Please See Also: <a href=\"#Feast\">Feast<\/a>.<\/p>"
    },
    {
        "title": "Banyan",
        "desc": "<p>To see a banyan tree in your dream represents shelter and protection. It also denotes the connection between the spiritual and the earthly.<\/p>"
    },
    {
        "title": "Baptism",
        "desc": "<p>To see a baby being baptized in your dream represents renewal, a new way of being, a new attitude toward life, or a new approach toward others.<\/p><p>To dream that you are being baptized suggests that your sins and impure thoughts are being washed away. Perhaps you are feeling guilty about something that you have done and are seeking forgiveness. Immersion in water represents death, whereas emergence signifies resurrection. You need to let go of your old negative self, so that the new you can emerge and be successful.<\/p><p>On a spiritual note, this dream signifies your renewed faith in God. You are coming closer to self-realization and spiritual fulfillment.<\/p>"
    },
    {
        "title": "Bar",
        "desc": "<p>To dream that you are at a public bar signifies your desire to escape from the stresses of your daily life and retreat into a light-hearted environment where pleasure abounds. Alternatively, you are seeking acceptance in some aspect of your daily life. The dream may also be a pun on being &quot;barred&quot; from some place or something. You are feeling excluded or held back by circumstances beyond your control.<\/p><p>To see a metal bar in your dream represents your own inner strength. You have the ability and tools to build a solid foundation and future. Alternatively, metal bars symbolize defiance and aggression.<\/p><p>*Please See: <a href=\"#Prison\">Prison<\/a>.<\/p>"
    },
    {
        "title": "Bar Mitzvah \/ Bat Mitzvah",
        "desc": "<p>Todream that you are at a bar mitzvah or bat mitzvah ceremony represents a transitional phase into adulthood. It indicates your social responsibilities, sense of morality, mental reasoning, and hopes.<\/p>"
    },
    {
        "title": "Barbarian",
        "desc": "<p>To see or dream that you are a barbarian represents the savage and instinctual aspect of your character. Perhaps you are being a little too rough or brash. Alternatively, the dream may also refer to your sexuality and your wild side.<\/p>"
    },
    {
        "title": "Barbecue",
        "desc": "<p>To dream of a barbecue refers to a minor issue or transformation occurring in your waking life.<\/p><p>To dream that you are barbecuing symbolizes togetherness, relaxation, and ease.<\/p>"
    },
    {
        "title": "Barbed Wire",
        "desc": "<p>To see barbed wire in your dream represents difficulty in breaking through or getting your point across to someone.<\/p><p>To dream that you are caught in barbed wire symbolizes oppression and confinement. You are feeling trapped and restricted in some relationship.<\/p>"
    },
    {
        "title": "Barber",
        "desc": "<p>*Please See: <a href=\"#Hairdresser\">Hairdresser<\/a>.<\/p>"
    },
    {
        "title": "Barber's Pole",
        "desc": "<p>To see a barber's pole in your dream indicates that you are contemplating a change in your life. Alternatively, the symbol represents some childhood memory or a piece of nostalgia.<\/p>"
    },
    {
        "title": "Barbie Doll",
        "desc": "<p>To see a Barbie doll in your dream represents society's ideals. You may feel that you are unable to meet the expectations of others. Alternatively, the Barbie doll refers to the desire to escape from daily responsibilities. It may serve to bring you back to your childhood where life was much simpler and more carefree.<\/p>"
    },
    {
        "title": "Barcode",
        "desc": "<p>To see a barcode in your dream symbolizes automation, simplification and ease. Alternatively, the dream represents an impersonal relationship in your waking life. You are feeling alienated.<\/p>"
    },
    {
        "title": "Bareback",
        "desc": "<p>To dream that you are riding bareback represents your ability to balance several difficult tasks. Alternatively, to ride bareback in your dream also means that you give your all into a project or relationship. You don't take the easy route when it comes to doing things.<\/p>"
    },
    {
        "title": "Barefoot",
        "desc": "<p>To dream that you are barefoot represents your playful attitudes and relaxed, carefree frame of mind. Alternatively, being barefoot indicates poverty, lack of mobility, or misunderstanding. You have low self-esteem and lack confidence in yourself. Or you may be dealing with issues concerning your self-identity. You are unprepared for what is ahead for you.<\/p><p>To dream that you are walking barefoot on a construction site means that you are not ready to put in the work necessary to improve your mind or body. Perhaps you are in denial that you need any improvement.<\/p>"
    },
    {
        "title": "Bargain",
        "desc": "<p>To dream that you are bargaining for something indicates that you are being undervalued. Perhaps you are not putting in as much effort into a project or relationship as you should be. Consider the symbolism of the item and how you feel about it in your dream.<\/p>"
    },
    {
        "title": "Baritone",
        "desc": "<p>To hear a baritone voice in your dream indicates deceit and suspicion. You need to pay close attention to the words of the voice.<\/p>"
    },
    {
        "title": "Bark",
        "desc": "<p>To hear barking in your dream suggests that you are annoying those around you with grumpiness and fussiness. The dream may also be analogous to your tendency of barking orders at people, instead of asking or talking kindly. Alternatively, barking refers to unhappy and disgruntled companions.<\/p><p>Dreaming of the bark of a tree refers to your thick-skinned nature. If you dream of clothing that is made of tree bark, then it indicates that you are putting up a protective barrier. You are not letting others get too close. Alternatively, the dream may mean that you are one with nature.<\/p>"
    },
    {
        "title": "Barley",
        "desc": "<p>To see or eat barley in your dream signifies good health, progress, and satisfaction with your life.<\/p>"
    },
    {
        "title": "Barn",
        "desc": "<p>To see a barn in your dream signifies the feelings that are kept in your subconscious. There is a possibility that you may be holding back your instinctual action or natural urges.<\/p>"
    },
    {
        "title": "Barnacles",
        "desc": "<p>To see barnacles in your dream suggest that there is a situation you need to confront head on before it gets out of control.<\/p>"
    },
    {
        "title": "Barometer",
        "desc": "<p>To see a barometer in your dream represents the state of your inner feelings and how you are coping with emotions or situations.<\/p>"
    },
    {
        "title": "Barracks",
        "desc": "<p>To dream that you are living in barracks suggest that you are in a restrictive situation. You need to bring some change in your life.<\/p>"
    },
    {
        "title": "Barrel",
        "desc": "<p>To see an empty barrel in your dream signifies unfulfilled needs and emotional emptiness. If there is something inside the barrel, consider the significance of the contents. If you are putting a stopper into a barrel, then it suggests that you need to hold onto what you have. Perhaps you are feeling a little instable or insecure about your position or status in life.<\/p>"
    },
    {
        "title": "Barrette",
        "desc": "<p>To see or wear a barrette in your dream indicates that you are open to a new idea. Alternatively, you are ready to show the world a whole new you.<\/p>"
    },
    {
        "title": "Barricade",
        "desc": "<p>*Please See: <a href=\"#Barrier\">Barrier<\/a><\/p>"
    },
    {
        "title": "Barrier",
        "desc": "<p>To see a barrier in your dream represents an obstacle to your emotional growth. You may feel hindered in fully expressing yourself. The dream may also indicate your resistance to change.<\/p>"
    },
    {
        "title": "Barrister",
        "desc": "<p>To see a barrister with a white wig in your dreamsymbolizes wisdom and knowledge. The barrister may be a variation of the &quot;wise old man&quot; figure. You are looking for guidance and help in some area of your life. Perhaps you are making an important decision.<\/p>"
    },
    {
        "title": "Bartender",
        "desc": "<p>To dream that you are a bartender suggests that you want to escape from the demands of your daily life. The dream may also be a play on words to indicate that you are creating a barrier for yourself or that you are &quot;barring&quot; yourself from doing something.<\/p>"
    },
    {
        "title": "Baseball",
        "desc": "<p>To dream that you are attending a baseball game represents contentment and peace of mind.<\/p><p>To dream that you are playing baseball denotes your need to set goals and achieve them. It is time to stop goofing around and set your sights for the long term. Consider the significance of the position you are playing. Alternatively, playing baseball may be analogous to sexual foreplay as in getting to first, second, or third base on a date. The game of baseball has sexual innuendos, where the masculine aspects is depicted by the bat and the feminine aspects is depicted in the form of the ball or the ballpark.<p>To dream that you are on a baseball field indicates that you need to pay attention to opportunities that are coming your way.<\/p><p>To see a baseball field under construction refers to unresolved sexual issues.<\/p>"
    },
    {
        "title": "Baseball Bat",
        "desc": "<p>To see or hold a baseball bat in your dream represents your motivating and driving forces. The dream may also be a pun on an &quot;old bat&quot; or old woman. Alternatively the baseball may be a phallic symbol and thus have sexual connotations.<\/p><p>Dreaming of a broken baseball bat indicates some sort of failure despite giving it your all. It also means that you no longer feel as motivated to pursue something as before.<\/p>"
    },
    {
        "title": "Basement",
        "desc": "<p>To dream that you are in a basement symbolizes your subconscious mind and intuition. The appearance of the basement is an indication of your subconscious state of mind and level of satisfaction. It represents primal urges, animalistic desires and basic needs. The dream may also be metaphor for &quot;abasement&quot; or being &quot;debased&quot;. Are you feeling humbled or unworthy?<\/p><p>To dream that the basement is in disarray and messy signifies some confusion in which you need to sort out. These are things that you have &quot;stored&quot; away or put aside in your mind because you do not know what to do with it or you do not have the time to deal with it. It may also represent your perceived faults and shortcomings.<\/p>"
    },
    {
        "title": "Basil",
        "desc": "<p>To see, smell, or taste basil in your dream refers to kindness, sweetness, and deep love.<\/p>"
    },
    {
        "title": "Basin",
        "desc": "<p>*Please see: <a href=\"#bathtubs\">Bathtubs<\/a><\/p>"
    },
    {
        "title": "Basket",
        "desc": "<p>To see a basket in your dream symbolizes the womb and physical body. It also represents the things that you are holding onto. If the basket is full, then it denotes abundance and fertility.<\/p>"
    },
    {
        "title": "Basketball",
        "desc": "<p>To dream that you are playing basketball indicates teamwork and cooperation. There is a situation in your waking life where you will need the cooperation and assistance of others in order to achieve a common goal. Perhaps you are standing in the way of your own progress and need to ask for help.<\/p><p>To see a basketball in your dream suggests that you need to make the first move. You also need to concentrate and focus on your goals.<\/p><p>*Please See Also: <a href=\"#dunk\">Dunk<\/a>.<\/p>"
    },
    {
        "title": "Bass",
        "desc": "<p>To play bass in your dream represents the beat and rhythm of life.<\/p><p>To sing bass in your dream symbolizes a solid foundation and groundwork for what is ahead.<\/p>"
    },
    {
        "title": "Bass Guitar",
        "desc": "<p>To hear a bass guitar in your dream symbolizes harmony and unity.<\/p><p>If you see or dream that you are playing a bass guitar, then it suggests that you are feeling overshadowed or under- appreciated. You feel you are not being recognized for your talents.<\/p>"
    },
    {
        "title": "Bastard",
        "desc": "<p>To dream that you are a bastard suggests that you need to learn to give love in order to receive love.<\/p>"
    },
    {
        "title": "Basting",
        "desc": "<p>To dream that you are basting meat indicates that you are trying to incorporate a little more flavor and pizzazz in your life.<\/p>"
    },
    {
        "title": "Bath",
        "desc": "<p>To dream that you are taking a bath signifies a cleansing of your outer and inner self. You are washing away the difficult times. This dream may also be symbolic of ridding yourself of old ideas, notions, opinions, and other negativities. Your dream may be pointing toward forgiveness and letting go.<\/p><p>To dream that you are bathing someone suggests that you are seeking a closer connection with that person. It also points to your nurturing side.<\/p><p>Dreaming that you are giving a dog a bath symbolizes your nurturing abilities. You also pride yourself in your loyalty and generosity.<\/p>"
    },
    {
        "title": "Bathing Suit",
        "desc": "<p>To dream that you are wearing a bathing suit suggests that you are feeling exposed or emotionally vulnerable. Consider how you feel in the swimsuit. If you are comfortable, then it signifies a life of ease, relaxation and leisure. If you feel uncomfortable, then it represents a lack of self confidence. If you are wearing a swimsuit in an inappropriate occasion, then it has similar significance as being naked in a dream.<\/p>"
    },
    {
        "title": "Bathrobe",
        "desc": "<p>To see or wear a bathrobe in your dream represents your personal needs or privacy issues. It also relates to sexual\/intimate situations and your ability to confront and deal with them.<\/p>"
    },
    {
        "title": "Bathroom",
        "desc": "<p>To dream that you are in the bathroom relates to your instinctual urges. You may be experiencing some burdens\/feelings and need to &quot;relieve yourself&quot;. Alternatively, a bathroom symbolizes purification and self-renewal. You need to cleanse yourself, both emotionally and psychologically.<\/p><p>To dream that you are in a public restroom with no stalls or that there are a lot of people around while you are trying to do your business signifies your frustrations about getting enough privacy. You are always putting others ahead of your own needs. As a result, you are lacking a sense of personal space. Alternatively, the dream indicates that you are having difficulties letting go of old emotions. You are afraid that if you reveal these feelings, then others around you will judge and criticize you.<\/p><p>To dream that you are in a bathroom meant for the opposite sex suggests that you are overstepping your boundaries. You have crossed the line in some situation.<\/p><p>To dream that you can not find the bathroom or that you have difficulties finding one indicates that you have difficulties in releasing and expressing your emotions. You are holding back your true feelings about something.<\/p><p>Dreaming that you have to pay to use the bathroom or of coin-operated bathroom indicates that you don't want to burden others with your emotions. The dream may also be analogous to seeking professional help. Thus refusing to pay or not having money to use the toilet means that you are reluctant to get help. Perhaps you feel unworthy.<\/p><p>*Please also see: <a href=\"#urination\">Urination<\/a>. See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bathroomdream1\">Restroom Maze<\/a>&quot; , &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bathroomdream2\">Sitting On The Toilet<\/a>&quot;, &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bathroomdream4\">Filthy Stalls<\/a>&quot;, &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bathroomdream3\">Dogs In The Bathroom<\/a>&quot; &amp; &quot;<a href=\"http:\/\/www.dreammoods.com\/dreambank\/bathroom-dreams-computer.html\">Computer In The Bathroom<\/a>&quot;<\/p>"
    },
    {
        "title": "Bathtubs",
        "desc": "<p>To see orbe in a bathtub in your dream suggests a need for self-renewal and escape from everyday problems. You need to rid yourself of the burdens that you have been carrying. Alternatively, it indicates your mood for love and pursuit of pleasure and relaxation.<\/p><p>To dream that you or someone has drowned in a bathtub indicates that you are not as ready as you had thought you were in facing your fears and emotions. You are feeling overwhelmed in confronting your repressed emotions. You need to take things more slowly, instead of trying to dive right in.<\/p>"
    },
    {
        "title": "Batman",
        "desc": "<p>To see Batman in your dream suggests that you need to utilize your wits and resources in order to help yourself or others. Perhaps your are not maximizing your full potential. You need to unleash the power from within. Stop looking for shortcuts to get you where you want. Alternatively, the dream implies that there is some wrongdoing that you need to rectify.<\/p>"
    },
    {
        "title": "Baton",
        "desc": "<p>To see or throw a baton in your dream represents your need for self expression and recognition in a dramatic way. In particular, to see a police baton symbolizes male sexuality or power.<\/p>"
    },
    {
        "title": "Bats",
        "desc": "<p>To see a bat in your dream symbolizes uncleanness, demons, and annoyances. Alternatively, bats represent rebirth and unrealized potential. You need to let go of old habits. Your current path is not compatible with your new growth and new goals. It may also indicate some unknown situation and how you are blindly entering into a situation or deal. You need to evaluate the facts more carefully. The dream may also been a pun on feeling &quot;batty&quot; or feeling crazy.<\/p><p>To dream of a white bat signifies death of a family member. To dream of a black bat signifies personal disaster.<\/p><p>To see a vampire bat in your dream suggests that a person in your life may be draining your of self-confidence and\/or your resources.<\/p><p>According to Chinese folklore, if you see five bats in your dream, then it symbolizes good health, longevity, pace, wealth, and happiness.<\/p>"
    },
    {
        "title": "Battery",
        "desc": "<p>To see a battery in your dream symbolizes life energy and vitality. If the battery is dead, then it suggests that you are emotionally exhausted or feeling low.<\/p>"
    },
    {
        "title": "Batting",
        "desc": "<p>To dream that you are batting signifies confrontations. It is time for you to step up to the plate and accept your responsibilities.<\/p>"
    },
    {
        "title": "Batting Cage",
        "desc": "<p>To dream that you are in a batting cage indicates that something or someone is holding your back from fully expressing your anger.<\/p>"
    },
    {
        "title": "Battle",
        "desc": "<p>To be in or see a battle in your dream suggests that you are overworked. You need to give yourself a break. There is a conflict between your rational thinking and your irrational impulses. Alternatively, dreaming of a battle represents eroticism. You may be overly stimulated or you are trying to suppress your instinctual urges.<\/p><p>To dream that you win a battle indicates that you will achieve balance in various aspects of your life. If you lose the battle, then it means that you are unable to escape from current circumstances.<\/p>"
    },
    {
        "title": "Battlefield",
        "desc": "<p>To dream that you are on a battlefield represents some major conflict occurring in your waking life. It may indicate a new situation, new problem or new relationship which you need to solve and conquer.<\/p>"
    },
    {
        "title": "Battleship",
        "desc": "<p>To play the game Battleship in your dream signifies the &quot;hit or miss&quot; approach you have to life. You need to be more tactical or deliberate in your decision making. Do not leave it to chance.<\/p>"
    },
    {
        "title": "Bay",
        "desc": "<p>To see a bay in your dream represents understanding. Something is become clearer to you. The dream may also suggest that you are keeping someone at a distance and not let them get too close to you, as in keeping them &quot;at bay&quot;.<\/p>"
    },
    {
        "title": "Bay Tree",
        "desc": "<p>To see a bay tree in your dream symbolizes immortality, longevity,resurrection, success, and victory. If the bay tree is located in your garden, then it represents protection. You may be seeking refuge from your emotions.<\/p>"
    },
    {
        "title": "Bay Window",
        "desc": "<p>To see a bay window in your dream indicates that you are trying to gain a different or wider perspective on things.<\/p>"
    },
    {
        "title": "Bayonet",
        "desc": "<p>To see a bayonet in your dream suggests that you need to stand up and fight for your beliefs. Do not give up!<\/p>"
    },
    {
        "title": "BB Gun",
        "desc": "<p>To see or use a BB Gun in your dream symbolizes an unperceived threat. You are letting your guard down in some situation where you need to be vigilant.<\/p>"
    },
    {
        "title": "Beach",
        "desc": "<p>To see the beach in your dream symbolizes the meeting between your two states of mind. The sand is symbolic of the rational and mental processes while the water signifies the irrational, unsteady, and emotional aspects of yourself. It is a place of transition between the physical\/material and the spiritual.<\/p><p>To dream that you are on the beach and looking out toward the ocean indicates unknown and major changes that are occurring in your life. Consider the state of the ocean, whether it is calm, pleasant, forbidding, etc.<\/p><p>To dream that you are looking toward the beach suggests that you are returning to what is familiar to you. Alternatively, you may be adapting or accepting to the changes and circumstances in your life.<\/p><p>To dream that you are relaxing on a beach signifies that the coming weeks will be calm and tranquil for you. Your stress will be alleviated and you will find peace of mind.<\/p><p>To dream that you are working on the beach signifies a business project that will consume most of your time.<\/p>"
    },
    {
        "title": "Beach Ball",
        "desc": "<p>To see or play with a beach ball in your dream signifies your playful and lighthearted emotions.<\/p><p>*Please See Also: <a href=\"http:\/\/www.dreammoods.com\/b.htm#Ball\">Ball<\/a>.<\/p>"
    },
    {
        "title": "Beach House",
        "desc": "<p>To see or live in a beach house in your dream implies that you need to take time off and relax. Alternatively, the dream means that you need to confront some emotional issue.<\/p>"
    },
    {
        "title": "Beads",
        "desc": "<p>To see beads in your dream indicate your tendency to please others and put their needs in front of your own. Alternatively, you have a need to strive for perfection.<\/p><p>To dream that you are stringing beads suggests that you have laid the groundwork for your success. You will be recognized and\/or rewarded for your achievements.<\/p><p>To dream that you are counting beads symbolizes pleasure, calmness and joy.<\/p>"
    },
    {
        "title": "Beak",
        "desc": "<p>To see a beak of a bird in your dream suggests that you or someone is meddling in a situation you or they have no business in. It is symbolic of an annoyance or interference.<\/p><p>Dreaming that a bird's beak is stuck in your neck means that you have been gossiping too much.<\/p>"
    },
    {
        "title": "Beaker",
        "desc": "<p>To see or use a beaker in you dream signifies your need to integrate various aspects of your life together. Alternatively, the dream represents logic and objectivity. Perhaps you need to try looking at a problem from a completely different perspective.<\/p>"
    },
    {
        "title": "Bean",
        "desc": "<p>To see or eat beans in your dream signify your connection to your roots and to humanity. Consider what binds you to your community. Alternatively, beans are symbolic of the soul and of immortality. They also relate to fertility.<\/p><p>To dream that you are picking up beans symbolizes your frugal and thrifty ways. Perhaps the dream is telling you to be more watchful of your finances.<\/p>"
    },
    {
        "title": "Beanbag",
        "desc": "<p>To see or toss a beanbag in your dreamsignifies a carefree or lackadaisical attitude.<\/p>"
    },
    {
        "title": "Beanbag Chair",
        "desc": "<p>To see or sit on a beanbag chair indicates temporary setbacks. You are not fully settled in your life.<\/p>"
    },
    {
        "title": "Beanie Baby",
        "desc": "<p>To see a beanie baby in your dream suggests that you are able to adapt to most situations. Consider the animal or the name of the beanie baby. The dream may have an underlying message or a pun.<\/p>"
    },
    {
        "title": "Bear",
        "desc": "<p>To see a bear in your dream represents independence, strength, death and renewal, and\/or resurrection. Bears are symbolic of the cycle of life. You may also be undergoing a period of introspection and thinking. In particular, if you see a bear in your grandmother's house, then it implies that your grandmother is a dominating figure in your life.<\/p><p>The dream may also be a pun on &quot;bare&quot;. Perhaps you need to bare your soul and let everything out into the open. Or there is a situation where you just need to &quot; grin and bear it&quot;.<\/p><p>To dream that you are being pursued or attacked by a bear denotes anger and uncontrolled aggression. You feel trapped. Perhaps you are in a threatening situation, some overwhelming obstacle or domineering and possessive relationship.<\/p><p>To see a polar bear in your dream signifies a reawakening.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=beardream1\">Polar Bears<\/a>&quot; &amp; &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/chasedreams.pl?method=exact&amp;header=dreamid&amp;search=chasedream8\">Bear In A Field<\/a>&quot;<\/p>"
    },
    {
        "title": "Bear Trap",
        "desc": "<p>To see or set a bear trap in your dream represents obstacles in your path that may be difficult to overcome. It is jeopardizing your autonomy and well being.<\/p>"
    },
    {
        "title": "Beard",
        "desc": "<p>To see a long beard in your dream is representative of old age and insight, and wisdom. If you dream that you have a beard, but you do not have on in real life, then the dream means that you are trying to conceal your true feelings. You are being deceptive about some matter. Alternatively, the dream represents your individualistic attitude. You do not care what others think or say about you.<\/p><p>If you have a beard in real life, but dream that you are clean-shaven indicates a desire to reveal more of yourself. There is something that you want to say and you want to make sure it is expressed clearly.<\/p><p>If you are a woman and you dream of growing a beard, then it highlights the masculine aspect of your personality. You want to be more assertive and have more power. Alternatively, the dream means that you are hiding your true character.<\/p>"
    },
    {
        "title": "Beast",
        "desc": "<p>To see a beast in your dream signifies foolishness and ignorance.<\/p><p>To see faceless beasts in your dream indicate a situation you are refusing to see or confront, but are aware of it in some passive way. This dream also suggests that something in your life is bringing up feelings of fear and insecurities.<\/p><p>According to the bible, a beast symbolizes men in honor without understanding. (Psa: 73:22)<\/p>"
    },
    {
        "title": "Beating",
        "desc": "<p>To dream that you are beaten indicates that you need to make some fundamental changes to your character. You need to make some conscious adjustments and evaluations. Alternatively, it suggests that someone is pushing you beyond your limits.<\/p><p>To see others being beaten suggests that some part of your life is out of balance.<\/p><p>To dream that you are beating someone indicates that you are shoving your own views and opinions on others.<\/p>"
    },
    {
        "title": "Beautiful",
        "desc": "<p>To dream that you or someone is extraordinarily beautiful refers to aspects of yourself that you admire and appreciate. These may be feelings that you have recently acknowledged or have incorporated into yourself. The dream may also be reminding you not to take yourself for granted. Do not sell yourself short.<\/p>"
    },
    {
        "title": "Beauty Contest",
        "desc": "<p>*Please See: <a href=\"#Pageant\">Pageant<\/a>.<\/p>"
    },
    {
        "title": "Beauty Mask",
        "desc": "<p>To apply or wear a beauty mask in your dream refers to your desire to hide your imperfections. You don't want others to see your flaws.<\/p><p>To see someone wearing a beauty mask in your dream indicates that he or she is trying too hard to meet other's standards and ideals.<\/p>"
    },
    {
        "title": "Beauty Parlor",
        "desc": "<p>*Please see: <a href=\"#Salon\">Salon<\/a>.<\/p>"
    },
    {
        "title": "Beaver",
        "desc": "<p>To see a beaver in your dream symbolizes energy ambition and productivity. It is time to put your ideas into action. Hard work is necessary to achieve your own goals.<\/p>"
    },
    {
        "title": "Bed",
        "desc": "<p>To see your bed in your dream represents your intimate self and discovery of your sexuality. If you are sleeping in your own bed, then it denotes security and restoration of your mind. You may be looking for domestic bliss, for peace or for some form of escape. If you are waking up in a different and\/or unknown bed, then it represents the consequences of the decisions you have made. The dream may also be a pun on the completion of a project and &quot;putting it to bed.&quot; Consider the condition of the bed. If the bed is made, then it symbolizes security. If the bed is unmade, then it indicates that certain secrets will soon be exposed or revealed. Or that you are exhibiting some carelessness in your sexual behavior.<\/p><p>To dream that you are searching for a bed suggests that you are having difficulties acknowledging your intimate self. You may be feeling inhibited in expressing your sexuality. Alternatively, it may mean that you are looking for domestic security and happiness. Or you just need more sleep.<\/p><p>To dream that you are floating or lifting up into the air from your bed suggests that you are feeling helpless and disconnected from those around you. Your ideas may be alienating people. You might need to tone down your personality a bit.<\/p><p>Dreaming that your parents are buying you a new bed indicates that you need to slow down. You need to make some new changes to your habit or lifestyle. Alternatively, the dream may indicate that you are being pressured to settle down.<\/p>"
    },
    {
        "title": "Bed And Breakfast",
        "desc": "<p>To dream that you are staying in a bed and breakfast indicates that you are looking to have your basic needs met. You want some sort of stability in your life.<\/p>"
    },
    {
        "title": "Bed Wetting",
        "desc": "<p>To dream that you wet the bed represents a lack of control in your life. You are experiencing a lot of anxieties. You may be concerned with not being accepted because of your beliefs or behaviors. The dream may also point to issues in your sexual relationships or sexuality.<\/p>"
    },
    {
        "title": "Bedbugs",
        "desc": "<p>To dream of bedbugs indicate that you are uneasy or annoyed about some situation or relationship. You are keeping these negative feelings to yourself instead of verbalizing it.<\/p>"
    },
    {
        "title": "Bedfellows",
        "desc": "<p>To dream that you are going to bed with a stranger suggests that you are making friends too fast. You need to be more cautious.<\/p><p>To dream that you are going to bed with someone you are not sexual with represents some sort of partnership or some aspect of yourself that you need to acknowledge and come to terms with.<\/p>"
    },
    {
        "title": "Bedpan",
        "desc": "<p>To see or use a bedpan in your dream indicates that you have been emotionally hurt and need time to heal. You feel emotionally detached from your own body. At the same time, you feel you have no physical control over your body.<\/p>"
    },
    {
        "title": "Bedridden",
        "desc": "<p>To dream that you are bedridden signifies ignorance or denial. You are not facing up to reality.<\/p>"
    },
    {
        "title": "Bedroom",
        "desc": "<p>To dream that you are in the bedroom signifies aspects of yourself that you keep private and hidden. It is also indicative of your sexual nature and intimate relations.<\/p><p>To dream of your childhood bedroom indicates that a current situation or feeling has triggered a memory from your childhood that you have kept secret. Alternatively, the dream may be symbolic of a sexual awakening.<\/p>"
    },
    {
        "title": "Bedspread",
        "desc": "<p>To notice or buy bedspread in your dream represents your open sexuality and outward beauty. The design and look of the bedspread may be a clue into what you are looking for sexually.<\/p>"
    },
    {
        "title": "Bee",
        "desc": "<p>To see bees in your dream symbolize wealth, good luck, harmony, creativity and bliss. Bees are also symbolic of hard work and industry as represented by the common phrase &quot;busy as a bee.&quot;Your hard work will pay off in the end with sweet results. Alternatively, the dream represents the things that are happening in your life or something that is buzzing with activity. Is there a lot going on in your life?<\/p><p>In particular, to see the queen bee in your dream refers to a dominant female in your life.<\/p><p>To dream that you are stung by a bee indicates that you have been wronged. Maybe you have been hurt by some stinging remark. Dreaming that your are chased by bees mean that you are trying to avoid a negative or painful situation.<\/p>"
    },
    {
        "title": "Bee Pollen",
        "desc": "<p>To dream that you are eating bee pollen means that you are looking for a more holistic or natural approach to improving your well-being.<\/p>"
    },
    {
        "title": "Beech",
        "desc": "<p>To see a beech tree in your dream symbolizes intellect, learning and wisdom. Pay attention to the message in your dream as you will learn something important from it. Alternatively, it represents death.<\/p>"
    },
    {
        "title": "Beef",
        "desc": "<p>To see or eat beef in your dream signifies your animal instinct and animalistic energy. The dream may also be a reference to your &quot;beef&quot; or grudge with someone. Are you trying to pick a fight?<\/p>"
    },
    {
        "title": "Beehive",
        "desc": "<p>To see a beehive in your dream denotes that there are many opportunities for you to get ahead in life. Don't let them escape from your grasp. The beehive symbolizes hard work and the importance of teamwork. A promotion may be in store for you.<\/p><p>To see an empty beehive signifies sorrow over love affairs and financial losses.<\/p><p>To dream of destroying a beehive symbolizes losses and bad luck.<\/p>"
    },
    {
        "title": "Beekeeper",
        "desc": "<p>To see or dream that you are a beekeeper implies that you need to find a balance between your professional life and your social life. Alternatively, the dream refers to some precarious situation that you need to handle with caution.<\/p>"
    },
    {
        "title": "Beeper",
        "desc": "<p>*Please See: <a href=\"#pager\">Pager<\/a>.<\/p>"
    },
    {
        "title": "Beer",
        "desc": "<p>To see or drink beer in your dream represents happiness, relaxation, and\/ or inspiration. You are free of worries and enjoying the moment. Alternatively, beer drinking refers to your social life.<\/p><p>*Please also see<a href=\"#Alcohol\">Alcohol<\/a>.<\/p>"
    },
    {
        "title": "Beer Bong",
        "desc": "<p>To see or drink from a beer bong in your dream represents your desires to escape from the stressors in your life. You are channeling your feelings in an ineffective way. Alternatively the dream refers to your party hard mentality.<\/p>"
    },
    {
        "title": "Beetle",
        "desc": "<p>To see a beetle in your dream indicates that some destructive influences may be at work in your waking life. You may also feel that your values and beliefs are being compromised. If you dream that beetles are crawling all over you, then it indicates that a lot of minor issues are bugging you.<\/p>"
    },
    {
        "title": "Beets",
        "desc": "<p>To see or eat beets in your dream symbolize success and abundance. You are reaping the benefits of your hard work.<\/p>"
    },
    {
        "title": "Beg",
        "desc": "<p>To dream that you are begging for something represents your unhappiness and dissatisfaction with your current waking situation. You are afraid to accept help or do not want to admit that you need help.<\/p>"
    },
    {
        "title": "Beggar",
        "desc": "<p>To see or dream that you are a beggar represents your sense of insecurity and lack of self-worth. You feel that you are undeserving. Alternatively, the dream may be telling you that &quot;beggars can't be choosers&quot;. Perhaps you are being too picky about something that you should not be picky about.<\/p><p>To dream that you are helping a beggar indicates that you will overcome your hardships and inadequacies.<\/p>"
    },
    {
        "title": "Begin",
        "desc": "<p>To dream about beginning something indicates that valuable time has been wasted through procrastination. You need to get on with life and put your plans into motion.<\/p>"
    },
    {
        "title": "Behead",
        "desc": "<p>To dream that you or someone else is being beheaded signifies poor judgment or a bad decision that you have made and regretted. You are not thinking clearly and are refusing to see the truth. You need to confront the situation or the person despite the pain and discomfort you might feel in doing so. The dream also suggests that you have the tendency to act before you think.<\/p><p>To dream that a snake is being beheaded indicates that you are refusing to face your fears.<\/p>"
    },
    {
        "title": "Behind",
        "desc": "<p>To dream that you are behind someone suggests that you are offering your support and encouragement for someone. Alternatively, it refers to emerging subconscious thoughts and feelings.<\/p><p>To dream that you are left behind represents feelings of rejection or not fitting into a group. It may also highlight fears of not being able to keep up. You are questioning your abilities and\/or may not be utilizing your full potential. If you left something or someone behind, then it indicates that you are ready to let go of the past and move forward.<\/p>"
    },
    {
        "title": "Belch",
        "desc": "<p>*Please See: <a href=\"#Burp\">Burp<\/a>.<\/p>"
    },
    {
        "title": "Believing",
        "desc": "<p>To dream that no one believes you represents a lack of confidence. You are questioning your own decisions or judgment.<\/p>"
    },
    {
        "title": "Bell",
        "desc": "<p>To hear a bell in your dream represents a warning or a call to order. The ringing of the bell signals the beginning of something new. It may also be a way for your subconscious to prepare you for whatever is happening next. If the bell rings and never stops, then it suggests that you are experiencing extreme anxiety.<\/p><p>To see a silver bell in your dream means that you are trying to keep negative forces at bay. Alternatively, it signals the holidays.<\/p><p>To dream about a gold bell indicates that you want someone's undivided attention. You feel what you have to say is extremely important.<\/p>"
    },
    {
        "title": "Bell Pepper",
        "desc": "<p>To see or eat a bell pepper in your dream represents your tenacity, your defense mechanism and your ability to put up a fight. In general, it is a positive symbol indicating a change for the better. Consider the color of the bell pepper. If it is green, then it suggests that you are still feeling fresh and energetic about your fight. If it is red, then it indicates that there is anger behind your wall of defense. If the bell pepper is yellow, then it means that you are using your energy wisely.<\/p>"
    },
    {
        "title": "Bellhop",
        "desc": "<p>To dream that you are a bellhop suggests that you are carrying the burdens of others on your shoulders. You are feeling weighed down by other people's problems.<\/p><p>To see a bellhop in your dream indicates that you are pushing your problems and burdens on others.<\/p>"
    },
    {
        "title": "Bellow",
        "desc": "<p>To use a bellow in your dream symbolizes hard work and industry. Nothing is going to come easy.<\/p>"
    },
    {
        "title": "Belly",
        "desc": "<p>To see your belly in your dream indicates that your are processing and integrating your ideas and feelings from the subconscious to the conscious level. The belly symbolically holds repressed emotions and unexpressed feelings. Your dream may also be telling you to trust your gut feeling and intuition.<\/p><p>To see a pregnant belly represents emotions that are due to come to the surface. They can no longer remain suppressed.<\/p><p>To dream that you are stroking or touching a belly indicates that you are coming to terms with certain feelings. You are slowly confronting and acknowledging your repressed emotions.<\/p><p>To dream that you or someone has a belly piercing denotes your deep connection with your mother. Perhaps the dream is telling you to reconnect with your mother or that you need to be in touch with your maternal instincts.<\/p>"
    },
    {
        "title": "Belly Button",
        "desc": "<p>*Please See: <a href=\"#Navel\">Navel<\/a>.<\/p>"
    },
    {
        "title": "Belly Dancer",
        "desc": "<p>To dream that you are a belly dancer means that you are comfortable in your own body. You are connecting with your sensual side.<\/p><p>To see a belly dancer in your dream refers to your easy going and down to earth nature.<\/p>"
    },
    {
        "title": "Below",
        "desc": "<p>To see something below you in your dream indicates that you are looking down on others. You feel that you are are too good for someone or for a situation. Alternatively, the dream suggests that you are delving into your subconscious.<\/p>"
    },
    {
        "title": "Belt",
        "desc": "<p>To see a belt in your dream signifies a constricted flow of life energy and issues of morality. You may be feeling conflicted between what you think (your intellectual reasoning) and what you feel (your instinctual nature). Alternatively, a belt may symbolize punishment and discipline.<\/p>"
    },
    {
        "title": "Bench",
        "desc": "<p>To see or sit on a bench signifies your tendency to procrastinate and put things aside. It also suggests that you often take on a passive role instead taking initiative.<\/p>"
    },
    {
        "title": "Bending",
        "desc": "<p>To dream that you are bending signifies your ability to adapt to new situations. In particular, bending backward may represent how you are going out of your way to please, while bending forward implies your eagerness to do something.<\/p>"
    },
    {
        "title": "Bereavement",
        "desc": "<p>To dream that you are in bereavement suggests that you are repressing your grief. Perhaps something is bothering you more than you realize. You need to express your sadness and not keep it inside. For those that are experiencing bereavement in real life, such dreams are a way of coping with what has happened.<\/p>"
    },
    {
        "title": "Beret",
        "desc": "<p>To see or wear a beret in your dream symbolizes the military. It could mean either peace or war. Consider the color of the beret for additional significance. In particular, if the beret is green or red, then it signifies successful strategy in battle.<\/p>"
    },
    {
        "title": "Berries",
        "desc": "<p>To see or eat berries in your dream indicate that you will be involved with a fulfilling relationship or experience. In particular, if the berries are poisonous, then it suggests that you are in danger of becoming negatively influenced by something or someone.<\/p>"
    },
    {
        "title": "Beryl",
        "desc": "<p>To see beryl in your dream symbolizes hope and happiness.<\/p>"
    },
    {
        "title": "Best Man",
        "desc": "<p>To dream that you are the best man of a wedding refers to your self-confidence. You are the &quot;best&quot; person for the job. Alternatively, the dream implies that you are moving toward becoming a better person.<\/p><p>If you are a woman and dream that you are the best man indicates that you are breaking down gender roles. Sometimes the best man for the job is not necessarily a man.<\/p>"
    },
    {
        "title": "Bestiality",
        "desc": "<p>To see or be involved in bestiality in your dream represents your animalistic and carnal desires. It also refers to raw sexuality and lust. Alternatively, the dream may indicate that you are experimenting with certain sexual acts that you are not fully comfortably with.<\/p>"
    },
    {
        "title": "Bet",
        "desc": "<p>To dream that you are making a bet suggests that you are taking a risk in a relationship or work situation which may not be such a wise choice. Use your judgment and proceed cautiously.<\/p>"
    },
    {
        "title": "Betrayal",
        "desc": "<p>To dream that you have been betrayed represents your suspicions about a particular person, relationship or situation. This dream often occurs when you are having feelings of insecurity and are faced with major commitments in your life at the same time.<p>To dream that someone has betrayed you indicates self-pity. You are feeling sorry for yourself.<\/p>"
    },
    {
        "title": "Betta Fish",
        "desc": "<p>To see a betta fish in your dream indicates that thoughts from your subconscious is close to emerging to the surface. You are ready to confront your repressed thoughts. If there are two betta fish in your dream, then it signifies conflicting issues that you are dealing with.<\/p>"
    },
    {
        "title": "Beverage",
        "desc": "<p>To drink a beverage in your dream represents your ability to understand and take in a new idea or concept. The dream may be analogous to your thirst for knowledge. Consider the type of beverage for additional meaning.<\/p>"
    },
    {
        "title": "Bewilderment",
        "desc": "<p>To dream that you are bewildered indicates that you are stuck in the middle between two opposing views. It represents your indecision and your inability to make up your mind. Such dreams often reflect your waking state of confusion and shock.<\/p>"
    },
    {
        "title": "Bible",
        "desc": "<p>To see or read the bible in your dream symbolizes truth, belief, inspiration and knowledge. You are seeking some form of comfort. The bible may also refer to your fundamental belief system. Perhaps you need to turn to the bible more. If you dream of a specific chapter or verse from the bible, then it points to advice that you need to consider in your waking life.<\/p><p>To buy a bible in your dream suggests that you are trying to justify your actions.<\/p>"
    },
    {
        "title": "Bicycle",
        "desc": "<p>To dream that you are riding a bicycle signifies your desires to attain a balance in your life. You need to balance work and pleasure in order to succeed in your current undertakings. If you have difficulties riding the bicycle, then it suggests that you are experiencing anxieties about making it on your own. If you are riding a push bike, then it means that you want to move forward at your own pace and by your own power.<\/p><p>To see a bicycle in your dream indicates that you need to devote time to leisurely pursuits and recreation.<\/p><p>To dream that you are riding tandem in a bicycle suggests that you are more accepting with aspects of yourself or of your partner that you have previously rejected. Dreaming that you are being chased by people on a tandem bicycle means that you are not being cooperative. You are refusing to work together with someone on a project.<\/p><p>If the color of the bicycle was particularly important or memorable, then the dream often relates to specific childhood memories. If you had a yellow bicycle or the neighbor down the street had a red one, then the dream is about what you were going through during that period of your life.<\/p>"
    },
    {
        "title": "Bier",
        "desc": "<p>To see a bier in your dream symbolizes a loss.<\/p>"
    },
    {
        "title": "Big",
        "desc": "<p>To dream that someone or something is bigger than normal indicates that you either have an inflated opinion of yourself or of someone. You may be expressing a desire to be more dominant in some situation or relationship.<\/p><p>To see a big figure in your dream represents authority and power.<\/p>"
    },
    {
        "title": "Big Bird",
        "desc": "<p>To see Big Bird in your dream represents friendship and acceptance. It also symbolizes your inquisitive nature. Alternatively, dreaming of Big Bird may serve to bring you back to your childhood. Perhaps the dream is trying to remind you of some old childhood lesson.<\/p>"
    },
    {
        "title": "Bigamy",
        "desc": "<p>To dream that you commit bigamy suggests that you are having an extremely difficult time with weighing out your options and making a decision between two choices.<\/p><p>To dream that you marry a bigamist indicates that you are being deceived by someone in your life. You need to look closely at those who are close to you.<\/p>"
    },
    {
        "title": "Bigfoot",
        "desc": "<p>To see bigfoot in your dream symbolizes the unknown and the subconscious. Alternatively, it suggests that you are misrepresenting yourself in some way or that you are misleading others.<\/p><p>To see or drive a bigfoot truck in your dream indicates that you have total control over the path that your life is taking. You do not let anybody stand in your way, especially toward your goals.<\/p>"
    },
    {
        "title": "Bikini",
        "desc": "<p>To dream that you are wearing a bikini suggests that you are feeling exposed. You may feel unprotected emotionally. It may also signal a return to innocence or youth. Alternatively, a bikini indicates superficial desires.<\/p>"
    },
    {
        "title": "Bile",
        "desc": "<p>To dream of your bile suggests that you are moody and irritable. Consider the color of the bile. If the color is dark, then it symbolizes sadness and depression. If the color is yellow, then it represents anger.<\/p>"
    },
    {
        "title": "Billboard",
        "desc": "<p>To see a billboard in your dream is a sign or message that you need to take note of in your path toward your goals. Consider what advice the billboard is trying to convey to you.<\/p>"
    },
    {
        "title": "Billionaire",
        "desc": "<p>To see or dream that you are a billionaire points to your desires. The dream may be an inspiration for you to work harder. Alternatively, the dream refers to your inadequacies and shortcomings. There is a void in you life.<\/p>"
    },
    {
        "title": "Bills",
        "desc": "<p>To see bills in your dream suggest that your mind is preoccupied with financial and money matters. You may be feeling overwhelmed with life's demands.<\/p><p>To receive a bill in your dream represents something that you have done is now costing you in some way or other.<\/p>"
    },
    {
        "title": "Billfold",
        "desc": "<p>**Please See: <a href=\"#Wallet\">Wallet<\/a>.<\/p>"
    },
    {
        "title": "Billiards",
        "desc": "<p>To dream that you are playing billiards represents your competitive nature. You need to learn to win or lose gracefully. Alternatively, it may mean that you need to concentrate harder on a problem in your waking life.<\/p>"
    },
    {
        "title": "Binder",
        "desc": "<p>To see a binder in your dream represents things that you need to keep track and stay on top of. It may indicate emotions and issues that you have overlooked in your waking hours. Consider the contents inside the binder. Alternatively, the dream may be a reference to &quot;binding&quot; something together. Perhaps you need to integrate, incorporate or combine certain qualities within yourself. Or the binder could also symbolize your obligations and responsibilities.<\/p>"
    },
    {
        "title": "Bingo",
        "desc": "<p>To see or play bingo in your dream symbolizes a sudden revelation. Pay special attention to the dream content as there is something significant and profound that you have learned or discovered about yourself.<\/p>"
    },
    {
        "title": "Binoculars",
        "desc": "<p>To dream that you are looking through a pair of binoculars suggests that you need to take a long and close look at a situation. You need to carefully evaluate your choices and decision.<\/p>"
    },
    {
        "title": "Bioluminescence",
        "desc": "<p>To see a bioluminescence in your dream suggests that you are seeking attention. Or the dream is telling you that you need to step out of the shadow and shine.<\/p>"
    },
    {
        "title": "Birch",
        "desc": "<p>To see a birch tree in your dream indicates self-punishment or guilt issues.<\/p>"
    },
    {
        "title": "Bird",
        "desc": "<p>To see birds in your dream symbolize your goals, aspirations and hopes. To dream of chirping and\/or flying birds, represent joy, harmony, ecstasy, balance, and love. It denotes a sunny outlook in life. You are experiencing spiritual freedom and psychological liberation. It is almost as if a weight has been lifted off your shoulders.<\/p><p>To dream of dead or dying birds indicates disappointments. You will find yourself worrying over problems that are nagging on your mind.<\/p><p>To dream of birds on the attack means that you are being pulled into too many directions. You are experiencing conflict with your spirituality. If the birds are trying to break into houses, then it implies that you are not following your desired path in life. Others are meddling in your life and interfering with your life path.<\/p><p>To see bird eggs in your dream symbolize money.<\/p><p>To see birds hatching in your dream symbolize delayed success.<\/p><p>To see a bird nest in your dream symbolizes independence, refuge and security. You need something to fall back on. Alternatively, it may signify a prosperous endeavor, new opportunities, and fortune.<\/p><p>Dreaming that a bird's beak is stuck in your neck means that you have been gossiping too much.<\/p><p>To see a bird singing near a fire refers to someone who is consumed by their passion.<\/p><p>**See: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/birds.htm\">Dream Moods Dream Themes: Birds<\/a> for the meaning of the different species of bird.<\/p>"
    },
    {
        "title": "Bird's Eye View",
        "desc": "<p>To see your dream from a bird's eye view implies that you are on top of a situation. It may also mean that you have a new perspective on things. Or the dream is telling you to look at the overall picture.<\/p>"
    },
    {
        "title": "Bird of Paradise",
        "desc": "<p>To see a bird of paradise in your dream represents your hard shell and cold exterior. You need to be more receptive and open yourself to love. Alternatively, the dream symbolizes relaxation. It is time for a vacation.<\/p>"
    },
    {
        "title": "Birdbath",
        "desc": "<p>To see a birdbath in your dream symbolizes spiritual cleansing. You are undergoing a fresh new phase in your life.<\/p>"
    },
    {
        "title": "Birdcage",
        "desc": "<p>To see a birdcage in your dream represents a loss of freedom. You are feeling locked up and unable to fully express yourself.<\/p>"
    },
    {
        "title": "Birdhouse",
        "desc": "<p>To see a birdhouse in your dream symbolizes the season of spring. It is time for a fresh start or a new beginning. Alternatively, the birdhouse in your dream may be analogous to your own home and your own spiritual sanctuary. The dream is telling you to be more in tune with your spirituality and to work on developing it.<\/p>"
    },
    {
        "title": "Birdseed",
        "desc": "<p>To dream of feeding birds with birdseed suggest that you are nourishing your higher, spiritual qualities. Alternatively, it many indicate insufficient rewards for your efforts.<\/p><p>To dream that you are spreading birdseed on the ground, signifies minor growth in your business endeavors.<\/p>"
    },
    {
        "title": "Birth",
        "desc": "<p>To dream of giving birth or see someone else giving birth suggests that you are giving birth to a new idea or project. It also represents a new attitude, fresh beginnings or a major event. Alternatively, the dream may be calling attention to your inner child and the potential for you to grow. If you dream that you are giving birth to twins, then itrepresents conflicting ideas. If you give birth to quadruplets in your dream, then it implies that you are undergoing a positive transformation which is making you feel whole again. A more direct interpretation of this dream may represent your desires\/ anxieties of giving birth or the anticipation for such an event to occur.<\/p><p>Dreaming that you are giving birth to an unusually heavy baby signifies dependency issues. You are afraid of having others rely on you and are apprehensive about satisfying other's needs. To dream that someone else is giving birth to a very heavy baby represents some burden that this person is creating for you or others.<\/p><p>To dream that you are giving birth prematurely implies that you have revealed or turned in a project that was incomplete. You feel unready or unprepared about a new endeavor.<\/p><p>To dream that you are giving birth to a non-human creature signifies your overwhelming (and unfounded) fear in the health of your baby. You are overly concerned that your baby may have birth defects. This type of dream is common in expectant mothers in their second trimester. If you are not expecting, then it refers to your fear in the outcome of some decision or project. You are trying to overcome difficulties in your life and achieve inner development.<\/p><p>In particular, if you dream that you are giving birth to a monster, then it implies that your inner creative energy has yet to blossom and grow into expression. You may have some hesitation in releasing this &quot;monster&quot; for fear that others will judge you or that they will not accept your ideals.<\/p><p>To dream that the mother dies during birth represents transformation. The dream represents the ending of one thing (death) and the new beginning of another thing (birth). You may be making life changes or getting rid of your old habits and ways.<\/p><p>To dream that the child dies during childbirth suggests that you are having difficulties getting pregnant. It may also reflect your anxiousness about caring for a child.<\/p><p>***Read our special section on: <a href=\"http:\/\/www.dreammoods.com\/dreaminformation\/pregnancy-dreams.htm\">Dreaming While Pregnant<\/a>. Please see also: <a href=\"#Pregnant\">Pregnant<\/a>.<\/p>"
    },
    {
        "title": "Birth Control",
        "desc": "<p>*Please See: <a href=\"#Contraceptive\">Contraceptive<\/a>.<\/p>"
    },
    {
        "title": "Birthday",
        "desc": "<p>To dream about your birthday denotes acceptance of yourself. You are celebrating who you are and coming to terms with who you are as a person. Alternatively, the dream may mean you are afraid of getting old.<\/p><p>To dream that your birthday was forgotten suggests that you are feeling lonely, overshadowed, and under-appreciated.<\/p><p>Dreaming that you are having a bad or horrible birthdayindicates some sort of regret.<\/p>"
    },
    {
        "title": "Birthday Cake",
        "desc": "<p>To see a birthday cake in your dream indicates that the best of your wishes will be realized. It also represents your willingness to let people in and share your life with others.<\/p><p>To see candles on the cake represents your positive outlook in life.<\/p>"
    },
    {
        "title": "Birthmark",
        "desc": "<p>To dream that you have a birthmark serves as a reminder that something you must either do or never do again. It represents a stain on your soul.<\/p>"
    },
    {
        "title": "Bisexual",
        "desc": "<p>If you are not bisexual and dream that you are, then it may indicate some sexual repression. You may be trying to compensate for your lack of sexual expression. Alternatively, it may represent general sexual confusion."
    },
    {
        "title": "Bison",
        "desc": "<p>*Please see: <a href=\"#Buffalo\">Buffalo<\/a>.<\/p>"
    },
    {
        "title": "Bites",
        "desc": "<p>To see a bite in your dream forewarns of danger from someone who wish you harm, either physical or financial. Be careful of people who surround you.<\/p><p>To dream that you are being bitten represents your vulnerability regarding some unresolved issues or emotions. You may be pestered by a problem or obstacle. The dream may also be a metaphor indicating that you have bitten off more than you chew. Perhaps you have too much to handle.<\/p><p>To dream that you are being bitten by a vampire signifies your need to shut out a person in your life who has been using you. It is time to open your eyes and stand up for your self. Do not let yourself be manipulated and played for a fool.<\/p><p>To dream of biting someone in your dream signifies the pressure you are putting on some people causing them great distress. You may have unexpressed, perhaps even childish, feelings of anger or resentment that need to be recognized. This dream is a message for you to lighten up and alleviate the stress that you are putting on others.<\/p>"
    },
    {
        "title": "Bitter",
        "desc": "<p>To dream that something is or tastes bitter suggests that a certain aspect or condition in your life is becoming difficult to swallow and tolerate. You may also be experiencing some guilt.<\/p>"
    },
    {
        "title": "Black Cat",
        "desc": "<p>To see a black cat in your dream indicates that you are experiencing fear in using your psychic abilities and in believing in your intuition. You may erroneously associate the black cat with evil, destruction, and bad luck. In particular, if the black cat is biting, clawing or attacking you, then the dream means that you must acknowledge what your intuition is trying to tell you. You can no longer ignore it. Do not be afraid to face the situation.<\/p>"
    },
    {
        "title": "Black Eye",
        "desc": "<p>To dream that you have or get a black eye indicates unresolved conflict. If you give someone a black eye in your dream, then it means that you are not accepting the truth or of someone's decisions.<\/p>"
    },
    {
        "title": "Black Hole",
        "desc": "<p>To see the black hole in your dream indicates that there is no turning back on a decision that you have made. You may be feeling stuck in a situation. Alternatively, the hole symbolizes the subconscious and the unknown.<\/p>"
    },
    {
        "title": "Black Light",
        "desc": "<p>To see something under black light in your dream means that you are not seeing things that are happening around you. You are turning a blind eye and refusing to see the truth. Alternatively, dreaming of black light represents your intuition.<\/p>"
    },
    {
        "title": "Black Widow",
        "desc": "<p>To see a black widow in your dream suggests fear or uncertainty regarding a relationship. You may feel confined, trapped, or suffocated in this relationship. You may even have some hostility toward your mate.<\/p><p>Because the female black widow has the reputation of devouring its mate, it thus also symbolizes feminine power and domination over men.<\/p>"
    },
    {
        "title": "Blackberries",
        "desc": "<p>To see or eat blackberries in your dream suggest that you are becoming careless. It is also an expression of your hidden sexual desires.<\/p>"
    },
    {
        "title": "Blackbird",
        "desc": "<p>To see a blackbird in your dream signifies a lack of motivation. You are not utilizing your full potential. Alternatively, it represents jealousy, lust or temptation.<\/p><p>In particular, if your dream that a blackbird is swooping, then it signifies delving into your subconscious.<\/p>"
    },
    {
        "title": "Blackboard",
        "desc": "<p>*Please See: <a href=\"#Chalkboard\">Chalkboard<\/a>.<\/p>"
    },
    {
        "title": "Blackmail",
        "desc": "<p>To dream that you are blackmailing someone indicates your issues with power and domination. You may be letting your competitive nature get the best of you.<\/p><p>To dream that you are being blackmailed represents inner weaknesses and helplessness. You may not have confidence in your own ability. It may also be a pun on a &quot;black male&quot; you may know in your life.<\/p>"
    },
    {
        "title": "Blackout",
        "desc": "<p>To dream that there is a blackout indicates your lack of insight and perspective on a situation. You may be feeling frustrated or experiencing failure in some work that you are attempting. The blackout may also symbolize ignorance, the subconscious, evil, death, or fear of the unknown.<\/p>"
    },
    {
        "title": "Blacksmith",
        "desc": "<p>To see a blacksmith in your dream represents inner strength and endurance. Perhaps the dream is telling you that you need to strike while the fire is hot or act while you have the opportunity.<\/p>"
    },
    {
        "title": "Bladder",
        "desc": "<p>To dream about your bladder suggests that you need to show some restraint in exercising your power.<\/p>"
    },
    {
        "title": "Blade",
        "desc": "<p>To see a blade in your dream suggests that you are making some difficult and important decisions. You need to be able to make clear distinctions between your choices. It also indicates that you are walking on a thin line and need to balance aspects of your life carefully.<\/p><p>To dream that a blade is broken in half indicates some ambivalence, confusion or ambiguity with some decision that you are trying to make. Up to now, your actions have been counterproductive. Alternatively, the dream means that anger is not the answer to solving your problems.<\/p><p>**Please See Also: <a href=\"#Knife\">Knife<\/a>.<\/p>"
    },
    {
        "title": "Blame",
        "desc": "<p>To dream that you are being blamed for something suggests that you are feeling powerless and helpless in some waking situation.<\/p><p>To blame someone else for something you did in your dream indicates that you are trying to deflect responsibilities for your actions.<\/p>"
    },
    {
        "title": "Blankness",
        "desc": "<p>To have a blank dream suggests that there is something missing or lacking in your life. It symbolizes fruitless labor, an emotional void, or loneliness. Alternatively, having a blank dream may mean that you are experiencing some sort of blackout. You are zoning out.<\/p>"
    },
    {
        "title": "Blanket",
        "desc": "<p>To see a blanket in your dream symbolizes warmth, love, security and protection. You may be seeking for some form of shelter from the outside world. Consider also how your dream may be calling attention to a &quot;cover-up&quot; in some situation or circumstance in your waking life.<\/p><p>To dream that you are wrapped in a blanket indicates your fear of the unknown. You may feel some sort of threat\/chaos or sense some coldness from those around you.<\/p><p>To dream that you are covering or wrapping someone in a blanket indicates your desire to care for that person.<\/p>"
    },
    {
        "title": "Bleach",
        "desc": "<p>To see or use bleach in your dream signifies a time of healing and cleansing. You are ready to mend past hurts and resolve any unexpressed emotions.<\/p>"
    },
    {
        "title": "Bleachers",
        "desc": "<p>To see or sit on bleachers in your dream indicates that you are reflecting on the progress of your goals. The appearance of bleachers can also serve to bring you back in time to the high school gym or track field and the feelings you experienced at the time.<\/p><p>To dream that you are drinking bleach indicates that you are regretting some past comments you have said.<\/p>"
    },
    {
        "title": "Blender",
        "desc": "<p>To see a blender in your dream symbolizes your ability to blend various ideas into a harmonious whole.<\/p>"
    },
    {
        "title": "Blessing",
        "desc": "<p>To dream of a blessing indicates that you are free to move ahead in some endeavor. Others are looking at your actions with approval. Alternatively, you are being recognized for your growth, progress and understanding.<\/p>"
    },
    {
        "title": "Blimp",
        "desc": "<p>To see or ride in a blimp in your dream represents your goals, ambitions and aspirations. It may also indicate an inflated sense of yourself. Alternatively, the dream may be a metaphor for your weight and your issues about your physical appearance. It could also be a reference to someone who is overweight. If there is a message on the blimp, then consider how you need to incorporate the message into some waking issue or to some aspect of your life. For example, the good year blimp may mean that you need to be more optimistic about life.<\/p>"
    },
    {
        "title": "Blind",
        "desc": "<p>To dream that you are blind represents your refusal to see the truth or your lack of awareness to a problem. Perhaps you are rejecting something about yourself or your situation. Are you refusing to see any other point of view except your own? Consider the pun, &quot;turning a blind eye&quot;.<\/p><p>To see a blind person in your dream suggests that you are letting opportunities pass you by.<\/p><p>To dream that a blind person has regained their sight in one or both eyesimplies that you do not need to be able to physically see certain things in order to &quot;see&quot; things. You need to trust your instincts or intuition.<\/p>"
    },
    {
        "title": "Blind Date",
        "desc": "<p>To dream that you are on a blind date represents unknown aspects of yourself that you are trying to get know or acknowledge.<\/p><p>*Please See Also: <a href=\"#Date\">Date<\/a>.<\/p>"
    },
    {
        "title": "Blindfold",
        "desc": "<p>To dream that you are wearing a blindfold indicates that you are being deceived by someone or by some situation. You may be too naive or too trusting. Alternatively, you are trying to cut yourself off from the world.<\/p><p>To dream that you are blindfolding someone suggests that you are being dishonest. You are trying to deceive others.<\/p>"
    },
    {
        "title": "Blinds",
        "desc": "<p>To see or dream that you are shutting the blinds suggests that you are in denial about a situation or problem. The dream may also be a pun on being blind and refusing to see something. Perhaps you are hiding something.<\/p><p>To dream that you are opening the blinds indicates that you are ready to reveal something significant and\/or personal that was previously unknown.<\/p>"
    },
    {
        "title": "Blinkers",
        "desc": "<p>To see or use the blinkers in your dream mean that you are looking for validation or approval. If the blinkers do not work, then it indicates that you are experiencing some hesitation about the decision you have made or the direction that you have taken.<\/p>"
    },
    {
        "title": "Blinking",
        "desc": "<p>To dream that you are blinking indicates that there is something you fear in seeing. You are refusing to see the obvious.<\/p>"
    },
    {
        "title": "Blister",
        "desc": "<p>To dream that you have a blister indicates that some minor annoyance or problem is draining your energy and time. Consider how you may have gotten the blister. If you got the blister from manual and hard labor, then it indicates that you need to put forth more effort in order to overcome your little problems. To dream that you got the blister from a burn suggests an emotional or relational problem.<\/p><p>Where the blister is located is also significant. If the blister is on you hand, then it suggests that you are having issues related to power and competency. If the blister is on your face, then it indicates issues related to your identity, self-image, and self-identity.<\/p>"
    },
    {
        "title": "Blizzard",
        "desc": "<p>To dream about a blizzard suggests that you are feeling emotionally cold and frigid. You feel excluded and left out. It may indicate a lack of love and the absence of warmth within your own family circle.<\/p>"
    },
    {
        "title": "Bloated",
        "desc": "<p>To dream that you are bloated indicates some pent up emotion.<\/p>"
    },
    {
        "title": "Blocks",
        "desc": "<p>To see a block or blocks in your dream represent obstacles that you need to overcome. These are things that try to hinder you from achieving your goals. Alternatively, it symbolizes a vision and making something out of nothing.<\/p>"
    },
    {
        "title": "Blog",
        "desc": "<p>To read or write a blog in your dream suggests that you are trying to change or rewrite the past to suit your own needs. Consider what is written in the journal and how it is similar or dissimilar to actual events in your waking life. Alternatively, it symbolic of some memory or something that you need to always remember.<\/p><p>To dream that someone is reading your blog indicates your popularity. You are experiencing life to the fullest.<\/p>"
    },
    {
        "title": "Blonde",
        "desc": "<p>To see a blonde person in your dream suggests that you need to enjoy life and live it up. Be a little glamorous.<\/p><p>To dream that you dye your hair blonde indicates that you literally need to lighten up and quit being so serious all the time. Try to be more upbeat.<\/p>"
    },
    {
        "title": "Blood",
        "desc": "<p>To see blood in your dream represents life, love, and passion as well as disappointments. If you see the word &quot;blood&quot; written in your dream, then it may refer to some situation in your life that is permanent and cannot be changed. If something else is written in blood, then it represents the energy you have put into a project. You have invested so much effort into something that you are not willing to give it up. If you dream of blood on the walls, then it is a warning of sorts. There is a situation that you need to confront. You can not avoid it any longer. More specifically, if blood is on the bathroom walls, then it indicates that the situation that you need to confront is an extremely emotional one.<\/p><p>To dream that you are bleeding or losing blood signifies that you are suffering from exhaustion or that you are feeling emotionally drained. It may also denote bitter confrontations between you and your friends. Some of your past actions have come back to haunt you. Women often dream of blood or of someone bleeding shortly before or during their periods or while they are pregnant. For a pregnant woman in particular, blood in dreams is symbolic of the life force that they are carrying. Such dreams are also a reminder to take things slow.<\/p><p>To dream that others are bleeding signifies an emotional cry for help.<\/p><p>To dream that you are drinking blood indicates that you have a fresh burst of vitality and power. If you dream that you are coughing blood, then it represents wasted energy. You are spending too much time on counterproductive activities.<\/p><p>To dream that you are giving or donating blood suggests that you are feeling physically drained due to stress. If blood is squirting everywhere, then the dream implies that you are experiencing some deep emotional stress. You are literally bursting.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?search=blooddream1&amp;method=exact&amp;header=dreamid\">Menstruation<\/a>&quot;<\/p>"
    },
    {
        "title": "Blood Pressure",
        "desc": "<p>To dream about your blood pressure suggests that a situation or problem is causing you some stress. If you dream that your blood pressure is too low, then it represents your lacking vitality and slower paced lifestyle. You need to socialize more.<br><br>To dream that someone is taking your blood pressure represents some health concerns. Perhaps you need to improve your health. Or you should go visit your doctor.<\/p>"
    },
    {
        "title": "Bloodstone",
        "desc": "<p>To see or wear bloodstone in your dream symbolizes tranquility, tolerance, and understanding. You will overcome your hardships and difficulties.<\/p>"
    },
    {
        "title": "Blossom",
        "desc": "<p>To see a blossom in your dream represents the beauty within your Self. It may be analogous to how you are opening to something. Alternatively, the dream suggests that your hard work will pay off in the end.<\/p>"
    },
    {
        "title": "Blouse",
        "desc": "<p>To wear or buy a blouse in your dream indicates that you are trying to express your emotions. Consider the color of the blouse for added significance. Also pay attention to the fit and style of the blouse for additional clues into your emotional state.<\/p>"
    },
    {
        "title": "Blow Dry",
        "desc": "<p>To dream that you are blow drying your hair suggests that you are clearing out your thoughts and getting some fresh ideas. It may also be a pun on something that blows your mind.<\/p>"
    },
    {
        "title": "Blow Torch",
        "desc": "<p>To see or use a blow torch in your dream indicates that you are trying to obliterate an aspect of your self that you are ashamed of or are embarrassed about. Consider the significance of what you are aiming the blow torch at for clues as to what you are trying to erase about yourself.<\/p>"
    },
    {
        "title": "Blowfish",
        "desc": "<p>* Please See: <a href=\"Puffer%20fish\">Puffer Fish<\/a>.<\/p>"
    },
    {
        "title": "Blowhole",
        "desc": "<p>To see a blowhole in your dream represents sudden outbursts of emotion, usually anger. You are looking for an outlet to release these emotions.<\/p>"
    },
    {
        "title": "Blowout",
        "desc": "<p>To dream that you have a blowout suggests that unexpected occurrences are creating obstacles and delays toward your goals.<\/p>"
    },
    {
        "title": "Blowup Doll",
        "desc": "<p>To see a blowup doll in your dream points to a one-sided relationship.<\/p><p>Dreaming that you are having sex with a blowup doll indicates that you are needs are not being fulfilled.<\/p>"
    },
    {
        "title": "Blue Jay",
        "desc": "<p>To see a blue jay in your dream indicates that you are over-confident and being too arrogant. Alternatively, a blue jay may be trying to call attention to something which you have overlooked.<\/p>"
    },
    {
        "title": "Bluebells",
        "desc": "<p>To see bluebells in your dream foretell of news coming your way.<\/p>"
    },
    {
        "title": "Blueberries",
        "desc": "<p>To see or eat blueberries in your dream represent your youth and the desire to recapture aspects of your youth. It is a symbol of eternity and optimism of the future. Alternatively, it may depict your depressed mood and sadden state of mind.<\/p>"
    },
    {
        "title": "Bluebird",
        "desc": "<p>To see a bluebird in your dream symbolizes both happiness and sadness. It is also an indication of purification and resolution to the opposing conflicts\/paradoxes in your life.<\/p>"
    },
    {
        "title": "Blueprint",
        "desc": "<p>To see a blueprint in your dream indicates that you need to pay closer attention at the details before proceeding forward with some plan or relationship. It may also mean that you are in the process of going through some inner changes in your life. You are working on expanding your way of thinking.<\/p>"
    },
    {
        "title": "Blurry",
        "desc": "<p>To have a blurry dream indicates that there is something you are not confronting or are refusing to see. Life may be passing you by if you do not participate in it. It also represents secrets and confusion. Perhaps you think that someone is trying to keep something from you.<\/p>"
    },
    {
        "title": "Blush",
        "desc": "<p>To dream that you are wearing blush indicates that you want to be more expressive and loving. Alternatively, the dream may be highlighting an embarrassing situation.<\/p>"
    },
    {
        "title": "Boa Constrictor",
        "desc": "<p>To see a boa constrictor in your dream suggests that you are feeling suffocated or restricted in some personal relationship. Alternatively, it represents repressed sexual urges or hidden enjoyment of sex.<\/p>"
    },
    {
        "title": "Boar",
        "desc": "<p>To see a boar in your dream indicates that you need to look inside to find the answers and secrets about yourself and the people around you. The dream may also be a pun on &quot; a bore&quot; or something or someone that is &quot;boring&quot;.<\/p>"
    },
    {
        "title": "Board Games",
        "desc": "<p>To see or play board games in your dream signifies your progress in life. How you do in the board game is analogous to the setbacks and accomplishments in your waking life. Consider the name of the board game you are playing in your dream for additional significance.<\/p>"
    },
    {
        "title": "Boardinghouse",
        "desc": "<p>To dream that you are in a boardinghouse signifies emotional difficulties and hardships. Hang in there and these times will pass.<\/p>"
    },
    {
        "title": "Boardwalk",
        "desc": "<p>To dream that you are on a boardwalk symbolizes your life's path. It represents your social circle and lifestyle.<\/p>"
    },
    {
        "title": "Boat",
        "desc": "<p>To dream that you are in or see a boat signifies your ability to cope with and express your emotions. Pay particular attention to the condition and state of the waters, whether it is calm or violent, clear or murky, etc. Are you &quot;smooth sailing&quot;? Alternatively, you may be ready to confront your subconscious and unknown aspects of yourself. The dream could be telling you not to rock the boat and to stay out of harm's way.<\/p><p>Dreaming that a wave hits your boat and knocks you into the water means that you are letting your emotions guide your decisions. Perhaps you are acting too irrationally.<\/p><p>To dream that you are trying to jump off a boat suggests that you want to confront those difficult emotions and approach your problems head on.<\/p>"
    },
    {
        "title": "Boathouse",
        "desc": "<p>To see or live in a boathouse in your dream suggests that you are well in tune with your emotions. You know how to express your emotions in a healthy way. Consider the condition of the water to indicate how you are feeling. Alternatively, the dream may mean that you need to find time to escape for life's daily demands.<\/p>"
    },
    {
        "title": "Bobble Head",
        "desc": "<p>To see a bobble head in your dream represents your tendency to go along with what other people do or say. You need to start thinking for yourself. Alternatively, the bobble head indicates indecision.<\/p>"
    },
    {
        "title": "Bobby Pin",
        "desc": "<p>To see or use a bobby pin your dream represents your need for order and neatness. Everything needs to be in placed. You are feeling insecure about something."
    },
    {
        "title": "Bobcat",
        "desc": "<p>To see a bobcat in your dream suggests that you need to pay close attention to what you see and hear in your daily life.<\/p><p>*Please see also: <a href=\"#Cat\">Cat<\/a>.<\/p>"
    },
    {
        "title": "Bodice",
        "desc": "<p>To wear a bodice in your dream suggests that you are holding in your emotions and not fully expressing yourself.<\/p>"
    },
    {
        "title": "Body",
        "desc": "<p>To dream about your own body signifies your level of self-worth and self-esteem. Often times, these qualities are dependent on your physical appearance or how your perceive yourself. The dream body also reflects your conscious identity or is representative of your state of health.<\/p><p>To dream about dead bodies implies that you are feeling detached from those around you. It may also mean that you are feeling emotionally drained.<\/p><p>To see a decomposing body in your dream refers to a situation that has long been dead. It is time to move on.<\/p><p>To see or find a bloody dead body in your dream refers to a situation or issue that you can no longer avoid. You need to make an important decision and act on it immediately.<\/p>"
    },
    {
        "title": "Body Bag",
        "desc": "<p>To see a body bag in your dream indicates that you are feeling distant or disconnected. You are out of touch.<\/p>"
    },
    {
        "title": "Body Builder",
        "desc": "<p>To see a body builder in your dream suggests that you need to develop a better sense of power or be more flexible in some situation.<\/p><p>To dream that you are a body builder means that you are feeling empowered.<\/p>"
    },
    {
        "title": "Body Odor",
        "desc": "<p>To dream that you have body order suggests that you are being offensive to others without realizing it. You need to adjust your attitude.<\/p><p>To smell body odor in your dream signifies an issue or problem that needs to be addressed. Alternatively, the dream implies not to take too many things personally.<\/p>"
    },
    {
        "title": "Body Paint",
        "desc": "<p>To dream that you are covered in body paint represents acceptance of yourself. You are proud of your body.<\/p><p>Dreaming that you or someone is covered in blue paint indicates a state of calm and relaxation. You don't want to be judged by your appearance. Alternatively, it may reflect sadness or depression.<\/p>"
    },
    {
        "title": "Body Piercing",
        "desc": "<p>*Please See: <a href=\"#Piercing\">Piercing<\/a>.<\/p>"
    },
    {
        "title": "Body Swap",
        "desc": "<p>To dream that you switch bodies with someone implies that you secretly want what the other person has. Alternatively, dreaming of switching bodies with someone suggests that you are trying to understand the other person and see things from their perspective.<\/p>"
    },
    {
        "title": "Bodyguard",
        "desc": "<p>To dream that you have a bodyguard indicates that you are uneasy about some situation in your waking life. You are feeling insecure, either physically or emotionally. Perhaps you have been hurt recently.<\/p><p>To dream that you are a bodyguard represents your desire to protect others from emotional hurt. It highlights your sympathetic and nurturing side.<\/p>"
    },
    {
        "title": "Bog",
        "desc": "<p>*Please See: <a href=\"http:\/\/dreammoods.com\/cgibin\/searchcsv.pl?search=swamp&amp;method=exact&amp;header=symbol\">Swamp<\/a>.<\/p>"
    },
    {
        "title": "Bogeyman",
        "desc": "<p>To see a bogeyman in your dream symbolizes the repressed and rejected aspect of yourself. It also signifies fear. For children, to dream of the bogeyman represents the disciplinary aspects of the parents that brings about fear and punishment.<\/p>"
    },
    {
        "title": "Bohemian",
        "desc": "<p>To dream that you are a bohemian or that you are living a bohemian lifestyle symbolizes your carefree and easy going attitude. Alternatively, it signifies a lack of direction or motivation.<\/p>"
    },
    {
        "title": "Boiler",
        "desc": "<p>To see a boiler in your dream represents rage that is on the verge of being expressed in a dramatic way.<\/p>"
    },
    {
        "title": "Boiler Room",
        "desc": "<p>To dream that you are in a boiler room refers to your ability to keep your temper and aggression contained. You are trying hard to keep your cool.<\/p>"
    },
    {
        "title": "Boiling",
        "desc": "<p>To dream that something is boiling represents transformation and\/or sacrifice. There is something that you need to get down to the heart of. In particular to dream that water is boiling suggests that you are expressing some emotional turmoil. It also may mean that feelings from your subconscious are surfacing and ready to be acknowledged.<\/p>"
    },
    {
        "title": "Bok Choy",
        "desc": "<p>To see or eat bok choy in your dream suggests that you need to stop dwelling on minor things in your life. You need to move ahead and look at the overall picture.<\/p>"
    },
    {
        "title": "Bologna",
        "desc": "<p>To eat bologna in your dream indicates financial insecurities. Alternatively, the dream may be a reference on something that is phony or nonsense.<\/p>"
    },
    {
        "title": "Bolt",
        "desc": "<p>To see a bolt in your dream suggests that you are protecting yourself from difficult emotions and experiences. The dream may also be a pun on your tendency or desire to flee from a situation.<\/p>"
    },
    {
        "title": "Bomb",
        "desc": "<p>To see a bomb in your dream indicates that you are going through a potentially explosive situation in your waking life. The bomb could represent repressed desires and unexpressed emotions that are on the verge of exploding or bursting if not dealt with soon.<\/p><p>To dream that you are unable to disarm a bomb suggests that your anger is out of control.<\/p><p>To dream of a bomb threat suggests that you are experiencing some inner anger and\/or pressures which are on the verge of exploding into violence.<\/p><p>Dreaming of a church bombing implies that you are not catering to your spiritual needs. Alternatively, to see or read about a church being bombed indicates that you are rejecting an aspect of yourself. You are harboring feelings of hostility.<\/p>"
    },
    {
        "title": "Bomb Shelter",
        "desc": "<p>To dream that you are in a bomb shelter suggests that you are being overly protective with some emotion or aspect of your waking life. You are trying to keep your unexpressed feeling from coming to the surface.<\/p>"
    },
    {
        "title": "Bondage",
        "desc": "<p>To dream that you are in bondage signifies that aspects of your emotions and\/or character are too tightly controlled or that are repressed. You may be restricting your need for self-expression or feel that you are a prisoner of your circumstances.<\/p><p>In a sexual sense, dreams of bondage represents your desires to be more sexually submissive. Perhaps you have not acknowledged these sexual passions.<\/p>"
    },
    {
        "title": "Bones",
        "desc": "<p>To see bones in your dream represent the discovery of your personal, family, or cultural secrets. It is also symbolic of your underlying strengths that you have not yet recognized. Consider the symbolism of getting to the &quot;bare bones&quot; or the significance of &quot;having a bone to pick with someone.&quot;<\/p><p>Dreaming that you are burying the bones of someone who is living means that there are secrets that this person knows about and you are trying to keep those secrets from coming out.<\/p><p>To dream of broken bones represents the discovery or realization that that there is a weakness in your plans or in your thinking. Your dream may call for your immediate attention to a particular situation or relationship.<\/p><p>To see a dog eating or chewing a bone represents your basic desires and instincts.<\/p>"
    },
    {
        "title": "Bonfire",
        "desc": "<p>To see a bonfire in your dream suggests that you need to find a new path and set forth toward a different goal. It is time to express yourself more freely and let go of the old outdated ways of thinking.<\/p>"
    },
    {
        "title": "Bong",
        "desc": "<p>To see or smoke a bong in your dream suggests that you are not confronting your feelings head on. You are trying to downplay your own emotions and are looking for an escape.<\/p>"
    },
    {
        "title": "Bonnet",
        "desc": "<p>To see or wear a bonnet in your dream represents your sheltered ideals and old-fashioned beliefs. Your close-mindedness is restricting your vision and plans.<\/p>"
    },
    {
        "title": "Bonsai Tree",
        "desc": "<p>To see a bonsai tree in your dream indicates the limitations of your own conscious mind. You need to consider what your instincts are telling you.<\/p>"
    },
    {
        "title": "Booger",
        "desc": "<p>To dream that you are picking a booger out of your nose indicates that you are ready to confront some subconscious material.<\/p><p>To dream that your nose is full of boogers implies that you are being stuffy, unyielding and rigid. If you try, but cannot get the boogers out of your nose, then it means that you are unable to be your true self. Something or someone is restricting you from fully expressing yourself.<\/p>"
    },
    {
        "title": "Boogie Board",
        "desc": "<p>To see or ride a boogie board in your dream indicates that you are riding out the difficulties and taking each day one day at a time.<\/p>"
    },
    {
        "title": "Booing",
        "desc": "<p>To hear booing or dream that you are being booed indicates that you are seeking approval and affirmation from others. Alternatively, you may find yourself in an embarrassing or shameful situation.<br>"
    },
    {
        "title": "*Please See Knapsack.",
        "desc": "<p>Bookkeeper<\/p><p>To dream that you are a bookkeeper represents a need to keep you life in balance and in harmony. Alternatively, it may indicate that you should be held accountable for some condition or circumstance.<\/p>"
    },
    {
        "title": "Bookmark",
        "desc": "<p>To see a bookmark in your dream represents memories and aspects of your past. It serves as a reminder of where you've been and where you are headed. The dream may also be a metaphor that you should not forget your place. Perhaps you are overstepping certain boundaries.<\/p>"
    },
    {
        "title": "Books",
        "desc": "<p>To see books in your dream indicate calmness. You are moving toward your goals at a slow and steady pace. Books also symbolize knowledge, intellect, information and wisdom. In particular, to see an open book in your dream, means that you are able to grasp new ideas with ease. If the book is closed, then it represents your allure and mysteriousness. Consider the type of book for additional clues. The dream may represent your calling into a specific field of work or an area that you need to devote more study to. Alternatively, the dream could be telling you not to judge a book by its cover.<\/p><p>To see dusty books in your dream denotes forgotten knowledge or previous &quot;chapters&quot; of your life.<\/p><p>To see children's books in your dream symbolize memories from your own childhood. It may also suggest your desire to escape from reality and retreat into some fantasy world.<\/p><p>To see a satanic book in your dream represents your one-sided way of thinking and looking at things. You are trying to denounce any responsibility in your actions and are putting forth as little effort as possible.<\/p>"
    },
    {
        "title": "Bookshelf",
        "desc": "<p>To see a bookshelf in your dream represents the various levels of your mind where ideas, concepts, and memories are kept. It also suggests your need to acquire some information or knowledge in a situation before making your decision.<\/p>"
    },
    {
        "title": "Bookstore",
        "desc": "<p>To dream that you are at a bookstore symbolizes your quest for knowledge and ideas. You want to develop your mental sharpness.<\/p>"
    },
    {
        "title": "Boomerang",
        "desc": "<p>To see or throw a boomerang in your dream indicates that what you do to others will come back to you, whether it is positive or negative.<\/p>"
    },
    {
        "title": "Booster Cables",
        "desc": "<p>To see or use booster cables in your dream suggests that you need to get a jumpstart on your goals. Stop wasting your life away and start getting a move on.<\/p>"
    },
    {
        "title": "Boot Camp",
        "desc": "<p>To dream that you are in a boot camp represents your need for discipline and rigid rules. You need to have a better focus on your goals. If you have been through boot camp, then the dream may represent the feelings you were going through at the time. Something in your current life is triggering those similar feelings. Alternatively, the dream may represent your need for a new start or fresh beginning.<\/p>"
    },
    {
        "title": "Bootlegger",
        "desc": "<p>To dream that you are a bootlegger suggests that you feel that you are above the law. You feel that the rules do not apply to you.<\/p>"
    },
    {
        "title": "Boots",
        "desc": "<p>To see or dream that you are wearing boots refers to the power in your movement and the boldness of your position. You are taking a firm stance. The dream may also be a metaphor that you are getting the boot. Are you getting kicked out somewhere?<\/p><p>If you dream that your boots are dirty, then it points to your stamina, willpower, hard work and strong work ethic. To dream about cleaning your bootsmeans that you are moving ahead by your own means.<\/p>"
    },
    {
        "title": "Border",
        "desc": "<p>To see or cross the border in your dream indicates that you are entering a new phase or transition in your life. You are encountering new territory. Alternatively, it represents the conversion of two states of mind or attitudes.<\/p>"
    },
    {
        "title": "Borrow",
        "desc": "<p>To dream that you are borrowing something suggests that you need to let go of your pride. It is okay to ask for help and lean on the support of friends and family. Alternatively, the dream indicates that you need to incorporate a certain quality into your own life that you are not utilizing currently.<\/p>"
    },
    {
        "title": "Bosom",
        "desc": "<p>* Please See: <a href=\"#Breasts\">Breasts<\/a>.<\/p>"
    },
    {
        "title": "Boss",
        "desc": "<p>To see your boss in your dream represents the bossy or authoritative side of your own personality. Your boss may reveal self-confidence and the assertive aspect of yourself. It is telling of your issues of control and authority. Alternatively, to see your boss in your dream may indicate your over-involvement or obsession with your work. Negatively, the boss in your dream may symbolize your limitations and lack of freedom\/originality.<\/p><p>Dreaming that you are in trouble with your boss is a reminder that there is higher power that you will need to answer to.<\/p><p>To dream that you are afraid of your boss indicates your fear of authority. You may feel that someone else is running your life or dictating what you can and can not do.<\/p><p>To dream that you are having sex with your boss signifies your desires for authority and control. You are feeling empowered.<\/p><p>If you are a boss in your waking life, then dreaming that you are the boss means that you need to better assert your authority. Alternatively, dreaming of being the boss is just a reflection of how you identify yourself. If you are not a boss in your waking life, but dream that you are, then it means that you need to be in control of your destiny. It is time to take charge.<\/p><p>Consider also the relationship you have with your boss. This may provide clues to work-related stress or issues that need to be resolved.<\/p>"
    },
    {
        "title": "Botox",
        "desc": "<p>To dream that you are getting botox injections suggests that you are trying to hide emotions or worries about a situation. More directly, the dream is about your concerns about aging and growing old.<\/p>"
    },
    {
        "title": "Bottle",
        "desc": "<p>To see a bottle in your dream indicates that you are pushing your feelings back inside, rather than expressing them. The content inside the bottle represents the nature of the emotions that you are experiencing. A bottle of champagne shows your need to socialize, while a bottle of poison signifies evil thoughts and a bottle of wine symbolizes sexuality.<\/p><p>To see an empty bottle denotes that you have exhausted your inner resources. You may be feeling drained and empty inside.<\/p>"
    },
    {
        "title": "Bottle Brush",
        "desc": "<p>To see or use a bottle brush in your dream refers to an emotional cleansing. You need to express your emotions instead of keeping it bottled up.<\/p>"
    },
    {
        "title": "Bougainvillea",
        "desc": "<p>To see bougainvilleas in your dream indicate protection.<\/p>"
    },
    {
        "title": "Boulder",
        "desc": "<p>To see a boulder in your dream symbolizes a major obstacle and problem in some component of your life.<\/p>"
    },
    {
        "title": "Bounce House",
        "desc": "<p>To see or play in a bounce house in your dream indicates a lack of stability in your life. You are also lacking focus in your life.<\/p>"
    },
    {
        "title": "Bouncer",
        "desc": "<p>To see a bouncer in your dream means that you are suppressing your desires.<\/p>"
    },
    {
        "title": "Bound",
        "desc": "<p>To dream that you are bound or tied up represents your need to be free from some relationship or situation. According to Freud, this dream may be an indication of repressed sexual fantasy.<\/p>"
    },
    {
        "title": "Boundary",
        "desc": "<p>To see a boundary in your dream indicates that something is restricting your growth and hindering your goals. You are being limited.<\/p>"
    },
    {
        "title": "Bounty Hunter",
        "desc": "<p>To dream that you are a bounty hunter is analogous to the pursuit of your goals. You are determined once you set your sight on a path. Alternatively, the dream may comment on how you are motivated by money. As a result, you may be feeling an emotional void in some area of your life.<\/p>"
    },
    {
        "title": "Bouquet",
        "desc": "<p>To dream that you receive or give a floral bouquet signifies respect, affection, approval, graciousness, admiration, and love. It is indicative of some healing energy. Consider the flowers and their colors in your bouquet for additional significance.<\/p>"
    },
    {
        "title": "Boutonniere",
        "desc": "<p>To see or wear a boutonniere in your dream represents some special occasion. You need to be on your best behavior. Alternatively, the dream means that you want others to see you in a different way.<\/p>"
    },
    {
        "title": "Bow",
        "desc": "<p>To see or tie a bow in your dream symbolizes femininity. Alternatively, the bow can stand for a social cause. Consider the color the bow for additional significance.<\/p><p>To see an archer's bow in your dream refers to the pursuit and accomplishment of your goals.<\/p>"
    },
    {
        "title": "w And Arrow",
        "desc": "<p>To see a bow and arrow in your dream represents a combination of female and male energies. It may refer to your libido or some sexual energy\/desire. Alternatively, it symbolizes anger, aggression, or tension. This dream symbol may also be a metaphor that you are aiming for perfection.<\/p>"
    },
    {
        "title": "Bowel Movement",
        "desc": "<p>To dream that you have a bowel movement signifies that you are successfully getting rid of your old habits\/ways and thinking patterns. It is usually analogous to the release of strong emotions, such as anger or hatred.<\/p><p>To dream that you have a bowel movement in a public place suggests that you are expressing regret about something that you said. You may have spoken your mind a little too loudly.<\/p><p>*See: <a href=\"#constipation\">Constipation<\/a> or <a href=\"#diarrhea\">Diarrhea<\/a>.<\/p>"
    },
    {
        "title": "Bowing",
        "desc": "<p>To dream that you are bowing symbolizes respect, honor, humility, and reverence. You are acknowledging a greater and higher power. Or perhaps you need to be more submissive to another's wishes.<\/p>"
    },
    {
        "title": "Bowl",
        "desc": "<p>To see a bowl in your dream symbolizes the womb and sense of security. Consider the condition of the bowl and how it is treated or handled in the dream. This may offer clues as to how you feel you are being treated in a particular relationship.<\/p>"
    },
    {
        "title": "Bowling",
        "desc": "<p>To dream that you are bowling represents the strikes, hits, and misses in your life. If you are bowling a bad game, then you may be expressing some regrets. If you are bowling strike after strike, then it suggests that you are on your way toward a successful future. The dream may also be a pun on your striking performance and\/or stellar ability.<\/p><p>To dream that you bowl a gutter ball suggests that you are stuck in a rut and need to make some changes of where your life is headed.<\/p><p>Alternatively, bowling and bowling alleys may also be a metaphor for sexual conquest. Consider the sexual innuendos that are at play in the bowling alley. The pins and bowling balls can be viewed as masculine symbols. The pin deck is symbolic of the womb or vagina (as is with any dark receptacle like caves, bowls, containers, etc.).<\/p>"
    },
    {
        "title": "Bowling Pin",
        "desc": "<p>To see a bowling pin in your dream symbolizes an issue that you are trying to address or knock down.<\/p>"
    },
    {
        "title": "Box",
        "desc": "<p>To see a box in your dream signifies your instinctual nature and destructive impulses. Alternatively, you may be trying to preserve and protect some aspect of yourself. The box may also symbolize your limitations and restrictions. Consider the pun of &quot;being boxed in&quot;.<\/p><p>To dream that you are opening a box indicates an aspect of yourself that was once hidden is now being revealed. It symbolizes self discovery. Consider your feelings as you open the box. If opening the box fills you with fear, then you may be uncovering aspects of yourself that cause you to feel anxious.<\/p>"
    },
    {
        "title": "Boxcar",
        "desc": "<p>To see a boxcar or a cable car in your dream signifies financial security.<\/p>"
    },
    {
        "title": "Boxing",
        "desc": "<p>Towatch boxing or dream that you are a boxer suggests that you are experiencing some internal struggle or conflict. The dream may also be a pun on &quot;boxing&quot; things up. It suggests that you are limiting yourself and your goals\/ideas. It may also indicate that you keep your emotions inside.<\/p>"
    },
    {
        "title": "Boxing Gloves",
        "desc": "<p>Tosee boxing gloves in your dream represents a difficult or even violent situation in which you are trying your best to succeed or overcome.<\/p>"
    },
    {
        "title": "Boy",
        "desc": "<p>If you are female and dream that you see or are a boy, then it indicates that you are developing the masculine aspects of character. Alternatively, it may represent your feelings about a real-life boy who is important and significant to you. You may have a crush on this boy and your waking thoughts of him has carried over into the dream world. Your motherly instincts may be taking over.<\/p><p>If you are an adult male and dream that you see or are a boy, then it suggests your playful, innocent, childlike nature. Alternatively, it can symbolize the immature aspects of yourself that still needs to grow. Your inner child may be trying to draw your attention to parts of yourself that you need to recognize and acknowledge.<\/p>"
    },
    {
        "title": "y Band",
        "desc": "<p>To dream that you are in a boy band indicates that you have a specific role to fill or an image to uphold. Alternatively, being in a boy band means that you have something to contribute or offer Also consider the group name of the specific boy band in your dream and how it can be applied as some subconscious advice. More directly, the dream may just be your infatuation with a particular boy band.<\/p>"
    },
    {
        "title": "Boy Scout",
        "desc": "<p>Your own experience as a boy scout will definitely affect this dream symbol. If you were never a boy scout and dream that you are, then it signifies your commitment and discipline toward some task. The dream may emphasize a sense of community, belonging, and helpfulness.<\/p><p>To see a boy scout in your dream denotes that you or someone else has displayed exemplary behavior. You will gain the ranks necessary to achieve your goals and success.<\/p>"
    },
    {
        "title": "Boyfriend",
        "desc": "<p>To see your boyfriend in your dream represents your waking relationship with him and how you feel about him. If you dream that your boyfriend is walking away while you hang out with your friends, then the dream suggests that you are not spending enough time with your friends. You need time away from your boyfriend to spend with friends.<\/p><p>To dream that your boyfriend is deadindicates that something in your own Self that is no longer functional and is &quot;dead&quot;. You are not being allowed to fully express yourself. It is also symbolic of your own relationship with that person. Perhaps you need to let go of this relationship. Alternatively, your boyfriend's death may signal a new phase in your relationship. Perhaps you are getting engaged.<\/p><p>If your boyfriend is away and your dreams of him involve a lot of touching, then it signifies how much you are missing his presence and having him nearby. The dream is telling you not to take the day to day things for granted. Learn to cherish the smaller things in life.<\/p><p>Dreaming that your boyfriend is getting married to another person represents a significant change in the relationship. It may mean that the relationship is moving forward into a new stage or that you are rethinking the longevity of the relationship. Perhaps deep inside you know that he is not the one for you.<\/p><p>To dream that your boyfriend tells you that he is gay or that he doesn't love your anymore represents your own insecurities with the relationship. It may also mean that the relationship is moving to a new level to which you are expressing some anxiety and fears about the changing situation. You may feel left out it in his life or that you are unable to share in all his experiences. It boils down to trust and communication.<\/p><p>To dream that you have a new boyfriend different from the one you have in your waking life implies that your existing relationship has moved on to a higher level. The relationship has moved toward a more serious phase.<\/p><p>To dream that you are pretending to be someone's boyfriend implies that you are not ready to settle down into a committed relationship. You don't want to be tied down.<\/p>"
    },
    {
        "title": "Bra",
        "desc": "<p>To dream that you are wearing a bra signifies support and protection. Perhaps you need to have your spirits uplifted. Alternatively, it may represent your nurturing side and maternal feelings.<\/p><p>To dream that you are not wearing a bra indicates that you have no discipline or control. Alternative, it may reflect your sexual nature.<\/p>"
    },
    {
        "title": "Bracelet",
        "desc": "<p>To see or wear a bracelet in your dream refers to an expression of deep passion and fire. The dream also highlights your need to reach out to others. It is a sign that you need to rekindle old friendships and to call up an old friend that you haven't heard from in awhile.<\/p><p>To see a broken bracelet in your dream suggests that you tend to sacrifice your own comfort and happiness for others.<\/p><p>Dreaming that you are eating a bracelet implies that you are not getting the help that you need. If the bracelet was a gift from a specific person, then it means that you feel this person is out of reach. Perhaps you are not able to connect with this person on some level.<\/p>"
    },
    {
        "title": "Bracer",
        "desc": "<p>To wear a bracer in your dream indicates that you are holding back in some area of your life instead of giving it your all. You are questioning your abilities.<\/p>"
    },
    {
        "title": "Braces",
        "desc": "<p>To dream that you have braces indicates your brashness and critics of others. You should not be so quick to criticize. You need to stop talking too much and listen to what others have to say. The dream may also be a pun on &quot;brace yourself&quot;.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/www.dreammoods.com\/commondreams\/teethdream3.htm\">Braces<\/a>&quot;<\/p>"
    },
    {
        "title": "Bragging",
        "desc": "<p>To dream that you are bragging indicates that you are feeling insecure about yourself. You are trying to overcompensate for your shortcomings.<\/p>"
    },
    {
        "title": "Braids",
        "desc": "<p>To dream that your hair is in braids represents your neat and orderly way of thinking. It symbolizes your determination and strong mindset.<\/p>"
    },
    {
        "title": "Braille",
        "desc": "<p>To read Braille in your dream suggests that you are trying to express yourself without words. Perhaps the dream means that you need to learn to better verbalize your thoughts and express your emotions.<\/p>"
    },
    {
        "title": "Brain",
        "desc": "<p>To dream of your brain suggests that you are under severe intellectual stress. You need to put your problem-solving abilities to use. Alternatively, it implies that your ideas are not receiving enough attention and validation. You are concerned that your knowledge and teachings are not be transmitted clearly.<\/p><p>To dream that you are undergoing brain surgery indicates that you need to rethink some important issue. You need to change your way of thinking and put aside any misconceived notions you have.<\/p>"
    },
    {
        "title": "Brain Surgery",
        "desc": "<p>*Please See: <a href=\"#Lobotomy\">Lobotomy<\/a>.<\/p>"
    },
    {
        "title": "Brainwash",
        "desc": "<p>To dream that you are being brainwashed suggests that you need to think for yourself. Stand up for yourself and do not let others tell you what to do.<\/p>"
    },
    {
        "title": "Brakes",
        "desc": "<p>To dream that you are applying your brakes signifies that you should slow down in your business and\/or personal affairs. You have been living on the fast lane and you need to take it easy. Alternatively, the dream may be a pun on &quot;break&quot;. Perhaps you need to take a break or perhaps you need to break off some relationship.<\/p><p>To dream that your brakes fail or that you can't reach the brakes forewarns that you lack stability in your life. Now is not the time to take risks. Your life is out of control and you need to make some significant changes. It may also not a bad idea to check out the brakes in your car, as you mind might have picked up subtle cues and is manifesting the problem in your dream.<\/p>"
    },
    {
        "title": "Bramble",
        "desc": "<p>To see or be entangled in bramble indicates that you are feeling trapped in a relationship or emotionally.<\/p>"
    },
    {
        "title": "Branches",
        "desc": "<p>To see branches in your dream symbolize good luck, growth, and new life. Alternatively, branches represent the relationships and communication between you and your family or relatives.<\/p><p>To see broken branches in your dream represents a personal or work-related problem.<\/p><p>To dream that a branch snaps indicates that you are under tremendous stress. Alternatively, the dream means that you are feeling emotionally insecure.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=treedream1\">Scissors In The Forest<\/a>&quot;<\/p>"
    },
    {
        "title": "Branded",
        "desc": "<p>To dream that you are getting branded means that you are being typecast or wrongfully labeled. Alternatively, it implies that you need to be more yielding in some area of your life. If you are willingly getting branded, then it means that you are being too submissive.<\/p>"
    },
    {
        "title": "Brandy",
        "desc": "<p>To drink brandy in your dream symbolizes your preoccupation with material gains and money. You need to remember that there are more important things in life.<\/p>"
    },
    {
        "title": "Brass",
        "desc": "<p>To see brass in your dream indicates deception, falsehood and deceitfulness. It may also refer to your boldness.<\/p><p>To dream that you are polishing brass suggests that you need to smooth out the rough edges of your personality.<\/p>"
    },
    {
        "title": "Bravery",
        "desc": "<p>*Please See: <a href=\"#courage\">Courage<\/a>.<\/p>"
    },
    {
        "title": "Bread",
        "desc": "<p>To see bread in your dream represents the basic needs of life. Bread may signify the positive qualities and great things you have learned on your journey of life. Alternatively, it suggests that you need to rise above the situation or rise for the occasion.<\/p>"
    },
    {
        "title": "Break",
        "desc": "<p>To dream that you break something indicates that changes are ahead for you. You need to &quot;break&quot; away from some situation and change the direction that your life is headed in. Alternatively, to break something suggests that you need to take things slower as in &quot;take a break&quot;. Or the dream may be a pun on being broke. Are money matters weighing on your mind?<\/p><p>To dream that objects around you are breaking suggests that you are under tremendous stress. The dream could be a metaphor that you are literally at your breaking point.<\/p>"
    },
    {
        "title": "Break-In",
        "desc": "<p>To dream that someone is trying to break into your house indicates that some subconscious material is attempting to make itself known. You are in denial about some aspects of yourself. Alternatively, the dream may be about a current relationship or situation that is making you uncomfortable. You feel that you are losing your own identity or space.<\/p><p>Dreaming that you are breaking into someone's house suggests that you are looking for answers. It is also symbolic of self-exploration and expansion of the mind. Alternatively, the dream implies that you are ashamed about something.<\/p><p>If the birds are trying to break into your house, then it implies that you are not following your desired path in life. Others are meddling in your life and interfering with your life path.<\/p><p>To dream that someone is breaking into your car suggests that your plans are not working out how you have planned.<\/p>"
    },
    {
        "title": "Break-Up",
        "desc": "<p>To dream that you break up with your significant other indicates that there is something in your life that you need to let go no matter how hard it may be.<\/p><p>To dream that your boyfriend or girlfriend is breaking up with you indicates that your relationship is moving to the next level. In a way, it is an end to something; you are leaving some past behind. At the same time, it is the start of something new or better. It is important to remember that such a dream is not an omen that the relationship is not working out. As a relationship evolves and grows, it also changes.<\/p><p>To dream that you did not break up with your boyfriend or girlfriend suggests that you are still in denial about the break-up. Your mind many not have accepted the notion that the relationship is over.<\/p>"
    },
    {
        "title": "Breakdancing",
        "desc": "<p>To dream that you are breakdancing suggests that you are deliberate and controlled in your actions.<\/p><p>To see someone breaking means that you need to be more flexible in your thinking.<\/p>"
    },
    {
        "title": "Breakdown",
        "desc": "<p>To dream that your vehicle breaks down suggests that you may be pushing yourself too hard and going beyond your limits. You are in danger of driving yourself toward physical difficulties, hardships, and even illness. You need to take better care of yourself or reevaluate your choices and alternatives.<\/p>"
    },
    {
        "title": "Breakfast",
        "desc": "<p>To dream about breakfast indicates the start of a new project or the beginning of a new stage in your life. Alternatively, your mind may already be thinking ahead on what to make for breakfast in the morning. It is not uncommon for your fleeting thoughts to be incorporated into your dream.<\/p>"
    },
    {
        "title": "Breast Feeding",
        "desc": "<p>To dream that you are breast feeding or nursing symbolizes tenderness, love, nurturance, and motherly love. Good things will be at your grasp. Alternatively, the dream suggests that you need to be careful in who you confide in.<\/p><p>To see someone breastfeeding indicates that you are nurturing a hidden aspect of yourself.<\/p><p>* Please See Also: <a href=\"#Lactating\">Lactating<\/a>.<\/p>"
    },
    {
        "title": "Breast Implants",
        "desc": "<p>To dream that you get or have breast implants refer to your body image issues. You are feeling insecure and self-conscious about the way you look. You are not measuring up to others. Alternatively, the dream is expressing your desires to be more sexual and\/or sensual. The dream may also reflect your subconscious desires for bigger boobs.<\/p>"
    },
    {
        "title": "Breast Pump",
        "desc": "<p>To see or use a breast pump in your dream refers to your ability to provide nurturance and give love.<\/p>"
    },
    {
        "title": "Breastplate",
        "desc": "<p>To see or wear a breastplate in your dream suggests that you are trying to protect yourself from love and heartbreak. You feel that you need to protect yourself emotionally.<\/p>"
    },
    {
        "title": "Breasts",
        "desc": "<p>To see breasts in your dream symbolize primal nourishment and your need to be nursed and care for. The breasts represent motherhood, nurturance, and infantile dependency. Alternatively, breasts indicate sexual arousal and raw energy.<\/p><p>Seeing naked breasts can also denote a feeling of exposure and invasion of privacy. In particular, for a woman, the dream may indicate anxieties about becoming a woman\/mother.<\/p><p>Dreaming that one of your breasts is missing implies that you are feeling undesirable. If your breasts are lopsided or one is bigger than the other, then it indicates of a lack of satisfaction or imbalance in your sex life. You feel that you are giving more than you are receiving.<\/p>"
    },
    {
        "title": "Breath",
        "desc": "<p>To dream that you are trying to catch your breath or that you are out of breath indicates that you are experiencing some anxiety, tension, or fear concerning a new situation in your waking life.<\/p><p>To dream that you have bad breath suggests that you are feeling enclosed or crowded in. Perhaps someone is invading your personal space.<\/p><p>To dream that you are holding your breath indicates your stubborn state of mind. Your views are too one-sided. The dream is telling you to be more open to the opinions of others.<\/p>"
    },
    {
        "title": "Breathe",
        "desc": "<p>To dream that you are breathing rapidly indicates that you are experiencing some anxiety, tension, or fear concerning a new situation in your waking life.<\/p><p>To dream that you are breathing underwater represents a retreat back into the womb. You want to return to a state where you were dependent and free from responsibilities. Perhaps you are feeling helpless, unable to fulfill your own needs and caring for yourself. Alternatively, you may be submerged in your own emotions.<\/p><p>To dream that you cannot breathe indicates that you are feeling exhausted. People who suffer from asthma often have dreams of not being able to breathe.<\/p><p>To dream that someone is breathing into your mouth suggests that you need to incorporate aspects of this person within your own self. If this person is no longer alive, then it means that he or she still lives within you.<\/p>"
    },
    {
        "title": "reathalyzer Test",
        "desc": "<p>To dream that you are being administered a breathalyzer test indicates that your misdeeds or bad behavior will catch up with you. The dream may be telling you to slow down.<\/p>"
    },
    {
        "title": "Breeze",
        "desc": "<p>To feel a breeze in your dream represents the movement of ideas and minor changes.<\/p>"
    },
    {
        "title": "Brew",
        "desc": "<p>To brew something in your dream suggests that patience, hard work, and tenacity will pay off in the long run. Hang in there and don't let life's difficulties or hurdles discourage you.<\/p>"
    },
    {
        "title": "ibery",
        "desc": "<p>To dream that you are being bribed suggests that you are easily influenced. Perhaps you are letting others persuade you into doing something you don't really want to. Gather your strength and stand up for yourself.<p>To dream that you are bribing someone indicates that you expect too much of others. You may be too demanding. In particular, if you dream that you are bribing a policeman, then you believe that you are above the law or rules. You think you can get away with being dishonest and deceitful."
    },
    {
        "title": "Brick",
        "desc": "<p>To see a brick in your dream represents your individual ideas and thoughts. Experience and\/or heartbreak may have hardened you.<\/p><p>To dream that you are building a brick wall signifies a wall that you are putting up to protect yourself against hurt. You are trying to isolate yourself. Alternatively, a brick may also indicate that you may be hard on the outside but still sensitive on the inside.<\/p>"
    },
    {
        "title": "Bride",
        "desc": "<p>To see a bride in your dream symbolizes a union or partnership. In particular, to see or dream that you are a runaway bride implies that you are not ready to commit to some important change or decision. You are not ready for the next phase of your life.<\/p><p>To dream that the bride is shot at her wedding suggests that a feminine aspect of yourself has come to an abrupt end.<\/p><p>If you are single and dream that you are a bride, then it represents your desires for marriage. Alternatively, it may represent the most feminine qualities about yourself. The dream may also symbolize purity and virginal qualities.<\/p>"
    },
    {
        "title": "Bridegroom",
        "desc": "<p>If you are female and see a bridegroom in your dream, then it represents your desire to be in a committed relationship or to be married. You are seeking for a partnership.<\/p>"
    },
    {
        "title": "Bridesmaid",
        "desc": "<p>To dream that you are a bridesmaid signifies a looming romance. Also consider the old adage &quot;always a bridesmaid, never a bride&quot;. You could be expressing your desire to be in a committed relationship.<\/p>"
    },
    {
        "title": "Bridge",
        "desc": "<p>To dream that you are crossing a bridge signifies an important decision or a critical junction in your life. This decision will prove to be a positive change filled with prosperity and wealth in the horizon. Bridges represent a transitional period in your life where you will be moving on to a new stage. If the bridge is over water, then it suggests that your transition will be an emotional one. If you fall off the bridge and into the water, then the dream indicates that you are letting your emotions hold you back and prevent you from moving forward. Alternatively, the bridge may indicate that you are trying to &quot;bridge&quot; or connect two things together.<\/p><p>To dream of a run-down bridge indicates that you should not contemplate any major changes in your life at this time.<\/p><p>To see a bridge collapse in your dream implies that you have let an important opportunity pass you by.<\/p><p>**See the Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bridgedream1\">God Is Dead<\/a>&quot;<\/p>"
    },
    {
        "title": "Bridle",
        "desc": "<p>To dream that you are being bridled indicates that you need to show some restraint and control, either physically, mentally or spiritually.<\/p><p>To see a bridle on a horse suggests that you are being manipulated in some waking situation.<\/p>"
    },
    {
        "title": "Briefcase",
        "desc": "<p>To see or carry a briefcase in your dream represents your level or preparedness in some situation or circumstance. It also refers to your concerns and worries about work and travel.<\/p>"
    },
    {
        "title": "Bright",
        "desc": "<p>To dream that something is bright represents divinity, a higher consciousness, and spirituality. You need to show your honor toward an important person or situation. The dream may also be a metaphor for intellect and someone who is smart. If your dream is particularly bright and vivid, then it could indicate a prophetic or epic dream.<\/p><p>If the brightness is blinding, then it suggests that you are not paying attention to some new insights.<\/p>"
    },
    {
        "title": "Brimstone",
        "desc": "<p>To see brimstone in your dream implies that you are being punished. It is also symbolic of destruction, loss and\/or suffering. Alternatively, dreaming of brimstone means that you need to listen to both your intuition and rational voice.<\/p>"
    },
    {
        "title": "Broadcast",
        "desc": "<p>To dream that you are in a broadcast indicates your desire to have your voice heard and get your message out there. You need to be more expressive.<\/p>"
    },
    {
        "title": "Broccoli",
        "desc": "<p>To see or eat broccoli in your dream suggests that you are in need of spiritual nourishment. Or it could just mean that you are lacking a particular nutrient. You need to eat a more well balanced diet. Alternatively, the dream indicates that you are putting up your defenses about a situation.<\/p>"
    },
    {
        "title": "Brochure",
        "desc": "<p>To see or read a brochure in your dream represents your open mindedness and your willingness to hear dissenting views, especially from those who disagree with you.<\/p>"
    },
    {
        "title": "Bronchitis",
        "desc": "<p>To dream that you have bronchitis represents the obstacles that you need to overcome. You need to stay the course and remain steadfast. The dream may possibly forewarn of a future illness.<\/p>"
    },
    {
        "title": "Bronze",
        "desc": "<p>To see bronze in your dream suggests that you need to provide more care and protection to something. You need to take better care of your health.<\/p>"
    },
    {
        "title": "Brooch",
        "desc": "<p>To see or wear a brooch in your dream represents an aspect of yourself that you are trying to express. There is a personal message or announcement that you need to convey.<\/p>"
    },
    {
        "title": "Brook",
        "desc": "<p>*Please See: <a href=\"#Stream\">Stream<\/a>.<\/p>"
    },
    {
        "title": "Broom",
        "desc": "<p>To see a broom in your dream denotes that it is time to clean up your act and resolve your past issues. You need to discard what is no longer useful to you. Alternatively, brooms symbolize domesticity and the establishment of a household. Perhaps it is time to settle down. Also, brooms are sometimes associated with witches and thus broomsticks may refer to the female shadow aspect of yourself.<\/p>"
    },
    {
        "title": "Brothel",
        "desc": "<p>To dream that you are in a brothel indicates dissatisfaction and deprivation in your emotional or sexual relationship. Your physical urges need attention.<\/p>"
    },
    {
        "title": "Brother",
        "desc": "<p>To see your brother in your dream symbolizes some aspect of your relationship with him. It can also serve to remind you that someone in your waking life has certain characteristics or behaviors similar to your brother.<\/p><p>If you do not have a brother and dream that you have one, then he may symbolize characteristics that you need to acknowledge within yourself. The brother in your dream can also be synonymous with a close friend or buddy. Brother also has religious implications and thus represents spiritual issues. Consider also the familiar phrase &quot;big brother is watching you&quot; which indicate that your dream has to deal with issues of authority and oppression.<\/p><p>To dream that you are mad or angry at your brother signifies repressed anger that you are feeling but afraid to express in your waking life.<\/p>"
    },
    {
        "title": "Brother-In-Law",
        "desc": "<p>To see your brother-in-law in your dream represents characteristics in him that you find within your own self. Consider also your waking relationship with your brother-in-law. If you dream that you are arguing with your brother-in-law, then it suggests that you are refusing to acknowledge or accept certain of his qualities.<\/p><p>To see your brother-in-law with his arm in a sling in your dream implies that he is being unhelpful or unproductive. If he is wearing a suit, then it means that you are underestimating his abilities.<\/p>"
    },
    {
        "title": "Brownies",
        "desc": "<p>To see or eat brownies in your dream symbolizes self indulgence. You feel that you are deserving of a small gift and are treating yourself to a little sweet reward.<\/p><p>To dream that you are baking brownies represents your sweetness and consideration of other people.<\/p>"
    },
    {
        "title": "Bruce Lee",
        "desc": "<p>To see Bruce Lee in your dream points to a negative force that you need to fight off. You have enemies who are working against you. Alternatively, dreaming about Bruce Lee may be a symbol of inspiration. Sometimes you need to break out of the pattern or even bend the rules in order to maximize your potential.<\/p>"
    },
    {
        "title": "Bruise",
        "desc": "<p>To dream that you have a bruise represents stress and mounting pressure that you are dealing with in your waking life. It may also refer to a reawakening of old, family wounds that have not been properly addressed. Alternatively, the dream is telling you that you need to accept the consequences of your actions. Consider the symbolism of the specific part of your body that is bruised.<\/p>"
    },
    {
        "title": "Brunette",
        "desc": "<p>To see or dream that you are a brunette indicates that you need to be more down to earth. It may also be symbolic of your sultriness and smoldering sexuality.<\/p>"
    },
    {
        "title": "Brush",
        "desc": "<p>To see a brush in your dream symbolizes your desire to &quot;brush&quot; away problems or something in your life that needs to be cleaned up. Perhaps you are taking a nonchalant attitude to circumstances that need serious consideration.<\/p><p>If you lose or can't find your brush, then it suggests that you are unable to sort out your problems.<\/p><p>To dream that you are brushing your hair suggests your need to organize and sort your thoughts. You need to search for some elements that are not clear. Brushing you hair may also highlight your preoccupation with appearances and beauty over substance and quality.<\/p><p>Dreaming of brushing your teeth suggests that you are feeling defensive about any criticism directed towards you. You are putting up a shield or barrier to protect yourself from potential hurt. Alternatively, the dream means that you are preoccupied with your appearance and are worried about how others perceive you.<\/p><p>To dream that you don't want to brush your teeth implies that you tend to speak your mind even if it may offend others.<\/p>"
    },
    {
        "title": "Brutality",
        "desc": "<p>To dream that you are being brutalized suggests that you need to confront your fears in order to progress forward. The dream may also symbolize animalistic passion.<\/p>"
    },
    {
        "title": "Bubble",
        "desc": "<p>To see bubbles in your dream represent merriment, fun, and childhood joys. It may also symbolize wishes or unrealistic expectations. In deciphering this dream symbol, consider also the phrase of having your bubble burst and the resulting disappointment.<\/p>"
    },
    {
        "title": "Bubble Bath",
        "desc": "<p>To dream that you or someone is taking a bubble bath represents ultimate relaxation. You have rid yourself of your worries\/difficulties and release all the negative emotions you have been keeping inside.<\/p>"
    },
    {
        "title": "Bubble Wrap",
        "desc": "<p>To see or use bubble wrap in your dream indicates that there is a problem that you need to be cautious in the way you handle it. Alternatively, the dream suggests that you are looking to shield yourself from some emotional hurt.<\/p><p>To dream that you are popping the bubble in the bubble wrap represents your satisfaction with the way your life is going. You have an effective outlet to release stress.<\/p>"
    },
    {
        "title": "Bubblegum",
        "desc": "<p>To chew bubblegum in your dream represents your overly carefree attitude. You need to take life a little more seriously.<\/p><p>*Please See Also: <a href=\"#Gum\">Gum<\/a>.<\/p>"
    },
    {
        "title": "Buck",
        "desc": "<p>To see a male deer or buck in your dream represents alertness, virility, masculine sexuality and assertiveness. If the two bucks are fighting, then it signifies male aggression. You are trying to dominate or take control over some area of your life. Alternatively, the dream may be a pun on a dollar.<\/p><p>*Please See Also: <a href=\"#Deer\">Deer<\/a>.<\/p>"
    },
    {
        "title": "Bucket",
        "desc": "<p>To see or carry a bucket in your dream indicates an improvement in your current situation. If the bucket is filled, then it signifies abundance, love and wealth. If the bucket is empty, then it signifies that you will overcome some loss or conflict.<\/p>"
    },
    {
        "title": "Buckle",
        "desc": "<p>To dream that you are fastening a buckle represents your acceptance of certain responsibilities. The dream may also be a pun to on &quot;buckling&quot; under the pressure. A fancy or expensive looking buckle symbolizes status and honor.<\/p>"
    },
    {
        "title": "Bud",
        "desc": "<p>To see a flower bud in your dream symbolizes great potential and the beginning of new experiences or relationships. A project that you have been working on may be finally taking off. Alternatively, the dream may be a metaphor for a &quot;buddy&quot;.<\/p>"
    },
    {
        "title": "Buddha",
        "desc": "<p>To see Buddha in your dream symbolizes wisdom, insight, compassion, and inner spirituality. You need to find calmness and peace within your own Self.<\/p>"
    },
    {
        "title": "Budgie",
        "desc": "<p>*Please See: <a href=\"#Parakeets\">Parakeets<\/a>.<\/p>"
    },
    {
        "title": "Budget",
        "desc": "<p>To dream that you are making a budget, indicates that you need to focus on your financial situation. You are experiencing concerns over money matters. Alternatively, the dream may be a metaphor for your emotions and thus means that you need to spread your love more evenly.<\/p>"
    },
    {
        "title": "Buffalo",
        "desc": "<p>To see a buffalo in your dream symbolizes survival, strength, and power. The dream may also warn that you are deviating from your life path and goals. Alternatively, the dream represents your heritage and your roots. In particular, if you see a white buffalo in your dream, then it means that your desires or wishes will be fulfilled.<\/p><p>To see an injured or killed buffalo forewarns that you need to carefully think through any new ventures and projects that you are undertaking.<\/p><p>To see a herd of buffalo in your dream signifies tranquility and plentitude.<\/p>"
    },
    {
        "title": "Buffet",
        "desc": "<p>To eat too much food at a buffet in your dream indicates that some relationship is consuming your energies. Alternatively, it suggests that you are trying to work through some guilt.<\/p>"
    },
    {
        "title": "Bug",
        "desc": "<p>To see a bug in your dream suggests that you are worried about something. It is symbolic of your anxieties and\/or fears. What is bugging you? Consider also the popular phrase &quot;bitten by the bug&quot; to imply your strong emotional ties or involvement to some activity\/interest\/hobby. Alternatively, the bug may be representative of your sexual thoughts.<\/p><p>To dream that there are endless amount of bugs coming out of your hair suggests that something is weighing on your mind that you are confused about. Perhaps you are making a big deal out of minor matter. Alternatively, the dream refers to concerns over your public image.<\/p><p>Dreaming that there are bugs coming out of your ear suggests that you have overheard something that you shouldn't have. Alternatively, bugs in your ear represent rumors.<\/p><p>Dreaming that there are bugs under your skin implies that you are feeling extremely uncomfortable about a certain situation. Something is making your skin crawl.<\/p>"
    },
    {
        "title": "Buggy",
        "desc": "<p>*Please See: <a href=\"#Carriage\">Carriage<\/a>.<\/p>"
    },
    {
        "title": "Bugle",
        "desc": "<p>To see or hear a bugle in your dream represents some sort of warning. It signals an end to something and the beginning of another. Alternately, hearing a bugle symbolizes remembrance, mourning and solemnity.<\/p>"
    },
    {
        "title": "Bugs Bunny",
        "desc": "<p>To see Bugs Bunny in your dream represents your fast thinking and quick wittedness. You will overcome your obstacles. The dream may be a way of asking you &quot;What's up, doc?&quot;<\/p>"
    },
    {
        "title": "Building",
        "desc": "<p>To see a building in your dream represents the self and the body. How high you are in the building indicates a rising level of understanding, awareness or success. If you are in the lower levels of the building, then it refers to more primal attitudes and\/or sexuality.<\/p><p>To see a building in ruins or damaged indicates that your approach toward a situation or relationship is all wrong. You need to change. Your own self-image may have suffered and taken some blow.<\/p><p>To dream that a building collapses indicates that you are losing sight of your ambitions and goals. Your pursuit for material gains is failing.<\/p><p>To dream that you or someone fall off a building suggests that you are descending into the realm of subconscious. You are learning about and acknowledging aspects of your subconscious. Alternatively, it symbolizes your fear of not being able to complete or succeeding in a task.<\/p><p>To dream that you are scaling or climbing a building indicates that you are getting carried away by your ambitions.<\/p><p>See also: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/falling.htm\">Falling<\/a> in our Common Dream Themes section.<\/p>"
    },
    {
        "title": "Bulb",
        "desc": "<p>To see a plant bulb in your dream represents your spiritual, physical, and intellectual potential. It refers to the growth of some project, relationship, or situation. Alternatively, it symbolizes your genetic heritage, family tradition or fertility.<\/p><p>*Please see Also: <a href=\"#Light%20Bulb\">Light Bulb<\/a><\/p>"
    },
    {
        "title": "Bulimia",
        "desc": "<p>To dream that you have bulimia represents your lack of self-acceptance, self-esteem and your quest for perfection. You feel alone and cut off from others. Learn to love yourself and accept who you are instead of punishing yourself. The dream symbolizes your quest for perfection.<\/p>"
    },
    {
        "title": "Bull",
        "desc": "<p>To see a bull in your dream symbolizes stubbornness, strong will, strength, and power. The dream may be telling you that it is time to take a stand and be more assertive. Alternatively, the bull indicates a rich, prosperous, and abundant life. Consider also the metaphor, &quot;being bull-headed&quot;. You need to learn to compromise in a situation. Or it could be a pun on something that is &quot;bull&quot;, as in crap or worthless.<\/p><p>Bulls are also symbolic of repressed sexual energies, fertility and virility. To see an untamed raging bull represents that your passions may be out of control. The bull may also represent a person in your life who is born under the Taurus sign.<\/p><p>To dream that you are bathing in bull's blood represents immortality and eternal life.<\/p><p>To dream that you are being chased by a black bullimplies that you are refusing to acknowledge your own stubbornness.<\/p><p>*Please See Also: <a href=\"#Steer\">Steer<\/a>.<\/p>"
    },
    {
        "title": "Bull's Eye",
        "desc": "<p>To see a bull's eye in your dream represents your search for perfection. It may also mean that you will achieve the goals you have set for yourself.<\/p>"
    },
    {
        "title": "Bulldog",
        "desc": "<p>To see a bulldog in your dream signifies that some protective force is helping you move forward in life.<\/p>"
    },
    {
        "title": "Bulldozer",
        "desc": "<p>To see a bulldozer in your dream suggests that you are feeling pushed away from what you want. Or that you are being diverted away from the path toward your goals. You may be feeling helpless and bullied. Alternatively, it suggests that you need to organize and clear away the clutter in your life.<\/p>"
    },
    {
        "title": "Bulletin Board",
        "desc": "<p>To see a bulletin board in your dream points to a message that you need to pay attention to from your subconscious. Alternatively, a bulletin board is representative of your achievements.<\/p>"
    },
    {
        "title": "Bullets",
        "desc": "<p>To see a bullet or bullets in your dream indicate anger and aggression directed at you or someone else. You need to be cautious on what you say and do. Your actions and words may easily be misinterpreted. Alternatively, the dream may be telling you that you need to &quot;bite the bullet&quot; and accept some difficult situation.<\/p><p>To dream of being hit by a bullet suggests that you need to persevere and endure the difficult times.<\/p>"
    },
    {
        "title": "Bulletproof Vest",
        "desc": "<p>To wear a bulletproof vest in your dream suggests that you are a overprotecting yourself from emotional hurt. You don't want to get hurt from a personal relationship again.<\/p>"
    },
    {
        "title": "Bullfight",
        "desc": "<p>To dream that you are watching a bullfight symbolizes the struggle between your animalistic desire and your spiritual side.<\/p><p>To dream that two bulls are fighting represent an imbalance in some area of your life.<\/p>"
    },
    {
        "title": "Bullhorn",
        "desc": "<p>*Please See: <a href=\"#Megaphone\">Megaphone<\/a>.<\/p>"
    },
    {
        "title": "Bully",
        "desc": "<p>To dream that you are a bully indicates your tendency to dominate a conversation relationship or situation. You have difficulties in recognizing your weaknesses and asking for help when you need it.<\/p><p>To see a bully or be bullied in your dream signifies repressed rage. The bully may be seen as your shadow Self which you have rejected.<\/p>"
    },
    {
        "title": "Bum",
        "desc": "<p>To dream that you are a bum indicates that you are feeling like failure or an outcast. You are losing control of a situation in your life.<\/p><p>To see a bum in your dream signifies laziness. You need to take more initiative.<\/p>"
    },
    {
        "title": "Bumblebee",
        "desc": "<p>To see a bumblebee in your dream is symbolic of distress and coming problems.<\/p>"
    },
    {
        "title": "Bumper",
        "desc": "<p>To dream that your bumper has been damagedsymbolizes the small &quot;bumps&quot; that you will encounter in life. Things will not always go as smooth as you expect.<\/p>"
    },
    {
        "title": "Bumper Car",
        "desc": "<p>To dream that you are riding in a bumper car represents your resilience. You are able to bounce back from adversity. Alternatively, the dream suggests that you are going nowhere with your life.<\/p>"
    },
    {
        "title": "Bumper Sticker",
        "desc": "<p>To see a bumper sticker in your dream represents a message that you are trying to convey to the world. You want your opinion to be heard. Consider the exact message on the bumper sticker.<\/p>"
    },
    {
        "title": "Bungee Jumping",
        "desc": "<p>To dream that you are bungee jumping represents your ability to bounce back from adversities and setbacks in your life. The important thing to remember is that you took the initial risk.<\/p>"
    },
    {
        "title": "Bunk Beds",
        "desc": "<p>To see bunk beds in your dream represent childhood and innocence. Alternatively, it may refer to diverging and conflicting views of sexuality. You may have difficulties expressing your needs and desires.<\/p>"
    },
    {
        "title": "Bunker",
        "desc": "<p>To dream that you are inside a bunker indicates that you are not confronting your anger issues. Instead you are on guard about your feelings and are keeping them from coming to the surface. You are afraid of getting hurt.<\/p>"
    },
    {
        "title": "Bunny",
        "desc": "<p>To see a bunny in your dream represents the innocence and carefreeness of being a child. It also symbolic of the Easter holiday.<\/p><p>Dreaming of a bunny that is running away from you points to your lack of commitment. You are flighty and jump from situation to situation.<\/p><p>**Please See Also: <a href=\"#Rabbit\">Rabbit<\/a>.<\/p>"
    },
    {
        "title": "Bunsen Burner",
        "desc": "<p>To see or use a Bunsen burner in your dream suggests that you need to be more expressive and focus your energies on more fruitful or worthwhile endeavors. The dream may also be symbolic of a developing awareness, truth or enlightenment.<\/p>"
    },
    {
        "title": "Buoy",
        "desc": "<p>To see a buoy in your dream represents your ability to hold your head up even amidst your emotional distress. It may also indicate a renewed state of mind and emotional calm. Alternatively, it suggests that some of your repressed thoughts or subconscious material has come to the surface and is making itself known.<\/p>"
    },
    {
        "title": "Bureaucracy",
        "desc": "<p>To dream that you are dealing with bureaucracy signifies a lack of emotions and personal contact in some aspect of your life. Perhaps your relationship has gotten too routine or that you are doing things by rote.<\/p>"
    },
    {
        "title": "Burglar",
        "desc": "<p>To see or dream that you are a burglar indicates that your energy is being sucked away from you. You are feeling drained. It may also mean that your fears, guilt, and anxieties are making it hard for you to say no to others.<\/p>"
    },
    {
        "title": "Burglary",
        "desc": "<p>To dream that you have been burglarized indicates that you are feeling violated or that personal space has been invaded. You feel helpless in some situation or relationship. This could be due to a major change in your life. Give yourself some time to adjust to your new environment. The dream may also occur as a result of being burglarized in real life and a symptom of post traumatic stress.<\/p>"
    },
    {
        "title": "Burj Khalifia",
        "desc": "<p>To see the Burj Khalifia in your dream symbolizes the ultimate success. You are not settling for anything less than the best and always aim as high as you can. The dream also represents your drive and motivation. Alternatively, dreaming of the Burj Khalifia signifies a spiritual journey.<\/p>"
    },
    {
        "title": "Burial",
        "desc": "<p>To see a burial in your dream indicates that you have gotten rid of your bad habits and have freed yourself from a negative situation. You are finally letting go of something.<\/p><p>To dream that you are burying a living person signifies emotional turmoil. Alternatively, it suggests that you are being buried by problems and stresses of your waking life.<\/p><p>To dream that you are being buried alive suggests that you are being undermined or stifled in some way. You are feeling trapped or helpless.<\/p><p>* Please also see: <a href=\"#funeral\">Funeral<\/a>.<\/p>"
    },
    {
        "title": "Burlap",
        "desc": "<p>Tosee or wear burlap in your dream refers to your tough persona. You are not afraid of letting your opinion and feelings be known.<\/p>"
    },
    {
        "title": "Burning",
        "desc": "<p>To see something burning in your dream indicates that you are experiencing some intense emotions and\/or passionate sexual feelings. There is some situation or issue that you can no longer avoid and ignore. Alternatively, it may suggest that you need to take time off for yourself and relax. Perhaps you are you feeling &quot;burned out&quot; or &quot;burned up&quot;.<\/p><p>To dream that you or someone is being burned alive suggests that you are being consumed by your own ambition.<\/p><p>*Please see also: <a href=\"#Fire\">Fire<\/a>.<\/p>"
    },
    {
        "title": "Burp",
        "desc": "<p>To dream that you burp indicates that your subconscious is informing you that you are going through some changes. You are seeing things differently as you grow older and gain more experience.<\/p><p>To hear a burp in your dream signifies a breakthrough in your personal struggles. You have overcame barriers and resistance and are no longer being held back.<\/p>"
    },
    {
        "title": "Burqa",
        "desc": "<p>To dream that you are wearing a burqa suggests that are feeling sexually repressed. You feel that you are not able to fully express yourself and be who you are.<\/p><p>To see someone wearing a burqa indicates that something is being kept away from you. You are in the dark about some issue or matter.<\/p>"
    },
    {
        "title": "Burr",
        "desc": "<p>To see or dream that a burr is clinging to you symbolize a minor irritation or annoyance that you are choosing to overlook.<\/p><p>To dream that an animal is covered in burrs implies that someone in your life is afraid of showing their vulnerable side.<\/p>"
    },
    {
        "title": "Burrito",
        "desc": "<p>Tosee or eat a burrito in your dream symbolizes your efficiency in some matter.<\/p>"
    },
    {
        "title": "Burst",
        "desc": "<p>To dream that something bursts indicates that you are under a lot of pressure and stress.<\/p>"
    },
    {
        "title": "Bury",
        "desc": "<p>To dream that you bury something suggests that you are hiding your true feelings. Or you are trying to cover up some situation or act. In particular, if you are burying a body, then it suggests that you are trying to hide something that you find repulsive or that others may find unappealing.<\/p><p>To dream that you are burying a living person signifies emotional turmoil. Alternatively, it suggests that you are being buried by problems and stresses of your waking life.<\/p><p>To dream that you are being buried alive suggests that you are being undermined or stifled in some way. You are feeling trapped or helpless.<\/p><p>Dreaming that you are burying the bones of someone who is living means that there are secrets that this person knows about and you are trying to keep those secrets from coming out.<\/p>"
    },
    {
        "title": "Bus",
        "desc": "<p>To dream that you are waiting for a bus indicates a temporary setback in achieving your personal goals. If you miss the bus, then it indicates that an aspect of your life is out of control. You need to slow down and map out a new plan. If you get on the wrong bus, then the dream indicates your fears of making the wrong choice and going on the wrong path. You are conflicted between what you want and what others want for you.<\/p><p>To dream that you are riding a bus implies that you are going along with the crowd. You are lacking originality and control over where your life is taking.<\/p><p>If you see a bus pass by in your dream, then it implies that you are going against the crowd on some idea or decision. Alternatively, the dream may mean that you feel excluded or left behind.<\/p><p>Dreaming that you are driving a bus means that you are a group leader and a trend setter. If you are driving a stolen bus in your dream, then it means that you are taking drastic measures to get control of your destiny. You are refusing to go along with the system.<\/p><p>To dream that you are in a bus accident suggests that it is time for you to move away from a group setting and venture out on your own. You need to be more independent. Dreaming that a bus crashes into or through a building implies that your opinions and views are clashing with the majority.<\/p><p>To dream that you are paying a bus fare refers to the price you are paying in order to please others.<\/p><p>To dream that a bus is driven into water refers to an emotional journey that involves several people.<\/p>"
    },
    {
        "title": "Bus Driver",
        "desc": "<p>To see a bus driver in your dream indicates leadership in some group idea or plan. It is symbolic of collective power. Alternatively, it suggests that you are going around in circles and showing little progress.<\/p><p>To dream that you are a bus driver suggests that you are moving forward quickly. You need to show more patience and less force. In particular, if you are a school bus driver, then it signifies that through knowledge and learning you will advance rapidly in life. Your dream may be connected with a new learning situation.<\/p>"
    },
    {
        "title": "Bus Station",
        "desc": "<p>To dream that you are at the bus station suggests that you have reached some new level or stage in your emotional or physical life.<\/p><p>To dream that you failed to get to the bus station indicates that you are feeling helpless and trapped by some situation. You feel that you are being held back, either physically or mentally. Alternatively, the dream may also suggest that you are feeling disconnected in some aspect of your life - work, relationship or home life.<\/p>"
    },
    {
        "title": "Bus Stop",
        "desc": "<p>To dream that you are at a bus stop indicates that there is a decision that you need to make. You need to decide what you want to do with your future.<\/p>"
    },
    {
        "title": "Bush",
        "desc": "<p>To see a bush in your dream symbolizes feminine emotions and desires. It may also be a reference to the female genitalia.<\/p><p>To dream that you are hiding behind a bush suggests that you are keeping something a secret and are not being completely open. A literal interpretation indicates that you are seeking protection.<\/p><p>To see a flowering bush represent development and personal growth.<\/p>"
    },
    {
        "title": "Business",
        "desc": "<p>To dream about a business deal signifies issues and problems that you are dealing with in your waking life. Pay attention to how the business deal is going and your demeanor during the deal. Alternatively, the dream may be a metaphor for aspects of your own personality that you need to deal with. The dream may also be a pun on the &quot;busy-ness&quot; of your life. Perhaps the dream is telling you that you need to &quot;get down to business&quot; or that you need to put &quot;business before pleasure.&quot;<\/p>"
    },
    {
        "title": "Business Card",
        "desc": "<p>To dream that you are handing out your business card indicates that you need to make more connections and expand your network. in order to be successful, you need to reach out.<\/p>"
    },
    {
        "title": "Business Trip",
        "desc": "<p>To dream that you are on a business trip suggests that you having a difficult time trying to relax. You may be feeling overwhelmed.<\/p>"
    },
    {
        "title": "Businessperson",
        "desc": "<p>To see or dream that you are a businessperson represents the rational and organized aspect of yourself.<\/p>"
    },
    {
        "title": "Bustier",
        "desc": "<p>*Please See: <a href=\"#Bra\">Bra<\/a>.<\/p>"
    },
    {
        "title": "Butcher",
        "desc": "<p>To see a butcher in your dream represents your raw emotions or immoral behaviors. You may be testing the limits of your physical strength. The dream may be a metaphor that you are &quot;butchering&quot; or ruining some project or situation.<\/p><p>To dream that you are a butcher signifies pent up anger and hostility.<\/p>"
    },
    {
        "title": "Butler",
        "desc": "<p>To see a butler in your dream suggests that you are depending too much on others for their help. You need to be more independent and tend to your own needs. Alternatively, the dream may symbolize your desire for wealth or material possessions.<\/p><p>To dream that you are a butler represents your feelings of subservience. Perhaps you need to take on a more submissive role.<\/p>"
    },
    {
        "title": "Butter",
        "desc": "<p>To see or taste butter in your dream suggests that you are looking to be gratified in some area of your life. You need to indulge yourself in life's pleasure. The dream may be a metaphor that you need to &quot;butter&quot; up to someone, in order to ease the situation.<\/p><p>To dream that you are churning butter represents hard work and difficult task.<\/p><p>To dream that you are melting butter or that the butter has melted implies that you need to be soften your attitude and demeanor toward others.<\/p>"
    },
    {
        "title": "Knife",
        "desc": "<p>To see or use a butter knife in your dream signifies easiness and simplicity. Consider the phrase &quot;like a knife through butter.&quot;<\/p><p>To dream that you are using a butter knife to cut or slice something indicates that you are ineffectual in getting a task done. You are lacking some important knowledge or insight.<\/p>"
    },
    {
        "title": "Buttercup",
        "desc": "<p>To see buttercups in your dream refer to your childhood and past memories. The dream may be trying to take you back to a time where things were simpler and the pace was slower. Alternatively, buttercups signify humility.<\/p>"
    },
    {
        "title": "Butterfly",
        "desc": "<p>To see a butterfly in your dream signifies longevity, creativity, romance, joy and spirituality. You may be experiencing a new way of thinking. Or you are undergoing some sort of transformation. Alternatively, a butterfly refers to your need to settle down. You are lacking focus in your life. You tend to be flighty and jump from one thing to another. Also consider the term &quot;social butterfly&quot; to describe someone who is popular and outgoing. Perhaps you need to be more outgoing.<\/p><p>To see two butterflies in your dream represent romance and a long and happy marriage. If you see several butterflies in your dream, then it symbolizes acceptance, growth, inspiration, and freeness.<\/p><p>To catch or kill a butterfly suggests that you are being too superficial. Alternatively, the dream refers to your possessive nature. To see a dead butterfly in your dream refers to your unrealized goals.<\/p><p>To dream that you are mounting a butterfly on frame symbolizes sexual oppression.<\/p>"
    },
    {
        "title": "Buttocks",
        "desc": "<p>To see your buttocks in your dream represent your instincts and urges. The dream also indicates your feelings of insecurity and reveals your struggles with some situation.<\/p><p>To dream that your buttocks are misshaped suggest undeveloped or wounded aspects of your psyche.<\/p><p>To dream that someone is smelling or kissing your butt indicates that someone in your life is not being genuine about her or his intentions.<\/p>"
    },
    {
        "title": "Buttons",
        "desc": "<p>To see a button in your dream indicates wealth and security. Alternatively, the dream may also be a metaphor for being too &quot;buttoned up&quot; or refrained. You need to let loose and be yourself.<\/p><p>To dream that you are unbuttoning your clothes denotes that you are opening yourself to others, either on a mental, emotional, or sexual level.<\/p><p>To lose a button in your dream signifies your tarnished self-image. You are feeling insecure and unconfident about yourself.<\/p>"
    },
    {
        "title": "Buying",
        "desc": "<p>To dream that you or someone is buying something represents your acceptance of an idea, condition, or situation. Consider what item you are buying for additional analysis. Alternatively, the dream means that you are lacking something in your life and are looking for some form of fulfillment.<\/p><p>To buy a car in your dream refers to your commitment to some important life decision you have made.<\/p>"
    },
    {
        "title": "Buzzer",
        "desc": "<p>To hear a buzzer in your dream indicates that you are experiencing a conflict in a relationship or situation. You are questioning the decisions you have made. Perhaps you feel you made the wrong choice and are now expressing regret. Alternatively, there is something in your dream that needs your immediate attention.<\/p>"
    },
    {
        "title": "Buzzard",
        "desc": "<p>To see a buzzard in your dream symbolizes death and decay. It may represent an ugly aspect of yourself.<\/p>"
    }
]