[
    {
        "title": "C",
        "desc": "<p>To see the letter &quot;C&quot; in your dream symbolizes being average. It may also be a pun on &quot;seeing&quot;. The dream is drawing your attention to something"
    },
    {
        "title": "Cab",
        "desc": "<p>To dream that you are hailing a cab suggests that you need to ask for help in order to be able to move forward in some waking situation."
    },
    {
        "title": "To dream that you are in a cab indicates that you are being taken for a ride. Someone is taking advantage of you.",
        "desc": "<p>Cabana<\/p><p>To see or dream that you are in a cabana signifies your need for an escape or vacation. You may be feeling overwhelmed by a waking problem and need some downtime.<\/p>"
    },
    {
        "title": "Cabaret",
        "desc": "<p>To watch a cabaret in your dream indicates your need to acknowledge your sensual side.<\/p>"
    },
    {
        "title": "Cabbage",
        "desc": "<p>To see or eat cabbage in your dream suggests that you should not waste time with petty things in your life. You live and thrive on life's challenges. Alternatively, the dream refers to your unwise choices or decisions. You need to rethink some of your decisions.<\/p>"
    },
    {
        "title": "Cabin",
        "desc": "<p>To see or dream that you are in a wood cabin indicates that you will succeed via your own means. It suggests that you are self-reliant and independent, yet still remain humble. You prefer the simpler things in life.<\/p><p>To dream that you are in a ship cabin indicates that are seeking some refuge from your emotions.<\/p>"
    },
    {
        "title": "Cabinet",
        "desc": "<p>To see a cabinet in your dream symbolizes the female body and\/or the womb. Alternatively, you may be hiding some family or personal secret. Consider the contents and condition of the cabinet for more clues.<\/p><p>To dream that someone rearranged your cabinets suggests that somebody is overstepping your boundaries.<\/p>"
    },
    {
        "title": "Cable",
        "desc": "<p>To see a cable in your dream represents your stamina and durability. If the cable is frayed or broken, then it signifies a lack of strength.<\/p><p>To dream of cable television signifies your openness and how you communicate with others.<\/p>"
    },
    {
        "title": "Cable Car",
        "desc": "<p>To see or ride in a cable car in your dream signifies the compromises that you make in life. Sometimes you have to go along with the masses in order to maintain the peace. Alternatively, the dream represents life's journey. You are headed in the right direction.<\/p>"
    },
    {
        "title": "Caboose",
        "desc": "<p>To see or be in a caboose implies that you are last in line for something. You are feeling shortchanged. Alternatively, dreaming of a caboose serves as a reminder that you will eventually get to where you need. It is not always about being first or finishing first.<\/p>"
    },
    {
        "title": "Cackle",
        "desc": "<p>To hear the sound of cackling in your dream signifies illness and loss.<\/p>"
    },
    {
        "title": "Cactus",
        "desc": "<p>To see a cactus in your dream suggests that you are feeling invaded, that your space is being crowded into and that you are being suffocated. The prickly spines of the cactus represent the boundary you are trying to establish between your personal and private. Or you feel the need to defend yourself in some way. Alternatively, the dream implies that you have found yourself in a sticky situation. Perhaps you need to adapt to your existing circumstances instead of trying to change them.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s5.htm#Succulents\">Succulents.<\/p>"
    },
    {
        "title": "Cadaver",
        "desc": "<p>To dream that you are dissecting a cadaver indicates that you are ready to reveal or expose an aspect of yourself that you have been hiding.<\/p><p>To see a cadaver in your dream represents a part of yourself that has died. Alternatively, dreaming of a cadaver means that you tend to give everything you have in a situation or relationship.<\/p>"
    },
    {
        "title": "dillac",
        "desc": "<p>To see a Cadillac in your dream suggests that you are driven to succeed. Your ambition will take you far in life.<\/p>"
    },
    {
        "title": "Caduceus",
        "desc": "<p>To see a caduceus in your dream symbolizes health concerns. The dream may be telling you that you need to take better care of yourself.<\/p>"
    },
    {
        "title": "Caesarian Section",
        "desc": "<p>To dream that you are having a caesarian section implies that you need help in order to get your idea or project off the ground. You can not do it by yourself. A more direct interpretation of this dream may represent your anxieties of having a C-section in real life.<\/p>"
    },
    {
        "title": "Cafe",
        "desc": "<p>To dream that you are at a cafe represents your social life. The dream is telling you that it is time to call up old friends and catch up with what they are all up to.<\/p>"
    },
    {
        "title": "Cafeteria",
        "desc": "<p>To dream that you are in a cafeteria denotes that there may be a lot of issues &quot;eating&quot; you up inside.<\/p>"
    },
    {
        "title": "Cage",
        "desc": "<p>To dream that you are in a cage indicates that you are experiencing inhibitions and powerlessness in some areas of your life. You are feeling restricted, confined and restrained in a current relationship or business deal. Somebody may be keeping a short leash on you, where you are lacking the freedom to act independently.<\/p><p>To dream that you are putting a wild animal into a cage signifies that you will succeed in overcoming your rivals and fears. It is also symbolic of your ability to control you animalistic rages and anger.<\/p><p>To see a bird in a cage suggests that you are feeling limited in your expression and a sudden lost of freedom. You may be experiencing frustrations and an inhibited spirituality. The dream may also imply that you are feeling like a &quot;jail bird&quot;.<\/p>"
    },
    {
        "title": "Cage Fighting",
        "desc": "<p>To dream that you are cage fighting indicates that you are feeling restricted or confined in a current relationship. An aspect of yourself is fighting to be expressed or let out.<\/p><p>To watch a cage fight represents conflicting ideas or beliefs.<\/p>"
    },
    {
        "title": "Cake",
        "desc": "<p>To see a cake in your dream indicates that you need to learn to share and allocate your workload instead of trying to do everything yourself. Cakes also symbolize selfishness or the feeling of not getting your fair share. More positively, the dream may represent your accomplishments and achievements. Consider also the metaphor a &quot;piece of cake&quot; or some situation that is easy.<\/p><p>To see a partially eaten cake in your dream signifies missed and lost opportunities.<\/p><p>To dream that you are buying a cake suggests that you have accepted the rewards and recognition you are getting for our work. You are learning to be comfortable in the spotlight.<\/p>"
    },
    {
        "title": "Calamari",
        "desc": "<p>To dream that you are eating calamari indicates that you are feeling battered or beaten. However, you are tough. Hang in there!<\/p>"
    },
    {
        "title": "Calculator",
        "desc": "<p>To see a calculator in your dream suggests that you need to thoroughly think through some problem and carefully evaluate your choices. You need to lay out some sort of plan or outline. The symbol may also be a metaphor for someone who is &quot;calculating&quot;, cunning and scheming.<\/p>"
    },
    {
        "title": "Calendar",
        "desc": "<p>To see a calendar in your dream represents the passing of time and past events. The dream may also be a reminder of a special event, appointment or important date in your waking life.<\/p>"
    },
    {
        "title": "Calf",
        "desc": "<p>To see a calf in your dream symbolizes immaturity and inexperience. You need to develop certain qualities.<\/p>"
    },
    {
        "title": "California",
        "desc": "<p>Known as the Golden State, to dream of California, refers to your desire for instant wealth. It may also suggests that you are looking for fame. If you live in California, then the dream may just be a reflection of your reality.<\/p>"
    },
    {
        "title": "Caliper",
        "desc": "<p>To see or use a caliper in your dream reflects your concerns about not measuring up to the standards or expectations of others. Alternatively, dreaming of a caliper means that you need to be careful in making a decision or judgment.<\/p>"
    },
    {
        "title": "lla Lily",
        "desc": "<p>To see calla lilies in your dream symbolize new beginnings, rebirth and longevity. In particular, a white calla lily represents purity, simplicity or elegance. Alternatively, the calla lily refers to a commitment.<\/p>"
    },
    {
        "title": "Calling Card",
        "desc": "<p>To see or use a calling card in your dream indicates that there is someone that you need to reach out to. If the calling card has the name of someone you know on it, then it means that their presence is with your spiritually, even though they may not be with you physically. Something in your waking life is reminding you of this person.<\/p>"
    },
    {
        "title": "Calluses",
        "desc": "<p>To dream that you have calluses symbolize hard work. You have be laboring over a difficult task or situation.<\/p>"
    },
    {
        "title": "Calm",
        "desc": "<p>To dream that you are calm denotes a fulfilling life. You find contentment and satisfaction in what you have.<\/p><p>To dream that someone is trying to calm you down suggests that you will experience many setbacks, especially if you continue to let your emotions run out of control.<\/p>"
    },
    {
        "title": "Calomel",
        "desc": "<p>To see calomel in your dream indicates a rivalry.<\/p><p>To dream that you are taking calomel signifies that you are being manipulated and taken advantage of. It is time to open your eyes and not allow yourself to be stepped on.<\/p>"
    },
    {
        "title": "Calves",
        "desc": "<p>To see your calves in your dream symbolize movement and your ability to jump from situation to situation. In particular, if you are admiring your own calves, then it denotes a needy or codependent relationship.<\/p>"
    },
    {
        "title": "Camcorder",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/v.htm#VideoCamera\">Video Camera.<\/p>"
    },
    {
        "title": "Camel",
        "desc": "<p>To see a camel in your dream denotes that you need to be more conservative; you are carrying too many responsibilities, burdens and problems on your shoulders. Consider the common phrase, &quot;the straw that broke the camel's back&quot;.You tend to hold on and cling on to your emotions instead of expressing and releasing them. Learn to forgive and forget. Alternatively, the camel represents your stamina.<\/p><p>To dream that you are petting a camel indicates that you are ready to let go of some of the burdens, responsibilities or emotional baggage that you are carrying around.<\/p>"
    },
    {
        "title": "Cameo",
        "desc": "<p>To see or wear a cameo in your dream represents an aspect of yourself that you are trying to express. Perhaps you are showing your delicate and feminize side. Alternatively, the dream may be a pun on a &quot;cameo&quot; appearance that you are making at some social gathering.<\/p>"
    },
    {
        "title": "Camera",
        "desc": "<p>To see a camera in your dream signifies your desires to cling on and\/or live in the past. Alternatively, it may indicate that you need to focus on a particular situation. Perhaps you need to get a clearer picture or idea.<\/p><p>To dream that the camera is broken indicates that you are ignoring an issue or refusing to see the big picture.<\/p><p>To dream that you cannot find your camera to take a picture implies that you are not focusing on the matter at hand. Your attention is too easily diverted. Alternatively, the dream refers to forgotten memories.<\/p><p>To see or dream that you are on a hidden camera indicates that you feel that you are being scrutinized. All eyes are on you.<\/p>"
    },
    {
        "title": "Camouflage",
        "desc": "<p>To dream that you are in camouflage suggests that you are hiding your true self and feelings. You are concealing who you really are. Alternatively, there is a situation in your waking life that is making you want to blend into the background and not get noticed.<\/p>"
    },
    {
        "title": "Camper",
        "desc": "<p>To dream that you are living in a camper indicates that you need to move on with some situation or some aspect of your life. You may be dwelling on a situation and it is time to move forward. Alternatively, you may be expressing your desire to be more independent and self-sufficient.<\/p>"
    },
    {
        "title": "Campfire",
        "desc": "<p>To start or see a campfire in your dream represents sharing and companionship. You need to open yourself to others and allow others to get to know you.<\/p>"
    },
    {
        "title": "Camping",
        "desc": "<p>To dream that you are camping indicates a need for relaxation and a long-deserved break. You need to be more in touch with nature and go back to a more basic and simpler life. Alternatively, it refers to your social circle and support group. You are looking for a sense of belonging, but at the same time be self-sufficient and independent.<\/p>"
    },
    {
        "title": "Campus",
        "desc": "<p>To dream that you are on a campus indicates your need to expand your thinking\/knowledge and challenge yourself mentally.<\/p>"
    },
    {
        "title": "Can",
        "desc": "<p>To see a can in your dream indicates that there is something in your past that you need to hold on to and preserve. The dream may also be a pun on how you &quot;can&quot; do something. Don't underestimate your abilities and talents.<\/p><p>To see canned foods in your dream symbolizes the emotions that you are keeping inside.<\/p>"
    },
    {
        "title": "Can Opener",
        "desc": "<p>To see a can opener in your dream indicates your willingness to accept new ideas and new concepts. It may also be a symbol of reassurance and a way to tell yourself that &quot;I can&quot; do something.<\/p>"
    },
    {
        "title": "Canada",
        "desc": "<p>To dream that you are in Canada depends on your own personal associations with the country. If you have never been to Canada, then you will need to draw on your own preconceptions and feelings of the country.<\/p>"
    },
    {
        "title": "Canal",
        "desc": "<p>To see a canal in your dream symbolizes restraint and constricted emotions. It also suggests that you are unyielding in your thinking and beliefs, which may hinder you in the pursuit of your goals. You are being too controlling.<\/p>"
    },
    {
        "title": "Canary",
        "desc": "<p>To see a canary in your dream represents happiness and harmony. Alternatively, the dream could indicate your desires for a relationship or that a new relationship is blossoming.<\/p>"
    },
    {
        "title": "Cancel",
        "desc": "<p>To dream that you are canceling an appointment or plans suggests that you are afraid to confront some matter. You don't want to face the facts.<\/p>"
    },
    {
        "title": "Cancer",
        "desc": "<p>To dream that you have cancer denotes hopelessness, grief, self-pity, and unforgiveness. You feel you are wasting your life away. This dream also represents areas in your life which are bothering you, disturbing you, and hurting you in some emotional way.An emotional issue is eating away at you.<\/p><p>To dream that you are being treated for cancer signifies a positive change in your life.<\/p><p>To dream that someone has cancer indicates that you need to change your negative way of thinking before it eats away at you. Start being more positive.<\/p><p>To dream that someone is a Cancer sign symbolizes your tendency to keep and hold on to everything. You have a lot of power and influence. The Cancer sign also indicates that you tend to be sensitive, moody and emotional.You are also very family oriented.<\/p>"
    },
    {
        "title": "Candle",
        "desc": "<p>To see a burning candle in your dream signifies that good luck and hope will be coming your way in small and steady amounts. You are in a comfortable stage in your life and may be seeking spiritual enlightenment.Lit candles are also symbolic of intellect, enlightenment, awareness or the search for truth.<\/p><p>To see an unlit candle denotes feelings of rejection or disappointments. You are not utilizing your fullest potential. If you try to light the candle, but it won't light, then it represents grief. You are in denial about something.<\/p><p>To see a candle blow out in your dream indicates that you are surrendering a significant aspect of yourself. You are letting go of something that used to be important to you.<\/p><p>To watch the candle burn down to nothing in your dream signifies your fears of aging and dying. Alternatively, it represents a fear of sexual impotence.<\/p><p>To see a red colored candle in your dream symbolizes some intimate or romantic relationship. You may not be giving the relationship a fair chance and are dismissing it before you invested sufficient time to learn more about the other person. On the other hand, you may just not be feeling any chemistry or passion.<\/p>"
    },
    {
        "title": "Candle Wax",
        "desc": "<p>To see candle wax in your dream indicates that there is too much activity going on in your life. You may need to slow down and take a breather. Alternatively, it may symbolize the passage of time.<\/p>"
    },
    {
        "title": "Candy",
        "desc": "<p>To see or eat candy in your dream symbolizes the joys and the special treats in life. It also represents indulgence, sensuality and\/or forbidden pleasure. You may be devoting too much time to unimportant issues. A more direct interpretation suggests that you are eating too much candy and sweets.<\/p>"
    },
    {
        "title": "Candy Apple",
        "desc": "<p>To see or eat a candy apple in your dream is a reminder that you can have too much of a good thing. You need to show restraint in some area of your life.<\/p>"
    },
    {
        "title": "Cane",
        "desc": "<p>To see or use a cane in your dream suggests that you are in need of some support and advice. The cane may also represent someone you trust and can rely on.<\/p><p>To dream that you are being caned indicates that you are being forced into submission or obedience. Someone is trying make an example of you. Alternatively, the dream symbolizes self-guilt.<\/p><p>To dream that you are caning someone signifies pent up aggression. Pay attention at who you are caning. You may harbor some ill feeling or anger toward this person. This person could also represent an aspect of your own self.<\/p>"
    },
    {
        "title": "Cannabis",
        "desc": "<p>To dream of cannabis denotes a loss of control. You are trying desperately to escape. The dream may also be a reflection of waking drug use.<\/p>"
    },
    {
        "title": "Canned Food",
        "desc": "<p>To see or eat canned food in your dream implies that you are keeping your emotions bottled up inside. You feel that it is not the appropriate time to express your true desires.<\/p>"
    },
    {
        "title": "Cannibalism",
        "desc": "<p>To see cannibalism in your dream symbolizes a destructive and forbidden desire or obsession. Metaphorically, cannibals consume people's lives, along with their energy. Thus, this dream may then denote an aspect of your life (career, relationship, children, etc ), which is consistently draining your enthusiasm and vitality.<\/p><p>To dream that you are a victim of cannibalism represents feelings of being &quot;eating alive&quot; by work, a relationship or a situation in your waking life.<\/p>"
    },
    {
        "title": "Cannon",
        "desc": "<p>To see a cannon in your dream suggests that there is something drastic that needs to be done immediately. According to the Freudian school of thought, the cannon symbolizes the penis.<\/p>"
    },
    {
        "title": "Cannonball",
        "desc": "<p>To see a cannonball in your dream indicates that you are harboring some anger or aggression and it is weighing your down.<\/p>"
    },
    {
        "title": "Canoe",
        "desc": "<p>To see a canoe in your dream represents serenity simplicity, and independence. It is also a reflection of your emotional balance. You are moving ahead via your own power and determination.<\/p>"
    },
    {
        "title": "Canopy",
        "desc": "<p>To see a canopy in your dream symbolizes protection. You may also be elevated to a prominent position.<\/p>"
    },
    {
        "title": "Cantaloupe",
        "desc": "<p>To see or eat cantaloupe in your dream implies that you put forth a tough image, but are sensitive on the inside. Metaphorically, cantaloupes can refer to the breasts.<\/p>"
    },
    {
        "title": "Canteen",
        "desc": "<p>To see or use a canteen in your dream suggests that you are looking to easily and conveniently satisfy your emotional needs.<\/p>"
    },
    {
        "title": "Canvas",
        "desc": "<p>To see a canvas in your dream symbolizes potential and possibilities, especially if the canvas is blank. Consider the significance of what is on the canvas, as it is an aspect of your subconscious.<\/p>"
    },
    {
        "title": "Canyon",
        "desc": "<p>To see a canyon in your dream represents your subconscious mind and hidden feelings. It may point to emotions and relationships that you did not recognize.<\/p>"
    },
    {
        "title": "Cap",
        "desc": "<p>To see a cap in your dream signifies informality and ease. It also suggests that you need to be more tolerant of others.<\/p>"
    },
    {
        "title": "Cap And Gown",
        "desc": "<p>To wear a cap and gown in your dream indicates that you are transitioning into a higher level in your life. You are ready to move on to the next stage.<br><br>To see someone in a cap and gown in your dream symbolizes your successes and accomplishments.<\/p>"
    },
    {
        "title": "Cape",
        "desc": "<p>To see or dream that you are wearing a cape indicates that you are trying to shield yourself from being emotionally hurt. It may also mean that you are trying to cover-up or hide something.<\/p>"
    },
    {
        "title": "Capital Punishment",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d.htm#DeathPenalty\">Death Penalty.<\/p>"
    },
    {
        "title": "Capricorn",
        "desc": "<p>To dream that someone is a Capricorn signifies fears of inadequacy. You are afraid that you are not measuring up. Alternatively, it denotes your drive, tenacity and ambition.<\/p>"
    },
    {
        "title": "Capsize",
        "desc": "<p>To dream that your boat has capsized represents your avoidance in confronting uncomfortable feelings and\/or situations.<\/p>"
    },
    {
        "title": "Captain",
        "desc": "<p>To dream that you are a captain indicates that you are taking charge of your emotions and confronting the issues that are bothering you.<\/p><p>To see a captain in your dream represents your powerful influence over others.<\/p>"
    },
    {
        "title": "Captive",
        "desc": "<p>To dream that you are held captive suggests that you are feeling trapped in some aspect or circumstances of your waking life. You may feel trapped in your career, relationship or life in general. Alternatively, captivity dreams indicate something you are refusing to acknowledge or something that you are in denial about.<\/p>"
    },
    {
        "title": "Car",
        "desc": "<p>To dream that you are driving a car denotes your ambition, your drive and your ability to navigate from one stage of your life to another. Consider how smooth or rough the car ride is. If you are driving the car, then you are taking an active role in the way your life is going. However, if you are the passenger, then you are taking a passive role. If you are in the backseat of the car, then it indicates that you are putting yourself down and are allowing others to take over.This may be a result of low self-esteem or low self-confidence. Overall, this dream symbol is an indication of your dependence and degree of control you have on your life.<\/p><p>Driving a new car means that you are headed toward a new direction or goal. You are deviating from your original life path.<\/p><p>To dream that you drive your car into a body of water or that it rolls into water implies that you are in for an emotional journey.To see a car underwater in your dream points to feelings of regret or sadness over an abandoned goal.<\/p><p>Dreaming that your car is buried suggests that you are feeling weary about pursing someone else's dreams instead of your own. You are afraid to let others down.<\/p><p>To dream that your car flipped over implies that some significant event is preventing you from achieving your goals. You feel that you have to put your own life on hold.<\/p><p>To see or dream that a car is being crushed represents disappointments occurring in your waking life. You are lacking ambition and goals.<\/p><p>To dream that your car won't start indicates that you are feeling powerless in some situation.<\/p><p>To dream that you forget or can't find where you parked your car indicates that you are dissatisfied or unhappy with an aspect of your waking life. You do not know what you really want to do with your life or where you want to go. To dream that your car has been stolen indicates that you are being stripped of your identity. This may relate to losing your job, a failed relationship, or some situation which has played a significant role in your identity and who you are as a person. If you dream that you are stealing a car, then it implies that you are trying to take credit for someone else's work. It may also mean that you are downplaying the role that others had in your success.<\/p><p>To dream that your car is overheating suggests that you are expending too much energy. You need to slow down or run the risk of being burnt out. You are taking on more than you can handle. It is time to take a breather.<\/p><p>To see a parked car in your dream suggests that you need to turn your efforts and energies elsewhere. You may be needlessly spending your energy in a fruitless endeavor. Alternatively, a parked car may symbolize your need to stop and enjoy life.<\/p><p>To dream that you are almost hit or were ran over by a car suggests that your lifestyle, beliefs or goals may be in conflict with another's. It may also be symbolic of a jolting experience or injured pride. If you dream that you hit or ran over someone with a car, then it implies that you have hurt someone in order to move ahead in life.<\/p><p>To dream that you are unable to roll up the windows of your car suggests that you are showing some hesitation and reservation about the direction that you are taking in life or the path that you have chosen.<\/p><p>To see a haunted car in your dream represents unfinished goals. You had started off on a path or journey, but never reached the end. Perhaps life had taken you on a different direction that you had planned or intended.<\/p><p>To dream that no one is driving a moving car suggests that you need to reassess your level of control over your life. You are unwilling to take responsibilities for your actions.<\/p><p>To buy a car in your dream refers to your commitment to some important life decision you have made.<\/p><p>If you dream of driving a black colored car, then it means that you like to be low-key about your intentions or goals. Driving a black color in a dream signify some ulterior motives.<\/p><p>Dreaming of a car that is driving fast suggests that you need to slow down and think through your choices. You are so focused on your goals that you are leaving behind the people around you.<\/p>"
    },
    {
        "title": "Car Alarm",
        "desc": "<p>To hear or set off a car alarm in your dream implies that you are headed on the wrong path. The dream is alerting you to change your direction and alter your course.<\/p>"
    },
    {
        "title": "Car Battery",
        "desc": "<p>To see your car battery in your dream symbolizes your stamina.<\/p><p>To dream that your car battery is dead suggests that you are overwhelmed and overworked. You need to slow down and set some time for yourself or else run the risk of collapsing from exhaustion.<\/p>"
    },
    {
        "title": "Car Carrier",
        "desc": "<p>To see a car carrier in your dream indicates that you are lacking direction and have no goal of your own. You are letting others make decisions for you. You are going with the flow.<\/p>"
    },
    {
        "title": "Car Dealership",
        "desc": "<p>To see or dream that you are in a car dealership refers to some decision that you need to make about where you want to go in life. You are trying to figure out your life path.<\/p>"
    },
    {
        "title": "Car Seat",
        "desc": "<p>To see an infant car seat in your dream implies that you are in control of someone else's direction or destiny in life.Alternatively, the dream refers to the beginning stages of your life journey. You are just getting started on an important path.<\/p>"
    },
    {
        "title": "Car Show",
        "desc": "<p>To dream that you are at a car show suggests that you are drawn to a flashy lifestyle which may not necessarily be who you really are.<\/p><p>To dream that you are showing off your car at a car show implies that you are proud of your accomplishments and achievements. You are seeking recognition for your work.<\/p>"
    },
    {
        "title": "Caramel",
        "desc": "<p>To eat or lick caramel in your dream indicates a sweet and satisfying situation will eventually turn into &quot;sticky&quot; problem. If it sounds too good to be true, then it is really too good to be true.<\/p>"
    },
    {
        "title": "Caravan",
        "desc": "<p>To dream that you are part of a caravan means that you will achieve your goals with the support of others. You do not need to do things by yourself.<\/p>"
    },
    {
        "title": "Carburetor",
        "desc": "<p>To see the carburetor in your dream represents emotional, spiritual and physical balance.<\/p>"
    },
    {
        "title": "Carcass",
        "desc": "<p>To see a carcass in your dream indicates that you are feeling emotionally torn. You feel that you are literally being ripped apart.<\/p>"
    },
    {
        "title": "Cardboard",
        "desc": "<p>To see a cardboard box in your dream indicates a lack of protection against risk.<\/p>"
    },
    {
        "title": "Cardinal",
        "desc": "<p>To see a cardinal in your dream represents vitality and happiness. It also may mean being in first place or your position at the front.<\/p>"
    },
    {
        "title": "Cards",
        "desc": "<p>To dream that you are playing a game of cards represents your ability to strategize in various areas of your life. In particular, diamonds indicate wealth and materialism, clubs indicate work and industry, hearts indicate happiness in love, and spades indicate troubling times and disappointments.<\/p><p>To dream that you are shuffling cards signifies indecision. You need to reevaluate your choices.<\/p><p>In particular, dreaming of the king of heart card symbolizes a compassionate male figure in your life. It may also mean that you are that compassionate person.<\/p>"
    },
    {
        "title": "Cargo",
        "desc": "<p>To dream that you are loading or carrying cargo refers to a heavy load that you are carrying around. You are feeling overburdened or overwhelmed.<\/p><p>If you are unloading cargo in your dream, then it indicates that you are ready to rid yourself of the extra weight, negative habits and\/or excesses that are holding you back. It is time to let go.<\/p>"
    },
    {
        "title": "Carjack",
        "desc": "<p>To dream that you have been carjacked suggests that you have lost your direction in life. You feel that circumstances in your life has lead you on a different course.<\/p>"
    },
    {
        "title": "Carnation",
        "desc": "<p>To see carnations in your dream symbolize light-heartedness, vitality and joy. Alternatively, it may represent bachelorhood.Consider the color of the carnation for additional significance.<\/p>"
    },
    {
        "title": "Carnelian",
        "desc": "<p>To see a carnelian in your dream represents passion, lust, sexuality, or matters of the heart. It also indicates a need for spiritual healing.<\/p>"
    },
    {
        "title": "Carnival",
        "desc": "<p>To dream that you are at the carnival represents falsehoods and deception. If you observe freakish sights, then it denotes a lack of harmony in your domestic life. Much sorrow will arise in what were thought to be pleasant times.<\/p><p>To dream that you are on a carnival ride suggests that you are going in circles. It may also symbolize cheap thrills.<\/p><p>To dream that you run away with the carnival denotes that you will be involved in or closely connected to the entertainment field.<\/p>"
    },
    {
        "title": "Caroling",
        "desc": "<p>To dream that you are caroling signifies joy, harmony and tranquility. You are in a festive and upbeat mood. The dream may also be a pun on someone who is named &quot;Carol&quot;.<\/p>"
    },
    {
        "title": "Carousel",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m2.htm#Merry-Go-Round\">Merry Go Round.<\/p>"
    },
    {
        "title": "Carp",
        "desc": "<p>To see a carp in your dream indicates that you need to put aside your pride and ego and not let it get in the way of friendships and relationships. Alternatively, the carp is symbolic of patience, perseverance, determination, tenacity, courage and success.<\/p>"
    },
    {
        "title": "Carpenter",
        "desc": "<p>To see or dream that you are a carpenter indicates that you are confronting and overcoming your obstacles. Alternatively, it suggests that you need to change your way of thinking and readjust your attitude.<\/p>"
    },
    {
        "title": "Carpet",
        "desc": "<p>To see a carpet in your dream represents your way of protecting yourself from life's harsh realities. Alternatively, a carpet symbolizes luxury, comfort or richness. Consider the condition and designs of the carpet and how it parallels the foundation that you have laid for yourself in life. Perhaps the dream is telling you that you are refusing to confront some issue and instead are sweeping it under the carpet?<\/p><p>To dream that you are installing or laying down carpet suggests that you are trying to make your life more comfortable. The dream may also be analogous to the planning of something. You are laying out some new project or endeavor.<\/p><p>To dream of a magic carpet implies your desires and wishes to escape from a situation, relationship, or responsibilities. The dream is similar to a flying dream, so you may want to look up<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/f2.htm#Flying\">flying.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/r.htm#redcarpet\">Red Carpet.<\/p>"
    },
    {
        "title": "Carriage",
        "desc": "<p>To see an old-fashioned carriage in your dream suggests that your ways of thinking may be too outdated and antiquated. The carriage is also a symbol of power and status.<\/p>"
    },
    {
        "title": "Carrom Board",
        "desc": "<p>To see or play with a Carrom Board in your dream implies that you need to focus on your goals. Alternatively, the dream indicates that you are trying to shield or protect a loved one from some problem or issue.<\/p>"
    },
    {
        "title": "Carrot",
        "desc": "<p>To see a carrot in your dream signifies abundance and fertility. It may also symbolize a lure as in the idiom &quot;to dangle a carrot&quot;.<\/p><p>To eat a carrot in your dream indicates clarity. You are seeing something more clearly.<\/p>"
    },
    {
        "title": "Carry",
        "desc": "<p>To dream that you are being carried suggests that you are feeling like a burden to somebody. You need to be more independent and take on more responsibilities. Alternatively, it may elude to romance.<\/p>"
    },
    {
        "title": "Cartoon",
        "desc": "<p>To dream that your real life is depicted in a cartoon world suggests that you are perceiving the world in a comical and unserious manner. This dream may also serve as an escape from the stressful realities of your life. It is your way of obtaining moments of lightheartedness and fun. Additionally, you need to learn to laugh at yourself and at your mistakes.<\/p><p>To dream that you are watching cartoons indicates that you are not taking life seriously.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/characters.htm#CartoonCharacter\">Cartoon Character.<\/p>"
    },
    {
        "title": "Cartwheels",
        "desc": "<p>To dream that you are doing cartwheels represent poise and balance in your life or the need to regain balance. You need to handle life's obstacle and stress with more fortitude.<\/p><p>To dream that you have difficulties doing cartwheels suggest that you do not have confidence in your own abilities. It may also mean that you are lacking discipline and are exhibiting some struggles in your life. There is an imbalance between work and pleasure.<\/p>"
    },
    {
        "title": "Carving",
        "desc": "<p>To dream that you are carving a piece of wood symbolizes spiritual and creative energy. Metaphorically, you are transforming subconscious energy into conscious awareness. Consider whether the carving is purely ornamental or utilitarian.<\/p><p>To dream that you are carving some meat indicates that you are trying to rid yourself of certain feelings. You may be distancing yourself from your emotions and analyzing them from an objective standpoint. Alternatively, some person or situation is violating an aspect of your life.<\/p>"
    },
    {
        "title": "Carwash",
        "desc": "<p>To dream that you are at a carwash indicates that you need to clean up your self-image. You are ready for a fresh start.<\/p>"
    },
    {
        "title": "Cash",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m3.htm#Money\">Money.<\/p>"
    },
    {
        "title": "Cash Register",
        "desc": "<p>To see a cash register in your dream represents financial worries and concerns. You are assessing your financial situation. On the other hand, you may be expecting monetary gains.<\/p>"
    },
    {
        "title": "Cashier",
        "desc": "<p>To see or dream that you are a cashier indicates that you are re-evaluating your life and what you have accomplished. Alternatively, it suggests that you have removed yourself out of some situation. You have &quot;checked out&quot;.<\/p>"
    },
    {
        "title": "Cashmere",
        "desc": "<p>To feel or wear cashmere in your dream symbolizes luxury. You strive for the finer things in life. Alternatively, dreaming of cashmere suggests that you are looking for warmth and comfort in your relationships.<\/p>"
    },
    {
        "title": "Casino",
        "desc": "<p>To dream that you are in a casino signifies the risk-taker within you. If you are a reserved or passive person, then the dream suggests that you should take a chance. If you are not, then it implies that you need to make a more informed decision instead of relying on fate.<\/p>"
    },
    {
        "title": "Casket",
        "desc": "<p>To see a casket in your dream symbolizes the womb. It also signifies your thoughts and fears of death. If the casket is empty, then it denotes irreconcilable differences. Alternatively, the coffin represents ideas and habits that are no longer of use and can be buried. In particular, if the casket is white, then it refers to lost innocence.<\/p><p>To see a body in a casket in your dream signifies that you are going through a period of depression. You may feel confined, restricted and that you are lacking personal freedom. There may be a dead or decaying situation or issue in your life that you need to address. It is time to end this situation or relationship.<\/p>"
    },
    {
        "title": "Casserole",
        "desc": "<p>To dream you are making a casserole symbolizes new ideas or a new phase in your life.<\/p>"
    },
    {
        "title": "Cassette Tape",
        "desc": "<p>To see a cassette tape in your dream suggests that there is worth and truth in what you are saying. Alternatively, the dream means that you need to get out of the same rut. You are going around in a loop.<\/p>"
    },
    {
        "title": "Cassowary",
        "desc": "<p>To see a cassowary in your dream refers to your shy nature. You try to avoid confrontation and arguments.<\/p>"
    },
    {
        "title": "Cast",
        "desc": "<p>To dream that you are wearing a cast suggests that your motion is being inhibited in some way. Or that you need to show some restraint in an area of your life. Consider which part of the body is in a cast. Alternatively, a cast symbolizes a time of healing and discipline.<\/p>"
    },
    {
        "title": "Castanets",
        "desc": "<p>To see, hear or play with castanets in your dream represents little annoyances and irritations in your waking life. Alternatively, the dream may be a metaphor that you need to &quot;cast-a-net&quot;. Perhaps you are looking for some assistance.<\/p>"
    },
    {
        "title": "Castle",
        "desc": "<p>To see a castle in your dream signifies reward, honor, recognition, and praise for your achievements. You are destined to a position of power, wealth, and prestige.Alternatively, the dream indicates your desire to escape from life's daily problems.<\/p><p>To dream that you live in a castle represents your extreme need for security and protection to the point where you may be isolating yourself from others. Perhaps the dream parallels a waking situation where it has put you on the defensive.<\/p><p>To see a castle door in your dream indicates that you have missed a huge and\/or profitable opportunity, especially if you are standing outside the castle door. If you are standing inside the castle door, then it means that you have let your success and ego distance you from others.<\/p>"
    },
    {
        "title": "Castration",
        "desc": "<p>To dream of a castration signifies your overwhelming fears that you have lost your virility. You are feeling the pressures of your sexual performance. Alternatively, it represents a lack of creativity, power or strength.<\/p>"
    },
    {
        "title": "Cat",
        "desc": "<p>To see a cat in your dream symbolizes an independent spirit, feminine sexuality, creativity, and power. It also represents misfortune and bad luck. The dream symbol has different significance depending on whether you are a cat lover or not. The cat could indicate that someone is being deceitful or treacherous toward you. If the cat is aggressive, then it suggests that you are having problems with the feminine aspect of yourself.If you are afraid of the cat in your dream, then it suggests that you are fearful of the feminine. The dream may be a metaphorfor &quot;cattiness&quot; or someone who is &quot;catty&quot; and malicious. If you see a cat with no tail, then it signifies a loss of independence and lack of autonomy.<p>To dream that you cannot find your cat highlights your independent spirit. You need to allow yourself to be free and not let anyone or anything hold you back.<p>To dream that a cat is biting you symbolizes the devouring female. Perhaps you are taking and taking without giving. You may be expressing some fear or frustration especially when something is not going as planned. To dream that you are saving the life of a cat implies that you are reclaiming your independence and power.<\/p><p>To dream that a cat is scratching you suggests that you are feeling threatened.<\/p><p>To see a black cat in your dream indicates that you are experiencing some fear in using your psychic abilities and believing in your intuition. You may erroneously associate the black cat with evil, destruction, and bad luck. In particular, if the black cat is biting, clawing or attacking you, then the dream means that you must acknowledge what your intuition is trying to tell you. You can no longer ignore it. Do not be afraid to face the situation. If you see a white cat, then it denotes difficult times.<\/p><p>To dream that a cat killed a spider suggests that you are expressing your femininity in a seductive and cunning manner rather than in an overtly and almost destructive way.<\/p><p>To see a dead cat or hear a cat being killed implies that you are lacking autonomy and independence in some area of your life. Alternatively, the dream means that you are refusing to recognize your feminine power.<\/p><p>To see cats playing in your dream refers to your frisky nature. You need to show your playful side.<\/p><p>To see a cat with green spikes suggests that jealousy is preventing you from forming meaningful relationships. You are keeping your distance from a situation or relationship.<\/p><p>To see or drive a car that looks like a cat refers to your free and independent spirit. If you are almost hit by a car that looks like a cat, then it suggests that you are hindering someone's goals or not letting them be who they are.<\/p><p>Dreaming of a cat without a body or any legs symbolizes limited independence. You are being mislead into thinking that you have the freedom to do whatever you want.<\/p><p>Seeing two identical cats in your dream means that you need to balance your own needs with the needs of others. You need to remember to take care of yourself and not always worry about others.<\/p><p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">Dreaming of thousands of cats running around in a house indicates a lack of direction in your life. There is too much going on in your life that you are losing sight of what's important.<span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline; float: none\">If you dream of a cat with two heads, then it implies indecision; you cannot make up your mind about something. Alternatively, the dream may also mean that you are too easily distracted by your surroundings.<\/p><p>**See The Meaning In Action: &quot;&quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=catdream1\">Black Cat&quot; or<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=catdream2\">Injured Cat&quot;<\/p>"
    },
    {
        "title": "Cat Eyes",
        "desc": "<p>To see or dream that you have cat eyes indicate that you are able to find your way through some dark and troubling problem. You are able to see the bright side of a negative situation. Alternatively, it suggests that you are being slick or sly.<\/p><p>To dream that a cat has glowing blue eyes indicates that you need to look at something from a different perspective. The dream may also mean sudden enlightenment which may bring about feelings of fear or anxiety. You are afraid of the truth.<\/p>"
    },
    {
        "title": "Catacomb",
        "desc": "<p>To dream of a catacomb suggests that you need to confront your fears of the subconscious.<\/p>"
    },
    {
        "title": "Catapult",
        "desc": "<p>To see a catapult in your dream indicates that you will overcome your obstacles through ingenuity and determination. Alternatively, the dream implies that you know no limit. You are on the fast track to success.<\/p>"
    },
    {
        "title": "Cataract",
        "desc": "<p>To dream that you have cataract or are having cataract remove indicates that you are looking for clarity in some situation. You are not seeing all the details clearly.<\/p>"
    },
    {
        "title": "Catastrophe",
        "desc": "<p>To experience a catastrophe in your dream represents sudden instability and upheaval in your walking life. You are feeling extremely anxious about the unknown changes that are in store for you.<\/p>"
    },
    {
        "title": "Catch",
        "desc": "<p>To catch something in your dream suggests that you need to incorporate something into your life. Consider the object you are trying to catch and look up its meaning. If you are trying to catch a ball, then it indicates that you want to feel whole or you need to be more well-rounded. If you catch a fish, then it suggests that you need to be more spiritual.<\/p><p>To dream that you are playing catch signifies your carefree attitude. You are enjoying life. Consider who you are playing catch with. If you are playing catch with mother or father, then it represents your bond and closeness to them.<\/p><p>The dream may also be a metaphor to indicate something that is &quot;catchy&quot; or contagious.<\/p>"
    },
    {
        "title": "Catcher",
        "desc": "<p>To see or dream that you are a baseball catcher implies that you need to be ready to accept whatever life throws at you. The dream is telling you to be prepared. Since baseball is often analogous to sexual foreplay as in getting to first, second, or third base on a date, the catcher in your dream may be a play on words, telling you to &quot;catch her&quot;. Perhaps there is a girl that you like and you are not sure if you should pursue her.<\/p>"
    },
    {
        "title": "Caterpillar",
        "desc": "<p>To see a caterpillar in your dream signifies a stage in your own personal growth and development where you are on your way, but have not yet reached your goal.<\/p>"
    },
    {
        "title": "Catfish",
        "desc": "<p>To see a catfish in your dream symbolizes someone who may not appear to be who they are. Their true self may not be obvious or immediately apparent.<\/p>"
    },
    {
        "title": "Cathedral",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c3.htm#Church\">Church.<\/p>"
    },
    {
        "title": "Catsup",
        "desc": "<p>To see or eat catsup in your dream represents simplicity, youth, and happiness. Alternatively, the dream may be a pun on your need to &quot;catch up&quot; on something.<\/p>"
    },
    {
        "title": "Cattle",
        "desc": "<p>To see cattle in your dream indicates that you need to proceed with caution in some situation or relationship.<\/p><p>To see a herd of cattle in your dream represents a lack of individuality. You generally go with the flow of things. Alternatively, it symbolizes prosperity.<\/p><p>To see a stampede of cattle in your dream suggests that something in your life is out of control.<\/p>"
    },
    {
        "title": "Catwalk",
        "desc": "<p>To see or dream that you are walking a catwalk represents your new found confidence. It may also mean that you enjoy being the center of attention. You are being recognized for your talents or creativity. Alternatively, the dream could mean that you are using your appearance to get your way. You need to start looking within yourself.<\/p>"
    },
    {
        "title": "Caught",
        "desc": "<p>To dream that you are caught doing something represents your fears and vulnerabilities. You are afraid of being judged. Consider the significance of what you were doing and how you felt when you were caught. Alternatively, the dream indicates that you are being hyper-vigilant about your surroundings.<\/p>"
    },
    {
        "title": "Caul",
        "desc": "<p>To see a caul in your dream indicates that you are not seeing something clearly. Your vision is being impaired or clouded by something or someone. A caul is also symbolic of luck and protection.<\/p>"
    },
    {
        "title": "Cauldron",
        "desc": "<p>To see a cauldron in your dream implies that you are undergoing some transformation. It also indicates destiny or some magical, spiritual force. Alternatively, the cauldron symbolizes fertility and the womb. Consider the symbolism of what is inside the cauldron and its importance.<\/p>"
    },
    {
        "title": "Cauliflower",
        "desc": "<p>To see or eat cauliflower in your dream symbolizes spiritual nourishment, purity and perfection. It also represents sadness and a need to be uplifted. Your dream indicates that the tough times you are experiencing will soon be over. Alternatively, the cauliflower represents the brain and your mental capabilities.<\/p>"
    },
    {
        "title": "Cave",
        "desc": "<p>To see or dream that you are in a cave symbolizes the womb and thus signify refuge, protection and concealment.<\/p><p>To dream that you are walking in a dark cave represents an exploration of your subconscious mind.It signals self discovery.<\/p>"
    },
    {
        "title": "Cave Painting",
        "desc": "<p>Tosee a cave painting in your dream indicates that you are not quite ready to share your ideas. You are reluctant to share your innermost thoughts and fully express who you are.<\/p>"
    },
    {
        "title": "Caveman",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b.htm#Barbarian\">Barbarian.<\/p>"
    },
    {
        "title": "Caviar",
        "desc": "<p>To see or eat caviar in your dream points to your expensive tastes. You enjoy the finer things in life and are not afraid to flaunt it.<\/p>"
    },
    {
        "title": "Cavities",
        "desc": "<p>To dream that you have a cavity indicates feelings of fear and insecurity over a situation. You are lacking self confidence.<\/p>"
    },
    {
        "title": "CD",
        "desc": "<p>To see a compact disc in your dream represents a need for enjoyment or a distraction. It also points to the opportunities and possibilities within your grasp. Consider the type of music and the title of the compact disc. If you are giving away the CD, then you may be trying to convey a message to that person within the songs.Alternatively, the CD is analogous to the meaning of a circle.<\/p><p>Consider also if the initial &quot;CD&quot; have any additional significance to you. Perhaps it represents a person or may even be a pun on something that is &quot;seedy&quot;.<\/p>"
    },
    {
        "title": "CD Player",
        "desc": "<p>To see or use a CD player in your dream represents the impression or image that you want to project to others. It may also symbolize inspiration and the simple pleasure of listening to music.<\/p>"
    },
    {
        "title": "Cedar",
        "desc": "<p>To see a cedar in your dream symbolizes longevity, durability, strength, endurance and immortality. The dream may be trying to offer reassurance during a difficult time in your life.<\/p>"
    },
    {
        "title": "Ceiling",
        "desc": "<p>To see a ceiling in your dream represents a mental or spiritual perspective. It may also symbolize the limit you have set for yourself. If you see vaulted ceiling in your dream, then it signifies your askew perspective or view.<\/p><p>Dreaming that there is water damage on the ceiling refers to some emotional issue that you are not addressing. You keep putting these feelings aside which may become a bigger problem at the end.<\/p>"
    },
    {
        "title": "Celebration",
        "desc": "<p>To dream of a celebration represents your achievement toward a higher level of growth. This may also be a self-congratulatory dream for the goals you have achieved and for the recognition you have gained. You may also be honoring some victory, success, or accomplishment. Alternatively, to dream of a celebration symbolizes freedom and emotional release. Celebration dreams are common for those who anticipate an upcoming turning point or event in their waking life.<\/p>"
    },
    {
        "title": "Celebrities",
        "desc": "<p>To dream that you are a celebrity signifies your high aspirations that may be way beyond your reach at the present moment. You may just be setting yourself for a let-down.<\/p><p>To dream that a friend or lover becomes a celebrity denotes your fear of losing the friendship and loyalty of this person.<\/p><p>To see a celebrity in your dream represents your beliefs and understanding about her or him. Consider what the celebrity is famous or known for and how you relate to that quality. Something in you waking life has triggered these similar beliefs and feelings. It is not uncommon that your obsession with a certain celebrity may carry over onto your dream world. Celebrities are often seen as heroes and all that is mighty. Also consider any puns within the name.<\/p><p>To dream that you are good friends with a celebrity represents your idealized version of someone you know in your life. Perhaps you hope that a real-life friend can act more like a particular celebrity. Consider the qualities that you see in this celebrity and how you want your friends to have those qualities.Alternatively, the dream may be trying to compensate for your own lack of self-confidence. You want to escape from your own reality and live the high life. You want to fit in.<\/p><p>Dreaming of dating a celebrity implies that you are idealizing a relationship. If you are infatuated or obsessed with a particular celebrity, then you may also have a dream of dating her or him.<\/p><p>To dream that you are kissing or having sex with a celebrity indicates your drive to be successful. Consider what movies you associate this celebrity with or what makes this celebrity famous for clues as to where and what you want to achieve success in. Alternatively, the dream may represent your waking fascination or obsession with this particular celebrity.<\/p><p>*See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/a.htm#Actor\">Actor \/ Actress.<\/p>"
    },
    {
        "title": "Celery",
        "desc": "<p>To see or eat celery represents your need to be cleansed, either physically or emotionally. The dream may also be a pun on &quot;salary&quot; and thus indicate your financial concerns.<\/p>"
    },
    {
        "title": "Celibacy",
        "desc": "<p>To dream that you are celibate represents your fears of intimacy. You may be trying to block off your sexual energies.<\/p>"
    },
    {
        "title": "Cell Phone",
        "desc": "<p>To see or use a cell phone in your dream indicates that you are being receptive to new information. It also represents your mobility. Alternatively, the dream signifies lack of understanding. Perhaps you are having difficulties getting through to someone.<\/p><p>To dream that you lost your cell phone represents a lack of communication. You have lost touch with some aspect of your feelings or your Self.If you find a cell phone, then it symbolizes reconnection and reopened communication.<\/p><p>To dream that your cell phone is snapping open and close implies that you are ready to talk about something that you have been keeping inside.<\/p><p>To dream that your cell phone screen is cracked implies that you are not expressing yourself in a healthy or effective manner.<\/p><p>Dreaming that your parents are giving you or letting you have a cell phone refers to having a better line of communication with them. Perhaps the dream is telling you that you should open up to them more.<span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">If you dream about getting a cell phone for free, then it symbolizes the importance of communication. In other words, you can not put a price on it.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/t.htm#Telephone\">Telephone<\/p>"
    },
    {
        "title": "Cell Phone Tower",
        "desc": "<p>To see a cell phone tower in your dream symbolizes communication and your connections to others.<\/p><p>To dream that a cell phone tower is being built on top of your house implies that there is a lack of communication within your family which can no longer be ignored. You need to address this communication problem.<\/p>"
    },
    {
        "title": "Cellar",
        "desc": "<p>To dream that you are in a cellar represents a part of your subconscious mind where you have kept your fears and problems hidden.<\/p><p>To dream that you are going down the cellar signifies that you are digging deep into your own past and facing your fears.<\/p>"
    },
    {
        "title": "Cello",
        "desc": "<p>To see or hear a cello in your dream represents sensual or creative achievements. You are displaying much strength and stability.<\/p>"
    },
    {
        "title": "Celtic Knot",
        "desc": "<p>To see a Celtic Knot in your dream symbolizes continuity, longevity, good health and\/or immortality. It also refers to a timeless tradition. Consider the general geometric shape of the knot for further meaning.<\/p>"
    },
    {
        "title": "Cement Truck",
        "desc": "<p>To see a cement truck in your dream represents firm and &quot;concrete&quot; ideas or plans that are being set into motion.<\/p><p>To dream that you are mixing cement suggests that you are fusing ideas or aspects of yourself together.<\/p><p>* Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c4.htm#Concrete\">Concrete.<\/p>"
    },
    {
        "title": "Cemetery",
        "desc": "<p>To dream that you are in a cemetery indicates an end to a habit or behavior. You are experiencing a rebirth. More directly, the dream may symbolize sadness, unresolved grief or your fears about death.<\/p><p>To dream that you are cleaning the cemetery suggests that you are coming clean about your past. In some Asian cultures, a special holiday revolves around surviving members of the family visiting and cleaning the gravesites of the deceased as a way to pay their respects. Thus in this regard, your dream may mean to respect your past and where you came from.<\/p>"
    },
    {
        "title": "Censor",
        "desc": "<p>To dream that you are being censored suggests that you are being prevented from expression your views, opinions or feeling. A relationship or situation may be unhealthy and oppressive.<\/p><p>To dream that something is being censored indicates that you do not have all the facts to make an informed decision about some matter.<\/p>"
    },
    {
        "title": "Centaur",
        "desc": "<p>To see a centaur in your dream symbolizes the duality of human nature. It indicates that you are trying to balance your intellectual\/mental nature with your physical nature. The centaur also represents humanity, wisdom, and compassion.<\/p>"
    },
    {
        "title": "Center",
        "desc": "<p>To dream that you are at the center of something represents your belief that everything revolves around you. The dream may also be a metaphor that you are in the middle of some situation that you cannot get out of. If you are off centered, then it indicates that something in your life is out of balance.<\/p>"
    },
    {
        "title": "Centipedes",
        "desc": "<p>To see a centipede in your dream suggests that you are letting your fears and doubts hinder you from making progress and achieving your goals. You need to stop thinking negative thoughts.<\/p>"
    },
    {
        "title": "Ceramics",
        "desc": "<p>To see or make ceramics in your dream suggest that you need to be more hands on in some situation or relationship. You need to express more of your creative side.<\/p>"
    },
    {
        "title": "Cereal",
        "desc": "<p>To dream that you are eating cereal denotes the start of a new project or new stage in your life. It may also indicate your need to restore yourself in some basic way. Alternatively, your mind may already be thinking ahead to breakfast. It is not uncommon for your fleeting thoughts to be incorporated into your dream.<\/p>"
    },
    {
        "title": "Ceremony",
        "desc": "<p>To dream that you are attending a ceremony suggests that sacrifice and devotion is necessary for success. You may be going through a crucial moment in your waking life that requires your commitment. It is a time for introspection, self-discovery, and inner changes.<\/p>"
    },
    {
        "title": "Certificate",
        "desc": "<p>To see a certificate in your dream suggests that you are seeking some validity and truth to some situation.You want recognition for your efforts.<\/p>"
    },
    {
        "title": "Cesarean Section",
        "desc": "<p>To dream that you are having a caesarian section implies that you need help in order to get your idea or project off the ground. You can not do it by yourself. A more direct interpretation of this dream may represent your anxieties of having a C-section in real life.<\/p>"
    },
    {
        "title": "Cesspool",
        "desc": "<p>To see a cesspool in your dream suggests that you need to undergo some emotional cleansing. You need to let go of the negativity and the things that are holding you back.<\/p>"
    },
    {
        "title": "Chains",
        "desc": "<p>To see chains in your dream signify your need to break free from a routine, old idea, or a relationship. If you are being chained, then some part of you is being forcefully put in check.You are being held back from what you really want to do.<\/p>"
    },
    {
        "title": "Chainsaw",
        "desc": "<p>To see a chainsaw in your dream indicates that something drastic is about to happen. Success will only come about through willpower. Alternatively, it suggests that you get right to the heart of the matter quickly. The chainsaw may be seen as a phallic symbol and can refer to your sexual drives.<\/p>"
    },
    {
        "title": "Chair",
        "desc": "<p>To see a chair in your dream symbolizes your need to sit down and take time out to contemplate a situation before proceeding. Or you just need to relax. Alternatively, it indicates that your feelings or ideas are being dismissed or cast to the side.<\/p><p>To dream that someone is offering you a chair suggests that you need to be open to taking and accepting advice.<\/p><p>Dreaming that you fall or someone falls backwards in your chair implies that you are too comfortable idling around and not accomplishing anything.<\/p>"
    },
    {
        "title": "Chairlift",
        "desc": "<p>Dreaming of riding a chairlift up a ski slope indicates that you are achieving new heights and overcoming your fears. You are in control of your emotions and are confronting any feelings and inhibitions you have been repressing.You are close to bringing them to the surface.<\/p><p>To dream of riding a a chairlift as you are watching other people suggests that life is passing you by. Instead of taking control of your life and being more proactive, you are just letting things happen. In particular, if you dream of a chairlift underwater, then it means that you are feeling numbed by your emotions.<span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\"><\/p>"
    },
    {
        "title": "Chakra",
        "desc": "<p>To dream about your chakra indicates that there is a blockage to the flow of your spiritual energy. You need to open up. There are 7 chakras so you need to consider which chakra for additional significance.<\/p><p>The crown chakra radiates a violet color and signifies wisdom and intellect.<\/p><p>The brow chakra, also referred to as the third eye is represented by an indigo light and symbolizes psychic ability, intuition and mutual understanding.This dream may be telling you to focus on the big picture.<\/p><p>The throat chakra radiates a blue light and pertains to your voice and how you express your opinions and beliefs.<\/p><p>The heart chakra is depicted by a green color and symbolizes pure and divine love for everyone and everything around you.<\/p><p>The solar plexus chakra radiates a yellow light and represents your relationships with others. Are you in conflict or at peace with others?<\/p><p>The hara chakra is represented by an orange. It relates to sexual matters and issues about love.<\/p><p>The root or base chakra radiates a red light. It relates to material and physical life. If you are dreaming of your base chakra, then it indicates feelings of being lost or uprooted in your waking life.<\/p>"
    },
    {
        "title": "Chalice",
        "desc": "<p>To see a chalice in your dream represents your need for spiritual nourishment. You are searching for your individual self and for a more meaningful existence.<\/p>"
    },
    {
        "title": "Chalk",
        "desc": "<p>To see a piece of chalk in your dream refers to school and learning.Your ability and knowledge is being called into question.<\/p><p>To see something written in chalk signifies something that can easily escape your grasp. You may have an advantage in some situation, but it is only temporary. Consider the significance of the message written.<\/p>"
    },
    {
        "title": "Chalkboard",
        "desc": "<p>To see a chalkboard in your dream represents the classroom and the difficulties you may have experienced in school. There is a lesson to be learned from this dream. You may feel that you are being put to the test. Consider what is being written on the chalkboard. Alternatively, it signifies your debts.<\/p><p>To dream that you are writing on the chalkboard indicates you will need to get your hands dirty in some situation.<\/p>"
    },
    {
        "title": "Chameleon",
        "desc": "<p>To see a chameleon in your dream represents your ability to adapt to any situation. You are versatile and are well-rounded. Alternatively, you feel you are being overlooked.<\/p>"
    },
    {
        "title": "Champagne",
        "desc": "<p>To see the opening of a bottle of champagne symbolizes a sexual act. Alternatively, it represents extravagance and overindulgence. Or it indicates a celebration or a personal achievement that you are proud of.<\/p>"
    },
    {
        "title": "Chamomile",
        "desc": "<p>To see or smell chamomile in your dream represents patience. You need to calm down over some situation.<\/p>"
    },
    {
        "title": "Chandelier",
        "desc": "<p>To see a chandelier in your dream represents grandeur and greatness. You see a bright future ahead. If the chandelier is made of crystal, then it symbolize wealth.<\/p>"
    },
    {
        "title": "Change",
        "desc": "<p>To dream that you receive the wrong amount of change depends on whether you were shortchanged or not. If you were shortchanged, then it is analogous to low self-esteem issues. You feel unworthy. If you receive more change than you were due, then it signifies your inflated ego. You feel entitled to certain things.<\/p>"
    },
    {
        "title": "Chanting",
        "desc": "<p>To dream that you are chanting symbolizes your camaraderie and oneness with others toward a common cause. It also suggests that you are in touch with a Higher plane and an elevated sense of spirituality.<\/p><p>To hear chanting in your dream signifies chaos and disagreements.<\/p>"
    },
    {
        "title": "Chapel",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c3.htm#Church\">Church.<\/p>"
    },
    {
        "title": "Chaps",
        "desc": "<p>To see or wear chaps in your dream symbolizes a passive aggressiveness.<\/p>"
    },
    {
        "title": "Character",
        "desc": "<p>To dream that you are playing a character indicates that you are avoiding some responsibility or refusing to acknowledge your role in it. Alternatively the dream means that you are putting on an act. By playing a character, you are pretending be someone else instead of being yourself. Consider a situation in your waking life where you are not being genuine.<\/p>"
    },
    {
        "title": "Charades",
        "desc": "<p>To dream that you are playing charades indicates that there is something that you are not able to put into words or articulate. Try to decipher what message you are trying to convey.<\/p>"
    },
    {
        "title": "Charcoal",
        "desc": "<p>To dream that you are eating charcoal symbolizes your burning passion and libido. You are going through some sort of transformation and embracing your sensuality.<\/p>"
    },
    {
        "title": "Chariots",
        "desc": "<p>To dream that you are riding in a chariot indicates that you need to exercise control in your life.<\/p><p>To dream that you or someone else fall from a chariot denotes failure.<\/p>"
    },
    {
        "title": "Charity",
        "desc": "<p>To dream that you are giving or receiving charity is analogous to your ability to give and receive love. You have compassion for others.<\/p>"
    },
    {
        "title": "Charleston",
        "desc": "<p>To dream that you are dancing the Charleston signifies important and substantial success ahead for you.<\/p>"
    },
    {
        "title": "Charlie Chaplin",
        "desc": "<p>To see or dream that you are Charlie Chaplin suggests that you are searching and looking for some direction in your life. You need some variety from your daily routine.<\/p>"
    },
    {
        "title": "Charm Bracelet",
        "desc": "<p>To see or wear a charm bracelet in your dream is symbolic of protection from any harm. Consider the symbolism of the specific charm for additional significance.<\/p>"
    },
    {
        "title": "Chart",
        "desc": "<p>To see or read a chart in your dream symbolizes your goals and your approach to life.<\/p>"
    },
    {
        "title": "Chase",
        "desc": "<p>To dream that you are being chased signifies that you are avoiding a situation that you do not think is conquerable. It is a metaphor for some form of insecurity. In particular, to dream that you are chased by an animal represents your own unexpressed and unacknowledged anger which is being projected onto that animal. Alternatively, you may be running away from a primal urge or fear.<\/p><p>To dream that you are chasing someone signifies that you are attempting to overcome a difficult goal or task. You may also be expressing some aggressive feelings toward others.<\/p><p>To dream that you are being chased and enjoying it implies that you like being the object of desire. You like feeling wanted. The dream may be analogous to a blossoming relationship.<\/p><p>*For an in depth analysis, click on<a href=\"http:\/\/www.dreammoods.com\/commondreams\/chase-dreams.html\">Common Dreams: Chase.<\/p>"
    },
    {
        "title": "Chasm",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/a.htm#Abyss\">Abyss.<\/p>"
    },
    {
        "title": "Chastity Belt",
        "desc": "<p>To see or wear a chastity belt in your dream signifies your attitudes and feelings toward sex. Alternatively, the dream may be a metaphor to indicate that you are being overly protective. Perhaps your way of thinking is outdated.<\/p>"
    },
    {
        "title": "Chat Room",
        "desc": "<p>To dream that you are in a chat room represents your need to connect with others on a mental level. The dream could also mean that you are spending too much time in front of the computer and this has carried over into your dreams. You need to get out and socialize in the real world.<\/p>"
    },
    {
        "title": "Chauffeur",
        "desc": "<p>To dream that you are a chauffeur indicates that you are helping someone with their goals. You are trying to steer them on the right direction.<\/p><p>To dream that you are being chauffeured signifies extravagance and luxury. You have a high sense of self worth. Alternatively, the dream represents your dependence on others. You are not in control of your life.<\/p>"
    },
    {
        "title": "Cheap",
        "desc": "<p>To dream that you or someone is cheap represents your own feelings of inadequacy. You are not fully acknowledging your own self worth.<\/p><p>To dream that you got something at a cheap price suggests that you are being undervalued. Or are you cheating somebody of their valuable things? Consider the symbolism of the item and how you feel about it in the dream.<\/p>"
    },
    {
        "title": "Cheating",
        "desc": "<p>To dream that you are cheating on your spouse mate, fiancé, or significant other suggests feelings of self-guilt and self-betrayal. You may have compromised your beliefs or integrity and\/or wasting your energy and time on fruitless endeavors. Alternatively, cheating dreams reflect the intensity of your sexual passion; you are exploring areas of your sexuality. In this scenario, the dream may actually serve as a reaffirmation of your commitment.Furthermore, if you are approaching your own wedding date, then it is not uncommon to have dreams about erotic experiences with partners other than your intended spouse. Most likely, such a dream represents the newness of your sexual passion. It may also signify anxieties of changing your identity - that of a spouse.<\/p><p>To dream that your mate, spouse, or significant other is cheating on you indicates your fears of being abandoned. You may feel a lack of attention in the relationship. Alternatively, you may feel that you are not measuring up to the expectations of others. This notion may stem from issues of trust or self-esteem. The dream could also indicate that you are subconsciously picking up hints and cues that your significant other is not being completely truthful or is not fully committed in the relationship.<\/p><p>To dream that your friend is being cheated onindicates your subconscious dislike for his\/her significant other. You think your friend deserves to be treated better.<\/p><p>To dream that you are cheating at a game suggests that you are not being honest with yourself. You feel inadequate and insecure.<\/p><p>***Go to<a href=\"http:\/\/www.dreammoods.com\/commondreams\/cheating-dreams.html\">Common Dreams: Cheating Dreams for further analysis.<\/p>"
    },
    {
        "title": "Check",
        "desc": "<p>To see a check in your dream suggests that you may feel indebted to others. The dream may also be a pun on checking things out.<\/p><p>To see a blank check in your dream symbolizes your unused potential. It may also indicate unclaimed rewards.<\/p><p>To see a check mark in your dream indicates approval and acceptance. Your hard work has paid off.<\/p>"
    },
    {
        "title": "Checkerboard",
        "desc": "<p>To see a checkerboard in your dream indicates the many aspects and facets of your personality. Alternatively, a checkerboard may reflect your struggle between good and evil or good and bad. The dream may also be a metaphor for your &quot;checkered&quot; past. Perhaps you did something that you were not proud of or something that is coming back to haunt you.<\/p>"
    },
    {
        "title": "Checkers",
        "desc": "<p>To see or play checkers in your dream suggests that you need to have a clear strategy in order to overtake your opponents. The dream may also be a pun on &quot;check her&quot;. Perhaps you need to reevaluate this female person.<\/p>"
    },
    {
        "title": "Checkout",
        "desc": "<p>To dream that you are at a checkout symbolizes completion. You feel whole. Alternatively, being at a checkout in your dream implies that you are not fully vested in a situation. You want to get out of some relationship or circumstance.<\/p>"
    },
    {
        "title": "Cheeks",
        "desc": "<p>To see your cheeks in your dream symbolize commitment, intimacy, and closeness. It also reveals your strength of character and your opinions. Alternatively, cheeks can also be a slang for the<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b3.htm#buttocks\">buttocks.<\/p><p>To see rosy-colored cheeks in your dream signifies life energy, enthusiasm and vitality. If the cheeks are sunken in, then it symbolizes sadness, hunger, poverty and\/or struggles. The emphasis of cheeks in your dream could also point to health issues.<\/p><p>To dream that your cheeks are painted represents your attitudes of courage and violence\/passivity.<\/p><p>To dream that you are kissing someone on the cheek or someone is kissing you on the cheek, then it signifies admiration, courtesy, reverence, friendship or respect.<\/p>"
    },
    {
        "title": "Cheer",
        "desc": "<p>To hear or start a cheer in your dream indicates that you are headed in the right direction or making the right decisions in your life. You have more self confidence and belief in yourself. The dream may also be a metaphor to &quot;cheer up&quot;.<\/p>"
    },
    {
        "title": "Cheerios",
        "desc": "<p>To see or eat Cheerios in your dream indicates that there is something missing from your life. You do not feel completely whole. Alternatively, the dream may be a pun on &quot;farewell&quot; or &quot;good bye&quot;.<\/p>"
    },
    {
        "title": "Cheerleader",
        "desc": "<p>To see a cheerleader in your dream represents competition and triumph. Your dream may be telling you to offer more praise and encouragement toward others.<\/p><p>To dream that you are a cheerleader signifies your self-confidence and self-esteem. You need to be more active and more positive in some waking situation in your life.<\/p>"
    },
    {
        "title": "Cheese",
        "desc": "<p>To see cheese in your dream symbolizes gains and profits. Alternatively, the dream may be a metaphor for something that is &quot;cheesy&quot; or lame. Or it could be saying that you need to smile more.<\/p>"
    },
    {
        "title": "Cheese Curl",
        "desc": "<p>To see or dream that you are eating cheese curls indicates that you are leaving some evidence or clue of your indulgent or negative behavior. Alternatively, the dream may just mean that you have a strong craving for cheese curls.<\/p>"
    },
    {
        "title": "Cheesecake",
        "desc": "<p>To see or eat cheesecake in your dream indicates that things are going great for you. You deserve a sweet reward for a job well done.<\/p>"
    },
    {
        "title": "Cheetah",
        "desc": "<p>To see a cheetah in your dream suggests that you need to get moving and be more active in pursuit of your goals. Perhaps you have been a little lazy and you need to get off from that seat.<\/p>"
    },
    {
        "title": "Chef",
        "desc": "<p>To dream that you are a chef indicates that you have the ability, knowledge, and talent to chose your path in life. You know what course of action you need to take and are moving forward in a productive manner. And you have learned from your previous life experiences.<\/p><p>To see a chef in your dream represents transformation and changes. Consider what is &quot;cooking&quot; in your life?<\/p>"
    },
    {
        "title": "Chemicals",
        "desc": "<p>To see or use chemicals in your dream suggest that you are undergoing some transformation and individuation process.<\/p><p>To dream that you are mixing or combining chemicals represent creativity, manipulation and\/or intellectual power.<\/p>"
    },
    {
        "title": "Chemistry",
        "desc": "<p>To see or dream that you are a chemist points to your ability to change your Self.<span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">You alter your persona according to the situation.<\/p><p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline; float: none\">Dreaming about chemistry refers to manipulation. You are being manipulated or you are the one that is doing the manipulating.<\/p>"
    },
    {
        "title": "Cherry",
        "desc": "<p>To see cherries in your dream symbolize honesty and truthfulness or sweetness and good fortune. Alternatively, the dream may be telling you that &quot;life is like a bowl of cherries&quot;. In other words, don't take life so seriously; take it easy.<\/p><p>To see a cherry tree in your dream represents luck, spring, femininity, and youth.<\/p>"
    },
    {
        "title": "Cherry Blossom Tree",
        "desc": "<p>To see a cherry blossom tree in your dream symbolizes feminine power, beauty and love. The dream may be telling you that you can be both strong and delicate at the same time. Alternatively, dreaming of a cherry blossom tree symbolizes mortality. It may also be a reminder that life is short and to take advantage of what life has to offer.<\/p>"
    },
    {
        "title": "Cherub",
        "desc": "<p>To see a cherub in your dream represents child-like innocence, frailty and mischievousness. You need to take life a little less seriously. Alternatively, the dream indicates that you may have been dishonest or manipulative.<\/p>"
    },
    {
        "title": "Cheshire Cat",
        "desc": "<p>To see the Cheshire cat in your dream signifies mischief, deceit and mockery. It may represent someone in your life who you are not sure if you can trust or rely on.<\/p>"
    },
    {
        "title": "Chess",
        "desc": "<p>To see or play chess in your dream indicates that you need to carefully think through the situation before making a decision. The light and dark squares of the chess board symbolizes the positive (pro) and negative (con) of a situation. The dream may also comment on how you have met your match in love or in business.<\/p><p>To dream that your king chess piece is in danger suggests that you are being stifled by some female character in your life.<\/p><p>To dream of chess pieces coming alive means that you are completely engrossed or submerged in some situation, relationship or task. You are ignoring everything else around you. Alternatively, the dream implies that you no longer have control of a situation. A situation in your waking life is ruling your actions and behavior.<\/p>"
    },
    {
        "title": "Chest",
        "desc": "<p>To see your chest in your dream signifies confidence, conquest and vitality. Alternatively, it represents feelings of being overwhelmed and being dangerously confronted by something. Consider also if the dream is telling you that there is something that you need to &quot;get off your chest&quot;.<\/p><p>To dream that you are beating on your chest indicates triumph and a great accomplishment.<\/p><p>It is common for those who experience real life chest pains to have dreams where they are being shot in the chest or feel heavy pressure on their chest.<\/p><p>Dreaming of a storage chest or a wooden chest is symbolic of suppressing your own needs or feelings. You tend to put other's needs ahead of your own. Alternatively, a storage chest represents memories that you are holding onto.<\/p>"
    },
    {
        "title": "Chestnut Tree",
        "desc": "<p>To see a chestnut tree in your dream represents strength and good health.<\/p>"
    },
    {
        "title": "Chevron",
        "desc": "<p>To see a chevron in your dream symbolizes protection.<\/p>"
    },
    {
        "title": "Chew",
        "desc": "<p>To dream that you are chewing something suggests that you are sorting things out and carefully thinking it over.<\/p>"
    },
    {
        "title": "Chicago",
        "desc": "<p>To dream that you are in Chicago represents mainstream thinking. Known as the windy city, the dream may also indicate that your life is blowing in a new direction. You are experiencing extra vigor, vitality and energy in your life.<\/p>"
    },
    {
        "title": "Chick",
        "desc": "<p>To see a baby chick in your dream symbolizes youthful curiosity and innocence. The dream may also be a slang for a girl.<\/p>"
    },
    {
        "title": "Chickadee",
        "desc": "<p>To see a chickadee in your dream indicates that you need to pay attention and become aware of something unique and special occurring in your life.<\/p>"
    },
    {
        "title": "Chicken Suit",
        "desc": "<p>To dream that you are wearing a chicken suit implies that your subconscious is calling you a chicken. You are lacking confidence in yourself.<\/p>"
    },
    {
        "title": "Chickens",
        "desc": "<p>To see chickens in your dream symbolize cowardliness and a lack of willpower. The dream may be a pun on being a chicken or chickening out of some situation. Chickens also represent excessive chatter and gossip. Listen closely to what people may be saying about you or what you are saying about others.<\/p><p>Tosee a rubber chicken in your dream indicates that you are being too serious and need to lighten up. It is okay to be silly sometimes.<\/p><p>To dream that you are eating chicken implies fear. You are being a &quot;chicken&quot;. In particular, if you are eating fried chicken, then it refers to some unhealthy aspect that you need to cut from your life. Perhaps you are being too overindulgent. If you are eating raw chicken in your dream, then it indicates that you are feeling unprepared about some situation. You are having difficulties achieving your goals.<\/p>"
    },
    {
        "title": "Chief",
        "desc": "<p>To see a police chief in your dream indicates that you need to take accountability for your actions. There is a higher authority that you need to answer to. Alternatively, a police chief symbolizes a father figure in your waking life. Your attitude or impression of the chief is a reflection of your waking relationship with this father figure.<span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\"><\/p>"
    },
    {
        "title": "Chiffon",
        "desc": "<p>To see or wear chiffon in your dream represents your feminine and delicate side. It may also point to your vulnerabilities.<\/p>"
    },
    {
        "title": "Chihuahua",
        "desc": "<p>To see a Chihuahua in your dream represents someone around you who is unexpectedly vocal. It may also represent someone who is insecure. Alternatively, the dream may refer to a situation or relationship where the bark is larger than the bite.<\/p>"
    },
    {
        "title": "Child",
        "desc": "<p>To dream that you are a small child again suggests that you are feeling the burdens of adulthood. You are trying to escape from your daily responsibility and are looking for someone else to shield, protect and care for you.<\/p><p>To dream that you lose a child represents losing hope. It may also suggest that a project is not working out as you had wanted it to.<\/p><p>To save a child in your dream signifies your attempts to save a part of yourself from being destroyed. If you dream that you are separated from your children, then it symbolizes failure in some personal endeavor or a setback in some ideal you had.<\/p><p>To see a child fall down in your dream denotes lost innocence.<\/p>"
    },
    {
        "title": "Childhood",
        "desc": "<p>To dream of your childhood indicates your wish to return to a life where you had little responsibility and worries. It also represents innocence. Alternatively, it suggests that certain aspects of your childhood has not yet been integrated into your adult personality. On the other hand, some childhood anxiety has yet to be resolved in your adult life.<\/p>"
    },
    {
        "title": "Children",
        "desc": "<p>To see children in your dream signify an aspect of yourself and your childlike qualities. You may be retreating back to a childlike state and longing for the past. You are trying to still satisfy repressed desires and unfulfilled hopes. Perhaps there is something that you need to see grow and nurture. Take some time off and cater to the inner child within. Alternatively, the dream may be highlighting your innocence, purity, simplicity, and carefree attitude. If you are fighting with children, then it implies that you are repressing your inner child. The children could represent someone in your waking life (coworker, mate, sibling, etc.) who is acting like a child. If you see children fighting in your dream, then it means that your sense of morality and character are in conflict.<\/p><p>To forget about your child or children suggests that you are feeling overwhelmed by your waking responsibilities. The dream is telling you that you are overly fixating on minor details and overlooking the important things on your life. You need to re-prioritize your time and focus on what matters. To dream that your own grown children are still very young indicates that you still see them as young and dependent. You want to feel needed and significant.To dream that you have more children that you actually have in real life means that you are discovering old talents or skills that you have been casting aside.<\/p><p>To dream that you are watching children but they do not know you are there is a metaphor for some hidden knowledge or some latent talent which you have failed to recognize.<\/p><p>To save a child in your dream signifies your attempts to save a part of yourself from being destroyed. If you dream that you are separated from your children, then it symbolizes failure in some personal endeavor or a setback in some ideal you had.<\/p><p>To see children being abused in your dream implies that you are lacking a voice for your own inner child. You feel that a part of your own childhood is lost.<\/p>"
    },
    {
        "title": "Chili",
        "desc": "<p>To see or eat chili in your dream symbolizes intense passion and raw emotion. The dream may also be a metaphor for being &quot;chilly&quot;.<\/p>"
    },
    {
        "title": "Chills",
        "desc": "<p>To get the chills in your dream signify fear. Alternatively, it represents your indifference to some situation or person. The dream may be an actual physical reaction; perhaps the blankets have fallen off of you. Or the dream may be a metaphor indicating that you need to &quot;chill out&quot; or calm down.<\/p>"
    },
    {
        "title": "Chimera",
        "desc": "<p>To see a chimera in your dream represents a feeling of confusion. You need to sort out your thoughts and emotions.<\/p>"
    },
    {
        "title": "Chimes",
        "desc": "<p>To hear chimes in your dream symbolize tranquility. Alternatively, it means that there is something that you need to pay special attention to.<\/p>"
    },
    {
        "title": "Chimney",
        "desc": "<p>To see a chimney in your dream represents warmth, tradition, and family values. Alternatively, a chimney symbolizes the phallus. So if the chimney is smoking, then it represents sexual release. If it is not smoking, then it signifies sexual tension or your need for sexual release. If the chimney collapses, then it implies impotence.<\/p><p>To dream that you are sweeping the chimney indicates your need to vent off your frustrations and get things out in the open. You need to release all that negativity and\/or guilt that you are holding in.<\/p>"
    },
    {
        "title": "Chimpanzee",
        "desc": "<p>To see a chimpanzee in your dream suggests that what you thought was true is actually not. You are over-thinking an issue.<\/p>"
    },
    {
        "title": "Chin",
        "desc": "<p>To notice your chin in your dream refers to your resilience and your ability to bounce back from adversity. The chin often symbolizes character, strength, and resolve. Perhaps you need to &quot;keep your chin up&quot; and remain optimistic.<\/p>"
    },
    {
        "title": "Chinchilla",
        "desc": "<p>To see a chinchilla in your dream indicates that you are feeling emotionally content or satisfied. It is also symbolic of warmth. Alternatively, dreaming of a chinchilla suggests that you are high maintenance and in need of a lot of attention. Because chinchillas are desired because of their ultra soft fur, the dream may also reflect your stance on the fur industry.<\/p>"
    },
    {
        "title": "Chipmunk",
        "desc": "<p>To see a chipmunk in your dream suggests that you are holding on to the past and need to learn to let go.<\/p>"
    },
    {
        "title": "Chiropractor",
        "desc": "<p>To see a chiropractor in your dream suggests that you are seeking support and advice. Don't be afraid to ask for help when you need it; it is not a sign of weakness.<\/p>"
    },
    {
        "title": "Chisel",
        "desc": "<p>To see or use a chisel in your dream indicates that you need to forcibly break through the surface or barrier in order to get to the core of the situation or problem.<\/p>"
    },
    {
        "title": "Chives",
        "desc": "<p>To see or eat chives in your dream suggest that you get along well with others. The dream symbolizes harmony and balance.<\/p>"
    },
    {
        "title": "Chlamydia",
        "desc": "<p>To dream that you have chlamydia points to your negative attitude about sex. The dream may also be a warning that you need to practice safer sex.<\/p>"
    },
    {
        "title": "Chocolate To see chocolate in your dream signifies love, celebration and self-reward. It also suggests that you may be indulging in too many excesses and need to practice somerestraint. To eat chocolate in your dream indicates that you are embracing your own sensuality.",
        "desc": "<p>If you dream that chocolate is melting, then it implies disappointments that you are experiencing in your waking life. Alternatively, dreaming of melted chocolate means that you need to adapt to some change.<\/p>"
    },
    {
        "title": "Chocolate Milk",
        "desc": "<p>To see or drink chocolate milk in your dream means that you are feeling good about life.<\/p>"
    },
    {
        "title": "Choir",
        "desc": "<p>To dream that you are singing in a choir symbolizes spiritual harmony and balance. It also refers to your ability to work and cooperate with others. If you are singing out of tune, then it suggests that you are not fitting into some group situation.<\/p>"
    },
    {
        "title": "Choker",
        "desc": "<p>To see or wear a choker in your dreamindicates that you are having difficulties in expressing yourself. You maybe feeling constricted or voiceless in some waking situation.<\/p>"
    },
    {
        "title": "Choking",
        "desc": "<p>Choking dreams are often a fearful experience and it is not uncommon for dreamers to awaken from them. To dream that you are choking on an object suggests that you may find some advice\/remarks\/situation hard to swallow or difficult to accept. Alternatively, you may feel that you are unable to completely express yourself in a situation. In particular, if you are choking on food, then it may be an expression of self-guilt and unnurtured feelings. If you are choking on smoke, then it indicates something you are unwilling to confront.<\/p><p>To dream that someone is choking you indicates that you are suppressing your emotions. You have difficulties in expressing your fears, anger, or love. Consider the phrase &quot;being all choked up&quot;. Alternatively, you may feel that you are being prevented or restricted from freely expressing yourself.<\/p><p>To dream that you are choking someone signifies feelings of aggression. You may be trying to prevent something from being said or revealed.<\/p>"
    },
    {
        "title": "Chopping",
        "desc": "<p>To dream that you are chopping something indicates that you are trying to cut your problems into smaller, more manageable sizes. You need to break up the issues and attack them piece by piece. Consider also the significance of the object that you are chopping. Alternatively, the dream may be a metaphor for having the chops or the guts and fortitude to do something.<\/p>"
    },
    {
        "title": "Chopping Board",
        "desc": "<p>To see or use a chopping board or chopping block in your dream means that you need to take a risk or a stand. Be more decisive. Consider the idiom of &quot;being on the chopping block.&quot; Perhaps you are at risk of losing your job or being let go fo some commitment. Your performance is being scrutinized and questioned.<\/p>"
    },
    {
        "title": "Chopsticks",
        "desc": "<p>To see or use chopsticks in your dream indicates that you are trying to manipulate some situation. Alternatively, it represents an extension of your reach.<\/p><p>If you are using chopsticks for its unintended function, then it suggest that you are in a sticky situation.<\/p>"
    },
    {
        "title": "Choreographer",
        "desc": "<p>Todream that you are a choreographer represents freedom of expression. You feel unconstrained, unrestricted, and in charge of the direction that your life is taking. Your life is balanced and in harmony.<\/p>"
    },
    {
        "title": "Chores",
        "desc": "<p>* Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/h3.htm#Housework\">Housework.<\/p>"
    },
    {
        "title": "Chow Chow",
        "desc": "<p>To see a chow chow in your dream highlights an unwavering loyalty. You are also a little overly protective.<\/p>"
    },
    {
        "title": "Christ",
        "desc": "<p>To see Christ in your dream represents perfection of the self and spiritual truth. You need to achieve self-fulfillment through love. This symbol has many personal associations for you, depending on your belief.<\/p>"
    },
    {
        "title": "Christening",
        "desc": "<p>To dream of a christening symbolizes a renewal and fresh beginning. You may be undergoing a transformation where you want to better yourself as a person.<\/p>"
    },
    {
        "title": "Christian",
        "desc": "<p>To dream of Christianity relates to your own personal beliefs and religious experiences. It is a sign of inner growth and development of the Self. Alternatively, it may refer to a person in your life whose name is Christian.<\/p>"
    },
    {
        "title": "Christmas",
        "desc": "<p>To dream of Christmas symbolizes family togetherness,reunions, celebration, peace, goodwill, generosity, and human kindness. It is also representative of new beginnings and fresh starts. Consider also your own associations with this holiday.<\/p>"
    },
    {
        "title": "Christmas Card",
        "desc": "<p>To see or send a Christmas Card in your dream indicates that you are reaching out to loved ones and reconnecting with old ties. It is also symbolic of forgiveness. Time to swallow your pride and let the past go.<\/p>"
    },
    {
        "title": "Christmas Lights",
        "desc": "<p>To see or hang Christmas lights in your dream implies flexibility in how you see things.<\/p>"
    },
    {
        "title": "Christmas Tree",
        "desc": "<p>To see a Christmas Tree in your dream symbolizes family celebrations, gatherings, and familial relationships. You may be experiencing some anxieties and stress in your domestic life. It also signifies a passage of time, self-development, and spiritual enlightenment.Consider also the feelings and emotions you experience during this holiday season to help you decipher this dream symbol.<\/p><p>If your dream of a Christmas Tree occurs in December, it may indicate the expected pleasures, demanding responsibilities, and growing anxieties associated with the holiday season.<\/p>"
    },
    {
        "title": "Chrome",
        "desc": "<p>To see chrome in your dream suggests that you will experience a surge in energy and vitality. It is time to share your new ideas.<\/p>"
    },
    {
        "title": "Chrysalis",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c3.htm#Cocoon\">Cocoon.<\/p>"
    },
    {
        "title": "Chrysanthemums",
        "desc": "<p>To see chrysanthemums in your dream represent abundance, prosperity, humility, longevity, and gratitude. Alternatively, it may suggest that you need to keep silent about some situation.<\/p>"
    },
    {
        "title": "Church",
        "desc": "<p>To see the outside of the church in your dream signifies sacredness and spiritual nourishment. It is representative of your value system and the things you hold sacred.<\/p><p>To dream that you are inside a church suggests that you are seeking for spiritual enlightenment and guidance. You are looking to be uplifted in some way. Perhaps you have made some past mistakes which have set you back on your path toward your goals. With proper support, you will get on the right track again. Alternatively, the dream may also mean that you are questioning and debating your life path and where it is leading. You are reevaluating what you want to do.<\/p><p>Dreaming of a church bombing implies that you are not catering to your spiritual needs. Alternatively, to see or read about a church being bombed indicates that you are rejecting an aspect of yourself. You are harboring feelings of hostility.<\/p>"
    },
    {
        "title": "Churning",
        "desc": "<p>To dream that you are churning something indicates disorder and chaos. You need to direct your energies to more worthwhile endeavors.<\/p>"
    },
    {
        "title": "Churro",
        "desc": "<p>To see or eat a churro in your dream refers to life's sweet rewards. Sometimes you need to take a break from your daily problems. Alternatively, a churro may represent the phallus.<\/p>"
    },
    {
        "title": "Cicadas",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/l3.htm#Locusts\">Locusts.<\/p>"
    },
    {
        "title": "Cigar",
        "desc": "<p>To see or dream that you are smoking a cigar represents a relaxed state of mind. You are in control of your own emotions and passions. According to Freud, a cigar is a phallic symbol and is representative of masculinity and raw energy. This dream symbol may also serve as a symbol for someone you know who smokes cigars.<\/p>"
    },
    {
        "title": "To see dried or shriveled cigars may be a pun on your lack of a sex life.TOP",
        "desc": "<p>Cigarettes<\/p><p>To dream that you are smoking or offering a cigarette signifies your need for a break. It may also points to issues ofdependency . However if you are against smoking and have this dream, you need to analyze aspects of your waking life and what you are doing that may adversely affect your health.<\/p>"
    },
    {
        "title": "Cilantro",
        "desc": "<p>To see or eat cilantro in your dream represents immortality.<\/p>"
    },
    {
        "title": "Cincher",
        "desc": "<p>To wear a body cincher or waist trainer in your dream implies that you are trying to fit in. You are changing aspects of yourself in order to fit other people's ideals.<\/p>"
    },
    {
        "title": "Cinderella",
        "desc": "<p>To see or watch Cinderella in your dream indicates that a seemingly bad situation will work out for the best in the end. There is such thing as &quot;happily ever after&quot;.<\/p><p>To dream that you are Cinderella suggests that you are feeling overburdened. You are taking on too much. Alternatively, the dream means that you are feeling overshadowed, overlooked or neglected. You are not being recognized for your work.<\/p>"
    },
    {
        "title": "Cinnamon",
        "desc": "<p>To see or smell cinnamon in your dream suggests that you need to introduce a little spice into your life. You need to do something that is out of your character.Alternatively, the dream signifies renewal and purification.<\/p>"
    },
    {
        "title": "Cinnamon Bun",
        "desc": "<p>To see or eat a cinnamon bun in your dream represents the Self, wholeness, and completion. Alternatively, it symbolizes the sweeter things in life.<\/p>"
    },
    {
        "title": "Cinema",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/t2.htm#Theater\">Theater.<\/p>"
    },
    {
        "title": "Circle",
        "desc": "<p>To see a circle in your dream symbolizes perfection, completeness, immortality and\/or wholeness. On a less positive note, it may also mean that you are going around in circles in some situation. Or the circle can indicate monotony and endless repetition.<\/p><p>To see circles within circles in your dream indicate that you are well protected or that you are being overly guarded. You may need to let down your defenses. Alternatively, the dream may highlight the notion that you are going around in a vicious circle. You need to somehow find a way to break this circle.<\/p><p>To see an imperfect or incomplete circle in your dream suggests that you will face many obstacles and setbacks toward achieving your goals. You need to work on your inner self and develop more knowledge. Eventually, you will overcome these obstacles and find that your struggles are well worth it.<\/p><p>To see a circle with a cross symbolizes earth. It may also serve as guidance toward the center and self-orientation.<\/p>"
    },
    {
        "title": "Circuit Board",
        "desc": "<p>To see a circuit board in your dream refers to the steps and processes that need to be completed in order to produce a desired outcome. Some project that you are working on requires cohesive action. Alternatively, a circuit board is symbolic of something in your life that is keeping everything or everyone together.<\/p>"
    },
    {
        "title": "Circuit Breaker",
        "desc": "<p>To see or trigger a circuit breaker in your dream suggests that you are overloaded and overwhelmed. You are no longer functioning efficiently or properly. The dream may be metaphor telling you to take a break.Learn to prioritize and reorganize your tasks.<\/p>"
    },
    {
        "title": "Circumcise",
        "desc": "<p>To dream that you are being circumcised suggests that you are getting rid of an essential part of yourself. Alternatively, it may mean that you are regressing and cutting yourself off from feeling emotions.<\/p>"
    },
    {
        "title": "Circus",
        "desc": "<p>To dream that you are at the circus indicates your desires for a more exciting life. Alternatively, it suggests that you are easily influenced or lured into dangerous situations. Sometimes you are giving off the wrong impression to others. Consider the significance of the various acts you see in your dream.<\/p><p>To dream that the circus is abandoned or empty suggests that you are feeling excluded in some situation. You are feeling lonely.<\/p><p>To dream that there is chaos at the circus signifies that your life is out of control.<\/p>"
    },
    {
        "title": "Citation",
        "desc": "<p>To dream that you get a citation suggests that you need to reevaluate how you are going about your life as it might get you into trouble.<\/p>"
    },
    {
        "title": "Citizenship",
        "desc": "<p>To dream about your citizenship refers to your sense of belonging and pride. If you dream that you are not a citizen, then it means that you are feeling lost or rejected.<\/p>"
    },
    {
        "title": "Citrine",
        "desc": "<p>To see a citrine gemstone in your dream represents strength and personal power. You need to have more willpower and motivation in pursuing your goals.<\/p>"
    },
    {
        "title": "City",
        "desc": "<p>To see a city in your dream signifies your social environment and sense of community. If you dream of a big city, then it suggests that you need to develop closer ties and relationships. You are feeling alienated and alone. To dream that you are in a deserted city indicates that you feel rejected by those around you.<\/p><p>To dream of a city in ruins denotes that you are neglecting your social relationships and allowing them to deteriorate.<\/p><p>To dream of an underground or underwater city represents your subconscious and how through deeper understanding of yourself, you find commonality and shared experiences with others.<\/p><p>Dreaming of a city in the sky implies that you are being too idealistic. You have overly high hopes for those around you.<\/p>"
    },
    {
        "title": "City Hall",
        "desc": "<p>To see or dream that you are in City Hall indicates that you are experiencing a lack of support or power. You feel that you are being bullied or dominated by some powerful source.<\/p>"
    },
    {
        "title": "Civil Rights Movement",
        "desc": "<p>To dream about the 60's civil rights movement in the United Sates suggests that you may be feeling superior over others. Perhaps your ego is getting out of hand. More directly, the dream may be about how you are being unfairly treated in some waking situation. Or the dream is a call to action; you can make a change.<\/p>"
    },
    {
        "title": "Claddagh",
        "desc": "<p>To see a claddagh in your dream symbolizes love loyalty and friendship. In particular, to give or wear a claddagh ring in your dream signifies your commitments and convictions when it comes to love loyalty and friendship.<\/p>"
    },
    {
        "title": "Clairvoyant",
        "desc": "<p>To dream that you are clairvoyant suggests that you are experiencing total clarity in a situation or problem. You are feeling peace of mind.<\/p>"
    },
    {
        "title": "Clam",
        "desc": "<p>To see or eat a clam in your dream refers to your stubbornness and tenacity. If the clam is closed, then it suggests that you are emotionally cold or withdrawn. You are shutting others out and not letting them in on your problems and feelings.<\/p>"
    },
    {
        "title": "Clamp",
        "desc": "<p>To clamp something in your dream indicates that you need to hold it together, especially when others are prone to losing control.<\/p>"
    },
    {
        "title": "p",
        "desc": "<p>To dream that you clap your hands means that you are seeking attention. You want the focus to be on you. Alternatively, a clap signifies hesitation in expressing how you really feel.<\/p><p>To hear a clap in your dream implies that there is something you need to pay close attention to.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/a3.htm#Applause\">Applause<\/p>"
    },
    {
        "title": "Clapperboard",
        "desc": "<p>To see or use a clapperboard in your dream symbolizes your quest for fame and glamour. Alternatively, the dream refers to the many chances and opportunities that you come across in life.<\/p>"
    },
    {
        "title": "Clarinet",
        "desc": "<p>To see or play a clarinet in your dream suggests that you need to adjust your tone of voice.<\/p>"
    },
    {
        "title": "Class",
        "desc": "<p>To dream that you are in class is a metaphor that you need to have more class.<\/p><p>To dream that you forget to attend a class you signed up for indicates your anxieties and fear of failing. You may also be lacking self-confidence in your ability to handle new responsibilities or projects.<\/p>"
    },
    {
        "title": "Classic Car",
        "desc": "<p>To see or drive a classic car in your dream signifies longevity and long term goals. You have come a long way from where you first started.<\/p>"
    },
    {
        "title": "mates",
        "desc": "<p>To see old classmates in your dream indicate that you need to draw on your old associations with your former classmates to gain insight in some current relationship. It represents a past lesson that you have learned and is applicable in some aspect of your waking life now.<\/p>"
    },
    {
        "title": "Classroom",
        "desc": "<p>To dream that you are in a classroom indicates that you are learning an important life lesson. Alternatively, it symbolizes personal growth. You are learning something about yourself.<\/p><p>To dream that you are looking for a classroom suggests that you need to expand your knowledge and learning.<\/p><p>To dream that a classroom is outdoors indicates that you need to learn to be more free and open. Learn to adapt to various situations.<\/p>"
    },
    {
        "title": "Claustrophobia",
        "desc": "<p>To dream that you have claustrophobia suggests feeling of self-guilt. You fear that you will be punished for your past's actions.<\/p>"
    },
    {
        "title": "Claw Machine",
        "desc": "<p>To see or play with a claw machine or claw crane in your dream points to something in your waking life that is within reach, but continues to escape your grasp.<\/p>"
    },
    {
        "title": "Claws",
        "desc": "<p>To see claws in your dream signify feelings of vulnerability and\/or hostility. You feel a need to defend or protect yourself or your surroundings. You also need to be careful with your words and actions.<\/p>"
    },
    {
        "title": "ay",
        "desc": "<p>To see or work with clay in your dream represents creativity, flexibility and the ability to shape your mind or mold yourself to fit into a situation. It may also mean that you are able to manipulate things to your advantage. Alternatively, it indicates your need to set some goals and plans for yourself. You have some growing up to do and need to plan for the future. According to Freudian perspective, clay symbolizes feces.<\/p><p>To see a clay pot in your dream signifies devotion, virtue or purity. The clay pot is also a healing symbol.<\/p>"
    },
    {
        "title": "Clean Shaven",
        "desc": "<p>If someone normally has facial hair, but you dream that he is clean shaven, then it means that he is ready to come clean about something. He is ready to be open and direct about his feelings or thoughts.<\/p>"
    },
    {
        "title": "Cleaners",
        "desc": "<p>To dream that you are at the cleaners warns that someone may be &quot;taking you to the cleaners.&quot; Someone may be taking advantage of your. Alternatively, you may need to clear up a matter without getting overly emotional.<\/p>"
    },
    {
        "title": "Cleaning",
        "desc": "<p>To dream that you are cleaning implies that you are removing some negativity in your life and overcoming major obstacles. You are moving ahead toward a new stage in your life. In particular, if you are cleaning your house, then it means that you need to clear out your thoughts and get rid of your old ways and habits. You are seeking self-improvement.Alternatively, the dream may be a metaphor that you need to &quot;come clean&quot; or tell the whole truth about some situation or matter.<\/p><p>To dream that you are cleaning an object represents an aspect of yourself that is not working or functioning as well as it should. If you are cleaning the refrigerator or oven, then it indicates that you are getting to root of a matter or situation. It may also indicate feeling so negativity and inferiority. You feel stuck in some area of your life.<\/p><p>To dream that you are cleaning out a desk suggests that you are getting rid of the burdens that has been weighing you down. You are acknowledging your new choices, decisions, and a new sense of freedom.<\/p>"
    },
    {
        "title": "Clearance",
        "desc": "<p>To dream that something is on clearance suggests that you are selling yourself short. You may be feeling undervalued or under appreciated. Alternatively, it indicates an old habit or characteristic that you need to clear out and rid yourself of.<\/p>"
    },
    {
        "title": "Cleaver",
        "desc": "<p>To see or use a cleaver in your dream indicates that there is something in your life that you need to cut out and get rid of. Perhaps you are trying to break off some relationship or sever your ties with your work. Alternatively, a cleaver symbolizes anger, aggression and fear. It could also be telling you to break your problems up into smaller conquerable chunks.<\/p>"
    },
    {
        "title": "Clef",
        "desc": "<p>To see a clef in your dream symbolizes harmony and cooperation. It is also reflective of your mood where a treble clef indicates joy and a carefree attitude and a bass clef indicates sadness or seriousness.<\/p>"
    },
    {
        "title": "Cleopatra",
        "desc": "<p>To see Cleopatra in your dream indicates that you are in danger of being seduced by some uncontrollable force.<\/p><p>To dream that you are Cleopatra suggests that you are acknowledging your own beauty and sexual appeal.<\/p>"
    },
    {
        "title": "Clergyman",
        "desc": "<p>**Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p4.htm#Preacher\">Preacher.<\/p>"
    },
    {
        "title": "Client",
        "desc": "<p>To see a client in your dream refers to your position of power. Consider the position that you are in and the significance of the services that you are providing. If you dream that you are a client, then it means that you are looking for some sort of approval and validation of your ideas.<\/p>"
    },
    {
        "title": "Cliff",
        "desc": "<p>To dream that you are standing at the edge of a cliff indicates that you have reached an increased level of understanding, new awareness, and a fresh point of view. You have reached a critical point in your life and cannot risk losing control. Alternatively, it suggests that you are pondering a life-altering decision.<\/p><p>To dream that you or someone falls off a cliff suggests that you are going through a difficult time and are afraid of what is ahead for you. You fear that you may not be up for the challenge or that you cannot meet the expectations of others.<\/p><p>To dream that you are climbing to the top of a cliff symbolizes your ambition and drive. The dream may parallel your desires to achieve success and to be the at the top of your profession. It is analogous to climbing the corporate ladder.<\/p>"
    },
    {
        "title": "Climate",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/w2.htm#Weather\">Weather.<\/p>"
    },
    {
        "title": "Climb",
        "desc": "<p>To dream that you are climbing up something (ladder, rope, etc.) signifies that you are trying to or you have overcome a great struggle. It also suggests that your goals are finally within reach. Climbing also means that you have risen to a level of prominence within the social or economic sphere.<\/p><p>To dream that you are climbing down something indicates that you need to acknowledge and take notice of your subconscious. You are expressing some hesitance and reservation with delving into your more negative feelings. Alternatively, it suggests that you may be feeling low or emotionally drained.<\/p>"
    },
    {
        "title": "Clinic",
        "desc": "<p>To dream that you are in a clinic implies that you need to work on your spiritual, emotional and\/or physical well-being. Consider the significance of what you are getting checked at the clinic.<\/p>"
    },
    {
        "title": "Clipboard",
        "desc": "<p>To see or use a clipboard in your dream suggests that you are under scrutiny. You feel that you are being judged or criticized for your choices and actions. Alternatively, the dream may mean that your opinions and views are valued by others.<\/p>"
    },
    {
        "title": "Cloak",
        "desc": "<p>To dream that you are wearing a cloak signifies the need for security and warmth. You want to be protected. It may also mean that you are trying to cover-up or hide something.<\/p><p>If see a torn or ragged cloak in your dream signifies a separation between you and a friend or lover.<\/p>"
    },
    {
        "title": "Clock",
        "desc": "<p>To see a clock in your dream signifies the importance of time in some waking situation. You may be feeling some anxiety of not being on top of things. Your mind may be preoccupied with a deadline that you have to meet or some other time-sensitive issue. It is time for you to tread on and speed up your actions. If the clock is chiming, then it suggests that time is running out. Alternatively, clocks symbolize the ticking of the human heart and thus is indicative of the emotional side of your life.If the clock has stopped, then it signifies death. This is a common theme for the terminally ill or the dying. Consider the time shown on the clock and determine the significance of the numerals or of the time.<\/p><p>To dream that the time on a clock is moving or speeding out of control symbolizes some overwhelming task or emotion that you are going through in your waking life. Time is not on your side.<\/p><p>To dream that a clock is moving backwards parallels the way that your life is going. Instead of moving forward and progressing toward your goals, you feel that you have not made any significant accomplishments. You feel you are stuck in a rut.<\/p><p>To dream that you are winding or setting a clock suggests that you need to put more effort toward a task in order to obtain the desired result or outcome.<\/p>"
    },
    {
        "title": "Clock Tower",
        "desc": "<p>To see a clock tower in your dream indicates that you will be recognized for your work.<\/p>"
    },
    {
        "title": "Clogged",
        "desc": "<p>To dream that the drain is clogged up indicates that you need to remove some obstacle or blockage that is hindering your progress.<\/p>"
    },
    {
        "title": "Clogs",
        "desc": "<p>To wear clogs in your dream signify your firm and solid foundation. The dream may also be a pun on feeling clogged. Perhaps you are feeling overloaded or overwhelmed. On the other hand, you are not expressing your feelings and harbor some pent up anger.<\/p><p>To dream that you are clogging or clog dancing signifies the beat and rhythm of your life. You are expressing your enthusiasm and zest for life.<\/p>"
    },
    {
        "title": "Clone",
        "desc": "<p>To dream that you have a clone suggests that you are either in harmony with or in conflict between ideas and decisions. Alternatively, the dream indicates that you are overburdened. You are spread to thin and feel that you need to clone yourself in order to get what you need to get done.<\/p><p>To dream that you have many clones represent your lack of originality. You have a tendency to copy other's ideas\/beliefs. You need to start thinking things through for yourself.<\/p>"
    },
    {
        "title": "Closed",
        "desc": "<p>To dream that a door is closed represents an aspect of your life or an opportunity that is closed off to you. It may also refer to sexual secrets or activities.<\/p><p>To dream that the store is closed signifies your inability to consider other alternatives and other viewpoints. You may be biased in your judgment and opinion. Alternatively, it also represents feelings of inadequacy and frustration. Something is missing from your life.<\/p>"
    },
    {
        "title": "Closet",
        "desc": "<p>To see a closet in your dream symbolizes something in your life that you have kept hidden. It may also signify an unveiling of previously hidden aspects of yourself, as in &quot;coming out of the closet&quot;.<\/p><p>Dreaming that you are hiding in the closet implies that you are trying to protect yourself from getting hurt, either emotionally or even physically. You are afraid of letting others get to know the real you.<\/p>"
    },
    {
        "title": "Cloth",
        "desc": "<p>To see cloth in your dream represents components and various pieces that composes your life. Consider the color for additional significance. It may hint of your outlook and how things are going in your life.<\/p>"
    },
    {
        "title": "thesline",
        "desc": "<p>To dream that you are hanging clothing on a clothesline suggests that you are revealing hidden aspects of yourself, especially if they are underwear. The dream may also signify your hang-ups. In particular, if you are hanging white clothes in the backyard, then it indicates your desire for pureness and to be cleansed. You may also be proclaiming your innocence in some situation. Or perhaps the dream is telling you not to &quot;air out your dirty laundry.&quot;<\/p>"
    },
    {
        "title": "Clothing",
        "desc": "<p>To dream of your clothes is symbolic of your public self andhow you are perceived. It is indicative of the act you put on in front of others. Clothes are also an indication of your condition and status in life. Thus, if you wear clothes that do not suit you or that you normally would not wear, then it suggests that you are putting up a front and trying to deceive others. Something in your life is &quot;unsuitable&quot;. It may be a symbol of hypocrisy and being someone that you are not. Alternatively, it could also mean that you are revealing a hidden part of yourself to the world.<\/p><p>To dream that your clothes are soiled and you are trying to clean them signifies your attempts to change something about your character. You may need to change your old habits and old ways of thinking.<\/p><p>To dream that you are wearing brand new clothes signifies new attitudes and a new persona. You are finding a different way of expressing yourself. If the price tags are still attached to the clothes, then it suggests that you are trying too hard to adapt to this new attitude. Perhaps it is not who you really are and you are not quite fitting in.<\/p><p>To dream that you are constantly changing your clothes represents the need for change and your need to fit into a new situation or role. You need to establish a new self-image.<\/p><p>To dream that your clothes fit too tightly denote that you feel restricted in some way. You may feel constrained in a relationship or held back at work.<\/p><p>To dream that your clothes fit too loosely or is oversized implies that you are feeling inadequate. You may also be suffering from low self esteem. In a way, you are trying to hide from the world.<\/p><p>If you are wearing inappropriate clothes for a situation, then it means that you are unprepared for the task at hand.<\/p><p>To dream that your clothing is torn or ripped indicates that there are some flaws in your thinking or thought process. Your logic is not making sense. You need to alter your reasoning and make a stronger argument.<\/p><p>To dream that you are shopping for or buying clothes represents your anxieties about trying to fit in or being &quot;well-suited&quot; for your changing role.<\/p><p>If you dream of receiving clothing or of someone giving you clothing means that you are trying to fit the image of what someone wants you to be.<\/p><p>To dream that all your clothes in the closet are white suggests that you need to lighten up. You may have recently been feeling a little depressed. Perhaps you are going through some crisis. It is time to move on. and change your attitude. You need to better get a grip of your inner emotions.<\/p><p>To dream that you are wearing only black clothes refer to your desires to blend in. You may be representing your shadow persona and expressing your subconscious thoughts. If you normally wear black clothes in your waking life, then the dream may simply be a reflection of yourself.<\/p><p>To dream that your clothes are worn inside out represents your non-conformist attitude. You like to go against what everybody else says.If you turn your clothes inside out in your dream, then it suggests that you are trying to protect yourself against something. You don't want to get hurt.<\/p><p>To dream that every one else is wearing the exact same clothes except for you implies that you are feeling like an outsider in some situation. You feel that others are against you or that you are standing out of a crowd in a negative way. Alternatively, the dream means that you are the voice of dissension and are going against the popular opinion.<\/p><p>Dreaming that you are pulling clothes out of a lake or river symbolizes cleansing of past sins.<span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">It may also mean that you are shedding your old identity.<\/p>"
    },
    {
        "title": "Clothing Store",
        "desc": "<p>To dream that you are in a clothing store means that you are looking for a new image. You want to be perceived in a different way. Alternatively, dreaming that you are in a clothing store indicates that you are experiencing anxieties about fitting in or being suited for some position or role.<\/p>"
    },
    {
        "title": "Clothes Hanger",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/h.htm#Hanger\">Hanger.<\/p>"
    },
    {
        "title": "Clothespin",
        "desc": "<p>To see a clothespin in your dream indicates that you are trying to control what is being revealed about yourself and your character. You are trying to get a firmer grasp on your public self.<\/p><p>To dream that you are pinching your nose with a clothespin suggests that you are above the situation at hand. The situation does not deserve your time or attention.<\/p>"
    },
    {
        "title": "Clouds",
        "desc": "<p>To see fluffy, white clouds in your dream signify inner peace, spiritual harmony and compassion. An issue in your waking life may be clearing up.<\/p><p>To see dark or stormy clouds in your dream symbolize depression or anger. It indicates an impending eruption of emotions. Alternatively, it represents a lack of wisdom or confusion in some situation. Thus, the dream may be a metaphor for your &quot;clouded&quot; way of thinking.<\/p>"
    },
    {
        "title": "Clover",
        "desc": "<p>To see a three-leaf clover in your dream symbolizes the past, present, and future.<\/p><p>To see a four-leaf clover in your dream represents good luck and happiness. The four leaves symbolize fame, wealth, good health, and love. Alternatively, the dream suggests that you have successfully come to a resolution of some problem.<\/p><p>To see a field of white clovers means that opportunities are just out of your reach.<\/p>"
    },
    {
        "title": "Cloves",
        "desc": "<p>To see or taste cloves in your dream represent love protection and domestic bliss.<\/p>"
    },
    {
        "title": "Clown",
        "desc": "<p>To see a clown in you dream symbolizes absurdity, light-heartedness, and a childish side to your own character. The countenance of the clown is a reflection of your own feelings and emotions. Whether it is a happy clown or a sad clown, that will help guide you through how you may be feeling. The actions of the clown signifies your uninhibited nature. Alternatively, a clown is an indication of your thoughtless or insincere actions.<\/p><p>If you have a fear or phobia of clowns, the clown may represent a mysterious person in your life who mean you harm. Somebody you know may not be who they appear to be.Or somebody may be pretending to be somebody they are not and are hiding under a facade.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/j.htm#jester\">Jester.<\/p>"
    },
    {
        "title": "Club",
        "desc": "<p>To see a club in your dream denotes feelings of aggression or submission depending if the club is used by or against you. You may have some unexpressed anger that is on the verge of boiling over. It is also symbolic of virility and combativeness.<\/p><p>To dream that you are in a night club or dance club represents the social aspects of your life and your sense of belonging. The dream could be a commentary on your lifestyle. Perhaps you need to settle down a little.<\/p><p>To see the clubs of a deck of card in your dream indicate work and industry.<\/p>"
    },
    {
        "title": "Clubbing",
        "desc": "<p>To dream that you are clubbing represents your sense of belonging. More directly, the dream suggests your need to relax and let loose or that you need to settle down a little.<\/p>"
    },
    {
        "title": "ue",
        "desc": "<p>To dream that you find a clue represents some information or some thing is coming into your consciousness. The dream is also a sign that you need to be more aware of your surroundings.<\/p>"
    },
    {
        "title": "Clumsy",
        "desc": "<p>To dream that you or someone is clumsy suggests that some situation or relationship is not going smoothly in your life. You need to take it easy and not be too hard on yourself.<\/p>"
    },
    {
        "title": "Clutter",
        "desc": "<p>To see clutter in your dream indicates that you need to clean up and organize a certain aspect of your life. The dream could be telling you that you need to let go of the past.<\/p>"
    },
    {
        "title": "Coach",
        "desc": "<p>To see or dream that you are a coach indicates that you need to be more self-disciplined.<\/p>"
    },
    {
        "title": "Coal",
        "desc": "<p>To see a coal in your dream represents wealth and prosperity. It also points to your unused potential. Alternatively, it indicates that you have been misbehaving and have been caught in the act.<\/p><p>To dream that you or someone is walking on coals indicates that you will overcome adversity. Nothing is impossible if you put your mind to it.<\/p>"
    },
    {
        "title": "Coast",
        "desc": "<p>To see the coast in your dream suggests that you are on a spiritual quest. The coast symbolizes the meeting between your two states of mind - the rational and the irrational. Alternatively, the dream may be a metaphor of how you are &quot;coasting&quot;. through life. You may need to take things more seriously.Or the dream may be telling you that &quot;the coast is clear&quot;. You are free to move ahead.<\/p>"
    },
    {
        "title": "Coat",
        "desc": "<p>To see or wear a coat in your dream symbolizes your protectiveness and defensive persona. You may be isolating yourself. Consider also the color, appearance, and type of coat for additional significance.<\/p><p>To dream that a coat is old, worn, or shabby suggests that you are feeling down on yourself.<\/p><p>To see or wear a fur coat in your dream symbolizes prosperity and luxury. It also indicates your need for attention and your need to be admired.<\/p>"
    },
    {
        "title": "Coat Of Arms",
        "desc": "<p>To see a coat of arms in your dream represents your familial roots and identity.<\/p>"
    },
    {
        "title": "Cobra",
        "desc": "<p>To see a cobra in your dream represents creation and creative energies. Some situation or relationship has you hypnotized.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s3.htm#Snake\">Snake.<\/p>"
    },
    {
        "title": "Cobwebs",
        "desc": "<p>To see cobwebs in your dream suggest that you have not reached your full potential. Your talents are not being utilized. Alternatively, the dream indicates that you are neglecting your responsibilities, talents, or some issue.<\/p>"
    },
    {
        "title": "Cocaine",
        "desc": "<p>To dream that you are taking cocaine indicates that you are feeling empty and devoid of emotions. You are looking to get out of your commitments or denying your responsibilities. You lack ambition. On a more positive note, the dream may be telling you that you need to be more lively and energetic.<\/p>"
    },
    {
        "title": "Cock",
        "desc": "<p>To see a cock in your dream symbolizes masculinity, pride, valor, cockiness and arrogance. It indicates that you or someone is being a show-off. You have little or no regards for others.The dream may also be a pun on the penis.<\/p><p>To hear a rooster in your dream signifies bragging and self-glorification.<\/p><p>To see cocks fighting in your dream indicate an attack on your masculinity.<\/p>"
    },
    {
        "title": "Cockatiel",
        "desc": "<p>To see a cockatiel or cockatoo in your dream implies that you tend to wear your emotions of your face. You are not one to hide your true feelings. Dreaming of a white cockatoo indicates that you are feeling calm.<\/p>"
    },
    {
        "title": "Cocker Spaniel",
        "desc": "<p>To see a cocker spaniel in your dream symbolizes your alertness. The appearance of a spaniel may mean that you are looking for companionship. You are ready for a relationship.<\/p>"
    },
    {
        "title": "Cockerel",
        "desc": "<p>To see a cockerel in your dream symbolizes male aggression and masculinity. The dream may also be a warning of some kind.<\/p>"
    },
    {
        "title": "Cockfight",
        "desc": "<p>To watch or participate in a cockfight in your dream implies that you masculinity or pride is under attack. You feel the need to defend your masculinity.<\/p>"
    },
    {
        "title": "Cockpit",
        "desc": "<p>To dream that you are in a cockpit of a plane suggests that you need to take a leadership role and show that you are in control of the situation. You need to prove yourself.<\/p>"
    },
    {
        "title": "Cockroach",
        "desc": "<p>To see a cockroach in your dream symbolizes uncleanness. It also signifies longevity, tenacity and renewal. You need to reevaluate major aspects of your life. Alternatively, the dream represents an undesirable aspect of yourself in which you need to confront. A roach may also be a pun on smoking marijuana.<\/p><p>To dream that two cockroaches are fighting in the kitchen implies that you are undergoing a spiritual conflict. You need to acknowledge and confront the issue in order to complete your transformation and achieve wholeness.<\/p><p>To dream that you have pet cockroaches kept in an aquarium implies that you are trying to contain your negative attributes.<\/p><p>To see a white cockroach in your dream with the word &quot;soap&quot; on it symbolizes uncleanness. The dream is telling you that you may be able to physically cleanse yourself, but are unable to cleanse yourself spiritually and\/or mentally.<\/p><p>To dream that Madagascar hissing cockroaches are coming out of your ears indicate that someone is trying to provoke you into doing or saying something your might regret. You need to show some restraint before reacting. Alternatively, the dream represents your fear over something you heard.<\/p><p>*See the meaning in action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=roachdream1\">Crawling Cockroaches&quot;<\/p>"
    },
    {
        "title": "Cocktails",
        "desc": "<p>To dream that you are drinking cocktails indicate your need for some relaxation. You need to escape and get away from the daily grind and unwind.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/a2.htm#Alcohol\">Alcohol.<\/p>"
    },
    {
        "title": "Cocoa",
        "desc": "<p>To dream that you are eating cocoa refers to relaxed state of mind. You are enjoying life.<\/p>"
    },
    {
        "title": "Coconuts",
        "desc": "<p>To see a coconut in your dream foretells of unexpected rewards.<\/p>"
    },
    {
        "title": "Cocoon",
        "desc": "<p>To see a cocoon on your dream signifies a place of safety and solitude. It may also represent transformation or healing.<\/p><p>To dream that you are in a cocoon represents your need to rejuvenate and restore your body, mind and spirit. You may be recreating new paths of expression and perhaps a rebirth. Alternatively, it symbolizes your unrealized potential and possibilities.<\/p>"
    },
    {
        "title": "Coffee",
        "desc": "<p>To dream that you are drinking or need your coffee suggests that you need to gain some insight and knowledge before making a decision or tackling some project\/relationship. You may be acting too hasty and need to slow down. Alternatively, it may imply a need for you to change your routine.<\/p><p>To dream that you are drinking coffee with someone indicates that you might have feelings for that person. Alternatively, having coffee with someone denotes your hospitality and sociability.<\/p><p>To see a coffee pot in your dream signifies hospitality and sharing of knowledge, hopes, concerns and\/or ideas. It may also represent neighborliness, comfort, and companionship.<\/p><p>Dreaming of dry coffee grounds refers to your readiness for change. To dream that you have a mouth full of dry coffee grounds point to a decision that you are having a hard time accepting.<\/p><p>If you dream that you are trying to make coffee, but encounter a problem (i.e. broken coffee maker, looking for a measuring spoon, using too much water or coffee grounds), then it suggests that you are trying too hard to please others.<\/p>"
    },
    {
        "title": "Coffee Bean",
        "desc": "<p>To see a pile of coffee beans in your dream represent your potential. You have some energy stored up waiting to be utilized. Alternatively, dreaming about coffee beans point to something that requires your prompt attention.<\/p>"
    },
    {
        "title": "Coffee Maker",
        "desc": "<p>To see a coffee maker in your dream represents a disturbance in your psyche and well-being. You are feeling off-balanced. Alternatively, the dream could also mean your level of alertness. Consider the phrase &quot;wake up and smell the coffee&quot;.<\/p>"
    },
    {
        "title": "Coffee Shop",
        "desc": "<p>To dream that you are at a coffee ship indicates that it is time to catch up with old friends. It is symbolic of social gatherings and merriment.<\/p>"
    },
    {
        "title": "Coffee Table",
        "desc": "<p>To see a coffee table in your dream signifies your social circle and togetherness.<\/p>"
    },
    {
        "title": "Coffin",
        "desc": "<p>To see a coffin in your dream symbolizes the womb. It also signifies your thoughts and fears of death. If the coffin is empty, then it denotes irreconcilable differences. Alternatively, the coffin represents ideas and habits that are no longer of use and can be buried. In particular, if the coffin is white, then it refers to lost innocence.<\/p><p>To dream of seeing a body or dream of seeing yourself in a coffin suggests that you are going through a period of depression. You are feeling confined, restricted and lacking personal freedom. There may be a dead or decaying situation or issue in your life that you need to address. It is time to end this situation or relationship.<\/p>"
    },
    {
        "title": "ins",
        "desc": "<p>To see coins in your dream indicate missed or overlooked opportunities that have come your way. To see gold coins in your dream represent success and wealth. Silver coins represent spirituality, intuition, values, and your sense of self-worth. Copper coins indicates healing.<\/p><p>To see coins stacked in your dream symbolize masculine power, dominance, and energy.<\/p><p>To dream that you are flipping a coin represents your casual attitude about making some decision. You may also not be taking responsibility for your decisions. Alternatively, it indicates your irrational thoughts.<\/p>"
    },
    {
        "title": "Cola",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s3.htm#Soda\">Soda.<\/p>"
    },
    {
        "title": "Colander",
        "desc": "<p>To see or use a colander in your dream indicates that you are unable to keep your emotions contained. Alternatively, the dream suggests that you need to separate your feelings from a situation and try to be more objective.<\/p>"
    },
    {
        "title": "Cold",
        "desc": "<p>To dream that you are cold indicates that you are experiencing a breakthrough in some area in your life. Alternatively, you may be feeling isolated or emotionally restrained. Your sense of coldness could reflect your feelings about a lover or a certain person. The dream may also occur as a result of your immediate environment in which you are really feeling cold.<\/p><p>To see the word cold in your dream suggests that you need to be more neutral or objective in your decision making. You need to remain emotionally detached.<\/p><p>To dream that you touch something cold suggests that you should avoid that object or what that object represents in your waking life.<\/p>"
    },
    {
        "title": "Cold Sore",
        "desc": "<p>To dream that you have a cold sore indicates that you have expressed some hurtful words. You are regretting something you have said.<\/p>"
    },
    {
        "title": "Coliseum",
        "desc": "<p>To dream that you are performing in a Roman coliseum implies that you are making a spectacle of yourself, either in a positive or negative way. If you dream of a coliseum in ruins, then it represents longevity and\/or something that is leaving a lasting impression. Alternatively, the dream suggest that you are neglecting the performer within yourself.<\/p>"
    },
    {
        "title": "Collapse",
        "desc": "<p>To dream that you collapse indicates that you are pushing yourself too hard. You have lost sight of your goals and what you need to accomplish. You may also be having difficulties trusting your own judgment and decisions.<\/p>"
    },
    {
        "title": "Collar",
        "desc": "<p>To see a collar in your dream signifies confinement and restraint. You may be going through a frustrating work situation or a confining relationship.<\/p><p>To dream that you have ring around the collar indicates that you need to clean up your language and the way you talk to others.<\/p>"
    },
    {
        "title": "Colleague",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c5.htm#Coworker\">Coworker.<\/p>"
    },
    {
        "title": "Collections",
        "desc": "<p>To dream that you are dealing with collections suggests that you are feeling picked on or harassed. Alternatively, it indicates that you may be too proud to ask for help.<\/p>"
    },
    {
        "title": "College",
        "desc": "<p>To dream that you are in college indicates that you are going through some social or cultural changes. You want to expand your knowledge and awareness. It also suggests that now is a good time for you to experiment and try new things. If you had gone to college in your past, then also consider your personal experiences and memories of your college days. However, if you are currently in college, then it may be a reflection of your current surroundings. Alternatively, the dream suggests that you will achieve your goals through perseverance and hard work. You may be going through a period of stress in your life.<\/p>"
    },
    {
        "title": "Collision",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c5.htm\">Crash.<\/p>"
    },
    {
        "title": "Colonel",
        "desc": "<p>To see a colonel in your dream suggests that you need to be mindful of other's feelings.<\/p><p>To dream that a colonel is stripped of their rank indicates that something will not go according to your plan.<\/p>"
    },
    {
        "title": "Colorado",
        "desc": "<p>If you have never been to Colorado and have a dream that you are in Colorado, then it suggests that you need to get out and enjoy what nature has to offer.<\/p>"
    },
    {
        "title": "Coloring Book",
        "desc": "<p>To see or color in a coloring book symbolizes childhood. It indicates that you have a carefree attitude, free from any responsibilities. On the other hand, the dream may be warning you against being idle and wasting time on fruitless pursuits. Consider the significance of the color you are using and what you are coloring.What is depicted in the coloring book suggests that you need to be more expressive in that area.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c5.htm#Crayons\">Crayons.<\/p>"
    },
    {
        "title": "Colorless",
        "desc": "<p>To have a colorless dream suggests a depressed mood and a feeling of sadness. You may be shutting yourself off from others."
    },
    {
        "title": "Colors",
        "desc": "<p>Colors in dreams represent energy, emotions, and vibes. First consider what that single color in your dream means to you and your own personal associations and relationship with that color.In general, pale pastel colors indicate weakness or subtlety. Dark colors represent passion and intensity. Bright colors mean awareness.<\/p><p>To dream in color and then dream in black and white suggests that you are starting to look at a situation from a more objective perspective instead of from an emotional standpoint. You are subconsciously reacting to events in the dream.<\/p><p>Please see<a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/colors.htm\">Dream Moods Dream Themes: Colors.<\/p>"
    },
    {
        "title": "Colt",
        "desc": "<p>To see a colt in your dream suggests that you are feeling awkward and insecure. You may also be starting to unleash your unused potential.<\/p>"
    },
    {
        "title": "Column",
        "desc": "<p>To see columns in your dream symbolize strength and hard work. You may be feeling burdened or drained in some way or that you find yourself needing to support others.<\/p>"
    },
    {
        "title": "Coma",
        "desc": "<p>To dream that you are in a coma indicates your helplessness and inability to function in some given situation. You are not prepared for the major changes that are happening around you. Alternatively, your dream coma state may reflect what is really happening to your body when you are in the dream stage of sleep. In this stage of sleep, your body remains immobile as if it was paralyzed; commonly referred to as REM paralysis.<\/p>"
    },
    {
        "title": "Comb",
        "desc": "<p>To dream that you are combing your hair suggests your need to organize and sort your thoughts. You need to search for some elements that are not clear to you in a situation or relationship. Alternatively, combing you hair may highlight your preoccupation with appearances and beauty over substance and quality.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/h.htm#hair\">Hair:<\/p>"
    },
    {
        "title": "Combination Lock",
        "desc": "<p>To see or use a combination lock in your dream indicates that you are shutting yourself down and not letting others in. Consider the numbers in the combination for additional significance.<\/p><p>To dream that you forgot your combination indicates that you are reluctant in fully expressing yourself. Something is holding you back. Alternatively, the dream may also parallel a date or appointment that you have forgotten.<\/p>"
    },
    {
        "title": "Combustion",
        "desc": "<p>To see a combustion in your dream represents violent rage or sudden anger. You have kept your feelings inside for too long and it is erupting uncontrollably.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/f2.htm#Fire\">Fire.<\/p>"
    },
    {
        "title": "Comedian",
        "desc": "<p>To see or dream that you are a comedian suggests that you need to be more carefree. You are feeling overburdened from your daily problems and need an outlet to release all that tension. You need to learn to laugh at yourself and not take yourself so seriously.<\/p>"
    },
    {
        "title": "Comedy",
        "desc": "<p>To dream that you are watching a comedy suggests that you need to try and find the humorous side of a situation especially when things seem to get too intense. Sometimes you need to take life less seriously and be more carefree.<\/p>"
    },
    {
        "title": "Comet",
        "desc": "<p>To see a comet in your dream indicates that you need to move on and free yourself from emotional and physical burdens. Charge forward toward your goals.<\/p>"
    },
    {
        "title": "Comforter",
        "desc": "<p>To see or use a comforter in your dream symbolizes warmth, love, security and protection. You may be seeking for some form of shelter from the outside world.Alternatively, the dream may be a metaphor that you are looking for &quot;comfort&quot; or that you need to be &quot;comforted&quot; by someone. You feel depressed.<\/p>"
    },
    {
        "title": "Comics",
        "desc": "<p>To see or read comics in your dream suggest that you need to learn to not take yourself so seriously. You need to have more of a sense of humor.<\/p><p>To dream that you are collecting comics indicate that you refuse to see the problems that exist in your life and only want to focus on the good times. Perhaps you are in denial about something.<\/p>"
    },
    {
        "title": "Command",
        "desc": "<p>To dream that you are giving commands refers to ability to express your desires or ideas. The dream may also be telling you that you need to have more of a presence and take a more active role in a situation. Take control over your life and behavior.<\/p><p>To dream that someone is commanding you highlights your subordinate role. Perhaps you need to show more humility in a situation.<\/p>"
    },
    {
        "title": "Commandments",
        "desc": "<p>To dream of the commandments in your dream suggests that you will be rewarded if you behave and follow the rules. If it is a specific commandment, consider how it relates to you waking situation.<\/p>"
    },
    {
        "title": "Commentator",
        "desc": "<p>** Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/a3.htm#Announcer\">Announcer.<\/p>"
    },
    {
        "title": "Commercials",
        "desc": "<p>To dream that you are watching TV commercials signify your tendency to jump from one thing to another without completing your initial responsibilities and tasks. You have a tendency to emotionally distance yourself and remain objective about the situations you are faced with.<\/p><p>If the commercials quickly jump from one to another, then the dream symbolizes your flightiness.<\/p>"
    },
    {
        "title": "Commune",
        "desc": "<p>To dream that you live in a commune indicates that you are withdrawing from society. You are doing things your own way and living by your own set of rules.<\/p>"
    },
    {
        "title": "Communication",
        "desc": "<p>To dream that you have difficulties communicating represents low self esteem and feelings of inadequacy.<\/p>"
    },
    {
        "title": "Communion",
        "desc": "<p>To dream of communion symbolizes your conflict with the material world and the spiritual world. You are torn between your values and your feelings. Alternatively, the dream indicates a betrayal. You may also be seeking some form of acceptance.<\/p>"
    },
    {
        "title": "Community",
        "desc": "<p>To have a sense of community in your dream means that you need to nurture your relationships with your family\/friends and develop new ties. Perhaps you need to look at expanding your network of friends.<\/p>"
    },
    {
        "title": "Compact Disc",
        "desc": "<p>To see a compact disc in your dream represents a need for enjoyment or a distraction. It denotes opportunities and possibilities. Consider the type of music and the title of the compact disc. If you are giving away the CD, you may be trying to convey a message to that person within the songs.<\/p><p>Consider also if the initial &quot;CD&quot; have any additional significance to you. Perhaps it may even be a pun on something that is &quot;seedy&quot;.<\/p>"
    },
    {
        "title": "Compass",
        "desc": "<p>To see a compass in your dream is a way of your subconscious to show you the way. The dream may be telling you to reconsider the direction in your life and to rethink the path you are taking.<\/p><p>To see or use a drafting compass in your dream represents your set path. You do not like to deviate from your plans, even if it becomes monotonous. Alternatively, a drafting compass symbolizes your drive for perfection.<\/p>"
    },
    {
        "title": "Compassion",
        "desc": "<p>To dream about compassion indicates that you are lacking this quality in your waking life. You need to be more sympathetic toward others.<\/p>"
    },
    {
        "title": "Competition",
        "desc": "<p>To dream that you are in a competition represents your need to grow and expand. Learn the value of endurance and perseverance. You also need to be more assertive. Alternatively, the dream may reflect your anxiety about some real life competition that you are involved in.<\/p><p>To dream that you win a competition suggests that you possess the necessary skills to accomplish a goal or solve a problem in your waking life.<\/p>"
    },
    {
        "title": "Complain",
        "desc": "<p>To dream that you or someone is complaining about something signifies suppressed or unexpressed feelings that are threatening to surface. The actual complaint usually refers to something else that is really bothering you.<\/p>"
    },
    {
        "title": "Complexion",
        "desc": "<p>To dream of your complexion represents how others perceive you.<\/p>"
    },
    {
        "title": "Compliment",
        "desc": "<p>To dream that you are giving a compliment suggests that you need to be steadfast and not let others question your authority and position on things.<\/p><p>To dream that you are being complimented signifies pride and self-love. You feel good about yourself. However, be careful not to let it get to your head.<\/p>"
    },
    {
        "title": "Composer",
        "desc": "<p>To dream that you are a composer signifies that you are creating or directing new found energies to some aspect of your life.<\/p>"
    },
    {
        "title": "Compost",
        "desc": "<p>To see compost in your dream suggests that you need to channel and transform your outdated ideas or past experiences into something you can learn from.<\/p>"
    },
    {
        "title": "Copyright",
        "desc": "<p>To dream of a copyright indicates that you are guilty of copyright infringement. Content within this dream dictionary has been copied without permission from dream mo0ds.<\/p>"
    },
    {
        "title": "Computer",
        "desc": "<p>To see a computer in your dream symbolizes technology, information, and modern life. New areas of opportunities are being opened to you. Alternatively, computers represent a lack of individuality and lack of emotions and feelings. Too often, you are just going along with the flow, without voicing your own opinions and views. You may also feel a depreciated sense of superiority.<\/p><p>To dream that your computer has a mind of its own denotes anxiety about technology and loss of control. You are feeling overwhelmed and that you are at the mercy of another.<\/p><p>To dream that a computer has a virus or has crashed suggests that something in your life that is out of control. It may parallel something in your life that has come to a crashing end. If you dream that your computer has a sentient computer virus that would create random or strange artwork, then it depicts your subconscious desires. The artwork may also be a reflection of a situation in your life that you are ignoring. In particular, if the artwork is of a little boy smearing X's with his poop on a calendar, then it indicates past regrets or remorse.<\/p><p>*See the Meaning In Action: &quot;<a href=\"http:\/\/www.dreammoods.com\/dreambank\/bathroom-dreams-computer.html\">Computer In The Bathroom&quot;<\/p>"
    },
    {
        "title": "Computer Games",
        "desc": "<p>To dream that you are playing computer games represent a situation in your waking life where you either win or lose. If you dream the game is over, then it indicates that something has come to an end. Consider the type of game and how it parallels your life.<\/p>"
    },
    {
        "title": "Computer Mouse",
        "desc": "<p>To see or use a computer mouse in your dream symbolizes control over your thoughts. If the mouse is malfunctioning, then it denotes confusion.<\/p>"
    },
    {
        "title": "Concentration Camp",
        "desc": "<p>To see or live in a concentration camp in your dream indicates that you are afraid of differences. You are having difficulties accepting others and their differences. Learn to appreciate diversity and the uniqueness in yourself and in others around you. If you actually lived in a concentration camp, then the dream may signify a situation in your waking life which is triggering similar feelings felt at the time.<\/p>"
    },
    {
        "title": "Concern",
        "desc": "<p>To dream that you are concerned about something or someone indicates that you are feeling much anxiety, unhappiness, or uneasiness in some situation of your waking life. The concern you have in your dream may be something you need to pay attention to and acknowledge.<\/p><p>To dream that someone is concerned about you implies that you are behaving recklessly.<\/p>"
    },
    {
        "title": "Concert",
        "desc": "<p>To dream that you are at a concert represents harmony and cooperation in a situation or relationship in your waking life. You are experiencing an uplift in your spirits.<\/p><p>To dream that you are holding a concert symbolizes your untapped talents and hidden potential. You need to show of your creative side.<\/p>"
    },
    {
        "title": "Conch Shell",
        "desc": "<p>To see a conch shell in your dream represents sexual inhibitions. The dream may also be a warning.<\/p>"
    },
    {
        "title": "Concussion",
        "desc": "<p>To dream that you have a concussion suggests that you are not utilizing your fullest potential. You need to be more responsive to others, instead of just sitting back and waiting for things to happen.<\/p>"
    },
    {
        "title": "Concrete",
        "desc": "<p>To see concrete in your dream represents your solid and clear understanding of some situation. The dream may also mean that you are too unyielding and inflexible.<\/p><p>To see wet concrete in your dream suggests that some issue or some aspect of your life still remains unresolved.<\/p>"
    },
    {
        "title": "Concubine",
        "desc": "<p>To dream that you are a concubine implies that you are compromising your own values and beliefs. You are sacrificing your own happiness to please someone else.<\/p><p>To dream that you are keeping a concubine refers to a sexual relationship that you are involved in, but have no emotional bond.<\/p>"
    },
    {
        "title": "Condo",
        "desc": "<p>To see or live in a condo in your dream refers to your financial and emotional state. You are looking for financial or emotional independence. Consider the appearance of the condo for indication on the current status of your life.<\/p>"
    },
    {
        "title": "Condom",
        "desc": "<p>To see a wrapped condom in your dream represents your one-sided viewpoints. You are not allowing others to voice their opinions. It also symbolizes sexual possibilities.<\/p><p>To see an unwrapped condom in your dream indicates sexual frustration. Additionally, it may also indicate that you are experiencing some anxiety about pregnancy or sexually transmitted diseases.<\/p><p>To dream that you or your partner is wearing a condom suggests that you feel emotionally protected.<\/p>"
    },
    {
        "title": "Condor",
        "desc": "<p>To see a condor in your dream signifies your close connection with your spirituality and to the supernatural. You possess a lot of insight.<\/p>"
    },
    {
        "title": "Conductor",
        "desc": "<p>To see or dream that you are a conductor represents your abilities to lead and direct yourself toward higher awareness.<\/p>"
    },
    {
        "title": "Cone",
        "desc": "<p>To see a cone in your dream represents a flow of ideas and feelings.<\/p>"
    },
    {
        "title": "Conference",
        "desc": "<p>To dream that you are attending a conference suggests that you need to consider the ideas and opinions of others before forming your own conclusion. Don't be so close minded and listen to what others have to say.<\/p>"
    },
    {
        "title": "Confession",
        "desc": "<p>To dream that you or someone is confessing represents feelings of guilt and self-blame. Alternatively, it suggests a form of healing. You are heralding new changes into your life.<\/p>"
    },
    {
        "title": "ssional",
        "desc": "<p>To see a confessional in your dream represents something that you can no longer keep to yourself. You are feeling guilty or ashamed for your actions.<\/p>"
    },
    {
        "title": "Confetti",
        "desc": "<p>To see or throw confetti in your dream represents achievement and success. You have achieved a higher level of growth and learning and are at a turning point in your life. Alternatively, it symbolizes much festivity and fanfare. You may be expressing joy, victory, and freedom from restraint.<\/p>"
    },
    {
        "title": "Confront",
        "desc": "<p>To dream of a confrontation represents a conflict or a fear that you are facing in your waking life. The dream provides a &quot;safe&quot; venue for you to confront your enemy or attacker, who you are afraid of standing up to in your waking life. You need to use your dream to overcome your fears. Next time you have this dream, tell your enemy or attacker that you are not afraid of them!<\/p>"
    },
    {
        "title": "Confucius",
        "desc": "<p>To see Confucius in your dream indicates that you need to utilize your common sense. Perhaps you are acting stupid and need to wise up. Alternatively, it represents the importance of loyalty and duty to your family.<\/p>"
    },
    {
        "title": "Confusion",
        "desc": "<p>To dream that you are confused reflects your true confused state of mind and the nonsensical events of your waking life. Isolate the single element in your dream that is confusing to you and analyze the meaning of that particular symbol. Alternatively, dreams of confusion indicate that you are being pulled in opposite directions or you do not know which viewpoint is right.<\/p>"
    },
    {
        "title": "Conga Line",
        "desc": "<p>To see or be part of a conga line in your dream implies that you are lacking creative expression. You tend to go along with what others are doing or saying. Alternatively, the dream epresents light-hearted fun. You need to let loose a little sometimes.<\/p>"
    },
    {
        "title": "Congratulate",
        "desc": "<p>To dream that you are congratulating someone represents your ability to offer your help and assistance to others.<\/p><p>To dream that you are being congratulated indicates that you need to learn to ask for help when you need it. You need to let go of your pride. Alternatively, the dream represents approval of your action or decision.<\/p>"
    },
    {
        "title": "Conjoined Twins",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s2.htm#SiameseTwins\">Siamese Twins.<\/p>"
    },
    {
        "title": "Conker",
        "desc": "<p>To see a conker in your dream implies that you have been callous and\/or insensitive toward someone or something. Alternatively, the dreaming of a conker may be a pun to mean conquer. Perhaps there is a situation or problem that you need to overcome or take control of.<\/p><p>If you dream about playing conkers, then it indicates that you are experiencing some peer pressure.<\/p>"
    },
    {
        "title": "man",
        "desc": "<p>To see a conman in your dream indicates that you are being taken advantage of in some way. The dream may highlight fears that you are being played. Perhaps you need to trust your instincts.<\/p><p>To dream that you are a con artist represents your ability to manipulate some situation or relationship. The dream may be calling attention to your lacking conscience and low character.<\/p>"
    },
    {
        "title": "Connection",
        "desc": "<p>To dream that you miss your train or plane connection symbolize missed opportunities. The dream may also be a metaphor for your inability to make contact with something or someone.<\/p>"
    },
    {
        "title": "Console",
        "desc": "<p>To dream that you are being consoled suggests that you are repressing your sorrow or grief. Something in your waking life is bothering you more than you want to admit. The dream is telling you that you need to express your sadness and not keep it inside. Alternatively, the dream implies that you are feeling emotionally neglected. Your feelings are being overlooked.<\/p><p>To dream that you are consoling someone means that you need to be more empathetic to others.<\/p>"
    },
    {
        "title": "Conspiracy",
        "desc": "<p>To dream of a conspiracy suggests that you are deceiving others or being deceived by someone. Consider the people who are involved. These people may represent aspects of yourself and thus imply that you are lying to yourself.<\/p>"
    },
    {
        "title": "Constellation",
        "desc": "<p>To see a constellation in your dream indicates that something in your life is coming together in a complex way. It represents a mental process. Consider what the constellation is depicting.<\/p>"
    },
    {
        "title": "Constipation",
        "desc": "<p>To dream that you have constipation denotes that you are unwilling to part with your old ways. You continue to grasp onto your old ways and fail to let go, forgive, and forget. You may be dwelling on past problems and previous difficulties.<\/p>"
    },
    {
        "title": "Construction",
        "desc": "<p>To dream that a building is under construction suggests that you need to work on some aspect of yourself and better your mind or body.<\/p><p>To see construction in your dream signifies a new surge of energy, growth, ambition and renewed confidence. It may also represent the rebuilding of your own life.<\/p><p>To dream that you are walking barefoot on a construction site means that you are not ready to put in the work necessary to improve your mind or body. Perhaps you are in denial that you need any improvement.<\/p>"
    },
    {
        "title": "Contact Lens",
        "desc": "<p>To see or wear contact lens in your dream suggests that you need to focus on the task at hand. You need to pay closer attention to a situation before acting on it. The dream may also be a metaphor that you need to get in &quot;contact&quot; with someone.<\/p><p>If you have difficulties putting on your contact lens in your dream, then it indicates that you are having trouble paying attention.<\/p>"
    },
    {
        "title": "Contest",
        "desc": "<p>To dream that you enter or are in a contest indicates the need to prove yourself as worthy and deserving. If you win the contest, then it represents your self-confidence, pride, and\/or conceit. If you lose the contest, then it indicates a lack of self-esteem. You may not be fully applying yourself to the task at hand.<\/p>"
    },
    {
        "title": "Container",
        "desc": "<p>To see a container in your dream refers to your tendency to keep your thoughts, ideas or feelings inside instead of expressing them. Alternatively, the dream indicates that you need to be better organized.<\/p>"
    },
    {
        "title": "Contortionist",
        "desc": "<p>Tosee or dream that you are a contortionist suggests that you are literally getting all twisted and wound up over a problem or situation in your life. Alternatively, it represents flexibility in your thinking or fluidity in your emotions. The dream may also be a metaphor in how you are able to stretch or twist the truth or facts of a situation.<\/p>"
    },
    {
        "title": "Contraceptive",
        "desc": "<p>To see or use contraceptive in your dream suggests that you are refusing to let your creativity emerge from beneath the surface. You are holding back some aspect of yourself. The contraceptive may be a metaphor for protection against emotional hurt. Alternatively, it signifies your anxieties about pregnancy or sexually transmitted diseases.<\/p>"
    },
    {
        "title": "Contract",
        "desc": "<p>To dream that you are signing a contract indicates that you are ready to commit to a long term relationship or project.<\/p><p>To dream that you enter into a bad contract suggests that you need to think twice about committing to a relationship. Carefully examine what you are getting into.<\/p>"
    },
    {
        "title": "Contrail",
        "desc": "<p>To see a contrail in your dream symbolizes hope, pride and possibilities. Alternatively, the dream may seek to tell you that no matter how far or how fast you go, you will always leave an impression on those you left behind. You will not be forgotten.<\/p>"
    },
    {
        "title": "Control Tower",
        "desc": "<p>Tosee or dream that you are in a control tower may be a metaphor that you need to get a better handle on your waking life situation. You need to take things one at a time and evaluate the situation individually. Alternatively, the dream symbolizes complete control over your emotions. You may be too overly rational and not let feelings get in the way.<\/p>"
    },
    {
        "title": "Convent",
        "desc": "<p>To dream that you are at a convent represents your need for spiritual support and nurturance.You need to isolate yourself and block out any external forces that may cloud your judgment. Alternatively, the dream indicates that you are being restricted from fully expressing yourself.<\/p>"
    },
    {
        "title": "Convention",
        "desc": "<p>To dream that you are at a convention represents your need for contact and communication. You need to keep in mind that the choices you make with effect those around you. Don't be hesitant in getting them involved in your decision making. The dream is also a metaphor for bringing various aspects of yourself together. Consider the type of convention for additional clues as to what may be lacking in your life.<\/p>"
    },
    {
        "title": "Conversion",
        "desc": "<p>To dream about a conversion indicates your hopes that some problem or situation can be changed. This dream also represents your mobility and adaptability to situations in life.<\/p>"
    },
    {
        "title": "Convertible",
        "desc": "<p>To see or dream that you are in a convertible refers to your glamorous attitude. You are showing off your power and influence.<\/p>"
    },
    {
        "title": "Conveyer Belt",
        "desc": "<p>To see a conveyer belt in your dream suggests that you are stuck in a rut. Your daily routine has become predictable and unchallenging.<\/p>"
    },
    {
        "title": "Convict",
        "desc": "<p>To dream that you are a convict suggests that some situation or relationship is making you feel restricted. You may be experiencing a loss of freedom in some area of your life. Alternatively, the dream represents your feelings of shame and guilt. This dream image is trying to tell you to stop punishing yourself.<\/p><p>To see a convict in your dream indicates that an aspect of yourself is unable to freely express itself.<\/p>"
    },
    {
        "title": "Cookie Cutter",
        "desc": "<p>To see or use a cookie cutter in your dream symbolizes monotony and sameness. The dream may be telling you to deviate from the norm. Do something or say something unexpected.<\/p>"
    },
    {
        "title": "Cookie Monster",
        "desc": "<p>To see Cookie Monster in your dream indicates that you need to eat more healthier and have a more balanced diet. Alternatively, the dream means that you need to show restraint and control.<\/p>"
    },
    {
        "title": "Cookies",
        "desc": "<p>To dream that you are eating, giving, receiving, or stealing cookies indicate that you are letting trivial matters and minor problems annoy you.<\/p><p>To dream that you are baking cookies signify feelings of optimism and increases. You may also experience a rise in status. If you dream that a freshly baked batch of cookies is out of reach, then it implies that someone else is trying to reap your rewards. In other words, someone is trying to take credit for your hard work. If you are able to get the cookies back, then it means that you are aware of your surroundings and of the people around you. You are regaining control.<\/p><p>To see or eat chocolate chip cookies symbolizes your guilty indulgences. If you are baking chocolate chip cookies, then it represents your connection to someone in an intimate and emotional way.<\/p><p>To dream that you are eating an oatmeal cookie suggests that it is okay to indulge once in a while.<\/p><p>Dreaming that you are buying cookies suggests that you are giving into some temptation. You have been working hard and deserve to indulge yourself.<\/p>"
    },
    {
        "title": "Cooking",
        "desc": "<p>To dream that you are cooking signifies your desire to influence others in such a way so that they will like you or become dependent on you. Alternatively, it represents your nurturing side. You want to be loved. Or the dream could mean that you need to express your creativity.<\/p><p>To dream that you have difficulties cooking indicate that you are trying too hard.<\/p>"
    },
    {
        "title": "Cooking Oil",
        "desc": "<p>To see or use cooking oil in your dream represents a smooth transition.<\/p>"
    },
    {
        "title": "Cooler",
        "desc": "<p>To see a cooler in your dream represents someone who is frigid or who has cold personality. As the cooler is a feminine symbol representing the womb, the dream could mean a female in your life who is emotionally cold. Alternatively, the dream may be telling you that you need to cool off or that you need to &quot;keep your cool&quot;. Consider also what is inside the cooler.<\/p>"
    },
    {
        "title": "Cop",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p2.htm#Police\">Police.<\/p>"
    },
    {
        "title": "Copier",
        "desc": "<p>To see or use a copier in your dream represents your lack of originality and your tendency to copy other's ideas\/beliefs. You need to start thinking things through for yourself. Alternatively, the dream may indicate a desire to spread some idea and circulate the word out.<\/p>"
    },
    {
        "title": "Copper",
        "desc": "<p>To see copper in your dream represents the power of healing. It also indicates a flow of ideas, your connection to a situation to others, and flow of information.<\/p>"
    },
    {
        "title": "Copycat",
        "desc": "<p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m3.htm#Mimic\">Mimic<\/p>"
    },
    {
        "title": "Coral",
        "desc": "<p>To see coral in your dream symbolizes protection and the beauty of life. Acknowledging your feelings is the key to a happy and rewarding life. Alternatively, it represents purification and blood.<\/p>"
    },
    {
        "title": "Cord",
        "desc": "<p>To see cords in your dream symbolize a lack in independence in a situation or relationship. You are feeling restricted or tied down. If the cord is being cut, then it indicates that you are breaking those relationships that have held you back.<\/p>"
    },
    {
        "title": "Coriander",
        "desc": "<p>To see or eat coriander in your dream symbolizes immortality. It also indicates that you are emotionally stable and healthy.<\/p>"
    },
    {
        "title": "Cork",
        "desc": "<p>To see cork in your dream represents your versatility and adaptability in different situations. You have the ability to stay afloat in times of turmoil and rise above your circumstances.<\/p><p>To see a cork pop in your dream symbolizes male sexuality and climax.<\/p>"
    },
    {
        "title": "Corkscrew",
        "desc": "<p>To see or use a corkscrew in your dream suggests that some aspect of your life is spinning out of control, especially if you are having difficulties using the corkscrew. Alternatively, the dream may indicate the beginning of a fresh new idea.<\/p>"
    },
    {
        "title": "Cormorant",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/l3.htm#Loon\">Loon.<\/p>"
    },
    {
        "title": "Corn",
        "desc": "<p>To see corn in your dream signifies abundance, prosperity, growth and fertility. Also consider the pun that something is &quot;corny&quot;.<\/p><p>To see a field of corn in your dream represents domestic bliss and harmony.<\/p>"
    },
    {
        "title": "Cornbread",
        "desc": "<p>To dream that you are making or eating cornbread refers to your family ties and home life. It brings about the comfort of home. Alternatively, cornbread symbolizes confidence.<\/p>"
    },
    {
        "title": "Corner",
        "desc": "<p>To dream that you are in a corner signifies feelings of frustration and lack of control in making decisions. You may feel trapped and &quot;cornered&quot;. Alternatively, it indicates self-punishment.<\/p>"
    },
    {
        "title": "Cornfield",
        "desc": "<p>To dream that you are in a cornfield refers to your desire to escape from your daily demands and\/or problems. Alternatively, being in a cornfield suggests that someone one is listening in on you. All ears are on you.<\/p>"
    },
    {
        "title": "Cornflower",
        "desc": "<p>To see cornflower in your dream represents hope, togetherness, and unity.<\/p>"
    },
    {
        "title": "Cornrows",
        "desc": "<p>If you do not wear cornrows in your waking life, but dream that your hair is in cornrows, then it indicates that you need to better organize your thoughts together. It also implies a reserved attitude toward a situation. You are holding back something.<\/p>"
    },
    {
        "title": "Cornucopia",
        "desc": "<p>To see a cornucopia in your dream represents abundance, plentitude, fertility and prosperity. The dream also highlights the union of the feminine and masculine aspects.<\/p>"
    },
    {
        "title": "Corpse",
        "desc": "<p>To see a corpse in your dream represents an aspect of yourself that has died. Or it may mean that you are unexpressive. You have shut yourself down and are dead inside.<\/p>"
    },
    {
        "title": "Correction Tape",
        "desc": "<p>To see or use correction tape in your dream represents your desires for a fresh new start. Alternatively, the dream maybe telling you are suppressing past mistakes into your subconscious, instead of learning from them.<\/p>"
    },
    {
        "title": "Corridor",
        "desc": "<p>To walk along a corridor in your dream signifies a transitional phase of self exploration. It signals spiritual enlightenment, emotional growth, physical prowess, new opportunities and mental passages in your life.<\/p><p>If you are walking through a long corridor, then it represents your desperation in trying to escape a repetitive situation or some behavior patterns. You need to free yourself of this repetition. Alternatively, it symbolizes the choices and options that are available to you. You have a lot of things to consider.<\/p>"
    },
    {
        "title": "Corsage",
        "desc": "<p>To see or wear a corsage in your dream suggests that an aspect of yourself is looking to be acknowledged and recognized. Alternatively, it is a symbol of honor.<\/p>"
    },
    {
        "title": "Corset",
        "desc": "<p>To see or wear a corset in your dream indicates submission, restraint and restrictions. You may be feeling limited. Alternatively, it may mean that you have a tendency to hold in your displeasure in order to please others.<\/p>"
    },
    {
        "title": "Cosmetics",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m.htm#Makeup\">Makeup.<\/p>"
    },
    {
        "title": "Cost To see or notice the cost of something in your dream represents the value you are placing on yourself, your time and your abilities.If the cost is high, then it indicates that you value yourself highly. If the cost is low, then you are undervaluing yourself or taking somebody else for granted. The dream also relates to your self esteem.TOP",
        "desc": "<p>Costume<\/p><p>To dream that you are wearing a costume indicates that you are putting on a facade toward others. You do not want to reveal your true self and are not being completely honest with people around you.<\/p>"
    },
    {
        "title": "Costume Party",
        "desc": "<p>To dream that you are at a costume party suggests that you are trying to escape from the demands of real life. You want to enjoy life and not worry about your daily responsibilities.<\/p>"
    },
    {
        "title": "Cottage",
        "desc": "<p>To see a cottage in your dream represents comfort peace and serenity. You prefer a quiet life of simplicity. The cottage may also represent an altered sense of reality and thus may be a means of escaping the responsibilities and problems that may be associated with your home. You need to approach life's difficulties one at a time.<\/p>"
    },
    {
        "title": "Cotton",
        "desc": "<p>To dream that you are picking cotton suggests that you are seeing little benefits from all your long hard work. It may also mean that aspects of yourself are in harmony.<\/p><p>To dream that you are wearing cotton symbolizes simplicity.<\/p>"
    },
    {
        "title": "tton Ball",
        "desc": "<p>To see or use a cotton ball in your dream indicates that you need to apply yourself and focus on some important project. Alternatively, a cotton ball symbolizes pureness or softness. Perhaps there is a relationship or situation that requires a more delicate touch.<\/p>"
    },
    {
        "title": "Cotton Candy",
        "desc": "<p>To see or eat cotton candy in your dream represents childhood pleasures or rewards. You are content with the way things are going in your life.<\/p>"
    },
    {
        "title": "Couch",
        "desc": "<p>To see or dream that you are on a couch represents rest, relaxation, laziness or boredom. It may also mean you need to clear you mind and thoughts. Consider also who is on the couch with you as the dream may also have sexual connotations.<\/p>"
    },
    {
        "title": "Cougar",
        "desc": "<p>To see a cougar in your dream symbolizes wild beauty, power, grace, and raw emotion. It often refers to feminine power and aggression. Thus, the dream may represent a woman. Alternatively, it indicates lurking danger and death.<\/p>"
    },
    {
        "title": "Cough Drops",
        "desc": "<p>To see or take cough drops in your dream indicate that you need some coaxing in order to discuss some issue. There is something holding you back.<\/p>"
    },
    {
        "title": "Coughing",
        "desc": "<p>To dream that you are coughing represents your fear or dissatisfaction of the future. You need to put some distance between yourself and others. Alternatively, it indicates that you have made a negative choice in some important matter.<\/p><p>In particular, to dream that you are coughing blood represents wasted energy. You are spending too much time on counterproductive activities.<\/p>"
    },
    {
        "title": "Counselor",
        "desc": "<p>To see or dream that you are a counselor or dream that you are one suggests that you are seeking for some support and direction in your life. Pay important attention to what the counselor is saying and\/or doing. Your dream is trying to convey a message that you need to think about and possibly act upon.<\/p>"
    },
    {
        "title": "Counter",
        "desc": "<p>To stand in front of a counter in your dream suggests that you are looking for advice and for some direction in your life.You are exploring your options. Depending on the function or purpose of the counter, the dream may also imply that you are lacking something in your life and are looking for a form of fulfillment.Alternatively, the counter may be a pun that you need to make a &quot;counter&quot; on some offer. Learn to compromise.<\/p>"
    },
    {
        "title": "Counterfeit",
        "desc": "<p>To see counterfeit money in your dream indicates that you are feeling unworthy or that someone is devaluing your talents or efforts. Perhaps something is not what it appears to be. Alternatively, this dream symbol suggests that you are pretending to be something you are not.<\/p>"
    },
    {
        "title": "Counting",
        "desc": "<p>To dream that you are counting suggests that you are too rigid, obsessive-compulsive and overly disciplined. You need to relax a little. Alternatively the dream may be a metaphor for being the one that others can &quot;count on&quot;. You are reliable and dependable.<\/p>"
    },
    {
        "title": "Country",
        "desc": "<p>To dream that you escape to another country symbolizes change in your life. You are going through a new phase or transition. Consider how you feel about the surrounding. If you are afraid or lost, then it indicates that you are not ready for the change. You are not willing to leave the past behind. If you are excited or happy in this unknown place, then it suggests that you are ready for change.<\/p><p>Dreaming about your home country indicates some unfinished feelings that you have left behind. A current situation may be forcing you to confront issues of your past. Alternatively, to dream of your home country represents loyalty and commitment to family.<\/p>"
    },
    {
        "title": "Country Club",
        "desc": "<p>To dream that you are in a country club represents your status in society and sense of belong. You feel that you are part of a special group.<\/p>"
    },
    {
        "title": "Countryside",
        "desc": "<p>To dream of the countryside suggests that you are seeking a simpler way of life. You need to take some time for yourself to relax and free your mind. Alternatively, it indicates a sense of freedom and\/or openness that is lacking in your daily life.<\/p>"
    },
    {
        "title": "Couple",
        "desc": "<p>To see a couple in your dream symbolize marriage, your parents, or a relationship. Consider what the couple are doing in your dream for additional clues about their significance. It may point to something that is lacking or missing from your life.<\/p>"
    },
    {
        "title": "Courage",
        "desc": "<p>To dream that you have great courage indicates that you are willing to confront rejected aspects of your subconscious head on. You are about to come to a whole new understanding. The dream may be training you for what you need to do in your waking life.<\/p>"
    },
    {
        "title": "Coupons",
        "desc": "<p>To see or clip coupons in your dream suggest that you are doing your best to maximize your resources. You need to be more frugal or conserve your energy.<\/p>"
    },
    {
        "title": "Court",
        "desc": "<p>To dream that you are in court standing up for charges against you signifies your struggle with issues of fear and guilt. A situation or circumstance in your life is giving you much distress and worry. You feel that you are being judged in some way and need to defend yourself.<\/p>"
    },
    {
        "title": "Courthouse",
        "desc": "<p>To see a courthouse in your dream indicates that you are being judged.<\/p>"
    },
    {
        "title": "Cousin",
        "desc": "<p>To see your cousin in your dream represents something or some aspect of your character that is somewhat familiar. Perhaps you need to spend more time in cultivating and developing some emerging ability or character. In particular, if you dream that your cousin is ignoring you, then it indicates that you are not acknowledging some aspect of yourself that is represented by your cousin.<\/p><p>To dream that you or your sibling is in love with a cousin represents your acceptance of each other. You are acknowledging and embracing key qualities in one another.<\/p>"
    },
    {
        "title": "Cover",
        "desc": "<p>To dream that you are covering something indicates a part of yourself that you are trying to hide or are afraid of revealing. Consider what you are trying to cover up.<\/p>"
    },
    {
        "title": "Cow",
        "desc": "<p>To see a cow in your dream symbolizes your passive and docile nature. You obey others without question. Alternatively, a cow represents maternal instincts or the desire to be cared for. For some cultures, the cow represents divine qualities of fertility, nourishment and motherhood.<\/p><p>To see the skeleton of a cow suggests that your mother or motherly figure in your waking life is displaying a lack of emotions. She is being unresponsive to your needs.<\/p><p>To see a herd of cows indicates your need to belong.<\/p><p>To dream that you are milking a cow represents your willingness and drive to work hard. In the end, you will benefit from your hard work.<\/p>"
    },
    {
        "title": "Coward",
        "desc": "<p>To dream that you or someone is a coward indicates that you are afraid to see your true Self and to be who you are. You are hindering your own self-growth.<\/p>"
    },
    {
        "title": "Cowboy",
        "desc": "<p>To see or dream that you are a cowboy symbolizes masculinity, ruggedness, and toughness. You are in control of your animalistic and instinctual side.<\/p>"
    },
    {
        "title": "Coworker",
        "desc": "<p>To see your coworkers in your dream highlights aspects of your waking relationship with them, including difficulties\/support. It signifies your ambition, struggles and competitive nature. If the coworkers in your dream are not your actual coworkers, then they may pertain to some psychological business that you need to work on. Work-related dreams can also often be linked to stress at work.<\/p><p>To dream that you are training someone to take your place suggests that you are moving toward deeper inner development. You are leaving behind old attitudes and are looking toward the future.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/o.htm#Office\">Office.<\/p>"
    },
    {
        "title": "Cowrie Shells",
        "desc": "<p>To see or wear cowrie shells in your dream signify your laid back and easy going attitude. Alternatively, a cowrie shell symbolizes fertility, womanhood, and reproduction. The dream may also be a metaphor for the value that you assign to certain things.<\/p>"
    },
    {
        "title": "Coyote",
        "desc": "<p>To see a coyote in your dream denotes deception and weakness.<\/p><p>To dream that you are attacked by coyotes indicates that you are struggling with your own selfish needs.<\/p>"
    },
    {
        "title": "CPR",
        "desc": "<p>To dream that you are performing CPR on someone indicates that you have resolved some anxiety, fear or tension in your life. Alternatively, the dream signifies creativity and intelligence.<\/p>"
    },
    {
        "title": "To dream that someone is giving you CPR suggests that you are feeling exhausted or emotionally drained. You are seeking advice.TOP",
        "desc": "<p>Crab<\/p><p>To see a crab in your dream signifies your perseverance and tenacity. On an extreme note, you maybe be too clingy and dependent. You are hanging on to a hopeless endeavor or relationship. Alternatively, the dream may indicate that you are trying to avoid some issue. You are being evasive. Crabs are also symbolic of your irritable personality, as in the pun, being &quot;crabby&quot;.<\/p>"
    },
    {
        "title": "Crack",
        "desc": "<p>To dream of a crack in some object indicates that something in your life is imperfect. Nobody is perfect. Or there could be a flaw in your thinking or relationship. The dream may also be a pun on &quot;cracking under pressure&quot;. You may be experiencing difficulties in trying to maintain your composure and keeping it together.<\/p>"
    },
    {
        "title": "Crackers",
        "desc": "<p>To see or eat a cracker in your dream suggests that you tend to care for the needs of others before your own. You spend your time looking after other people and as a result, neglect your needs. The dream may also be a pun on &quot;crack her&quot;. Perhaps you are trying to get someone to reveal certain information or secrets.<\/p>"
    },
    {
        "title": "Cradle",
        "desc": "<p>To see a cradle in your dream symbolizes a dependent relationship. You may feel the need to be protected and cared for. Your dream may be telling you to regain some control and independence in your life. Alternatively, it represents a new project or fresh start.<\/p>"
    },
    {
        "title": "Crafting",
        "desc": "<p>To dream that you are making crafts refers to your resourcefulness and your hands on approach to various situations. Alternatively, crafting in your dream may be a metaphor that you are being deceitful, cunning or manipulative.<\/p>"
    },
    {
        "title": "Cramp",
        "desc": "<p>To dream that you have a cramp means that you need to stop what you are doing and reevaluate your choices or decisions. Alternatively, a cramp implies that you are overworked. Consider also the significance of where the cramp is located.<\/p>"
    },
    {
        "title": "Cranberries",
        "desc": "<p>To see or eat cranberries in your dream meanslongevity and good health. Alternatively, cranberries signify warmth and togetherness.<\/p><p>To drink cranberry juice in your dream suggests that you need to cut down on your stress.<\/p>"
    },
    {
        "title": "Crane",
        "desc": "<p>To see a crane in your dream represents happiness, maternal love, and your gestures of good will. You look out for those who are near and dear to you. Alternatively, a crane signifies tact, immortality or vigilance.<\/p>"
    },
    {
        "title": "Crank CallTOP",
        "desc": "<p>To dream that you are making a crank call signifies your frustrations about not being taken seriously.<\/p><p>To dream that someone is crank calling you indicates that you are feeling out of the loop. You feel that some information is being hidden from you.<\/p>"
    },
    {
        "title": "Crash",
        "desc": "<p>To dream that you are in a car crash indicates that your beliefs, lifestyle, or goals are clashing with another's. It may also represent a shocking situation or painful experience. Alternatively, car crashes may forewarn of your dangerous or careless driving habits.In particular, if a car crashes into you, then it suggests that your lifestyle, beliefs or goals may be in conflict with another's. It may also be symbolic of a jolting experience or injured pride.<\/p><p>To dream that a plane crashes signifies that you have set overly high and unrealistic goals for yourself. You are in danger of having those goals come crashing down. Alternatively, the crashing airplane represents your lack of confidence, self-defeating attitude and self-doubt. You do not believe in your own ability to achieve those goals. Loss of power and uncertainty in achieving your goals are also signified.<\/p><p>To wake up before you crash in your dream may simply be the anticipation of the crash that jolts you awake. It is similar to the notion of waking up before you hit the ground from a fall.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=airplanedream2\">Plane Crash&quot;<\/p>"
    },
    {
        "title": "Crash Test Dummy",
        "desc": "<p>To see a crash test dummy in your dream refers to the impacts others are making on your life.<\/p>"
    },
    {
        "title": "Crate",
        "desc": "<p>To see a crate in your dream signifies your positive attitude, your potential, the possibilities and your drive for success.<\/p>"
    },
    {
        "title": "Crater",
        "desc": "<p>To see a crater in your dream indicates that aspects of your subconscious are being slowly revealed to you. This dream symbol is also symbolic of past memories and experiences.<\/p>"
    },
    {
        "title": "Crawfish",
        "desc": "<p>To see a crawfish in your dream represents your tenacity.<\/p>"
    },
    {
        "title": "Crawl Space",
        "desc": "<p>To see a crawl space in your dream symbolizes your subconscious. If you are going through a crawl space, then it suggests that you are exploring aspects of your subconscious in a slow and careful manner.<\/p>"
    },
    {
        "title": "Crawling",
        "desc": "<p>To dream that you are crawling indicates that you are approaching your goals with careful forethought and preparation. Alternatively, the dream may indicate that you are lowering yourself and your standards. You may be doing less than your best.<\/p><p>To dream that you are crawling out of a wreck or ruins represents your willpower.<\/p><p>To dream that someone is crawling towards you signifies your need for power, revenge, superiority, or control.<\/p>"
    },
    {
        "title": "Crayons",
        "desc": "<p>To see crayons in your dream represent some childhood memory or a period of time where you were more carefree. It is also symbolic of creativity. You may need to think outside the lines into more unconventional thoughts and ways of doing things. Consider the symbolism of the color of the crayon.<\/p>"
    },
    {
        "title": "Crazy",
        "desc": "<p>To dream that you are going crazy suggests that you have lost sight of your goals. You may feel that you are no longer able to depend on someone. Alternatively, you feel that your opinions, viewpoints or decisions are being unaccepted or being ignored. You may feel like an outsider.<\/p>"
    },
    {
        "title": "Cream",
        "desc": "<p>To see or eat cream in your dream indicates that you appreciate the minor and sweet things in life.It is symbolic of nurturance and richness.<\/p><p>To see or apply face cream in your dream represents a beautiful soul. It may also represent the character and personality you are portraying to others in your waking life.<\/p>"
    },
    {
        "title": "Creatures",
        "desc": "<p>To see a faceless creature in your dream indicates a situation you are refusing to see or confront, but are aware of it in some passive way. This dream also suggests that something in your life is bringing up feelings of fear and insecurities.<\/p>"
    },
    {
        "title": "Credit",
        "desc": "<p>To dream that you are getting credit for something represents acceptance of your responsibilities and duty. It also signifies your own sense of pride and confidence.<\/p>"
    },
    {
        "title": "Credit Cards",
        "desc": "<p>To dream about credit cards relate to your worth, value and\/or credibility. Depending on your waking experiences, the credit cards may symbolize being in debt and your attitudes about money, work, and thrift.<\/p><p>To dream that you owe money on your credit card signifies an imbalance or some struggle in a personal situation or business matter. Alternatively, it may indicate that you are putting too much demands of others.<\/p><p>To dream that you lose your credit cards indicate your carelessness in some aspect of your waking life.<\/p><p>To dream that someone is stealing your credit cards suggest that something or someone is robbing you of vital energy.<\/p>"
    },
    {
        "title": "Credit Score",
        "desc": "<p>To dream of your credit score represents your feelings of measuring up or being accepted in some way. More directly, the dream may be about your concerns regarding your financial standing. To dream of a low credit score is a variance of the &quot;<a href=\"http:\/\/www.dreammoods.com\/commondreams\/test-dreams.html\">failing an exam&quot; dream scenario. The dream relates to your lack of self-esteem and confidence. You are experiencing some anxiety in your waking life. If you dream of a high credit score, then it symbolizes your high sense of worth. Also consider the significance of the actual credit score number.<\/p>"
    },
    {
        "title": "Creek",
        "desc": "<p>To see a creek in your dream represents personal energy flow and steady emotional release. Alternatively, the dream may indicate that you are in trouble or danger. Consider the saying to be &quot;up a creek without a paddle.&quot;<\/p><p>To see a dried up creek indicates that you are being cut off from your spiritual being and being out of touch with yourself. You may also feel physically or emotionally drained.<\/p>"
    },
    {
        "title": "Creeper",
        "desc": "<p>To see or use a creeper in your dream indicates that you need to approach your goals from a different angle. You need a fresh new perspective on where your life is headed.<\/p>"
    },
    {
        "title": "Cremains",
        "desc": "<p>To see cremains in your dream symbolizes change. It also represents a return to your true Self and acceptance of who you are.<\/p>"
    },
    {
        "title": "Cremation",
        "desc": "<p>To dream that someone is being cremated represents purification and your strive for perfection. It symbolizes the ending to a phase in your life and the beginning of something else. If the person being cremated has passed away in real life, then the dream may be a way of grieving or coping with the loss. You want to always remember them in a positive light.<\/p>"
    },
    {
        "title": "epe",
        "desc": "<p>To see or eat a crepe in our dream implies that you are doing your best to keep it together while still looking your best.<\/p><p>To see or wear a crepe fabric in your dream suggests that life is not always as smooth as you want it to be. Enjoy life and learn from the little obstacles that it has to offer.<\/p>"
    },
    {
        "title": "Crescent",
        "desc": "<p>To see a crescent in your dream represents the emergence of your feminine character. It also indicates versatility and changes.<\/p>"
    },
    {
        "title": "Crib",
        "desc": "<p>To see a crib in your dream suggests that you are harvesting or &quot;babying&quot; a new idea, creation or project. Alternatively, it may refer to your nurturing, protective, and caring nature. A more literal interpretation of this symbol suggests that you may be yearning for a baby or that you are expecting a baby. The dream may also be a pun on &quot;your home&quot;.<\/p>"
    },
    {
        "title": "Crickets",
        "desc": "<p>To see crickets in your dream represents introspection. You are seeking guidance.<\/p><p>To hear crickets in your dream suggests that you are letting minor things bother you.<\/p>"
    },
    {
        "title": "Crime",
        "desc": "<p>To dream that you or someone commits a crime represents feelings of guilt and shame. Your inner fears are hindering your growth and progress.<\/p>"
    },
    {
        "title": "Crime Scene Tape",
        "desc": "<p>To see crime scene tape in your dream represents protection from your subconscious. Something is preventing you from delving deeper. Alternatively, the dream symbolizes restriction.<\/p>"
    },
    {
        "title": "Criminal",
        "desc": "<p>To dream that you are a criminal indicates that you are looking for a short cut in life. You are selling yourself short and underestimating your own potential.Alternatively, the dream means that you feel you are entitled to certain things.<\/p>"
    },
    {
        "title": "Cripple",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/h.htm#Handicap\">Handicap.<\/p>"
    },
    {
        "title": "Critic",
        "desc": "<p>To dream that you are a critic suggests that you are being overly judgmental of others or of some situation. Alternatively, the dream represents self-discipline.<\/p>"
    },
    {
        "title": "Crochet",
        "desc": "<p>To see crochet in your dream indicates that you will find yourself entangled in some situation<\/p><p>To dream that you are crocheting symbolizes your creativity and artistic abilities.<\/p>"
    },
    {
        "title": "Crock Pot",
        "desc": "<p>To see or use a crock pot in your dream suggests that you need to look at various sources to attack a problem. Alternatively, it means that patience, hard work, and tenacity will pay off in the long run. Hang in there and don't let difficulties and obstacles discourage you.<\/p>"
    },
    {
        "title": "Crocodile",
        "desc": "<p>To see a crocodile in your dream symbolizes freedom, hidden strength and power. It also forewarns of hidden danger. Someone near you is giving you bad advice and is trying to sway you into poor decisions. Because crocodiles can live in water and on land, they also represent your conscious and subconscious and the emotional and rational. Perhaps something is coming to the surface and you are on the verge of some new awareness.<\/p><p>Alternatively, the crocodile may be an aspect of yourself and your aggressive and &quot;snappy&quot; attitude. Or it may reveal that you are being insincere, displaying false emotions and shedding &quot;crocodile tears&quot;.<\/p><p>Dreaming that you are chased or bitten by a crocodile implies that you are refusing to confront some painful, disturbing or destructive aspect of your subconscious.<span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px\">Your feelings toward a situation or relationship is suffocating you or is eating you up inside.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/chasedreams.pl?method=exact&amp;header=dreamid&amp;search=chasedream4\">Crocodile Chase&quot;<\/p>"
    },
    {
        "title": "Crocus",
        "desc": "<p>To see a crocus in your dream represents lucidity and your need to think more clearly about a situation.<\/p>"
    },
    {
        "title": "Croissant",
        "desc": "<p>To dream that you are eating a croissant indicates that you are lacking some"
    },
    {
        "title": "Crooked",
        "desc": "<p>To see something crooked in your dream indicates that something is not right or normal about a situation. The dream may also be a pun on someone who is a crook. You may be duped or lied to.<\/p>"
    },
    {
        "title": "Crop",
        "desc": "<p>To dream that you are tending to your crop represents growth, self-love, and self-appreciation. In the end, your hard work will pay off.<\/p>"
    },
    {
        "title": "Cross",
        "desc": "<p>To see a cross in your dream signifies suffering, martyrdom, death, and\/or sacrifice. It is a symbol of your religious faith. Perhaps your dream is telling you that you have a cross to bear or that you are acting &quot;crossed&quot; and annoyed. Ask yourself what is causing you to suffer or what is causing you great difficulties.<\/p><p>Dreaming that a cross is swinging back and forth in a pendulum motion suggests that you are wavering in your faith and\/or questioning your belief system.<\/p>"
    },
    {
        "title": "Cross-Dressing",
        "desc": "<p>To dream that you or someone is cross-dressing indicates that you need to express and acknowledge your masculine side if you are female or your feminine side if you are male.<\/p>"
    },
    {
        "title": "Crossing",
        "desc": "<p>To dream that you are crossing a street suggests that you are putting yourself in harm's way. Alternatively, the dream indicates that you like to go against the majority. As a result, you become the target of criticism.<\/p><p>To dream that you are crossing a river or some body of water symbolizes a spiritual change or reawakening.<\/p>"
    },
    {
        "title": "Crossbones",
        "desc": "<p>To see crossbones in your dream symbolizes danger and poison. The symbol may also represent the life of a pirate.<\/p>"
    },
    {
        "title": "Crossbow",
        "desc": "<p>To see or use a crossbow in your dream implies that you need to have more precision in the goals that you are reaching for. Try to accomplish your goals in a more direct manner.<\/p>"
    },
    {
        "title": "rossing Gate",
        "desc": "<p>To see a crossing gate in your dream symbolizes temporary setbacks toward achieving your goals, especially if the gate is going down. If the gate is up, then it means that you have overcome certain obstacles in your life. You are not letting something or something get in your way of your goals.<\/p>"
    },
    {
        "title": "Crossroads",
        "desc": "<p>To dream that you are at a crossroads symbolize an important decision that you need to make. You have come to a point in your life where you have several options that you need to weigh. Each option will lead you to a different destination or goal. Alternatively, the crossroads suggest of a change in direction in your life.<\/p>"
    },
    {
        "title": "Crosswalk",
        "desc": "<p>To see or dream that you are in a crosswalk means that you are careful about the risks you take.<\/p>"
    },
    {
        "title": "Crossword Puzzle",
        "desc": "<p>To see or do a crossword puzzle suggests that you are being faced with a mental challenge. The dream may be a pun on &quot;cross words&quot; directed at your or aimed toward someone.<\/p>"
    },
    {
        "title": "outon",
        "desc": "<p>To see or eat a crouton in your dream indicates that you are feeling uninspired. You are in need of encouragement and motivation.<\/p>"
    },
    {
        "title": "Crow",
        "desc": "<p>To see a crow in your dream represents death and the darker aspects of your character. The dream could also be pointing out your annoying habits. Alternatively, the crow may be conveying a message from your subconscious.<\/p><p>To dream that crows are on the attack indicates a conflict with your subconscious.<\/p><p>To dream that you kill a crow implies that you are unable to or refuse to give up a habit.<\/p><p>To dream that a crow kills a person represents an inescapable death. This death may be symbolic to an end to some situation, habit, or relationship in your waking life.<\/p>"
    },
    {
        "title": "Crowbar",
        "desc": "<p>To see or use a crowbar in your dream suggests that you are trying to get into your subconscious even though you may not be mentally ready to confront those issues. You are forcing things out.<\/p><p>To dream that you are attached with a crowbar means that someone is making you confront some issue that you are not ready to deal with.<\/p>"
    },
    {
        "title": "Crowd",
        "desc": "<p>To dream that you are in or part of a crowd suggests that you need some space for yourself. You need solitude to reflect on a situation and recharge your energy. Consider also the familiar phrase of &quot;going along with the crowd&quot; which implies conformity and lack of individuality. Perhaps you feel that your own opinion doesn't count or matter. Alternatively, dreaming of a crowd means that you need to incorporate the various aspects of the crowd into your own persona.If you dream that you are stopping a crowd from doing something, then it means that you have a tendency to go against what everyone else is doing or thinking.<\/p><p>To dream that you are not part of a crowd or that you separated yourself from a crowd suggests that you are feeling left out. Alternatively, the dream symbolizes your individualism. You are your own person and you are not afraid to voice your own opinions.<\/p><p>To see an unruly crowd in your dream signifies that the worries and problems around you are pressing in on you.You are expressing great distress.<\/p><p>To see a happy, orderly crowd in your dream indicates that you have a strong social support system.<\/p>"
    },
    {
        "title": "Crown",
        "desc": "<p>To see a crown in your dream symbolizes success and prominence.<\/p><p>To dream that you are wearing a crown suggests that you are in a position of power. Alternatively, you may be basking in your own achievements. You are recognizing your talents and accomplishments.<\/p>"
    },
    {
        "title": "Crucifix",
        "desc": "<p>To see a crucifix in your dream is symbolic of new life, spiritual guidance, and liberation. The dream may serve as a connection with your inner Christ\/love consciousness. Alternatively, it represents your difficulties and hardships. Do you feel you are being crucified for something occurring in your life?<\/p><p>To see an upside down crucifix implies that some aspect of your life is in disarray. You are not sure what to believe or what is right anymore. Things are not always what it seems. Alternatively, an upside down crucifix is symbolic of the pope.<\/p>"
    },
    {
        "title": "Crucify",
        "desc": "<p>To dream that you are being crucified indicates that you are punishing yourself.You may be feeling guilty.<\/p>"
    },
    {
        "title": "Cruel",
        "desc": "<p>To dream that you or someone is being cruel signifies the release of pent-up hostility and anger. You may need to acknowledge the shadow and negative aspects of your personality.<\/p>"
    },
    {
        "title": "To dream that someone is being cruel to you suggests that you need to develop your inner and outer strengths and become more emotionally strong.TOP",
        "desc": "<p>Cruise<\/p><p>To dream that you are on a cruise represents some emotional journey that you are going through. The dream may also be a pun on &quot;cruising&quot; through situations in your life with ease and little effort.<\/p>"
    },
    {
        "title": "Crumbs",
        "desc": "<p>To see or make crumbs in your dream suggest that you are feeling left out. Do you feel like an outsider in some situation?<\/p>"
    },
    {
        "title": "Crush",
        "desc": "<p>To dream that you are crushing something denotes that you are under tremendous stress over a decision that you need to make. If you dream that a part of your body is being crushed, then it suggests that you are being prevented to full express yourself.<\/p><p>To dream that you have a crush on somebody is a literal reflection of your attraction and fascination for that person. To see your crush in your dream represents your current infatuation with her or him. If you find yourself thinking about him during the day, then it is not surprising that his image will appear in your dream during the night. If you dream of your crush frequently or that your crush likes you back, then your dream maybe be telling you that it is time to let this person know how you feel, especially if you are dreaming of her or him in a good way. Only good things can happen from you telling your crush. Even if he or she is not interested, at least you can move on and stop wasting time on her or him.<\/p><p>To dream that your crush has died suggests that your feelings for her or him is waning; the crush is no longer as strong. The dream may also be telling you to move on.<\/p><p>If you dream that somebody has a crush on you, then it represents you own sense of worthiness and esteem.<\/p><p>To dream about a former crush refers to a particular period in your life and what you were feeling then. Perhaps a waking relationship is repeating the same pattern.<\/p><p>To dream that your crush rejects you or stands you up represents your feelings of insecurities and anxieties. The idea of not knowing how your crush feels about you is driving you nuts. Assuming that he or she rejects you, before you actually know how he or she feels, saves you from getting hurt.Because you are afraid to find out how he or she really feels about you, it may just be easier to move on ifyou think that they don't like you back.<\/p>"
    },
    {
        "title": "Crutches",
        "desc": "<p>To dream that you are on crutches signify your need to lean on others for help. Perhaps you are acting helpless in order to get out of some situation or obligation.<\/p>"
    },
    {
        "title": "Cry",
        "desc": "<p>To dream that you are crying signifies a release of negative emotions that is more likely caused by some waking situation rather than the events of the dream itself. Your dream is a way to regain some emotional balance and to safely let out your fears and frustrations. In your daily lives, you tend to ignore, deny, or repress your feelings. But in your dream state, your defense mechanisms are no longer on guard and thus allow for the release of those feelings that you have repressed during the day.<\/p><p>To see someone else crying in your dream may be a projection of your own feelings onto someone else. If you do not cry in your waking life, then seeing someone else cry may be a little easier to deal with then seeing yourself cry.<\/p><p>To wake up crying represents some suppressed hurt or previous trauma that is coming up to the surface. You can no longer suppress these emotions. They need to be dealt with head on.<\/p><p>To dream that no one hears or responds to your cries represents your helplessness, difficulties and frustrations in trying to communicate with others. You feel that your words are falling on deaf ears. Perhaps your dream is telling you to be more vocal and work harder to get your point across.<\/p>"
    },
    {
        "title": "Cryopreservation",
        "desc": "<p>To dream that you are being cryopreserved indicates that you may be stuck in the past. You are dwelling on how things used to be.<\/p>"
    },
    {
        "title": "Crystal",
        "desc": "<p>To see a crystal in your dream signifies wholeness, purity, healing, development and unity. It represents your higher Self. The dream may be a metaphor for something in your life that is crystallizing or taking shape.<\/p><p>To dream that you are looking into a crystal represents how you are looking within yourself to find your true destiny. Alternatively, it indicates your outlook of the future.<\/p>"
    },
    {
        "title": "Crystal Ball",
        "desc": "<p>To see or look through a crystal ball in your dream suggests that you are looking for guidance and direction in your life.It represents your outlook of the future.<\/p>"
    },
    {
        "title": "Crystal Skull",
        "desc": "<p>To see or find a crystal skull in your dream represents something you do not fully understand.<\/p><p>Dreaming that your own skull is turning into a crystal skull suggests that you feel others can read your mind or see right through you. Perhaps you have something to hide. Alternatively, the dream symbolizes reflection, insight, intuition and mental powers. You need to look at a situation from the past, present and future.<\/p>"
    },
    {
        "title": "Cub",
        "desc": "<p>To see a cub in your dream represents innocence, playfulness and\/or mischievousness. It is also symbolic of your children or siblings.<\/p>"
    },
    {
        "title": "Cube",
        "desc": "<p>To see a cube in your dream symbolizes material possessions and earthly things. It may also be a metaphor for &quot;being square&quot; or being too conservative.<\/p>"
    },
    {
        "title": "Cuckoo",
        "desc": "<p>To see a cuckoo in your dream symbolizes unfaithfulness. Or there may be someone in your life whose presence is unwelcome. Perhaps you are the one who is intruding on other people's business. Alternatively, a cuckoo represents timing and fate. You need to change your direction or alter your approach in how your pursue some situation. The dream may also be a metaphor for someone who is behaving crazily.<\/p>"
    },
    {
        "title": "Cucumber",
        "desc": "<p>To see or eat a cucumber in your dream signifies recuperation and recovery. You need to regain your energy and health. Alternatively, it is symbolic of the phallus and have sexual connotations.<\/p>"
    },
    {
        "title": "Cuddle",
        "desc": "<p>To dream that you are cuddling with someone indicates your need for physical and\/or emotional contact. Do not overlook the obvious meaning of this dream which suggests your heart's desire for that particular person. Also consider the symbolism of that person you are cuddling with and determine how you need to acknowledge, accept, and unify those qualities in yourself.<\/p>"
    },
    {
        "title": "Cult",
        "desc": "<p>To dream that you are in a cult suggests that you are in some destructive and\/or manipulative relationship. You are being exploited. On a more positive note, you have the desire to strive for a better Self. It implies devotion and sense of community.<\/p><p>To see a cult in your dream indicates that you are lacking any spiritual freedom.<\/p><p>To dream that you are a leader of a cult signifies your authoritarian attitude. No one should question your motives or choices.<\/p>"
    },
    {
        "title": "Cultivate",
        "desc": "<p>To dream that you are cultivating indicates that you need to clear your mind of negative thoughts. Keeping an open mind will further allow you to grow as a person.<\/p>"
    },
    {
        "title": "Cup",
        "desc": "<p>To see a cup in your dream represents love, nurturance and the womb. The cup may also signify rejuvenation and healing.Alternatively, it indicates a transcendence into a realm of higher consciousness. Is the cup half-full or half-empty? Do you see life from an optimistic or pessimistic point of view.<\/p><p>To see a cup with a broken handle indicates your feelings of inadequacy and anxieties of being unable to handle a particular situation.<\/p><p>To see a broken cup in your dream denotes feelings of powerlessness, guilt and\/or low self-esteem. Perhaps you feel unqualified or inadequate in dealing with a situation.<\/p>"
    },
    {
        "title": "Cupboard",
        "desc": "<p>To dream that you are opening a cupboard signifies that you are revealing some hidden truth or secret.<\/p><p>To dream that you are closing the cupboard or putting something away inside the cupboard, indicates that there is something you are trying to hide. You are refusing to confront some issue or problem.<\/p>"
    },
    {
        "title": "Cupcake",
        "desc": "<p>To see or eat a cupcake in your dream suggests that you are treating yourself to a little sweet reward. You feel that you are deserving of some sort of gift of prize. Alternatively, a cupcake represents your need to downsize some aspect of your life in order to make it more palatable or manageable. Take it a little bit at a time.<\/p>"
    },
    {
        "title": "Cupid",
        "desc": "<p>To see cupid in your dream represents a love relationship in your waking life. Its appearance in your dream may mean that you need to take a risk in love.<\/p>"
    },
    {
        "title": "Curb",
        "desc": "<p>To see a curb in your dream symbolizes restrictions and limitations. Alternatively, the dream may be a metaphor that there is something that you need to &quot;curb&quot; in your life. You need to showmore control.<\/p>"
    },
    {
        "title": "Cure",
        "desc": "<p>To dream of a cure for a disease or illness indicates positive changes ahead. Things are taking a turn for the better. Alternatively the dream represents hope.<\/p>"
    },
    {
        "title": "Curfew",
        "desc": "<p>To dream that you have a curfew symbolizes some time-sensitive situation. You are feeling burdened by the expectation of others.<\/p><p>To dream that you miss curfew denotes your fear of change. You are feeling unprepared, unworthy, or unsupported in your current circumstances. Alternatively, the dream suggests that time has ran out and you do not have time to accomplish all the things you want.<\/p>"
    },
    {
        "title": "Curlers",
        "desc": "<p>To see curlers in your dream suggest that you are thinking in circles. You may be going over the same problem\/situation again and again without any conclusion.<\/p>"
    },
    {
        "title": "Curling",
        "desc": "<p>To dream that you are watching or playing curling symbolizes teamwork and cooperation. Sometimes you need the help of others in order to attain your goals. Alternatively, the dream refers to your ability to shape your own path in life.<\/p>"
    },
    {
        "title": "Curling Iron",
        "desc": "<p>To see or use a curling iron in your dream indicates that you are trying to disguise your true feelings.<\/p>"
    },
    {
        "title": "Current",
        "desc": "<p>To see\/notice an ocean or river current in your dream represents the direction of your life and the decisions you have made along the way. It also represents your influences and how they work in guiding you through your life's path. The dream may also be a metaphor for some current events or for something that is going on in your life at the moment.<\/p>"
    },
    {
        "title": "Curry",
        "desc": "<p>To see or taste curry in your dream suggests that you are emotionally sensitive and easily irritable. Alternatively, it refers to your quick-wit, sharpness, and intellect. It may also mean that you feel like you are hot stuff.<\/p>"
    },
    {
        "title": "Curse",
        "desc": "<p>To dream that you or someone is under a curse suggests that you are getting caught up in your own guilt. You also need to proceed with caution in some situation or relationship.<\/p><p>To dream that you or someone is cursing refers to your inner fears. It also means that you are becoming a hardened person.<\/p>"
    },
    {
        "title": "Curtain Rod",
        "desc": "<p>To see a curtain rod in your dream indicates that you are revealing too much. You need to learn to hold certain things back.<\/p>"
    },
    {
        "title": "Curtains",
        "desc": "<p>To see or dream that you are shutting the curtains signify secrecy and a repression of thoughts. You are concealing some personal matter or some aspect of yourself. On the other hand, to dream that you are opening the curtains indicates that you are ready to reveal something hidden about yourself.<\/p><p>To dream that a stage curtain is going up indicates personal development and growth. You have learned something significant about yourself. If the stage curtain is coming down, then it suggests that you need to accept some decision. You have to come to terms with the end.<\/p>"
    },
    {
        "title": "Curtsy",
        "desc": "<p>To curtsy in your dream suggests that you are acknowledging something that is greater than you and deserves your respect. You are submitting to a power larger than you.<\/p>"
    },
    {
        "title": "Cushion",
        "desc": "<p>To see or use a cushion in your dream suggests that you are in need of more rest and relaxation. Alternatively, the dream may be a metaphor that you need to &quot;cushion&quot; or distance yourself against a hurtful situation or some offensive remarks.<\/p>"
    },
    {
        "title": "Cussing",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s5.htm#Swearing\">Swearing.<\/p>"
    },
    {
        "title": "Custard",
        "desc": "<p>To see or eat custard in your dream represents your appreciation for the little things in life. It also indicates that your life is full of richness, sweetness and nurturance.<\/p>"
    },
    {
        "title": "Custard Apple",
        "desc": "<p>To see or dream that you are eating custard apple indicates that you are experiencing an uplift in your spirituality. You are in a state of contentment and calm.<\/p>"
    },
    {
        "title": "Customer",
        "desc": "<p>To see a customer or customers in your dreamrefers to others who share your viewpoints and ideas. If you notice that there are no customers in a store, then it implies that you are alone with your ideas. You feel no one agrees with your thinking. If you are the customer, then it means that you are looking for some sort of approval and validation of your ideas.<\/p>"
    },
    {
        "title": "Customs",
        "desc": "<p>To dream that you are going through customs indicates that you are under scrutiny and are being criticized. Alternatively, the dream suggests that you need to be on guard.<\/p>"
    },
    {
        "title": "Cut",
        "desc": "<p>To dream that you have a cut suggests that you are being let down or being undermined. Alternatively, it refers to feminine sexuality and feminine attitudes toward sex. In particular, if the cuts are on your legs, then it symbolizes an imbalance. You are unable to stand up for yourself.<\/p><p>To dream that you are cutting yourself indicates that you are experiencing some overwhelming turmoil or problems in your waking life. You are trying to disconnect yourself from the unbearable pain you are experiencing.<\/p><p>To dream that someone else is being cut suggests that you are trying to understand this person on some level. You want them to open up to you. If you dream that someone is cutting you, then it is symbolic of masculine aggression.<\/p><p>To see cut marks on a wall refers to your desires to break free from some obligation or relationship.<\/p>"
    },
    {
        "title": "Cuticles",
        "desc": "<p>To notice your cuticles in our dream suggest that you are being overly sensitive. You may be overreacting in some situation.<\/p>"
    },
    {
        "title": "Cutlass",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m.htm#Machete\">Machete.<\/p>"
    },
    {
        "title": "Cutting",
        "desc": "<p>To dream that you are cutting something signifies a broken relationship or severed connection. Alternatively, the dream may be a metaphor for something you need to &quot;cut out&quot; in your life. Perhaps it refers to a bad habit or a certain food.<\/p>"
    },
    {
        "title": "Cuttlefish",
        "desc": "<p>To see or eat cuttlefish in your dream indicates that you are clear on your feelings and are expressing them in a healthy manner. There is no confusion or ambiguity on how you feel about a situation or about a person.<\/p>"
    },
    {
        "title": "Cyborg",
        "desc": "<p>To see or dream that you are a cyborg implies that you need to balance your objectivity with your personal feelings. It may also mean that you are too rigid in your thinking.<\/p>"
    },
    {
        "title": "Cyclamen",
        "desc": "<p>To see cyclamen in your dream represents the feminine mystique, seduction, lust and allure.<\/p>"
    },
    {
        "title": "Cyclone",
        "desc": "<p>To see a cyclone in your dream suggests that you are fighting against some emotional turmoil.<\/p>"
    },
    {
        "title": "Cyclops",
        "desc": "<p>To see Cyclops in your dream suggests that you may be narrow-minded and need to expand the scope of your vision. Alternatively, you may be too overly focused on one thing.<\/p>"
    },
    {
        "title": "Cylinder",
        "desc": "<p>To see a cylinder in your dream suggests that you are receptive to new ideas, especially if both ends of the cylinder are open. If the cylinder is closed, then it implies that you are exhibiting caution in what you share about yourself.<\/p>"
    },
    {
        "title": "Cymbals",
        "desc": "<p>To dream that you are playing with cymbals indicate that you are overreacting in some situation. You are making too much fuss over a small thing. Alternatively, the dream refers to your connection to your spirituality.<\/p>"
    },
    {
        "title": "Cypress",
        "desc": "<p>To see a cypress tree in your dream symbolizes death, the underworld, and the subconscious. It may also indicate a time of mourning and sadness.<\/p>"
    },
    {
        "title": "Cyst",
        "desc": "<p>To dream that you have cyst suggests that you have something that needs to be expressed and get out in the open. You may be harboring some prejudices, attitudes, or some other negative emotion that attempting to be released. You need to acknowledge these feelings and deal with them. Also consider the symbolism of where on the body the cyst is located.<\/p>"
    }
]