[
    {
        "title": "D",
        "desc": "<p>To see the letter &quot;D&quot; in your dream signifies mediocrity. Alternatively, the letter D refers to receptiveness and joy. As a Roman Numeral, it could represent the number 500.<\/p>"
    },
    {
        "title": "Dachshund",
        "desc": "<p>To see a Dachshund in your dream highlights your loyalty and devotion to others. You are well grounded and rational in your thinking.<\/p>"
    },
    {
        "title": "Dad",
        "desc": "<p>*Please See: <a href=\"#Father\">Father<\/a>.<\/p>"
    },
    {
        "title": "Daffodil",
        "desc": "<p>To see daffodils in your dream symbolize self-love, renewal, inner growth, optimism, inspiration, and hope. It may signal a fresh start, a new beginning or a new project.<\/p><p>To give someone daffodils in your dreamrepresent unrequited love. Someone that you are interested in may not feel the same way about you. The dream is telling you that it is time to move on.<\/p>"
    },
    {
        "title": "Dagger",
        "desc": "<p>To see or use a dagger in your dream represents some &quot;cutting remark&quot;. Perhaps you feel that you have been stabbed in the back.<\/p><p>To dream that you take a dagger from somebody's hand means you will overcome hardships and misfortune.<\/p>"
    },
    {
        "title": "Dahlias",
        "desc": "<p>To see dahlias in a dream signify good fortune in financial matters. In particular, if the daffodils are wiling, then it represents loss and sorrow.<\/p>"
    },
    {
        "title": "Dairy",
        "desc": "<p>To dream that you are in a dairy farm suggest that you are well nurtured and well care for.<\/p>"
    },
    {
        "title": "Daisy",
        "desc": "<p>To see daisies in your dream symbolize freshness, beauty, innocence, simplicity, friendliness, and cleanliness. If you are plucking the petals of a daisy, then it denotes the purity of love.<\/p><p>To dream that someone gives you a bouquet of daisies symbolizes sorrow and\/or lost love.<\/p><p>To dream of walking in a field of daisies represents good luck and prosperity. Someone will be there to offer you a helping hand and some guidance for your problems.<\/p>"
    },
    {
        "title": "Dalai Lama",
        "desc": "<p>To see the Dalai Lama in your dream represents spiritual enlightenment. There is some important message or advice that you need to take from such a dream. Alternatively, dreaming of the Dalai Lama may be telling you not to focus on material wants and gains. You need to free yourself from your possessions.<\/p>"
    },
    {
        "title": "Dalmatian",
        "desc": "<p>To see a Dalmatian in you dream suggests that you overlook your own feelings in order to tend to the needs of others. You are a people pleaser.<\/p>"
    },
    {
        "title": "Dam",
        "desc": "<p>To see a dam in your dream signifies repressed emotions or feelings that needs to be released. To dream of a bursting dam denotes that you have lost control of your anger and are overwhelmed with emotions.<\/p>"
    },
    {
        "title": "Damask Rose",
        "desc": "<p>To see a damask rosebush in your dream signifies happy unions.<\/p><p>To dream that you receive a bouquet of damask rose foretells of true love.<\/p>"
    },
    {
        "title": "Damn",
        "desc": "<p>To dream that you are being damnedindicates that you need to use caution in a new situation. You are also overly concerned with what others think of you. Alternatively, if someone damns you in your dream, then it means that you need to be more thick skinned and not let others get to you so easily.<\/p>"
    },
    {
        "title": "Damson",
        "desc": "<p>To see a damson tree full with fruit in your dream signifies riches. You will be well-rewarded. Alternatively, it suggests that you will experience some loss and sorrow. A dark cloud will hover over you.<\/p>"
    },
    {
        "title": "Dance",
        "desc": "<p>To dream that you are dancing signifies freedom from any constraints and restrictions. Your life is in balance and in harmony. Dancing also represents frivolity, happiness, gracefulness, sensuality and sexual desires. You need to incorporate these qualities in your waking life.<\/p><p>To dream that you are dancing with a partner signifies intimacy and a union of the feminine and masculine aspects of yourself. If you are leading, then it indicates that you are in control of your personal life. It could also mean that you are being overly aggressive and assertive. If you dream that someone asks you to dance, then it highlights the notion that you are a follower. You feel that you need someone in order to be complete and in harmony. If you dream that someone asks you to dance, then it highlights the notion that you are a follower. You feel that you need someone in order to be complete and in harmony. In particular, to dream that you are dancing with your ex represents your full acceptance of her or him for the person he or she was. The break-up was a positive decision.<\/p><p>To dream that you are dancing with your ex represents your full acceptance of him or her for the person he or she was. The break-up was a positive decision.<\/p><p>To dream that you are attending or going to a dance indicates a celebration and your attempts to achieve happiness. Consider the phrase the &quot;dance of life&quot; which suggests creation, ecstasy, and going with what life has to offer you.<\/p><p>To see children dancing in your dream indicates a happy home life.<\/p><p>To see ritualistic dancing in your dream denotes your need to get in touch with the spirit within.<\/p>"
    },
    {
        "title": "Dance Class",
        "desc": "<p>To dream that you are in dance class indicates that you need to learn to let go. The dream may also be a metaphor that you are learning the steps to some new project, new process or new stage in your life.<\/p>"
    },
    {
        "title": "Dance Floor",
        "desc": "<p>To see a dance floor in your dream implies that you need to be more expressive. It is time to let loose. If there is no one on the dance floor, then it means that you are lacking an outlet to express yourself. You feel that you can't be who you really are.<\/p>"
    },
    {
        "title": "Dance Recital",
        "desc": "<p>To see or dream that you are in a dance recital suggests that you are ready to move forward into a new phase in your life.<\/p>"
    },
    {
        "title": "Dandelion",
        "desc": "<p>To see dandelions in your dream represent pleasant and joyous surroundings. You are content with where you are at in life. Alternatively, the dream seeks to bring your back to your childhood and past memories.<\/p><p>To dream that you are blowing on dandelions symbolize fleeting moments. You are trying to recapture a certain time in your life. You feel that time is passing you by.<\/p><p>To dream that you are eating dandelions signify that you need to take better care of your health or suffer unpleasant consequences.<\/p>"
    },
    {
        "title": "Dandruff",
        "desc": "<p>To dream that you have dandruff indicates that you are misusing your energy. You may have been under a lot of stress and tension. You should rethink the way you are approaching any of your current problems. Alternatively, this dream may suggest a lack of self-esteem.<\/p>"
    },
    {
        "title": "Danger",
        "desc": "<p>To dream that you are in danger suggests that you need to be more cautious in some aspect of your life. Alternatively, your negativity and pessimistic attitude is causing you to be depressed about the future.<\/p><p>To dream that you escape from danger signifies that you will rise to a place of high position and honor in your business and social circle.<\/p>"
    },
    {
        "title": "Dare",
        "desc": "<p>To dream that you dare someone to do something suggests that you are too dominating or too overbearing.<\/p><p>To dream that someone dared you do something indicates that you will find yourself in some embarrassing or compromising position.<\/p>"
    },
    {
        "title": "Daredevil",
        "desc": "<p>To watch or dream that you are a daredevil means that you need to take a risk and be more &quot;daring&quot; in some situation. You will go nowhere if you just sit around thinking about it. It is time to take action.<\/p>"
    },
    {
        "title": "Darkness",
        "desc": "<p>To dream that darkness comes upon you signifies failure in some work that you are attempting. Darkness is synonymous with ignorance, the subconscious, evil, death, and fear of the unknown. If the sun breaks through the darkness, then you will overcome your failures. If you feel safe in the dark, then it suggests that you like not knowing about certain things. As some might say, ignorance is bliss.<\/p><p>To dream that you cannot find someone in the darkness signifies that you need to keep your temper in check. You have the tendency to let your emotions get out of control and lose your temper.<\/p><p>To dream that you are lost in the darkness denotes feelings of desperation, depression, or insecurity.<\/p><p>To dream that you are groping around in the darkness indicates that you have insufficient information to make a clear decision. Do your research and do not rush into making choices.<\/p>"
    },
    {
        "title": "Darkroom",
        "desc": "<p>To dream that you are in a darkroom suggests that you are waiting for something to happen. You are curious to see what might develop in a situation.<\/p>"
    },
    {
        "title": "Dartboard",
        "desc": "<p>To see a dartboard in your dream indicates that you are feeling hostility from someone. You need to express your anger and feelings more directly. Alternatively, the dartboard may symbolize a goal that you are aiming for. You need to try and take a shot at something new and overcome your fear of failure.<\/p>"
    },
    {
        "title": "Darth Vader",
        "desc": "<p>To see Darth Vader in your dream implies that you are struggling between good and evil. Alternatively, the Darth Vader represents your shadow aspect. There is a negative influence or force pulling you toward the dark side.<\/p><p>To dream that someone you know is Darth Vader implies that there is some good in everyone.<\/p>"
    },
    {
        "title": "Darts",
        "desc": "<p>To dream that you are throwing darts in your dream refers to some hurtful or harmful remarks that you or someone have said. Alternatively, it represents your goals and your &quot;go-getter&quot; attitude.<\/p>"
    },
    {
        "title": "Dashboard",
        "desc": "<p>Tosee a dashboard in your dream represents the status of your goals and of where you are headed in life.<\/p>"
    },
    {
        "title": "Date",
        "desc": "<p>To dream that you are on a date represents your need for self-discovery and self-awareness. You are getting to know some hidden aspects of yourself and acknowledging your hidden talents. Alternatively, it may reflect your anxieties about dating or finding acceptance. The dream may also be a &quot;rehearsal&quot; for an actual date you have. It serves to overcome anxieties you may have.<\/p><p>To dream that you are dating two people at the same time signifies passion in your own personal relationship. This dream does not necessarily mean that you want to stray from your significant other. It may also indicate some anxiety on some major change in the relationship.<\/p><p>To dream of a date, as in a particular, month, day and year represents the passing of time and past events. The dream may also be a reminder of a special event, appointment or important date in your waking life. Also consider the significance of the numbers in the date.<\/p>"
    },
    {
        "title": "Dates",
        "desc": "<p>To see plump ripe dates growing on a tree represents happiness and joy. Take some time to relax and find peace of mind. The dream may also be a metaphor for a date that you are going on or an important date or appointment that you have to keep.<\/p><p>To dream that you are eating dates signify distress. You are never happy with what you have and are always trying to acquiring more material things.<\/p>"
    },
    {
        "title": "Dating Show",
        "desc": "<p>To watch or dream that you are on a dating show implies that you are looking to be in a relationship, but are looking in all the wrong places. Or perhaps you feel that your love life is being scrutinized or being put on display. Consider the name of the dating show and how it relates to your current relationship views or status.<\/p>"
    },
    {
        "title": "Daughter",
        "desc": "<p>To see your daughter in your dream reflects your ideal or your better self. Alternatively, the dream may represent your waking relationship with your daughter and the qualities that she projects.<\/p><p>If you do not have a daughter, then the dream symbolizes the feminine aspect within yourself.<\/p>"
    },
    {
        "title": "Daughter-In-Law",
        "desc": "<p>To see your daughter-in-law in your dream suggests that an unexpected incident will either provide you with joy or distress, depending on her attitude.<\/p>"
    },
    {
        "title": "Dawn",
        "desc": "<p>To see the dawn in your dream signifies rejuvenation, enlightenment, and vitality. You are emerging out from a new stage in life and have a new understanding or a new start in life.<\/p>"
    },
    {
        "title": "Day",
        "desc": "<p>To dream of a sunny day symbolizes clarity and\/or pleasantness. You are seeing things clearly. To dream of a gloomy or cloudy day signifies sadness. If you dream of a particular day, then you may need to look closely at that day for any significance. Consider the number associated with that day. A certain date could highlight a special anniversary, appointment or occasion.<\/p><p>To dream of the passing of a day indicates that you need to manage your time better and plot out your goals in a more deliberate manner.<\/p>"
    },
    {
        "title": "Daybreak",
        "desc": "<p>To dream that the day breaks signifies success in your projects and endeavors. Your outlook is looking good.<\/p>"
    },
    {
        "title": "Daycare",
        "desc": "<p>To dream that you are at a daycare indicates that you want to be taken care of and not have to worry about anything else. You want to go back to a simpler time. Consider the condition of the daycare for additional significance. If the daycare is chaotic, dirty and unorganized, then it parallels how you see the issues in your life. If the daycare is calm and cheery, then it suggests that you have a handle over the problems in your life.<\/p>"
    },
    {
        "title": "Dead",
        "desc": "<p>To see or talk to the dead in your dream forewarns that you are being influenced by negative people and are hanging around the wrong crowd. This dream may also be a way for you to resolve your feelings with those who have passed on. Alternatively, the dream symbolizes material loss.<\/p><p>If you dream of a person who has died a long time ago, then it suggests that a current situation or relationship in your life resembles the quality of that deceased person. The dream may depict how you need to let this situation or relationship die and end it. If you dream of someone who has recently passed away, then it means that their death is still freshly in your mind. You are still trying to grasp the notion that he or she is really gone. Dreams can also be a way for you to keep loved ones who have past away alive and still be in some aspect of your life. If the dead is trying to get you to go somewhere with him or her, then it signifies that you are trying to understand their death. You also don't want to be alone.<\/p><p>To see and talk with your dead parents in your dream is a way of keeping them alive. It is also a way of coping with the loss. You are using your dream as a last opportunity to say your final good-byes to them.<\/p><p>To see your dead sibling, relative, or friend alive in your dream indicates that you miss them and are trying to relive your old experiences you had with them. In trying to keep up with the pace of your daily waking life, your dreams may serve as your only outlet in coping and coming to terms with the loss of a loved one.<\/p><p>To dream of your dead child is a way for you to keep your child alive through your dreams. For a parent to lose a child is extremely difficult. Such dreams occur because you still cannot accept or understand how or why your child was taken from you so soon.<\/p><p>Dreaming of a dead person who passes away again in your dream means that you wished they were still around to experience and share certain aspects of your life with you. Such dreams are more likely to occur during happy times or during important milestones in your life.<\/p><p>*Please see also: <a href=\"#Death\">Death<\/a><\/p>"
    },
    {
        "title": "Dead End",
        "desc": "<p>To dream that have reached a dead end indicates that you have come to an abrupt end in the pursuit of your goals. You must find another way to achieve your goals because the current path is not working out. Alternatively, the dream may be telling you that you are going nowhere. Perhaps, the dream is symbolic of a dead end job or a dead end relationship. You need to reevaluate your options.<\/p>"
    },
    {
        "title": "Deadline",
        "desc": "<p>To dream of a deadline signifies your preoccupation with time. You feel that time is running out for you and that will not be able to meet your goals by a set time. You need to learn to prioritize and balance aspects of your life.<\/p>"
    },
    {
        "title": "Deaf",
        "desc": "<p>If you are not deaf in real life and dream that you are deaf, then it suggests that you are feeling secluded from the world. You may be closing yourself off from new experiences or shutting yourself out. Alternatively, the dream could indicate that your defenses are up. There is something that you are refusing to hear. Perhaps you have problems taking criticism. The dream could just mean that you are in need of some peace and quiet.<\/p><p>To dream that someone else is deaf suggests that someone close to you is withdrawn.<\/p>"
    },
    {
        "title": "Death",
        "desc": "<p>To dream about the death of a loved one suggests that you are lacking a certain aspect or quality that the loved one embodies. Ask yourself what makes this person special or what you like about them. It is that very quality that you are lacking in your own relationship or circumstances. Alternatively, the dream indicates that whatever that person represents has no part in your own life anymore. In particular, to dream about the death of your living parents indicates that you are undergoing a significant change in your waking life. Your relationship with your parents has evolved into a new realm. If you dream about the death of a child, then it implies that you need to let go of your immaturity and start being more serious. As your child reaches certain milestones and grows into an adult, dreaming of their death may be symbolic of their own self-discovery, transition and transformation into a new stage of life.<\/p><p>To dream that you are faking your own death suggests that you are looking for a new start. You need some change in your life. If you dream that your significant other is faking their own death, then the dream represents something new that you are learning about them. Or it may mean that they are not who you thought they were.<\/p><p>To have a near death experience in your dream implies that you are experience a relapse of sorts. You are reverting back to your old habits and ways. Alternatively, the dream indicates that you are being given a second chance or second try at something.<\/p><p>To dream that you die in your dream symbolizes inner changes, transformation, self-discovery and positive development that is happening within you or your life. You are undergoing a transitional phase and are becoming more enlightened or spiritual. Although such a dream may bring about feelings of fear and anxiety, it is no cause for alarm as it is often considered a positive symbol. Dreams of experiencing your own death usually means that big changes are ahead for you. You are moving on to new beginnings and leaving the past behind. These changes does not necessarily imply a negative turn of events. Metaphorically, dying can be seen as an end or a termination to your old ways and habits. So, dying does not always mean a physical death, but an ending of something. If you dream that someone is telling you that you are going die, then it implies that you are being pressured to make an important change or choice. You are about to embark on some new life adventure.<\/p><p>If a love one has past away, but you dream that he or she didn't really die that first time and are being buried again indicates that this loved one was taken before their time and you never got a chance to say a proper good bye. Perhaps there was some unfinished issue that is still left lingering long after their death. You wished you had a little more time with them.<\/p><p>On a negative note, to dream that you die may represent involvement in deeply painful relationships or unhealthy, destructive behaviors. You may feeling depressed or feel strangled by a situation or person in your waking life. Perhaps your mind is preoccupied with someone who is terminally ill or dying. Alternatively, you may be trying to get out of some obligation, responsibility or other situation. You are desperately trying to escape from the demands of your daily life.<\/p><p>To see someone dying in your dream signifies that your feelings for that person are dead or that a significant change\/loss is occurring in your relationship with that person. Alternatively, you may want to repress that aspect of yourself that is represented by the dying person. If you see a stranger die in your dream, then it implies that you are feeling detached from the changes that are happening around you.<\/p><p>*Go to: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/death-dreams.html\">Common Dreams: Death Dreams<\/a> for further analysis. Also See the Meaning in Action: &quot;<a href=\"http:\/\/www.dreammoods.com\/dreambank\/death-dreams-family.html\">Eating Out with My Dead Mother<\/a>&quot; and &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=deathdream1\">Grandmother's Death<\/a>&quot;.<\/p>"
    },
    {
        "title": "Death Penalty",
        "desc": "<p>To dream that you are given the death penalty means that you need to reevaluate your life and the decisions that you are making. You are going on the wrong path. Alternatively, a death sentence means that you have a limited time to respond or to do something.<\/p>"
    },
    {
        "title": "Debate",
        "desc": "<p>To dream that you are in a debate symbolizes some inner turmoil or conflict that you are experiencing. It also means that you will find closure to those unresolved issues.<\/p>"
    },
    {
        "title": "Debt",
        "desc": "<p>To dream that you are in debt signifies imbalance, struggle, worry and trouble in some personal situation or business matter. Alternatively, it may indicate that you are putting too much demands of others.<\/p>"
    },
    {
        "title": "Debutante Ball",
        "desc": "<p>To attend a debutante ball in your dream represents a celebration of life. You are welcoming new experiences, changes and challenges.<\/p><p>To dream that a debutante ball is held in your honor indicates that you are undergoing a transitional phase in your life. It is a new beginning for you.<\/p>"
    },
    {
        "title": "Decapitation",
        "desc": "<p>*Please See: <a href=\"#behead\">Behead<\/a>.<\/p>"
    },
    {
        "title": "Decay",
        "desc": "<p>To see something decay in your dream signifies the degradation of a situation or circumstance. It may also represent the death of an old situation before the rebirth into a new stage.<\/p>"
    },
    {
        "title": "Deceased",
        "desc": "<p>*Please See: <a href=\"#Dead\">Dead<\/a>.<\/p>"
    },
    {
        "title": "December",
        "desc": "<p>To dream of the month of December signifies togetherness, friendships, and happy reunions. Consider your own personal associations with this month. Is it someone's birthday? Does it invoke the holiday spirit? Is the dream telling you to be more giving? Does December signify a closure to something?<\/p>"
    },
    {
        "title": "Deception",
        "desc": "<p>To dream that you are deceiving someone suggests that you are lying to yourself that everything is okay when in reality it is not. You are trying to cover up some mistake or some lie. The deceit is manifesting itself into your dream and eating away at your conscious.<\/p>"
    },
    {
        "title": "Deck",
        "desc": "<p>To dream that you are out on the deck represents your connection with your Self and with nature. You need to be more aware of your surroundings and appreciate the environment. Alternatively, the dream may be a metaphor that you are all &quot;decked out&quot; for some special occasion. You are showing off.<\/p>"
    },
    {
        "title": "Decompose",
        "desc": "<p>*Please See: <a href=\"#Decay\">Decay<\/a>.<\/p>"
    },
    {
        "title": "Decorate",
        "desc": "<p>To dream that you are decorating suggests that you are trying to mask or cover up something. You may be putting up a front instead of addressing the core matter at hand.<\/p>"
    },
    {
        "title": "Decoy",
        "desc": "<p>To dream that you are using a decoy indicates your tendency to mislead people. Your conscious may be appearing in your dream to try and steer you back in the right direction.<\/p><p>To dream that you are a decoy represents self denial or self deception. You are trying to tell yourself to believe one thing, but really feel differently.<\/p>"
    },
    {
        "title": "Deed",
        "desc": "<p>To dream that you a signing a deed suggests that you are making some unwise choices.<\/p>"
    },
    {
        "title": "Deep",
        "desc": "<p>To dream of something deep or a place of great depth represents things that you are avoiding or feelings that you are suppressing. Alternatively, the dream implies that there is more to something or someone that what you see on the surface.<\/p>"
    },
    {
        "title": "Deer",
        "desc": "<p>To see a deer in your dream symbolizes grace, compassion, gentleness, meekness and natural beauty. It has feminine qualities and may point to the feminine aspect within yourself. It also represents independence, alertness, and virility. Consider the symbol to be a pun for someone who is &quot;dear&quot; to you. Alternatively, the dream represents vulnerability and naivet&#65533;. As a result, others may take advantage of you and your gullibility.<\/p><p>If the deer is black, then it means that you are not acknowledging or are rejecting the feminine qualities in you. You may not be in tune with your feminine side.<\/p><p>To dream that you hunt or kill a dear suggests that you are trying to suppress those feminine qualities.<\/p><p>Dreaming that you are bottle feeding a baby deer highlights your nurturing attribute. A baby animal is often a symbol of your own child.<\/p>"
    },
    {
        "title": "Defeat",
        "desc": "<p>To dream that you have been defeated indicates that you are headed in the wrong direction. You need to reevaluate the situation and rethink what is really best for you. Alternatively, the dream suggests that you need to learn from your experiences, even the negative ones.<\/p>"
    },
    {
        "title": "Defecate",
        "desc": "<p>To dream that you are defecating on someone indicates your anger and hostility toward that person.<\/p><p>To dream that you are being defecated on represents feelings of guilt and unworthiness. You may be suffering from low self-esteem.<\/p><p>Dreaming that someone defecated on your bed suggests that you are ashamed about some past secret coming back to haunt you. If a member of your family comes in contact wit the feces, then it points to some unfinished business that is affecting your family.<\/p><p>*Please see also: <a href=\"#Bowel%20Movement\">Bowel Movement<\/a> or: <a href=\"#feces\">Feces<\/a>.<\/p>"
    },
    {
        "title": "Defend",
        "desc": "<p>To dream that you are defending yourself suggests an underlying hurt. It may parallel a waking life situation where you are being put on the defensive.<\/p><p>To dream that you are defending someone indicates that you are projecting your beliefs and feelings onto someone else. By defending this person, you are deflecting or undermining your own beliefs. Perhaps you are not ready to confront your feelings.<\/p><p>Dreaming that someone is defending you or standing up for you symbolizes your sense of self-worth.<\/p>"
    },
    {
        "title": "Defibrillator",
        "desc": "<p>To dream that someone is using a defibrillator on you implies that you need to be reenergized. You need to literally get a jumpstart on your goals.<\/p>"
    },
    {
        "title": "Deflate",
        "desc": "<p>To dream that a tire, ball or balloon is deflated signifies a lack of self esteem or self-worth. According to Freud, deflation symbolizes impotence.<\/p>"
    },
    {
        "title": "Deformed",
        "desc": "<p>To dream that you or someone is deformed represents undeveloped aspects of yourself that you may have ignored. You refusal to acknowledge these characteristics may be affecting your performance and creative flow.<\/p>"
    },
    {
        "title": "Defriend",
        "desc": "<p>To dream that you are defriending someone suggests that your friendships are drifting apart. You are feeling socially disconnected or withdrawn. Alternatively, the dream indicates aspects of your own self that you are rejecting or refusing to acknowledge.<\/p><p>To dream that you have been defriended indicates that you are feeling betrayed.<\/p>"
    },
    {
        "title": "Defy",
        "desc": "<p>*Please see: <a href=\"#Disobedience\">Disobedience<\/a>.<\/p>"
    },
    {
        "title": "D�j� Vu",
        "desc": "<p>To dream of D�j� Vu indicates some unresolved issue which you are not addressing or are refusing to acknowledge. It may also represent a message or word of advice that you need to heed.<\/p>"
    },
    {
        "title": "Delay",
        "desc": "<p>To experience a delay in your dream suggests that obstacles toward your goals are inevitable. Don't let these setbacks discourage you.<\/p>"
    },
    {
        "title": "Deli",
        "desc": "<p>To dream that you are at a deli indicates that you are seeking for emotional nourishment outside of your social support system. You want to know the options that are available to you. Alternatively, the dream suggests that you need to watch your weight.<\/p>"
    },
    {
        "title": "Delight",
        "desc": "<p>To dream that you are experiencing delight signifies a favorable and positive turn of events. Pleasant times are ahead for you.<\/p>"
    },
    {
        "title": "Delinquent",
        "desc": "<p>To see a delinquent in your dream indicates that you are wasting away some aspect of your life. You are selling yourself short and underestimating your own potential.<\/p><p>Dreaming that you are delinquent with your bills suggests that your mind is preoccupied with financial and money matters. You may be feeling overwhelmed with life's demands.<\/p>"
    },
    {
        "title": "Deliverance",
        "desc": "<p>To dream about deliverance refers to your need to feel protected. You may be feeling a little vulnerable and are looking strength. The dream may also indicate that you are being swayed by some negative influences in your life.<\/p>"
    },
    {
        "title": "Delivery",
        "desc": "<p>To dream that you are expecting a delivery or have a delivery signifies disappointments. Alternatively, the dream is telling you to be grateful and appreciative with what you have. Alternatively, the dream may be a metaphor for delivery of a baby. *Please also see: <a href=\"#Birth\">Birth<\/a>.<\/p><p>To deliver something in your dream indicates that you need to give more in some relationship or situation. Consider the significance of what you are delivering for meaning as to what you need to give more of.<\/p>"
    },
    {
        "title": "Delta",
        "desc": "<p>To see a river delta in your dream represents an end to something in your waking life. This may relate to some personal or spiritual journey. Alternatively, the dream may share the same symbolism as a triangle.+<\/p>"
    },
    {
        "title": "Dementia",
        "desc": "<p>To dream that you or someone has dementia implies that there is a waking situation that is causing you to &quot;lose your mind.&quot; Perhaps someone or some situation is literally driving you crazy. Alternatively, the dream may be reflective of someone in your waking life who is suffering from dementia.<\/p>"
    },
    {
        "title": "Demeter",
        "desc": "<p>To see Demeter in your dream represents your maternal instinct and your desire to provide for and support your dependents.<\/p>"
    },
    {
        "title": "Demolition",
        "desc": "<p>To dream of a demolition suggests that you are undergoing major changes in your life. You may feel out of control. Alternatively, to watch a demolition in your dream indicates a final end to some situation or relationship.<\/p>"
    },
    {
        "title": "Demons",
        "desc": "<p>To see demons in your dream indicates that you may be experiencing or inflicting fear, emotional distress or physical abuse in your waking life. Demons are also symbolic of ignorance, negative habits, and of your shadow self. Perhaps you are being overindulgent and letting some negativity give way to your better judgment. Alternatively, the demons may represent a past secret that is still haunting you.<\/p><p>To dream that you are possessed by demons indicates helplessness.<\/p>"
    },
    {
        "title": "Demonstration",
        "desc": "<p>To dream that you are part of a demonstration indicates that you need to speak up for yourself and for your rights. Pay attention to the details of your dream as you may be ignoring or overlooking some important issue in your life.<\/p>"
    },
    {
        "title": "Demotion",
        "desc": "<p>To dream that you are getting a demotion at work indicates a lack of self-esteem and confidence. You are fixated on the negative aspects of your life. On the other hand, your dream demotion may point to your arrogance and that you need to tone it down. Alternatively, being demoted means that you are not giving an important task your full attention.<\/p>"
    },
    {
        "title": "Den",
        "desc": "<p>To dream that you are in the den signifies work, industry, and efficiency.<\/p>"
    },
    {
        "title": "Denial",
        "desc": "<p>To dream that you are in denial about something reflects your waking state of mind. You are refusing to see or acknowledge some truth.<\/p><p>To dream that you are being denied something suggests that you are not measuring up to the expectation of others. Alternatively, it signifies overindulgence. Consider what you are being denied for additional significance.<\/p>"
    },
    {
        "title": "Denim",
        "desc": "<p>To see or wear denim in your dream signifies ruggedness and durability. The dream may be analogous to your ability to withstand or endure a difficult period in your life. Alternatively, the dream symbolizes your easygoing and laid back attitude.<\/p>"
    },
    {
        "title": "Dent",
        "desc": "<p>To see a dent in your dream signifies self-doubt in your thinking. You are second guessing your decisions. It also represents a blemish in your personality.<\/p>"
    },
    {
        "title": "Dental Floss",
        "desc": "<p>To floss in your dreamsuggests that you are trying to get to the root of some matter. Alternatively, the dream may be a metaphor that you are showing off and flaunting your material things. If your gums become bloody as a result of flossing, then it represents your fears and the negative consequences of your actions.<\/p>"
    },
    {
        "title": "Dentist",
        "desc": "<p>To dream that you are at the dentist represents your concerns about your appearance. Alternatively, it suggests that you are having some doubt over the sincerity and honor of some person in your life. You are experiencing some momentary anxiety or pain, but you will be a better and stronger person for it in the long run.<\/p>"
    },
    {
        "title": "Dentures",
        "desc": "<p>To dream that you are wearing dentures indicate that you are not being completely truthful in some waking matter.<\/p><p>To see or dream that others are wearing dentures suggests that someone in your life is not who they say they are. They are being deceitful.<\/p>"
    },
    {
        "title": "Deodorant",
        "desc": "<p>To see or put on deodorant in your dream represents your inner strength and your ability to rid yourself of harmful and destructive behaviors.<\/p>"
    },
    {
        "title": "Depart",
        "desc": "<p>To dream that you are departing somewhere suggests that you are leaving a past life or an old relationship behind. You are looking for a change or for something new. Alternatively, the dream may also represent your desire to escape from the daily demands of your life.<\/p>"
    },
    {
        "title": "Department Store",
        "desc": "<p>To dream that you are in a department store suggests that you are trying to fulfill your needs and desires. Consider the significance of what you are shopping for and how you may be lacking that item in your life.<\/p>"
    },
    {
        "title": "Deportation",
        "desc": "<p>To dream that you are being deported indicates that you are feeling unwanted or unwelcome in some new surrounding. You are feeling rejected and unwanted.<\/p><p>To dream that someone is deported signifies an aspect of your own self that is feeling rejected.<\/p>"
    },
    {
        "title": "Depression",
        "desc": "<p>To feel depressed in your dream refers to your inability to make connections. You are unable to see the causes of your problems and consequences of your decisions. People who are depressed in their waking life often have dreams about being depressed. Pay attention to what is depressing you in your dream and see how it relates to your waking life.<\/p>"
    },
    {
        "title": "Derailment",
        "desc": "<p>To dream that a train has derailed suggests that you are doing something against your own conscious.<\/p>"
    },
    {
        "title": "Derrick",
        "desc": "<p>To see derricks in your dream symbolize the obstacles that you need to overcome in order to succeed. The dream may also be a pun on someone who is named &quot;Derek&quot; in your waking life.<\/p>"
    },
    {
        "title": "Desert",
        "desc": "<p>To dream that you are walking through a desert signifies loss and misfortune. You may be suffering from an attack on your reputation. Deserts are also symbolic of barrenness, loneliness and feelings of isolation and hopelessness. The desert landscape may also be a metaphor for feeling deserted and left behind.<\/p>"
    },
    {
        "title": "Desk",
        "desc": "<p>To see or sit at your desk in your dream suggests that you are evaluating and weighing your problems. It is indicative of self-exploration and discovery. If you are at someone else's desk, then it symbolizes a lack of confidence in your own abilities.<\/p><p>To dream that your desk is cluttered indicates that you need to prioritize and reorganize aspects of your life. If the desk is cleaned out, then it suggests that you need to find more productive ways to spend your time. Pick up a new hobby.<\/p>"
    },
    {
        "title": "Despair",
        "desc": "<p>To dream that you are in despair represents the many hardships and cruelties that you will experience in the waking world. Alternatively, the dream may be a pun on &quot;the spare&quot;. Perhaps the dream is hinting at some back up.<\/p><p>To dream that others are in despair denotes that someone around you will be in need of your help.<\/p>"
    },
    {
        "title": "Dessert",
        "desc": "<p>To see or eat a tasty dessert in your dream represents indulgence, celebration, reward, or temptation. You are enjoying the good things in life.<\/p>"
    },
    {
        "title": "Destruction",
        "desc": "<p>To dream about mass destruction suggests that there is some chaos occurring in your life. Things may not be going the way you want it to. Perhaps the choices you are making are self-destructive.<\/p>"
    },
    {
        "title": "Detective",
        "desc": "<p>To see a detective in your dream signifies the thrills and dangers in some aspect of your waking life.<\/p><p>To dream that you are a detective indicates that you are searching for your hidden abilities and talents. You may be trying to solve a problem and seek out the truth about some worrisome issue.<\/p><p>To dream that you are being followed by a detective signifies guilt. Your character will be put under scrutiny and called into question.<\/p>"
    },
    {
        "title": "Detention",
        "desc": "<p>To dream that you are in detention suggests that you need to reflect on your negative actions and bad behavior. Learn from your past mistakes.<\/p>"
    },
    {
        "title": "Detergent",
        "desc": "<p>To see or use detergent in your dream indicates that you need to resolve a major problem in your life. You may also need to clean up your image or readjust your attitude.<\/p>"
    },
    {
        "title": "Determination",
        "desc": "<p>To dream that you have determination represents your ambition and realization of your goals. It refers to your attitude and the restrictions that you or others impose onto you.<\/p>"
    },
    {
        "title": "Detour",
        "desc": "<p>To see a detour in your dream suggests that you have encountered an obstacle in some aspect of your life. You are not wanting to confront something directly, and thus are trying to find a way around it.<\/p>"
    },
    {
        "title": "Devil",
        "desc": "<p>To see the devil in your dream signifies fear, limitations, and negative aspects of yourself. You may be harboring feelings of guilt. It is time to release these feelings. Alternatively, the devil represents intelligence, cunningness, deception, and cleverness.<\/p><p>To dream that you fight off the devilindicates that you will succeed in defeating your enemies.<\/p><p>To dream that the devil talks to you suggests that you will find certain temptations hard to resist even though you know it is not in your best interest.<\/p><p>To dream that you and the devil are friends suggests that you are easily influenced and can be persuaded into doing something you do not necessarily want to do. Alternatively, you may be dealing with issues of morality.<\/p>"
    },
    {
        "title": "Devotion",
        "desc": "<p>To dream that you are showing your devotion to your beliefs is a reminder that nothing will be gained by deceit.<\/p>"
    },
    {
        "title": "Devour",
        "desc": "<p>To dream that you are being devoured indicates a loss in your identity or a fear of losing who you are. The dream may be a metaphor of being consumed by your own ambition or obsession.<\/p><p>To dream that you are devouring something represents the things that drives and motivates you.<\/p>"
    },
    {
        "title": "Dew",
        "desc": "<p>To dream that dew is falling represents a spiritual renewal and cleansing. You are experiencing a sense of calm and refreshment. Alternatively, the dream may be a pun on &quot;to do&quot;. Perhaps there is something that you must do.<\/p>"
    },
    {
        "title": "Diabetes",
        "desc": "<p>If you do not have diabetes in your life, but dream that you are diabetic, then the dream may mean that you have difficulty enjoying the sweeter things in life. You are worrying too much instead of taking time to enjoy the moment.<\/p>"
    },
    {
        "title": "Diadem",
        "desc": "<p>*Please Also See: <a href=\"#crown\">Crown<\/a>.<\/p>"
    },
    {
        "title": "Diagonal",
        "desc": "<p>To dream that things are coming at you diagonally means that you are being caught a little off guard. You are unprepared for what is coming your way. Alternatively, the dream means that you are not being direct about a situation or emotion.<\/p>"
    },
    {
        "title": "Dial",
        "desc": "<p>To see a dial in your dream indicates that you need to be more in tune to your thoughts and to your intuition.<\/p>"
    },
    {
        "title": "Diamond",
        "desc": "<p>To see diamonds in your dream signify the wholeness of the Self. You may be finding clarity in matters that have been clouding you. Alternatively, it represents vanity, conceit, and your unchanging or unyielding nature. You may be distancing yourself from others.<\/p><p>To receive diamond jewelry in your dream signifies love, commitment and dedication. If you lose the diamond jewelry, then it indicates difficulty in your love relationship. It may also be analogous to financial hardships.<\/p><p>To dream that a diamond is fake suggests that you are trying to be someone that you are not. Alternatively, the dream may indicate that you that you are living beyond your means.<\/p><p>To see a diamond shape in your dream symbolizes the many directions that you can take in life. You need to evaluate your goals and how you are going to achieve them.<\/p>"
    },
    {
        "title": "Diaper",
        "desc": "<p>To see or wear a diaper in your dream symbolizes your childish or babyish attitudes\/actions. You may be too dependent on others.<\/p><p>To dream that you are changing diapers suggests a need to clean up you behavior and change your childish ways. Perhaps you need to change your attitude and approach regarding a new idea or project.<\/p><p>To see dirty diapers in your dream indicate that you need to clean up the mess you have created as a result of your childishness.<\/p>"
    },
    {
        "title": "Diarrhea",
        "desc": "<p>To dream that you have diarrhea signifies that some part of your life is going out of control. You can no longer contain your strong emotions and need to get it out of your system quickly. Alternatively, the dream indicates that you have not analyzed a situation long enough or that you do not want to deal with the problem at all.<\/p><p>*Please see also: <a href=\"#BowelMovement\">Bowel Movement<\/a>.<\/p>"
    },
    {
        "title": "Diary",
        "desc": "<p>*Please See: <a href=\"#Journal\">Journal<\/a>.<\/p>"
    },
    {
        "title": "Dice",
        "desc": "<p>To see or play dice in your dream suggests that you are taking chances and playing with fate. It refers to the unpredictability of life. The dream may also be a pun on a situation that may be getting too &quot;dicey&quot;. Consider the significance of the numbers reflected on the dice or how many dice were thrown.<\/p>"
    },
    {
        "title": "Dictator",
        "desc": "<p>To see or dream that you are a dictator suggests that you need to be more flexible and open-minded in your thinking and in your decision making. You are being too controlling. The dream dictator may also symbolize an over controlling father or father figure.<\/p>"
    },
    {
        "title": "Dictionary",
        "desc": "<p>To dream that you are using a dictionary signifies that you rely too much on the opinions of others in the management of your own affairs.<\/p>"
    },
    {
        "title": "Die",
        "desc": "<p>*Please See: <a href=\"#Death\">Death<\/a>.<\/p>"
    },
    {
        "title": "Die Cast Car",
        "desc": "<p>To see or play with die cast cars in your dream suggests that you are spending too much time thinking about your goals instead of taking action towards them. You are taking too long to accomplish your goals. It may also mean that you are wasting time on worthless or fruitless pursuits. Alternatively the dream represents the carefree aspects of childhood where you did not have to worry about goals.<\/p>"
    },
    {
        "title": "Diet",
        "desc": "<p>To dream that you are on a diet suggests that you are punishing yourself. You feel restricted from what you really want to do. Alternatively, it indicates self-control and self-discipline. You are giving up the things that are unhealthy in your life. The key is balance and moderation.<\/p>"
    },
    {
        "title": "Difficulty",
        "desc": "<p>To dream that you are experiencing difficulties reflect waking difficulties. You are under tremendous stress.<\/p>"
    },
    {
        "title": "Digging",
        "desc": "<p>To dream that you are digging indicates that you are working hard to uncover the truth in a problem that is haunting you. You are overly preoccupied with trying to find out something about yourself, your reputation, or your self-identity. Alternatively, the dream suggests that you are trying to get to the root of some issue. Or the dream may be a metaphor to imply an insult.<\/p><p>To dream that you dig a hole and find something may be a pun that you &quot;dig something&quot;, as in you like it or appreciate it. Or it may also refer to someone that you might be &quot;digging&quot; or like. Alternatively, the dream suggests that you need to be more open minded and welcome new ideas.<\/p><p>To dream that you dig a hole and fill it with water denotes that no matter how hard you try, your efforts will not sway things your way. You need to learn to compromise.<\/p><p>To dream that you are digging for mollusks refer to qualities within yourself that are yielding and can be changed. Dreaming of digging for plastic goods refer to qualities within yourself that are unchangeable.<\/p>"
    },
    {
        "title": "Dildo",
        "desc": "<p>To see or use a dildo in your dream suggests that you are feeling unsatisfied in some area of your life, which may or may not relate to sex. There is a void in your life. Alternatively, the dream indicates your desires for a more gratifying sex life.<\/p><p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 1; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">If you see someone else using a dildo in your dream, then it indicates a sexual attraction toward this person.<\/p><p>To wear a strap-on dildo in your dream refers to your unexpressed masculine energy.<\/p>"
    },
    {
        "title": "Dill",
        "desc": "<p>To see or eat dill in your dream represents spiritual and emotional protection. You are not letting the negativity get to you.<\/p>"
    },
    {
        "title": "Dilute",
        "desc": "<p>To dream that you are diluting something implies that you are trying to downplay or shrug off your feelings.<\/p>"
    },
    {
        "title": "Dim",
        "desc": "<p>To dream that it is dim indicates that you are lacking clarity in a waking situation. You need to shed some light or perspective on the issue. Alternatively, the dream may be a metaphor for someone who is dumb or stupid.<\/p>"
    },
    {
        "title": "Dime",
        "desc": "<p>To see a dime in your dream represents the number 10 and thus means closure, strength and big gains. Alternatively, the dream indicates money issues. You need to do some serious saving! Also consider the phrases, &quot;stop on a dime&quot; to mean ending something abruptly or quickly or &quot;drop of a dime&quot; to mean dropping everything to tend to someone else's needs without hesitation.<\/p>"
    },
    {
        "title": "Dimension",
        "desc": "<p>To dream that you are in another dimension refers to your desire of escaping from your own reality. You are feeling disconnected from life and society. Alternatively, the dream is trying to get you to look at something from a different perspective. You need to step outside of the situation. The dream may also be telling you that things are not always what they appear to be.<span style=\"font-size:14.0pt;mso-bidi-font-size:12.0pt;font-family:Arial\"><\/p>"
    },
    {
        "title": "Dimples",
        "desc": "<p>To see dimples in your dream represent happiness, joy, and pleasure. You need to enjoy some frivolity and have some light-hearted fun in your life.<\/p>"
    },
    {
        "title": "Ding",
        "desc": "<p>To hear a ding in your dream symbolizes an idea. You are experiencing a surge in creativity. Alternatively, hearing a ding in your dream indicates either confidence or arrogance.<\/p>"
    },
    {
        "title": "Dining Room",
        "desc": "<p>To dream that you are in a dining room represents your quest for knowledge and understanding. You may be reaching an important decision in your life.<\/p>"
    },
    {
        "title": "Dinner",
        "desc": "<p>To dream that you are eating dinner alone indicates that you need to do some serious thinking about your goals and directions in life. Alternatively, it may represent independence or lack of social skills.<\/p><p>To dream that you are eating dinner with others signifies your acceptance or others, your interpersonal relationships, and how you behave in your social life. It is a time to reflect and share past experiences. It also suggests that you see everyone as an equal.<\/p>"
    },
    {
        "title": "Dinosaur",
        "desc": "<p>To see a dinosaur in your dream symbolizes an outdated attitude. You may need to discard your old ways of thinking and habits.<\/p><p>To dream that you are being chased by a dinosaur indicates your fears of no longer being needed or useful. Alternatively, being chased by a dinosaur, may reflect old issues that are still coming back to haunt you.<\/p><p>To see dinosaurs mating in your dream means that you want to preserve an aspect of your past. Alternatively, dreaming about dinosaurs mating indicate concerns about carrying your family line or legacy.<\/p>"
    },
    {
        "title": "Dip",
        "desc": "<p>To dream that you are going for a dip in the water suggests that you are exploring your emotions.<\/p><p>To dream that you dip your partner represents your self confidence. You may even be showing off a little bit. Alternatively, it also indicates that you are feeling sexually charged.<\/p><p>To see or eat dip in your dream signifies your desires for a little extra flavor in your life. You are looking for some excitement and pizzazz. If you are double dipping, then it represents your selfishness and overindulgence.<\/p>"
    },
    {
        "title": "Diploma",
        "desc": "<p>To see or receive a diploma in your dream symbolizes completion and\/or recognition for a job well done.<\/p>"
    },
    {
        "title": "Diplomat",
        "desc": "<p>To dream that you are a diplomat suggests that you need to approach some situation or problem with care and tact.<\/p>"
    },
    {
        "title": "Directions",
        "desc": "<p>To dream that you are following directions represent your need or ability to accept criticism. It also relates to your feelings about authority.<\/p><p>To dream that you are giving directions refer to your goals and purpose. You are on a path toward self-realization.<\/p>"
    },
    {
        "title": "Director",
        "desc": "<p>To dream that you are a film director refers to your desire to control the outcome of a situation. Alternatively, the dream may be telling you that you need to exert more control over aspects of your life.<\/p>"
    },
    {
        "title": "Dirigible",
        "desc": "<p>To see a dirigible in your dream symbolizes your ambition and the determination to achieve your goals. Alternatively, the dream represents your inflated sense of yourself.<\/p>"
    },
    {
        "title": "Dirt",
        "desc": "<p>To see freshly stirred dirt in your dream symbolizes thriftiness and frugalness. Dirt is also representative of situations where you have been less than honorable and may have acted in a devious manner. You are trying to conceal or bury your questionable behavior.<\/p><p>To dream that someone throws dirt at you suggests that someone is questioning your character and harming your reputation.<\/p>"
    },
    {
        "title": "Dirty",
        "desc": "<p>To dream that you or something is dirty represents your anxieties and feelings toward sex. The dream stems from low self-esteem and feelings of being unworthy. You need to purify your mind, heart and body.<\/p>"
    },
    {
        "title": "Disability",
        "desc": "<p>To dream that you have a disability indicates that you are experiencing a lowered self-esteem. You have lost your power or direction in life. Perhaps you are not utilizing your full potential and skills. Consider the symbolism of the part of your body that is disabled.<\/p>"
    },
    {
        "title": "Disappear",
        "desc": "<p>To dream that people or objects are disappearing right before your eyes signify your anxieties and insecurities over the notion that loved ones might disappear out of your life. You feel that you cannot depend on anyone and that you will end up alone. You need to work on your self-image and self-esteem.<\/p><p>Alternatively, to dream that someone is disappearing suggests that you may not have given sufficient attention to those aspects\/qualities of that person within your own self. Have you lost touch with some aspect of yourself? If your lover is disappearing, then it suggests that your love or interest for them is fading.<\/p><p>To dream that you are disappearing from others means that you feel you are being overlooked. You are not being noticed or recognized for what is important to you. Alternatively, the dream indicates that you are trying to withdraw from the realities of life.<\/p>"
    },
    {
        "title": "Disappointment",
        "desc": "<p>To dream of disappointment indicates real-life experiences of being continually disappointed. Such dreams often reflect repressed disappointments which has accumulated over a period of time. Your dream serves as an emotional outlet to help ease your mind.<\/p>"
    },
    {
        "title": "Disapproval",
        "desc": "<p>To dream of disapproval indicates that you are rejecting or ignoring some aspect of yourself. It may also represent your own feelings of self-worth and being accepted.<\/p>"
    },
    {
        "title": "Disaster",
        "desc": "<p>To dream that you are in a disaster represents your personal anxieties and fears of change. You are afraid of not knowing what is in store for you in the future.<\/p>"
    },
    {
        "title": "Disc Golf",
        "desc": "<p>To dream that you are playing disc golf means that you need to take things more seriously and focus on your future goals.<\/p>"
    },
    {
        "title": "Disc Jockey",
        "desc": "<p>To listen to a disc jockey in your dream represents a message from your subconscious. The disc jockey may be trying to give you some advice about a waking situation. Alternatively, the dream may symbolize someone in your life with the initials &quot;DJ&quot;.<\/p>"
    },
    {
        "title": "Disco",
        "desc": "<p>To dream that you are a disco suggests that you need to get out and be more sociable.<\/p><p>To dream that you are listening or dancing to disco music represents your free spirit.<\/p>"
    },
    {
        "title": "Disco Ball",
        "desc": "<p>To see a disco ball in your dream symbolizes your fun and free spirit. It is a reflection of the various components of your life.<\/p>"
    },
    {
        "title": "Discovery",
        "desc": "<p>To dream of a discovery indicates that you are a entering a new phase of life or a new phase of personal development. Alternatively, the dream suggests you have uncovered an aspect of yourself which is significant to your waking life.<\/p><p>*Please See Also: <a href=\"#Find\">Find<\/a>.<\/p>"
    },
    {
        "title": "Disease",
        "desc": "<p>To dream that you are inflicted with a disease forewarns of some illness or physical ailment. Sometimes your dreams are able to diagnose an illness before you are aware of the symptoms. Alternatively, the disease in your dream may be symbolic of some fear or tension that you are experiencing in your waking life.<\/p>"
    },
    {
        "title": "Disfigure",
        "desc": "<p>To dream that you are disfigured indicates that you are still scarred emotionally or physically from some past situation or relationship. You feel that you are not yourself anymore.<\/p>"
    },
    {
        "title": "Disgrace",
        "desc": "<p>To dream that you have been disgraced indicates guilt over something you have done in your walking life. You feel your sense of morality and reputation is being compromised.<\/p><p>To dream that others are being disgraced suggests that you need to distance yourself from these other people. You cannot let their actions bring you down.<\/p>"
    },
    {
        "title": "Disguise",
        "desc": "<p>To dream that you are in a disguise indicates that you are hiding from something or someone in your waking life. It is time to face reality and stop hiding behind a facade. Alternatively, the dream suggests that you are being someone you are not.<\/p>"
    },
    {
        "title": "Disgust",
        "desc": "<p>To feel disgust in your dream represents an unacknowledged or denied aspect of your own self. You fear confrontation. You may also lack the means to defend and\/or protect yourself.<\/p>"
    },
    {
        "title": "Dishes",
        "desc": "<p>To see dishes in your dream represent ideas, concepts, and attitudes. The dream may be a pun on the things you are &quot;dishing&quot; out to others. Or it could describe someone you are interested in as in someone who is a &quot;dish&quot;. Perhaps it is time that you make the first move. If the dishes are dirty and unwashed, then it signify dissatisfaction and an unpromising outlook. You may have overlooked some problems in your life or you have not confronted your emotions.<\/p><p>To dream that you are washing dishes suggest that you are moving on and planning for the next thing that comes your way. Alternatively, it represents your daily routine. Perhaps you are in a rut.<\/p><p>To see shelves of polished dishes suggest that you are doing your best and making the best out of a situation. You are trying to make a good impression.<\/p><p>To see broken dishes or break dishes in your dream signify feelings of poverty, lack, and inadequacy. You may feel that you are not meeting the expectations of others.<\/p><p>*Please See Also: <a href=\"#Plates\">Plates<\/a>.<\/p>"
    },
    {
        "title": "Dishonesty",
        "desc": "<p>*Please See Also: <a href=\"#Liar\">Liar<\/a>.<\/p>"
    },
    {
        "title": "Dishwasher",
        "desc": "<p>To see or use a dishwasher in your dream suggests that you need to resolve past issues and old problems in order to make a clean start for yourself. Alternatively, the dream means that you are moving ahead and looking toward the future.<\/p>"
    },
    {
        "title": "Disinfectant",
        "desc": "<p>To see or use a disinfectant in your dream signifies cleansing and healing. You are ready to mend past hurts and resolve feelings of self guilt or past pain.<\/p>"
    },
    {
        "title": "Disinherited",
        "desc": "<p>To dream that you have been disinherited forewarns that you should reevaluate your social and professional standing. You may not be in such solid ground as you thought.<\/p>"
    },
    {
        "title": "Diskette",
        "desc": "<p>To see a diskette in your dream symbolizes the transfer of ideas and advices from one person to another. It also signifies information that you need to incorporate into a waking situation or some aspect of your life.<\/p>"
    },
    {
        "title": "Dislike",
        "desc": "<p>To dream that you dislike someone or are disliked represents an aspect of yourself that you do not like or are trying to suppress. Who are you inside and how you are acting on the outside are out of sync. You are not being true to yourself.<\/p><p>To see someone you dislike in your dream suggests that you are in denial about something.<\/p>"
    },
    {
        "title": "Disneyland",
        "desc": "<p>To dream that you are at Disneyland indicates that you need to take some time off, especially after all the hard work that you have been involved in. Known as the &quot;happiest place on earth&quot;, the dream may suggest a lack of happiness in your life. You are looking for that happiness.<\/p>"
    },
    {
        "title": "Dismemberment",
        "desc": "<p>To dream that you are dismembered suggests that some situation or circumstance is falling apart in your waking life. You feel cut off, isolated and disempowered. You may also be experiencing some great and significant loss. Consider also which part of your body is dismembered as that body part may offer additional significance or needs special attention. Alternatively, the dream may coincide with some significant life change as in a new job, new school, marriage, moving, etc. You are feeling a loss of power, potential, or identity.<\/p>"
    },
    {
        "title": "Disobedience",
        "desc": "<p>To dream that you disobey authority suggests that you are going against your conscience. You know what the right thing to do is, but still refuse to follow what is right. As a result, you are experiencing much inner turmoil. The dream points to a rebellious attitude. Alternatively, disobedience means that you are suppressing your emotions or sensitivities.<\/p>"
    },
    {
        "title": "Disown",
        "desc": "<p>To dream that you have been disowned indicates that you need to change your old habits and take charge of the situation.<\/p>"
    },
    {
        "title": "Dispute",
        "desc": "<p>To dream that you are having disputes with others suggest that you are trying to resolve some internal conflict or some unsettled issue in your waking life. Consider the symbolism of what is the dispute you are having. Alternatively, the dream indicates that you may be unfairly judging others.<\/p>"
    },
    {
        "title": "Disrespect",
        "desc": "<p>To dream that you have been disrespected suggests that you feel overlooked or ignored. You are not being taken seriously in some area of your waking life. If you dream of not getting any respect, then it may also imply feelings of unworthiness and low self-esteem.<\/p><p>Dreaming that you are being disrespectful indicate guilt about your actions or behavior. You are expressing a desire to go back in time and act in a different manner.<\/p>"
    },
    {
        "title": "Dissection",
        "desc": "<p>To dream that you are dissecting something suggests that you are trying to get to the core of some situation. You are trying to peel away at the layers in order to get to the heart of the matter. Alternatively, the dream may indicate that you are overanalyzing a situation. Consider also what you are dissecting.<\/p><p>In particular, to dream that you are dissecting a frog indicates that you are trying to figure out if the guy you are interested in is just a frog or is a real prince. Alternatively, the dream seeks to bring you back to your high school science class and how you felt when you had to dissect a frog.<\/p><p>To dream that you are dissecting a human cadaver suggests that you are trying to reveal or expose an aspect of yourself that you have kept hidden.<\/p>"
    },
    {
        "title": "Dissolve",
        "desc": "<p>To see a liquid dissolve in your dream signifies the integration of various aspects of yourself. Two parts are coming together as one. Alternatively, the dream may also be a metaphor for an end to some situation, condition or relationship.<\/p>"
    },
    {
        "title": "Distance",
        "desc": "<p>*Please See: <a href=\"#Far\">Far<\/a>.<\/p>"
    },
    {
        "title": "Distress",
        "desc": "<p>To dream that you or others are in distress represents worries and unhappiness in your waking life. You will find that your worries were unfounded and that they will turn out to be better than expected. Perhaps the dream is telling you to lighten up.<\/p>"
    },
    {
        "title": "Ditch",
        "desc": "<p>To see a ditch in your dream indicates that there is something in your waking life that you need to avoid. Alternatively, the dream suggests that you need to let go of the emotional baggage and frivolity that are holding you back.<\/p><p>The dream may also be on pun on ditching school, work, appointment, or something that you are now feeling guilty about.<\/p><p>To dream that you fall into a ditch indicates that you may be headed into a pitfall.<\/p>"
    },
    {
        "title": "Diving",
        "desc": "<p>To dream that you are diving into clear water indicates that you have overcome your obstacles and setbacks. You have a new sense of confidence. Things are looking up. Alternatively, the dream indicates that you are trying to get to the bottom of a current situation or the root of your problems or feelings. It may also refer exploration of your subconscious.<\/p><p>To dream that you are diving into muddy water suggests that you are feeling anxious about how you have handled certain issues in your waking life.<\/p><p>To see others diving in your dream represents psychological and emotional balance.<\/p><p>To see animals diving in your dream suggest that are exploring your instinctual and sexual urges which have been previously suppressed into your subconscious.<\/p>"
    },
    {
        "title": "Diving Board",
        "desc": "<p>To see or stand on a diving board in your dream indicates that you need to think things through carefully and thoroughly before you take the plunge. The dream may signal a new phase in your life. Consider the height of the diving board. The higher the diving board, the more significant and more difficult it is to take the next step and make the plunge.<\/p>"
    },
    {
        "title": "Divorce",
        "desc": "<p>To dream that you are getting a divorce suggests that you need to differentiate between things in your life and prioritize them. Perhaps you need to separate yourself from some issue or some aspect of yourself. Alternatively, the dream indicates that you have a fear of separation or fear of being alone. You may be unsatisfied with your present relationship.<\/p><p>If your parents are not actually getting a divorce, but you dream that they are divorced or that they are getting a divorce highlights conflicts within your own self. You are struggling with pleasing both your parents without disappointing the other.<\/p><p>Divorce dreams may reflect real-life events and the stress that divorce can bring. You may be wondering if you have made a mistake in some situation or decision. Divorce dreams also imply a transitional phase. It is time to change your old habits.<\/p>"
    },
    {
        "title": "Dizzy",
        "desc": "<p>To dream that you feel dizzy symbolizes confusion. You are unable to make a decision or make up your mind about something. Concentrate on a focal point and learn to balance your choices.<\/p>"
    },
    {
        "title": "DNA",
        "desc": "<p>To dream about DNA suggests that you need to focus your energy. Carefully plot out your goals so you can move ahead in life. Learn from the negativity that you have experienced. DNA symbolizes life, humanity and science. Alternatively, to dream about DNA indicates that you are questioning your identity. You are asking yourself who you truly are and what makes you you. The dream may also represent the initials &quot;D&quot; and &quot;A&quot;. Consider who or what in your life has these initials.<\/p>"
    },
    {
        "title": "Doberman Pincher",
        "desc": "<p>To see a Doberman Pincher in your dream symbolizes your fears. It may also represent someone in your waking life who is &quot;barking&quot; orders at you. Alternatively, the dream indicates that you have your guard up. You are protecting yourself from getting hurt.<\/p>"
    },
    {
        "title": "Dock",
        "desc": "<p>To dream that you are on a dock suggests that you have successfully gotten through some tough times and emotions. If the dock is empty, then it implies that you are feeling emotionally drained.<\/p>"
    },
    {
        "title": "Doctor",
        "desc": "<p>To dream that you are seeing the doctor indicates your need for emotional and spiritual healing. The dream could also highlight medical concerns. Perhaps it is time to go and get a physical check up.<\/p><p>To dream that you are a doctor suggests that there is some problem that you need to patch up or some emotional wound that you need to bandage up. Alternatively, it signifies your ability to offer your support to others.<\/p>"
    },
    {
        "title": "Document",
        "desc": "<p>To see or read a document in your dream represent some important information that is about to be made known to you. It symbolizes some discovery or realization.<\/p>"
    },
    {
        "title": "Documentary",
        "desc": "<p>To have a dream in a documentary format suggests that you need to appreciate the life you have and realize the impact you have on others. You are important. The dream may also be a metaphor that there is something that you need to &quot;document&quot; or remember.<\/p>"
    },
    {
        "title": "Dodo",
        "desc": "<p>To see a dodo bird in you dream represents death. This is a symbolic death in that it is an end to some behavior or habit. The dream may also be a pun on someone who is stupid or lacks common sense.<\/p>"
    },
    {
        "title": "Dodgeball",
        "desc": "<p>To play dodgeball in your dream parallels a situation in your waking life where you are either on the offensive or on the defensive. If you are throwing the ball, then it represents pent up anger and aggression. If you are hit by the ball, then it suggests that you are feeling victimized by a situation. Alternatively, the dream may be a metaphor that you are &quot;dodging&quot; or avoiding a situation or question.<\/p>"
    },
    {
        "title": "Dog",
        "desc": "<p>To see a dog in your dream symbolizes intuition, loyalty, generosity, protection, and fidelity. The dream suggests that your strong values and good intentions will enable you to go forward in the world and bring you success. The dream dog may also represent someone in your life who exhibits these qualities. Alternatively, to see a dog in your dream indicates a skill that you may have ignored or forgotten. If the dog is vicious and\/or growling, then it indicates some inner conflict within yourself. It may also indicate betrayal and untrustworthiness. If the dog is dead or dying, then it means a loss of a good friend or a deterioration of your instincts.<\/p><p>To dream that a dog bites you on the leg suggests that you have lost your ability to balance aspects of your life. You may be hesitant in approaching a new situation or have no desire to move forward with your goals. Dreaming that a dog bites on the hand symbolizes disloyalty. To dream that someone is bitten by a dog indicates a betrayal. You feel that you have been wronged by this person.<\/p><p>To see a happily barking dog in your dream symbolizes pleasures and social activity. You are being accepted into some circle. If the dog is barking ferociously, then it represents your habit of making demands on people and controlling situations around you. Are you &quot;barking&quot; too many orders? Alternatively, it could also indicate unfriendly companions.<\/p><p>To see a sick dog in your dream symbolizes a neglected friendship.<\/p><p>To dream that you are feeding a dog means that you are nurturing an old skill or talent. It also implies that you need to put more time and effort into fostering your friendships.<\/p><p>To see a dog chasing its tail or running around in circles in your dream implies that you are not handling a situation in an effective way. You are spending too much time on fruitless labor.<\/p><p>Dreaming that two dogs are licking each other represents mutual understanding in one of your waking relationships.<\/p><p>To dream that you are buying a dog indicates your tendency to buy your friends or buy compliments and favors. Alternatively, it suggest a need for you to find companionship. If you are being guided by a dog, then it suggests that you are having difficulties in navigating out of a situation or problem.<\/p><p>To dream that you give or send your dog away indicates that the decisions and choices you are making now may be misinterpreted as disloyalty. You have to do what is right for you and not worry about what others think of the decision. Alternatively, it signifies rejection of friendship.<\/p><p>Having a dream where you our chasing your dog means that you are taking someone's loyalty for granted.<\/p><p>To run over a dog in your dream means that you are expressing doubt in the intentions of a friend. Perhaps you feel betrayed. Your friend is not being supportive.<\/p><p>To dream about running or living with a pack of dogs means that you are looking for a sense of belonging and familyhood. The dogs may symbolize your siblings, children or other family members that you feel the need to protect and to keep from harm's way.<\/p><p>Dreaming that you are giving a dog a bath symbolizes your nurturing abilities. You also pride yourself in your loyalty and generosity.<\/p><p>To dream that you are rubbing a dog's belly represents trust in relationship.<\/p><p>To dream that you are dressing up your dog signifies your attempts to cover up your own character flaws and habits.<\/p><p>Dreaming that you cannot get a dog off your back implies that you are not able to shake someone off your back. Perhaps they are being too overbearing or too dependent on you.<\/p><p>To see a black colored dog in your dream symbolizes the shadow aspect of a friend. The dark side of someone close to you is being revealed and you are able to see through to their true intentions. If the dog is white, then it indicates that the intentions of a friend are pure and true.<\/p><p>Dreaming that you step on a dog implies that you are taking certain friendships or relationships for granted.<\/p><p>To dream that a dog has puppies refers to your nurturing abilities.<\/p><p>To dream that a dog is eating a snake implies that a close friend is trying to prevent you from making a bad decision.<\/p><p>To see a dog with two heads in your dream means that you are hyper vigilant about your surroundings. On the other hand, the dream may also mean you need to be more aware of what is around you.<\/p><p>Also consider the notions associated with the word dog, such as loyalty (&quot;man's best friend&quot;) and to be &quot;treated like a dog&quot;.<\/p><p>Dreaming that dogs are being slaughtered or disemboweled represent a bitter ending to a friendship. It indicates betrayal and\/or misplaced trust.<\/p><p>To dream that your dog is trying to rape you forewarns that someone who you thought was your friend is trying to take advantage of you.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=dogdream1\">The Bunny Dog<\/a>&quot; &amp;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bathroomdream3\">Dogs In The Bathroom&quot;<\/p>"
    },
    {
        "title": "Dog Fight",
        "desc": "<p>To see or watch a dog fight in your dream implies that you are desperately rejecting an aspect of yourself. You are feeling ashamed about something.<\/p><p>To dream that dogs are fighting signifies a conflict of interest between you and someone close to you. You need to step away from this situation.<\/p>"
    },
    {
        "title": "Dog Food",
        "desc": "<p>To eat dog food in your dream suggests that you need to address some animalistic or primitive thoughts. You may be battling fidelity or loyalty issues in a relationship.<\/p>"
    },
    {
        "title": "Dog House",
        "desc": "<p>To see a dog house in your dream suggests that you are in big trouble. You are being punished for your actions.<\/p>"
    },
    {
        "title": "Dog Race",
        "desc": "<p>To dream of a dog race indicates that you are looking out for your own self and your own needs. You are motivated by personal gains over community goals.<\/p>"
    },
    {
        "title": "Dogwood",
        "desc": "<p>To see a dogwood tree in your dream suggests that you feel the need to be protected or shielded. It also symbolizes the sacrifices you are making.<\/p>"
    },
    {
        "title": "Doll",
        "desc": "<p>To dream that a doll comes to life signifies your desires to be someone else and escape from your present problems and responsibilities. The doll serves as a means to act out your wishes.<\/p><p>To see a doll in your dream symbolizes childhood innocence and light-hearted fun. The dream may also be a metaphor for someone that you call or refer to as &quot;doll&quot;.<\/p><p>To dream that you are playing with a doll represents a lack of communication between your conscious and subconscious mind. The dream also indicates an immature attitude towards the opposite sex.<\/p>"
    },
    {
        "title": "Dollhouse",
        "desc": "<p>To see or play with a dollhouse in your dream suggests that you are idealizing family life. You have the notion that everything is perfect or problem-free. Perhaps you are in denial about any problems. Alternatively, the dollhouse in your dream may serve as an indirect way to solve and work out waking problems with family members.<\/p>"
    },
    {
        "title": "Dolphins",
        "desc": "<p>To see a dolphin in your dream symbolizes spiritual guidance, intellect, mental attributes and emotional trust. The dream is usually an inspirational one, encouraging you to utilize your mind to its capacity and move upward in life. Alternatively, it suggests that a line of communication has been established between the conscious and subconscious aspects of yourself. Dolphins represent your willingness and ability to explore and navigate through your emotions.<\/p><p>To dream that you are riding a dolphin represents your optimism and social altruism.<\/p><p>To dream that a dolphin is dying indicates feeling of despair. You are feeling disconnected.<\/p>"
    },
    {
        "title": "Dome",
        "desc": "<p>Tosee a dome in your dream signifies spiritual protection and enlightenment.<\/p>"
    },
    {
        "title": "Domesticated",
        "desc": "<p>To dream of domesticated animals represent qualities and attributes within yourself that you are able to control.<\/p>"
    },
    {
        "title": "Dominatrix",
        "desc": "<p>To dream that you are a dominatrix represents your need for power and control. Alternatively, it suggests that you are experiencing an elevated sense of spirituality.<\/p>"
    },
    {
        "title": "Dominoes",
        "desc": "<p>Tosee or play dominoes in your dream suggests that your actions are sure to affect those around you. Consider the phrase &quot;fall like dominoes&quot;.<\/p>"
    },
    {
        "title": "Donation",
        "desc": "<p>To dream that you are giving a donation refers to your ability to give love. Conversely, if you are receiving a donation, then it refers to your ability to receive love.<\/p><p>To dream that you are donating blood suggests that you are feeling physically drained due to stress.<\/p>"
    },
    {
        "title": "Donkey",
        "desc": "<p>Tosee a donkey in your dream represents your stubbornness and unyielding personality. You are unwilling to cooperate with others. The donkey also symbolizes menial work. You may be feeling overburdened or stressed. If the donkey is dead, then itdenotes that your party hearty attitude will lead to unrestrained immorality. Alternatively, the donkey isrepresentative of the United States democratic party. Consider your personal associations and feelings about the democrats.<p>To dream that you fall off or are thrown from a donkey signifies separation and disharmony in love..<\/p><p>To dream that you are kicked by a donkey suggests that you are afraid of being caught in some illicit activity. There is a cloud of suspicion over you.<\/p><p>To dream that you are leading a donkey by a halter signifies your leadership abilities. You have the gift of convincing people to see things your way.<\/p>"
    },
    {
        "title": "Donuts",
        "desc": "<p>*Please see: <a href=\"#Doughnuts\">Doughnuts<\/a>.<\/p>"
    },
    {
        "title": "Door",
        "desc": "<p>To dream that you are entering through a door signifies new opportunities that are presented before you. You are entering into a new stage in your life and moving from one level of consciousness to another. In particular, a door that opens to the outside signifies your need to be more accessible to others, whereas a door that opens into the inside, denotes your desire for inner exploration and self-discovery.<\/p><p>To see an opened door in your dream symbolizes your receptiveness and willingness to accept new ideas\/concepts. In particular, to see a light behind the door suggests that you are moving toward greater enlightenment\/spirituality.<\/p><p>To dream that the door is closed or locked signifies opportunities that are denied and not available to you or that you have missed out on. Something or someone is blocking your progress. It also symbolizes the ending of a phase or project. In particular, if you are outside the locked door, then it suggests that you have anti-social tendencies. If you are inside the locked door, then it represents harsh lessons that need to be learned.<\/p><p>To dream that you are locking the door suggests that you are closing yourself off from others. You are hesitant in letting others in and revealing your feelings. It is indicative of some fear and low self-worth. If someone slams the door in your face, then it indicates that you are feeling shut out or some activity or that you are being ignored.<\/p><p>In particular, seeing the front door in your dream indicates that you are shielding yourself from outside influences.<\/p><p>To see revolving doors in your dream suggests that you are literally moving in circles and going nowhere. You may feel that your opportunities and choices lead to a dead end.<\/p><p>To see a castle door in your dream indicates that you have missed a huge and\/or profitable opportunity, especially if you are standing outside the castle door. If you are standing inside the castle door, then it means that you have let your success and ego distance you from others.<\/p><p>Dreaming of a red door refers to either anger or passion that you are keeping locked up within yourself. If you open the red door, then it means that you are confronting some uncomfortable emotions. To see a black door in your dream symbolizes your personal hidden secrets. If you open the black door, then it suggests that you are exposing yourself to danger. You are proceeding toward a situation despite the risk. Seeing a gray door in your dream indicates that you are experiencing ambiguity in your future.<\/p>"
    },
    {
        "title": "Doorbell",
        "desc": "<p>To dream that you hear or ring a door bell indicates that you are open to new experiences. The dream may also be calling attention to something that you have overlooked. Perhaps you do not yet realize that an opportunity is open to you.<\/p>"
    },
    {
        "title": "Door Knocker",
        "desc": "<p>*Please see: <a href=\"#Knocker\">Knocker<\/a>.<\/p>"
    },
    {
        "title": "Doorknob",
        "desc": "<p>To see a doorknob in your dream symbolizes either access or restriction. Alternatively, the dream may suggest that you are not thinking intelligently. If you dream that the doorknob is talking, then it means that someone is always watching you. It also indicates that you are being underestimated in some way.<\/p>"
    },
    {
        "title": "Doormat",
        "desc": "<p>To see a doormat in your dream indicates that you feel others are walking all over you and taking advantage you. Consider also if there is any message or words on the door mat as this will be significant in meaning.<\/p>"
    },
    {
        "title": "Doorway",
        "desc": "<p>To see a bricked-up doorway in your dream implies that you are shutting yourself down from the world. If you are inside the bricked-up doorway, then it represents your sheltered life. If you are outside the bricked-up doorway, then it means that there is a deep secret that you are trying to prevent from coming out. Alternatively, a bricked-up doorway is similar to a locked door and signifies missed or denied opportunities.<\/p>"
    },
    {
        "title": "Doppelganger",
        "desc": "<p>To see your own doppelganger in your dream is a reflection of your negative actions. The dream is showing you the consequences of your actions and what you should not do. Alternatively, the dream signifies bad luck, danger, and\/or illness.<\/p><p>To dream that you are fighting with your doppelganger means that you are struggling between good and evil and right and wrong. If you kill your own doppelganger, then it indicates that you have successfully repressed certain negative emotions from surfacing.<\/p>"
    },
    {
        "title": "Dormitory",
        "desc": "<p>To dream that you are in a dormitory represents the value you place on knowledge and education. You believe that you are constantly learning, even when you are not in the classroom. If you are currently a college student who live in a dormitory, then this symbol may just be a reflection of your current surroundings and hold similar meaning as a house.<\/p>"
    },
    {
        "title": "Dots",
        "desc": "<p>To see dots in your dream symbolize routine and monotony.<\/p>"
    },
    {
        "title": "Double",
        "desc": "<p>Tosee your own double in your dream suggests that you are attempting to recapture the past and the good old times. Alternatively, the dream may indicate that you are needlessly working twice as hard or doing double duty.<\/p>"
    },
    {
        "title": "Double Date",
        "desc": "<p>To dream that you are on a double date represents the dualities of your personality - the persona you show to the world and your true Self. Alternatively, the dream may simply mean togetherness and your need to socialize.<\/p>"
    },
    {
        "title": "Double Decker",
        "desc": "<p>To see a double decker bus in your dream suggests that you need to consider alternatives to your way of thinking. Do not look at the situation or problem from a single perspective.<\/p>"
    },
    {
        "title": "Double Jointed",
        "desc": "<p>To dream that you are double jointed refers to how you yield to the needs of others. You tend to go out of your way to help those who need it.<\/p>"
    },
    {
        "title": "Dough",
        "desc": "<p>To see or work with dough in your dream signifies potential, possibilities and the ability to create. The dream may also be a metaphor to symbolize money.<\/p>"
    },
    {
        "title": "Doughnuts",
        "desc": "<p>To see a doughnut in your dream represents the Self. It suggests that you may be feeling lost and still trying to find yourself and your purpose in life. Alternatively, it refers to growth, development and nurturance. You are not yet completely whole.<\/p>"
    },
    {
        "title": "Doves",
        "desc": "<p>To see a dove in your dream symbolizes peace, tranquility, harmony, affection and innocence. In particular, to see a white dove in your dream represents loyalty, love, simplicity, gentleness and friendships. It may also signify a message and blessing from the Holy Spirit. You have let go of your thoughts of hate and revenge. If you dream that Jesus releases a white dove, then it refers to spreading the word of God.<\/p><p>To dream that doves are mating and building a nest symbolize a joyous home life filled with love, tranquility, pleasure and security.<\/p><p>To see a dove fly away in your dream suggests that someone you love has passed away.<\/p>"
    },
    {
        "title": "Down",
        "desc": "<p>To dream that you are moving down suggests that you have made a wrong decision or headed toward the wrong direction in life. Alternatively, the dream may be a pun on &quot;feeling down&quot; or depressed. &quot;Going down&quot; may also sexual connotation and be a metaphor for oral sex.<\/p>"
    },
    {
        "title": "wn Payment",
        "desc": "<p>To dream that you are making a down payment symbolizes commitment. If you are dreaming of putting a down payment for a house, it means commitment to a relationship. If you are putting down a payment for a car, then it refers to your commitment toward a life goal.<\/p>"
    },
    {
        "title": "Down Syndrome",
        "desc": "<p>To see or dream of a child with down syndrome implies that you are underestimating your own abilities or someone else's.<\/p>"
    },
    {
        "title": "Downhill",
        "desc": "<p>Dreaming that you are going downhill means that things are not going your way. You are experiencing some setbacks. Alternatively, the dream signifies regression or repressed thoughts.<\/p>"
    },
    {
        "title": "Downspout",
        "desc": "<p>To see a downspout in your dream refers to suppressed emotions that are coming to the surface and needing to be addressed. It is symbolic of an emotional cleansing.<\/p>"
    },
    {
        "title": "Downtown",
        "desc": "<p>Todream that you are in downtown represents your material concerns and possessions. It may indicate the hustle and bustle of your life.<\/p>"
    },
    {
        "title": "Dowry",
        "desc": "<p>Todream of a dowry indicates hard work ahead for you. You need to overcome many obstacles in order to succeed.<\/p>"
    },
    {
        "title": "Dozing",
        "desc": "<p>To dream that you are dozing off suggests that you are letting an opportunity is passing you by if you do not take action. You are lacking knowledge or awareness in some area or issue. You need to pay more attention to your surroundings.<\/p>"
    },
    {
        "title": "Dracula",
        "desc": "<p>To dream that you are Dracula implies that you are draining the energy of others.<\/p><p>To see Dracula in your dream suggests that you are being misguided in some area of your waking life. Be careful.<\/p><p>To dream that Dracula is your father indicates that you feel a disconnect with your own father. You don't really know who is this man.<\/p><p>*Please See: <a href=\"#Vampire\">Vampire<\/a>.<\/p>"
    },
    {
        "title": "Draft",
        "desc": "<p>To feel a draft in your dream indicates an external force that is affecting a situation or relationship in your life. It may also indicate a visitation of a Spirit or a communication from your subconscious.<\/p>"
    },
    {
        "title": "Drafted",
        "desc": "<p>To dream that you have been drafted indicates that the opinions and beliefs of others are being forced upon you. You are feeling pressure from those around you who want you to do something that you are not comfortable with. Alternatively, it indicates your need for more self discipline in your life.<\/p>"
    },
    {
        "title": "Drafting Compass",
        "desc": "<p>To see or use a drafting compass in your dream represents your set path. You do not like to deviate from your plans, even if it is monotonous. Alternatively, a drafting compass symbolizes your drive for perfection.<\/p>"
    },
    {
        "title": "Drag",
        "desc": "<p>To dream that you are dragging something refers to your burdens and struggles. You need to unload and\/or let go some of your responsibilities as it is holding you back. Perhaps it is a relationship that you need to let go of. Consider also what or who you are dragging. Alternatively, the dream may be a pun on a situation that is a &quot;drag&quot; or unpleasant.<\/p><p>Dreaming that you are being dragged signifies a lack of power or control in the direction you are going. You are feeling forced to do something that you don't really feel like doing. Alternatively, being dragged symbolizes reluctance in some endeavor. Perhaps you are feeling unmotivated or uninspired. You are not doing your fair share.<span style=\"font-size:14.0pt;mso-bidi-font-size:12.0pt;font-family:Arial\"><\/p>"
    },
    {
        "title": "Drag Queen",
        "desc": "<p>To see or dream that you are a drag queen refers to your over the top attitude. You are also exuding a lot of confidence. Alternatively, the dreams suggests that you are hiding your true self. Perhaps you are being someone who you are not.<\/p>"
    },
    {
        "title": "Drag Race",
        "desc": "<p>To see or dream that you are in a drag race refers to some situation that you don't really want to be involved in, but feel pressure to prove yourself. You have a strong competitive side. Alternatively, the dream means that you need to slow down before you jeopardize your well being.<\/p>"
    },
    {
        "title": "Dragon",
        "desc": "<p>Tosee a dragon in your dream represents your strong will and fiery personality. You tend to get carried away by your passion, which may lead you into trouble. You need to exercise some self-control. If you dream about the birth of a dragon, then it refers to your emerging passion and strong will. In particular, dreaming of a metal dragon signifies an unyielding character, a water dragon symbolizesquiet confidence, a wood dragon means an analytical and logical mind, a fire dragon refers to a competitive nature and leadership and an earth dragon signifies sociability.<\/p><p>In the eastern cultures, dragons are seen as spiritual creatures symbolizing good luck and fortune.<\/p><p>To dream that you are a dragon and breathing fire suggests that you are using your anger to get your own way.<\/p>"
    },
    {
        "title": "Dragonfly",
        "desc": "<p>To see a dragonfly in your dream symbolizes change and regeneration. It may also indicate that something in your life may not appear as it seems. Alternatively, the dream represents instability flightiness or activity. You are always on the go.<\/p><p>To dream that you are eating a dragonfly suggests that you are consumed by some sort of passion even at the risk of offending or hurting other's feelings.<\/p>"
    },
    {
        "title": "Drain",
        "desc": "<p>To see a drain in your dream signifies your need to release and channel your emotions. You should not keep your feelings inside. Consider the condition and appearance of the drain for clues on how you are feeling. Alternatively, it may represent some wasted effort or loss. The dream may also be a pun on something or someone that is &quot;draining&quot; you of your energy or resources.<\/p><p>To dream that you are unclogging the drain indicates that you need to remove some obstacle or blockage that is hindering your progress.<\/p>"
    },
    {
        "title": "Drainer",
        "desc": "<p>To see a drainer in your dream suggests that you are getting rid of your excessive emotions. Or on the other hand, it could imply that you are feeling emotionally drained.<\/p>"
    },
    {
        "title": "Drama",
        "desc": "<p>Todream that you are in drama class signifies your ability to express your emotions. The dream may be a metaphor for your waking life. Do you feel like you are living in your own drama?<\/p>"
    },
    {
        "title": "Drapes",
        "desc": "<p>To dream that you are closing the drapes suggest that you are blocking out external worries and problems. You are shielding yourself from the world.<\/p>"
    },
    {
        "title": "Drawbridge",
        "desc": "<p>To see a drawbridge in your dream represents protection. You feel that some relationship or situation is too invasive. It may also mean that you are drawing the line and creating boundaries.<\/p>"
    },
    {
        "title": "Drawers",
        "desc": "<p>To see drawers in your dream signify your inner and hidden state and being. In particular, a disorderly drawer represents internal chaos and turmoil while an orderly drawer signifies calmness. Alternatively, a drawer symbolizes your reserves. There is something that you have stored away, but are now ready to use or express. If the drawer is full, then it symbolizes your many resources. If the drawer is empty, then it denotes your need to fulfill your goals.<\/p>"
    },
    {
        "title": "Drawing",
        "desc": "<p>To dream that you are drawing represents an expression of your latent artistic abilities. You need to show more of your creativity in your waking life. Alternatively, the dream may be a pun on a &quot;draw&quot; to mean a tie or some undecided decision or argument. &quot;It's a draw.&quot;<\/p>"
    },
    {
        "title": "Dreadlocks",
        "desc": "<p>If you do not have dreadlocks in your waking life and dream that you have them, then it indicate a rejection of traditional values and beliefs. You are going against the norm of society. Alternatively, the dream may be a metaphor for something that you are dreading.<\/p>"
    },
    {
        "title": "Dream Moods",
        "desc": "<p>To dream of our website Dream Moods indicates the importance you are placing in understanding dreams. You are serious about learning more from your dreams. Alternatively, it also represents of sense of community.<\/p>"
    },
    {
        "title": "Dreamcatcher",
        "desc": "<p>To see a dreamcatcher in your dream indicates that you are putting up a wall or barrier against the negativity in your life. Perhaps there is something in your subconscious that you are trying to prevent from emerging.<\/p>"
    },
    {
        "title": "Dreams",
        "desc": "<p>To dream that you are dreaming or daydreaming signifies your emotional state. You are excessively worried and fearful about a situation or circumstance that you are going through. Dreaming that you are dreaming also serves as a layer of protection from what you are feeling. The dream within a dream allows you to experience certain difficult feelings that may otherwise be too painful to confront if you were directly dreaming the scenario.<\/p>"
    },
    {
        "title": "Dress",
        "desc": "<p>To see or wear a dress in your dream represents a feminine outlook or feminine perspective on a situation. You are freely expressing your femininity. If you are a man and dream that you are wearing a dress suggests that others are questioning your sexuality. Or that you are feeling sexually insecure.<\/p><p>To dream that you are wearing a white dress implies that you want to appear pure and angelic toward others. Perhaps you are trying to look &quot;innocent&quot;. To dream that you are wearing a purple dress refers to your devotion to your spouse or partner. Dreaming of wearing a blue dress indicates a desire to fit in or be like someone else. If the dress is another color, look up the specific color for additional significance.<\/p><p>Dreaming that you are wearing a dress that belongs to someone has has passed away suggests that you have not let go. You are trying to relive or hold on to something in the past.<\/p>"
    },
    {
        "title": "Dress Form",
        "desc": "<p>To see a dress form in your dream refers to your desires to fit in. You feel that you do not measure up to others ideals or expectations.<\/p>"
    },
    {
        "title": "Dresser",
        "desc": "<p>To see a dresser in your dream represents aspects of yourself that you are hiding. It may refer to your intimate self or childhood self. You need to reevaluate these emotions and either discard or incorporate them into your daily life.<\/p>"
    },
    {
        "title": "Dressing",
        "desc": "<p>To dream that you are dressed in someone else's clothes represents your admiration for that person. You are trying to incorporate aspects of that person into your own self.<\/p><p>To dream that you are dressing up suggests that you need to be more confident in your abilities and proud of your achievements.<\/p><p>To dream that you are having trouble getting dressed indicates that someone is trying to cause you problems and give you stress in your waking life.<\/p><p>To dream that you are dressed in white indicates longevity, good health or purity. You are trying to appear innocent to others.<\/p>"
    },
    {
        "title": "Dressing Room",
        "desc": "<p>To dream that you are in a dressing room suggests that you are trying to fit into some new situation or role. You are working on a fresh self-image. If the clothes do not fit, then it implies a feeling of insecurities. You feel you don't fit in. Alternatively, the dream represents your changing roles and the various personas you have.<\/p>"
    },
    {
        "title": "Drift",
        "desc": "<p>*Please See: <a href=\"#Floating\">Floating<\/a>.<\/p>"
    },
    {
        "title": "Drill",
        "desc": "<p>To see a drill in your dream indicates that you are headed toward a new direction in life. You are opening yourself up to new experiences and insights.<\/p>"
    },
    {
        "title": "Drinking",
        "desc": "<p>To dream that you are drinking water represents spiritual refreshment. You will find resolution by looking within yourself and your past. Alternatively, the dream may indicate that you are really thirsty.<\/p><p>To dream that you are drinking alcohol denotes that you are seeking either pleasure or escape. In particular, if you are drinking wine, then it is symbolic of a divine power.<\/p>"
    },
    {
        "title": "Drinking Fountain",
        "desc": "<p>*Please see: <a href=\"#Water%20Fountain\">Water Fountain<\/a>.<\/p>"
    },
    {
        "title": "Drinks",
        "desc": "<p>*Please See: <a href=\"#Beverage\">Beverage<\/a>.<\/p>"
    },
    {
        "title": "Dripping",
        "desc": "<p>To dream that something is dripping suggests that you are slowly losing your spiritual will. You are experiencing something disturbing which is affecting your psyche and well-being.<\/p>"
    },
    {
        "title": "Drive-In",
        "desc": "<p>To see or dream that you are at a drive-in indicates that you are taking a different life path then you had planned. Perhaps you have put your own goals on hold. You may also be reflecting on certain decisions you have made in your life.<\/p>"
    },
    {
        "title": "Drive-Thru",
        "desc": "<p>To dream that you are going through a drive-thru implies that your ambition and drive is getting in the way of your personal relationships. Sometimes you need to take a break and reconnect with loved ones.<\/p>"
    },
    {
        "title": "Driver's License",
        "desc": "<p>To see your driver's license in your dream suggests that you are facing an identity crisis.<\/p><p>To lose your driver's license in your dream indicates that you have lost your way or direction in life. Perhaps you have lost the autonomy to move forward toward your goals. Alternatively, the dream may mean that you have lost your true Self. You are trying to be someone you are not.<\/p>"
    },
    {
        "title": "Driveway",
        "desc": "<p>To see or drive up to a driveway in your dream symbolizes an end to your journey. It also represents security and rest. Alternatively, it denotes your path toward achieving inner peace and finding your spirituality.<\/p><p>To see rocks on the driveway refers to a rocky end to some journey.<\/p>"
    },
    {
        "title": "Driving",
        "desc": "<p>To dream that you are driving a vehicle signifies your life's journey and your path in life. The dream is telling of how you are moving and navigating through life. If you are driving and cannot see the road ahead of you, then it indicates that you do not know where you are headed in life and what you really want to do with yourself. You are lacking direction and goals. Similarly, to dream that you are driving at night suggests that you are unsure of where you are headed in life. You are experiencing obstacles toward your goals. Perhaps you do not want to see what is ahead for you or you are afraid to confront certain issues. You may be feeling apprehensive about the future. If your view is blocked or obstructed while you are driving, then it symbolizes your lacking awareness of something in your life. You are overlooking certain aspects in your life. Alternatively, the dream indicates dangers or problems that are not yet made known to you. If you are driving on a curvy road, then it indicates that you are having difficulties in achieving your goals and accepting the changes associated with it. If you are driving in the snow, then it means that you need to be extra cautious about how your approach your goals. Metaphorically, driving a car in your dream is analogous to your sex life and sexual performance. Consider how you are driving and what kind of car you are driving and how it relates to your waking sex life. Or the dream may be a pun on your &quot;drive&quot; or ambition.<\/p><p>To dream that someone else is driving you represents your dependence on the driver. You are not in control of your life and following the goals of others instead of your own. If you are driving from the passenger side of a car, then it suggests that you are trying to gain control of the path that your life is taking. You are beginning to make your own decisions. If someone else is driving you from the passenger side, then it means that you are being misled into thinking that you are in power or that you are in full control.<\/p><p>To dream that you are driving a cab or bus suggests that menial tasks are providing little opportunities for advancement. Dreaming that you are driving an ambulance indicates that you are putting the needs of others before your own. Perhaps you are letting others dictate your direction or goals in life.<\/p><p>To dream that you are driving a car in reverse suggests that you are experiencing major setbacks in your goals. In particular, if you drive in reverse into a pool of water, then it means that you emotions are literally holding you back.<\/p><p>To dream that you are driving drunk indicates that your life is out of control. Some relationship or somebody is dominating you.<\/p><p>To dream that you drive off a mountain road suggests that the higher you climb in life, the harder it is to stay at the top. You feel that your advanced position is a precarious one. It takes hard work to remain at the top. You may also feel that you are not able to measure up to the expectations of others.<\/p><p>To dream that you are a backseat driver means that you have problems relinquishing control. You have power issues.<span><\/p><p>Dreaming that you are driving fast suggests that you need to slow down and think through your choices. You are so focused on your goals that you are leaving behind the people around you.<\/p>"
    },
    {
        "title": "Driving Test",
        "desc": "<p>To dream that you are taking a driving test suggests that your goals and aspirations are being put to the test. You may be questioning what you really want to do with your life. If you fail the driving test, then it indicates that you do not have the necessary tools to move toward your goals. You may be lacking confidence. If you pass the driving test, then it represents your motivation and confidence in your ability.<\/p>"
    },
    {
        "title": "Dromedary",
        "desc": "<p>Tosee a dromedary in your dream signifies unexpected gains and honor. You are a giving person and always there to lend a helping hand.<\/p>"
    },
    {
        "title": "rone",
        "desc": "<p>Todream that you are flying or controlling a drone aircraft indicates that you need a new or better vantage point on something.<\/p><p>Seeing a drone aircraft in your dream means that you need to take control of your goals and of your destiny.<\/p>"
    },
    {
        "title": "Drooling",
        "desc": "<p>Todream that you are drooling suggests that you are feeling foolish or embarrassed by some situation. On the other hand, you may be taking things too seriously and need to let loose.<\/p><p>To dream that you or someone is lying in drool symbolizes a sense of hopelessness.<\/p>"
    },
    {
        "title": "Drop",
        "desc": "<p>To dream that you are dropping things indicates that you need to let go of some project, relationship, person, or idea. Also analyze the significance of what is being dropped. Alternatively, it may represent your carelessness. Perhaps you are expressing some dismay or regret in how you let something slip through fingers.<\/p>"
    },
    {
        "title": "Drought",
        "desc": "<p>To dream of a drought indicates that you are void of emotions. You are withdrawn and depressed. The dream may be a result of a major loss in your life. Alternatively, the dream suggests that you are not drinking enough water and staying well hydrated.<\/p>"
    },
    {
        "title": "Drowning",
        "desc": "<p>To dream that you are drowning indicates that you are feeling overwhelmed by emotions. Repressed issues may be coming back to haunt you. You may be proceeding too quickly in trying to discover your subconscious thoughts. You should proceed more cautiously and slowly. If you drown to death, then is refers to an emotional rebirth. If your survive the drowning, then it means that a waking relationship or situation will ultimately survive the turmoil.<\/p><p>To see someone drowning in your dream suggests that you are becoming too deeply involved in something that is beyond your control. Alternatively, it represents a sense of loss in your own identity. You are unable to differentiate who you are anymore.<\/p><p>To dream that you rescue someone from drowning indicates that you have successfully acknowledged certain emotions and characteristics that is symbolized by the drowning victim. Thus dreaming of rescuing a drowning baby means that you are allowing yourself to be vulnerable and accepting help from others. If you fail to make the rescue, then it implies that you are numb from fear. Consider a situation in your waking life where you are letting fear dictate your actions.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bathroomdream3\">Dogs In The Bathroom<\/a>&quot;<\/p>"
    },
    {
        "title": "Drugs",
        "desc": "<p>To dream that you are in possession of or taking drugs signifies your need for a &quot;quick fix&quot; or an escape from reality. You may be turning to a potentially harmful alternative as an instant escape from your problems. Ask yourself why you need the drugs. What do you hope the drugs will achieve for you?<\/p><p>Dreaming of someone shooting up drugs implies that others are not seeing things from your angle. You don't understand where others are coming from and feel that their perspective is skewed. Alternatively, the dream means that you are feeling helpless in a situation and don't know how to respond.<\/p><p>To dream that you or someone overdosessuggests that you do not know your limits. You may be pushing yourself too hard. Alternatively, the dream means that you are on a self-destructive path and need to make some significant changes.<\/p><p>To dream that you are dealing or selling drugsrepresents changes.<\/p><p>To dream that you have been drugged indicates that you are refusing to take responsibility for your actions.<\/p>"
    },
    {
        "title": "Drugstore",
        "desc": "<p>To dream that you are in a drugstore signifies a time for healing. You need to correct your thinking and readjust your attitude. You should look within yourself for the solution to a problem instead of relying on outside help. Alternatively, you may also be experiencing concerns with your health.<\/p>"
    },
    {
        "title": "Drums",
        "desc": "<p>To dream that you are playing the drums indicate that you progress through life by your own terms. You are strong willed and stick by the decisions you make. The dream may also be a metaphor to indicate you are &quot;drumming up&quot; business. You need to be more aggressive with your new ideas.<\/p><p>To hear a drum in your dream symbolizes the rhythm of life and the need to keep a steady pace in the pursuit of your goals.<\/p>"
    },
    {
        "title": "rumsticks",
        "desc": "<p>Tosee a pair of drumstick in your dream represents your power and determination. You are striving to make a difference. Alternatively, the dream means that you need to establish a rhythm and have more control in your life.<\/p>"
    },
    {
        "title": "Drunk",
        "desc": "<p>Todream that you are drunk suggests that you are acting careless and insensible. You are losing control of your life and losing a grip on reality. Perhaps you are trying to escape from a waking situation.<\/p>"
    },
    {
        "title": "Dry Cleaners",
        "desc": "<p>To dream that you are at the dry cleaners indicates that you are trying to be more objective in some situation. You are showing restraint and control over your emotions.<\/p>"
    },
    {
        "title": "Dryad",
        "desc": "<p>To see a dryad in your dream points to your quiet, soft-spoken persona. Alternatively, the dream may refer to your environmental awareness or that you need to be more environmentally conscious.<\/p>"
    },
    {
        "title": "Dryer",
        "desc": "<p>To dream that you are using a dryer suggests that you need to start dealing with your emotions. The dream may also signify a dry idea that fails to bring any excitement and thrill.<\/p>"
    },
    {
        "title": "Drywall",
        "desc": "<p>To see or install drywall panels in your dream refers to your desires for privacy. You are building up a layer of protection. Perhaps you have been hurt and are being guarded with your emotions.<\/p>"
    },
    {
        "title": "ubai",
        "desc": "<p>Todream of being in Dubai symbolizes commerce, vision, success and imagination. You are of a creative mindset. Alternatively, dreaming of Dubai suggests that you are having a difficult time on focusing on one goal.<\/p>"
    },
    {
        "title": "Duck",
        "desc": "<p>To see ducks in your dream represent your spiritual freedom (if flying) or the subconscious (if swimming). They serve as a connection between the spiritual realm and the physical world. Ducks are multi-talented animals in that they can walk, swim and fly. Thus, a duck indicates your flexibility and your ability to blend and adapt in various situations. Alternatively, the dream suggests that you are setting yourself up or being set up for the kill as associated by the phrase &quot;sitting duck&quot;. Are you being targeted? Also, the duck may be a pun on &quot;ducking&quot; some issue or situation, instead of confronting it head-on. Consider the phrase, &quot;if it looks like a duck, walks like a duck, quacks like a duck, it's a duck&quot;. Some things are too obvious to deny.<\/p><p>To see a white duck in your dream signifies falsehood and deceit.<\/p><p>To see a two-headed duck in your dream suggests that you need to be more grounded. You need to thoroughly think through some emotional issue.<\/p><p>To see a dead duck in your dream refers to a pessimistic outlook. You are set on a path that is destined for doom.<\/p>"
    },
    {
        "title": "Duct Tape",
        "desc": "<p>To see or use duct tape in your dream represents your strong hold or grasp of some situation. You are able to separate your feelings and be objective.<\/p>"
    },
    {
        "title": "Duel",
        "desc": "<p>To dream that you are in a duel signifies internal disagreements or inner conflicts in which you need to find a middle ground. You need to stop seeing things in black and white.<\/p>"
    },
    {
        "title": "Duet",
        "desc": "<p>To sing in a duet in your dream signifies balance and harmony. You are coming to terms with some problem or issue that you have been at odds at for a long time.<\/p>"
    },
    {
        "title": "Dulcimer",
        "desc": "<p>Tosee a dulcimer in your dream signifies carefree attitudes and a life where your desires will be happily realized.<\/p>"
    },
    {
        "title": "Dumb",
        "desc": "<p>Todream that you are dumb denotes your inability to persuade others to see your point of view.<\/p>"
    },
    {
        "title": "Dump Truck",
        "desc": "<p>To see or drive a dump truck in your dream suggests that you need to get rid of the burden that you have been carrying around with you. This dream symbol may be related to some major change.<\/p>"
    },
    {
        "title": "Dummy",
        "desc": "<p>To see a dummy in your dream indicates that a critical component is lacking in your relationship. You are feeling unchallenged and unfulfilled. The relationship is making you feel empty. The dream may also point to how you or someone has acted foolishly and stupidly in a situation.<\/p>"
    },
    {
        "title": "Dumpling",
        "desc": "<p>To see or eat dumplings in your dream signify dietary balance. You need to take better care of your health.<\/p><p>To make or wrap dumplings in your dream symbolizes tradition, family, and togetherness.<\/p>"
    },
    {
        "title": "Dumpster",
        "desc": "<p>Todream that you are at a dumpster implies that you may that you are being dumped on. You feel rejected. Alternatively, it indicates that you are trying to rid yourself of old, negative habits and bad characteristics.<\/p><p>To dream that you are secretly throwing something away in a dumpster suggests that you are not taking responsibility for something.<\/p>"
    },
    {
        "title": "Dunce",
        "desc": "<p>To dream that you are a dunce suggests that you are not thinking through your actions clearly. You are acting without thinking.<\/p>"
    },
    {
        "title": "Dune Buggy",
        "desc": "<p>To see or ride a dune buggy suggests that you need to find your own way in life and not follow someone else's path. Alternatively, dreaming of a dune buggy relates to your quest for adventure and life experiences.<\/p>"
    },
    {
        "title": "Dung",
        "desc": "<p>To see cow dung in your dream symbolizes fertility and renewal.<\/p>"
    },
    {
        "title": "Dungeon",
        "desc": "<p>Todream that you are in a dungeon represents your subconscious thoughts and wishes. Consider what you see or do in the dungeon. Alternatively, it indicates that you will overcome the obstacles in your waking life by continuing to struggle and utilizing your wisdom.<\/p>"
    },
    {
        "title": "Dunghill",
        "desc": "<p>Tosee a dunghill in your dream indicates that fortune will come from the most unexpected of sources.<\/p>"
    },
    {
        "title": "Dunk",
        "desc": "<p>To dream that you are dunking a basket represents your achievements and goals. You are on the right track toward success and accomplishing your goals. Alternatively, if you play basketball in your waking life, then the dream may serve as &quot;practice&quot;. If you visualize yourself dunking a basket, then you are more likely to achieve it. This is a technique utilized by many athletes.<\/p><p>*Please also see: <a href=\"#Basketball\">Basketball<\/a>.<\/p>"
    },
    {
        "title": "Dunk Tank",
        "desc": "<p>To dream that you are sitting inside a dunk tank suggests that you are on the verge of an emotional breakdown. You feel on edge. If you get dunked into the water in your dream, then it means that you are being forced to face your feelings.<\/p><p>Dreaming of hitting the target of a dunk tank means that you are imposing your views and opinions on others.<\/p>"
    },
    {
        "title": "Duplex",
        "desc": "<p>To see or dream that you are in a duplex suggests that you are feeling conflicted. In particular, if you dream that a school and a mall are located within a duplex, then it means that your time is torn between two obligations.<\/p>"
    },
    {
        "title": "Durga",
        "desc": "<p>To see Durga in your dream implies that your problems and difficulties will soon be over. Trust in your ability to overcome the negativity in your life. Alternatively, seeing Durga in your dream represents a birth (either an actual birth or birth of a new idea).<\/p>"
    },
    {
        "title": "Durian",
        "desc": "<p>To see or eat durian in your dream indicates that you should not judge others based on the outside. You never know what you will find if you get pass the exterior appearances. Alternatively, the dream may mean that some unpleasant memory or obstacle is trying to hinder your path to self discovery.<\/p>"
    },
    {
        "title": "Dusk",
        "desc": "<p>To see the dusk of day in your dream signifies defeated hopes and a dark, gloom outlook in your endeavors.<\/p>"
    },
    {
        "title": "Dust",
        "desc": "<p>To see dust in your dream suggests that certain aspects of yourself have been ignored or neglected.<\/p><p>Todream that you are covered in dust signifies that the failure of others will adversely affect you.<\/p><p>To dream that you are dusting implies that you are clearing out all your past mistakes and starting fresh on a new slate.<\/p><p>To dream that gold dust is running through your fingers indicates regrets with the ending of some personal relationship. You feel that you've made a terrible mistake.<\/p>"
    },
    {
        "title": "Duvet",
        "desc": "<p>To see a duvet in your dream symbolizes protection. It may also indicate that you are sexually conservative. Consider the color or pattern of the duvet for more clues on the meaning.<\/p>"
    },
    {
        "title": "DVD",
        "desc": "<p>To watch a DVD in your dream indicates that you need to stop and relax. Take a break from life and let your mind rest. Consider the title of the DVD or what you are watching and determine how it relates to your waking life. Alternatively, the DVD represents your desire to recapture or relive a certain moment in your life.<\/p>"
    },
    {
        "title": "Dwarf",
        "desc": "<p>Tosee a dwarf in your dream suggests that you are well-grounded and connected to nature and the earth. Alternatively, a dwarf may mean an aspect of yourself that is not fully developed or has been repressed. You may be feeling inferior or insignificant.<\/p><p>*Please See Also: <a href=\"#Troll\">Troll<\/a>.<\/p>"
    },
    {
        "title": "Dye",
        "desc": "<p>To dream that you or someone is dyeing cloths and garments suggests that you are expressing a desire to project a new identity. Depending on the color of the dye, it could be positive or negative. Look up the color in the: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/colors.htm\">Dream Moods Dream Themes: Colors<\/a> for further significance.<\/p><p>To dream that you are dyeing your hair indicates that you are trying to project a new persona. If you are dyeing your hair to a darker color, then it suggests that you want to be more serious. If you are dyeing your hair to a lighter color, then you are looking to be more livelier.<\/p>"
    },
    {
        "title": "Dying",
        "desc": "<p>*Please See: <a href=\"#Death\">Death<\/a><\/p>"
    },
    {
        "title": "Dynamite",
        "desc": "<p>To see dynamite in your dream symbolizes danger. There is a significant change that is quickly approaching. Alternatively, you may be harboring aggression that is about to blow up.<\/p>"
    }
]