[
    {
        "title": "E",
        "desc": "<p>To see the letter &quot;E&quot; in your dream implies ease and relaxation. The drug ecstasy is often referred to as &quot;E&quot;.<\/p>"
    },
    {
        "title": "Eagles",
        "desc": "<p>To see an eagle in your dream symbolizes nobility, pride, fierceness, freedom, superiority, courage, and powerful intellectual ability. It also represents self-renewal and your connection with your spirituality. You will struggle fiercely and courageously to realize your highestambitions and greatest desires.Alternatively, if you live in the United States, then the national bird could represent your patriotism and devotion to country.<p>To see a chained or trapped eagle in your dream represents a desperate situation where you are feeling restricted and confined. You are unable to express yourself and be who you really want to be. Consider also what the eagle is chained down to for additional clues as to what might be holding you back.<\/p><p>To see a nest of young eagles in your dream represents your achievements and your climb to the top of the social ladder.<\/p><p>To dream that you kill an eagle signifies your ruthlessness. You will let nothing stand in your way of ambitions and obtaining your goals, even if it means hurting those around you. If someone else kills an eagle, then it indicates that your fame, fortune and power will be ruthlessly taken from you.<\/p><p>To dream that you eat the flesh of an eagle implies that your strong and powerful character will lead you to great wealth and influence.<\/p>"
    },
    {
        "title": "Earlobe",
        "desc": "<p>To dream that your earlobes are long represent your spiritual or ancestral connection. It is also indicative of royalty and your social status in life.<\/p><p>To dream that you are stretching your earlobes indicates your desires to be more connected with your ancestors and understanding of where you came from. Alternatively, it means that you want to stand out and be different. You want to go against the norm.<\/p>"
    },
    {
        "title": "Earmuffs",
        "desc": "<p>To dream that you are wearing earmuffs means that you have a tendency to hear what you want to hear and not what was actually said. If you see someone else wearing earmuffs, then it implies that you have trouble making yourself heard. You have a difficult time to get others to listen to you.<\/p><p>Seeing or buying earmuffs in your dream indicates ignorance.<\/p>"
    },
    {
        "title": "Earphones",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/h.htm#Headphones\">Headphones.<\/p>"
    },
    {
        "title": "Earplugs",
        "desc": "<p>To dream that you are wearing or putting on earplugs suggests that there is something that you are refusing to hear or believe. Alternatively, the dream may mean that you are isolating yourself from others.<\/p>"
    },
    {
        "title": "Earrings",
        "desc": "<p>To dream that you or someone is wearing earrings suggests that you need to listen more carefully and pay attention to a message that someone is conveying to you. In particular, to see or wear pearl earrings in your dream indicates that are being given some wise advice you should follow. Alternatively, pearl earrings may serve as a memory of a person in your life who wore them.<\/p><p>To see broken earrings in your dreams suggests that someone is talking about you.<\/p><p>To dream that you are buying earrings represents your desire for acceptance and affection.<\/p><p>To dream that you lose an earring indicates that you are being misguided.<\/p>"
    },
    {
        "title": "Ears",
        "desc": "<p>To see ears in your dreams suggest that you need to be more responsive or receptive to guidance and assistance from others. You may be relying too much on your own judgment and intuition. You need to listen more closely to what you are being told. Alternatively, it signifies your immaturity and lack of experience. If you dream that your ears are weird or oddly shaped, then it indicates deception.<\/p><p>To dream that you are cleaning wax from your ears suggests that you are not listening to those around you. There may be something that you are refusing to hear. Are you turning a deaf ear?<\/p><p>To dream that your ear has been severed or cut off implies that you are tired of hearing what others tell you. If someone else's ear has been cut off, then it suggests that you should keep your opinions to yourself. Or that you need to stop talking about others.<\/p><p>To dream of pain in your ear indicates that you will be receive some bad or offensive news.<\/p><p>To dream that your ear is being pulled indicates dissent and disagreements. If you are pulling someone else's ear, then it suggest that you have a tendency to force your opinions on others.<\/p><p>To dream that your ears are getting red symbolizes shame or guilt.<\/p><p>To dream that someone is whispering in your ear suggests that you need to pay closer attention to something or listen to someone more carefully. Alternatively, it represents your insecurities and anxieties that people are talking about your behind your back.<\/p><p>To dream that you are getting your ears pierced represents some stinging remarks or insults.<\/p><p>To dream that there is a fly in your ear implies that someone is trying to discretely tell you something that you don't want to hear.<\/p><p>Dreaming that there are bugs coming out of your ear suggests that you have overheard something that you shouldn't have. Alternatively, bugs in your ear represent rumours.<\/p>"
    },
    {
        "title": "Earth",
        "desc": "<p>To notice the earth in your dream indicates that you need to be &quot;grounded&quot; and realistic. Perhaps your sense of stability and security is lacking. Consider the consistency of the earth for additional significance on how you are feeling. If the earth opens or separates, then it represents a project or relationship that you are afraid of falling into.<\/p><p>To dream that you can bend the earth signifies your ability to control your actions and react at a precise or optimal moment.<\/p><p>To see the planet Earth in your dream signifies wholeness and global consciousness. You are interconnected with the world.<\/p><p>To dream of the Earth's core symbolizes suppressed anger. You are holding in a lot of negative emotions.<\/p>"
    },
    {
        "title": "Earthquake",
        "desc": "<p>To dream of an earthquake suggests that you are experiencing a major &quot;shake-up&quot; that is threatening your stability and foundation. The dream highlights your insecurity, fears and sense of helplessness. Is there something in your life that you feel at &quot;fault&quot; for?<\/p><p>If you find cover from the quake, you will overcome these challenges. If you become trapped or injured during the quake, you will suffer some sort of loss in your life. According to the bible, earthquakes symbolize God's anger and power.<\/p>"
    },
    {
        "title": "Earthworm",
        "desc": "<p>To see an earthworm in your dream indicates that you need to go deep into your subconscious in order to unearth your hidden feelings and desires. Alternatively, earthworms symbolize little things that can be beneficial for your growth and well-being. It also represents renewal. Perhaps you need to restore some aspect of yourself.<\/p>"
    },
    {
        "title": "Earwax",
        "desc": "<p>To dream that you have excessive earwax suggests that there is something you are refusing to hear.<\/p>"
    },
    {
        "title": "Earwig",
        "desc": "<p>To see an earwig in your dream signifies unpleasant news that will affect both your professional and family spheres.<\/p>"
    },
    {
        "title": "East",
        "desc": "<p>To dream that you are headed east represents inner wisdom, rejuvenation, and spiritual enlightenment. You need to dedicate yourself to your goals, family, career, etc. The direction east also symbolizes the sun. Since east is related to the direction right, it can suggest that you are headed in the right direction.<\/p>"
    },
    {
        "title": "Easter",
        "desc": "<p>To dream about Easter suggests that the worst of your problems are over. Things will look up for you after a period of darkness and sadness. It is time to walk with your head held high and stop being ashamed. Alternatively, the dream symbolizes resurrection and spiritual rebirth.<\/p>"
    },
    {
        "title": "Easter Egg",
        "desc": "<p>To see Easter eggs in your dream symbolize potential, bewilderment and wonder. You need to recognize that potential and unleash it. The dream may also be symbolic with the passage of time.<\/p>"
    },
    {
        "title": "Eating",
        "desc": "<p>To dream that you are eating alone signifies loss, loneliness, and depression. You may feel rejected, excluded, and cut off from social\/family ties. Eating may be a replacement for companionship and provide a form of comfort. Alternatively, eating alone reflects independent needs. Also consider the phrase, &quot;what's eating you up?&quot; in reference to anxiety that you may be feeling.<\/p><p>To dream that you are eating with others signifies harmony, intimacy, merriness, prosperous undertakings, personal gain, and\/or joyous spirits.<\/p><p>To dream that you are overeating or not eating enough signifies a lack of spirituality and fulfillment in your waking life. Food can represent love, friendship, ambition, sex or pleasure in your life. Thus, food is a metaphor to fulfill and gratify your hunger for love and desires. If you are refusing to eat, then it indicates that you want to be more independent and not rely on others so much. If you dream that you are a picky eater, then it indicates that you are holding back something.If you are currently dieting in your waking life, then the dream may serve to compensate for the sustenance that you are lacking.<\/p><p>To dream that someone clears away the food before you finish eating foretells that you will have problems and issues from those beneath you or dependent upon you.<\/p>"
    },
    {
        "title": "Eating Contest",
        "desc": "<p>To dream that you are in an eating contest suggests that you are lacking a social life. You are turning to food as a companion. Consider also the type of food you are eating to determine which area of your life is severely lacking. Alternatively, the dream highlights your ability to process emotions quickly.<\/p>"
    },
    {
        "title": "Eavesdropping",
        "desc": "<p>To dream that you are eavesdropping signifies the coming of bad news. You will not like what you hear.Alternatively, it indicates that you are left out on something or someone is hiding information from you. As a result, you are feeling insecure.<\/p>"
    },
    {
        "title": "Ebony",
        "desc": "<p>To dream that something is made of ebony represents mystery, richness, smoothness. or some alluring quality.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/colors.htm#Black\">Black.<\/p>"
    },
    {
        "title": "Ebook",
        "desc": "<p>To see or read an ebook in your dream refers to modern knowledge. It also points to a wealth of information that is accessible right at your fingertips. Alternatively, dreaming of an ebook signifies a concept or idea that you are unable to fully grasp. Note also that an ebook may often have the same interpretation as a<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b4.htm#Book\">book.<\/p>"
    },
    {
        "title": "Echo",
        "desc": "<p>To hear or make an echo in your dream symbolizes your need to repeat yourself in order to be heard and for others to believe you. Pay attention to the power and impact of your own words. You are waiting and hoping for a reaction from those around you. It is also symbolic of the soul. Alternatively, to hear your own voice echo indicates that someone is mocking you. Or it could mean that your past actions will come back to haunt you. You need to confront those old memories and past issues.<\/p>"
    },
    {
        "title": "Eclipse",
        "desc": "<p>To dream of an eclipse of the sun indicates self-doubt and fears of not achieving your goals. You feel you are being overshadowed and are underestimating your abilities. Your level of confidence is fading or lost. You may be undergoing some difficult times and unable to remain optimistic.<\/p><p>To see the eclipse of the moon in your dream signifies that your feminine side is being overshadowed.Or it may mean that some hidden aspect of yourself is coming to the surface.<\/p><p>To dream that the eclipse has passed symbolizes new light and knowledge. You need to look at a problem from a different perspective.<\/p>"
    },
    {
        "title": "Ecstasy",
        "desc": "<p>To dream of feeling ecstasy indicates that you will experience much happiness and joy, especially amongst family and friends.<\/p>"
    },
    {
        "title": "Editor",
        "desc": "<p>To dream that you are an editor implies that you are censoring yourself and watching what you say. You are controlling your feelings.<\/p>"
    },
    {
        "title": "Education",
        "desc": "<p>To dream about your education symbolizes your desire for knowledge. You are on a higher level that you peers.<\/p><p>*Please also see<a href=\"http:\/\/www.dreammoods.com\/s.htm#school\">School.<\/p>"
    },
    {
        "title": "Eel",
        "desc": "<p>To see an eel in your dream indicates that you have issues with commitment. It also means that you have problems holding on to things.Consider the phrase &quot;slippery as an eel&quot; to mean someone who escapes responsibility or culpability. Alternatively, the eel may be a phallic symbol and thus have erotic connotations.<\/p>"
    },
    {
        "title": "Eggplant",
        "desc": "<p>To see or eat eggplants in your dream signify satisfaction with where you life is at. It may indicate abundance or fertility. Eggplants are also symbolic of loyalty, passion and devotion.<\/p>"
    },
    {
        "title": "Egg",
        "desc": "<p>To see or eat eggs in your dream symbolize fertility, birth and your creative potential. Something new is about to happen. If the eggs are scrambled, then the dream represents your commitment on a set course. It may also mean that you need to accept the consequences of your actions. If you see eggs hatching in your dream, then it indicates that you will realize your goals. It also means that your ideas are coming to fruition.<\/p><p>To find a nest filled with eggs in your dream signify some financial gain; the more abundant and bigger the eggs, the more significant the gain.<\/p><p>To see cracked or broken eggs in your dream represent feelings of vulnerability or a fragile state in your life. Consider the phrase, walking on eggshells. Alternatively, you may be breaking out of your shell and being comfortable with who you are.<\/p><p>To see bright colored eggs in your dream symbolizes celebration of a happy event.<\/p><p>To dream of rotten eggs signify loss. You may have allowed some situation to take a turn for the worse. Alternatively, the dream is telling you that something may look fine on the outside, but as you delve deeper, you find that it is not what it appears to be. Perhaps, something is too good to be true.<\/p><p>To see fish eggs in your dream represent an idea that has emerged from your subconscious.<\/p><p>Dreaming of only the egg whites refers to your support system in your new endeavor. It is also symbolic of your comfort zone and knowing your limitations.<\/p>"
    },
    {
        "title": "Eggshells",
        "desc": "<p>To see eggshells in your dream symbolize your fragile or vulnerable state of mind. Alternatively, the dream implies that you need to break out of your shell and let others know your true self. It is time to let your guard down a little.<\/p>"
    },
    {
        "title": "Egret",
        "desc": "<p>To see an egret in your dream refers to some codependent relationship.<\/p>"
    },
    {
        "title": "Egypt",
        "desc": "<p>To dream of Egypt indicates the roots and core of your own emotions and spirituality. It suggests of a time in life where things may have been simpler.<\/p>"
    },
    {
        "title": "Eiffel Tower",
        "desc": "<p>To see the Eiffel Tower in your dream symbolizes strength and longevity. You have a solid relationship and strong support system. Alternatively, the dream symbol refers to romance.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p.htm#Paris\">Paris.<\/p>"
    },
    {
        "title": "Eight Ball",
        "desc": "<p>To see the eight ball in your dream indicates that you tend to leave things to chance or fate. Consider the phrase, to be &quot;behind the eight ball&quot;. Perhaps you feel that you are stuck or that you are in a hopeless situation. You need to remain strong. Also consider the significance of the number eight in your waking life.<\/p>"
    },
    {
        "title": "Ejaculation",
        "desc": "<p>To dream that you are ejaculating represents your need for release. You can no longer contain yourself, either emotionally or sexually. Alternatively, it signifies a loss of control and power.<\/p>"
    },
    {
        "title": "Elastic",
        "desc": "<p>* Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/r3.htm#RubberBand\">Rubber Band<\/p>"
    },
    {
        "title": "Elbows",
        "desc": "<p>To see your own elbow in your dream indicates that you need to make a space for yourself. Your dream may express hesitance or fear in creating your own space for fear of being scrutinized. Alternatively, the dream may be a pun on your need to put more &quot;elbow grease&quot; on some task.<\/p>"
    },
    {
        "title": "To dream that your elbow is wounded suggests your inability to function in some waking situation. It may also refer to some sexual anxiety. The right elbow relates to moral and ethical issues while the left elbow represents passiveness and your undeveloped characteristics.TOP",
        "desc": "<p>Elderberries<\/p><p>To see elderberries in your dream symbolize domestic bliss and comfort.<\/p>"
    },
    {
        "title": "Elderly",
        "desc": "<p>To see an elderly person in your dream represents wisdom or spiritual power. Pay attention to the message or advice that the elderly person is conveying to you. He or she can help provide life answers and solutions to your problems and try to guide you toward the right direction.<\/p><p>Dreaming of an elderly person with two new front baby teeth refers to the cycle of life or how things have a tendency of coming full circle.<\/p>"
    },
    {
        "title": "Election",
        "desc": "<p>To dream that you are at an election represents a choice that you need to make which may affect others.<\/p>"
    },
    {
        "title": "Electric Blanket",
        "desc": "<p>To see an electric blanket in your dream indicates that you need to conserve your energy and get some much needed rest. Alternatively, the dream mean that you lack the ability to fulfill or sustain your needs.<\/p>"
    },
    {
        "title": "Electric Chair",
        "desc": "<p>To see an electric chair in your dream indicates a sudden end to something in your life. You are making a drastic change. Alternatively, the dream represents feelings of guilt, regret, or remorse about something you did.<\/p>"
    },
    {
        "title": "Electric Fence",
        "desc": "<p>To see an electric fence in your dream indicates that anger has caused you to isolate yourself from everyone else. Or it may be that others may be afraid to approach you because of your highly charged personality.<\/p>"
    },
    {
        "title": "Electric Guitar",
        "desc": "<p>To see or play an electric guitar in your dream signifies the power and strength of your passions. You clearly express your feelings to others.Alternatively, it is symbolic of youth and rebellion.<\/p>"
    },
    {
        "title": "Electric Saw",
        "desc": "<p>To see an electric saw in your dream signifies your ability to get down to the core of the problem. You know how to get to the point quickly.<\/p>"
    },
    {
        "title": "Electricity",
        "desc": "<p>To dream of electricity symbolizes vigor and life energy. You need to be revitalized. Alternatively, the dream suggests that you need to conserve your energy.<\/p><p>To dream that the electricity is fried or out indicates your lack of insight and perspective on a situation.<\/p>"
    },
    {
        "title": "Electricity Tower",
        "desc": "<p>To see an electricity tower in your dream symbolizes a distribution of power. You do not need to always be in full control. You need to delegate responsibilities and duties. Alternatively, the dream symbolizes industry and modernity.<\/p>"
    },
    {
        "title": "Electrocution",
        "desc": "<p>To dream of an electrocution indicates that the current course of your actions will lead to disaster. The dream also represents fear and the consequences of your actions. You need to be more aware of your surroundings and those around you.<\/p>"
    },
    {
        "title": "Elemental Bending",
        "desc": "<p>To dream that you can bend fire refers to your ability to control your anger.<\/p><p>To dream that you can bend water represents your ability to control your emotions. You can hide your feelings well.<\/p><p>To dream that you can bend air refers to your ability to control and watch what you say. You are careful in how you choose your words.<\/p><p>To dream that you can bend the earth signifies your ability to control your actions and react at a precise or optimal moment.<\/p>"
    },
    {
        "title": "Elephant",
        "desc": "<p>To see an elephant in your dream indicates that you need to be more patient or more understanding of others. Or perhaps there is a memory that you are holding on to for too long. You need to let go of the past. The elephant is also a symbol of power, strength, faithfulness and intellect. Alternatively, the elephant's introverted personality may be a reflection of your own personality. In particular, if you see a white elephant, then it symbolizes royalty.<\/p><p>To dream that you are riding an elephant indicates that you are in control of your subconscious and aspects that you were once afraid of.<\/p><p>To dream that you are afraid of the elephant suggests that there is an enormous problem that you are afraid to confront.<\/p><p>To dream that you are an elephant suggests that you need to make your opinions and views known. You need to be more vocal and voice your ideas. Express yourself. Alternatively, dreaming that you are an elephant may be reflective of your conservative views. The elephant is the symbol of the United States Republican party. Perhaps you are sharing the same views as the Republican party.<\/p>"
    },
    {
        "title": "Elevator",
        "desc": "<p>To dream that you are ascending in an elevator represents a rise to status and wealth. You may have risen to a higher level of consciousness and are looking at the world from an elevated viewpoint. If the elevator is moving upward in an out of control fashion or it crashes through the roof, then it indicates that you are being catapulted to a position of power in which you do not yet know how to deal with. You are afraid of the new responsibilities ahead for you. Descending in an elevator suggests that you are being grounded or coming back down to reality. It also signifies setbacks and misfortunes.<\/p><p>In general, the up and down action of the elevator represents the ups and downs of your life. It also symbolizes emotions and thoughts that are emerging out of and submerging into your subconscious. Alternatively, the dream may have sexual connotations.<\/p><p>To dream that the elevator is out of order or that it is not letting you off symbolizes that your emotions have gotten out of control. It may be a reflection of your life or your career. You are feeling stuck in some aspect of your life, whether it is your career, relationship, etc.<\/p><p>To dream that the elevator is moving sideways means that your efforts are counterproductive. You are going nowhere in your work, relationship or other situation.<\/p>"
    },
    {
        "title": "Eleventh Hour",
        "desc": "<p>To dream of the eleventh hour signifies that time is running out for you. This may be an approaching deadline for a project or a decision that needs to be made by you.<\/p>"
    },
    {
        "title": "Elf",
        "desc": "<p>To see an elf in your dream refers to some imbalance and disharmony in your life. The elf often serves as a guide of the soul. Alternatively, it suggests that you need to be more carefree, worry-free, and light-hearted.<\/p>"
    },
    {
        "title": "Elimination",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b4.htm#BowelMovement\">Bowel Movement.<\/p>"
    },
    {
        "title": "Elk",
        "desc": "<p>To see an elk in your dream symbolizes strength and endurance. It is also an indication that you need to spend more time with friends and eat healthier.<\/p>"
    },
    {
        "title": "Elm",
        "desc": "<p>To see an elm tree in your dream indicates death, misfortune, and bad luck.<\/p>"
    },
    {
        "title": "Elopement",
        "desc": "<p>To dream that you are eloping suggests that you are trying to escape from the problems of your daily life. You are trying to maintain some sort of balance in aspects of your spiritual, emotional and daily life.<\/p>"
    },
    {
        "title": "Eloquent",
        "desc": "<p>To dream that you are eloquent signifies your readiness for an upcoming task or event.<\/p>"
    },
    {
        "title": "Email",
        "desc": "<p>To dream about email indicates that you need to reach out to people who may not necessarily always physically be around. It could also very well mean that you have been spending too much time in front of the computer and this has carried over into your dreams.<\/p>"
    },
    {
        "title": "Embankment",
        "desc": "<p>To see or drive along an embankment in your dream signifies the threat of trouble and unhappiness. You are struggling with success.<\/p>"
    },
    {
        "title": "Embarrassment",
        "desc": "<p>To dream that you are embarrassed signifies hidden weaknesses, fears and lack of self-confidence. This dream also suggests that you are also harboring some insecurities about your sexuality.<\/p>"
    },
    {
        "title": "Emblem",
        "desc": "<p>To see an emblem in your dream represents your cultural ties and ancestral links. The dream provides you with a sense of confidence and inner strength.<\/p>"
    },
    {
        "title": "Embrace",
        "desc": "<p>To dream that you are embracing yourself symbolizes self-acceptance and self-love.<\/p><p>To dream that you are embracing someone else indicates that you are in need of more affection or that you need to show more love.<\/p>"
    },
    {
        "title": "Embroidery",
        "desc": "<p>To dream that you are embroidering symbolizes your ability to make the best of everything that comes your way.<\/p>"
    },
    {
        "title": "Embryo",
        "desc": "<p>To dream of an embryo symbolizes the emergence of a fresh idea. Also, your subconscious feelings may be surfacing. Alternatively, the dream may refer to your feelings of vulnerability and your need to be protected. However if you are pregnant, it is quite common to see an embryo in your dream.<\/p>"
    },
    {
        "title": "Emerald",
        "desc": "<p>To see an emerald in your dream represents strength, longevity, immortality, faithfulness, durability, and fertility. You may be entering the healing stages of some situation.<\/p>"
    },
    {
        "title": "Emergency",
        "desc": "<p>To dream of an emergency indicates that there is a urgent matter that needs your immediate attention. You are about to learn an important lesson.<\/p>"
    },
    {
        "title": "Emergency Alert System",
        "desc": "<p>To hear or see a message from the emergency alert system is a wake-up call to get aspects of your life in order. It is time to take action.<\/p>"
    },
    {
        "title": "Emergency Room",
        "desc": "<p>To dream that you are in an emergency room implies that your current lifestyle is doing you harm. You need to reevaluate your actions and its consequences.<\/p>"
    },
    {
        "title": "Emery Board",
        "desc": "<p>To see an emery board in your dream suggests that you need to smooth out the rough edges of your personality or your relationship with others. You may be a little too harsh and too abrasive toward others.<\/p>"
    },
    {
        "title": "Emigration",
        "desc": "<p>To dream that you are emigrating suggests that you are dissatisfied with your waking situation and are looking for a change. Alternatively, it indicates that you are trying to escape from life's problems instead of confronting them.<\/p>"
    },
    {
        "title": "Emoticon",
        "desc": "<p>To see emoticons in your dream represents your range of emotions. You are feeling emotionally overwhelmed. Alternatively, dreaming of emoticons suggests that your feelings are being trivialized or that someone is discounting how you feel.<\/p>"
    },
    {
        "title": "Emotionless",
        "desc": "<p>To dream that you are emotionless suggests that you are closing yourself off from those around you. You may be neglecting your own feelings and need to start paying more attention to them.<\/p>"
    },
    {
        "title": "Emotions",
        "desc": "<p>Emotions expressed in dreams are a way for you to act out the feelings that you normally would not express if you were awake. The dream provides a &quot;safe&quot; outlet for these emotions instead of letting them get pent up. However if you feel of mix of emotions in your dream, especially if they are contradictory, then it means that your conscious and subconscious are in an emotional conflict.<\/p>"
    },
    {
        "title": "Emperor",
        "desc": "<p>To see an emperor in your dream represents completion and creativity. You are trying to maintain harmony and peace.<\/p>"
    },
    {
        "title": "Employee",
        "desc": "<p>To see an employee in your dream symbolizes your waking relationship with them. You may be experiencing work difficulties or work-related stress.<\/p><p>To dream that you have a new employee indicates that you are discovering a new aspect of yourself.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/o.htm#office\">Office.<\/p>"
    },
    {
        "title": "Employment",
        "desc": "<p>To dream of your employment suggests that your talents are being utilized. It may also mean that you need to put more focus on your professional life. Alternatively, the dream may be analogous to your own self worth.<\/p>"
    },
    {
        "title": "Empress",
        "desc": "<p>To see an empress in your dream represents power honor, influence, pride and status. You may be letting power get the best of you. The empress may also symbolize the Great Mother.<\/p>"
    },
    {
        "title": "Emptiness",
        "desc": "<p>To dream of emptiness suggests that there is something missing or lacking in your life. It symbolizes fruitless labor, an emotional void, or loneliness. There is nothing to show for all the effort that you have dedicated to a project or relationship. In particular, to dream that a container is empty represents optimism.<\/p>"
    },
    {
        "title": "Emu",
        "desc": "<p>To see an emu in your dream implies that you are emotionally resilient. You are also observant. Alternatively, the dream may be telling you that you are being overbearing.<\/p>"
    },
    {
        "title": "Enchantment",
        "desc": "<p>To dream that you are being enchanted indicates that you are being manipulated or influenced to your demise.<\/p>"
    },
    {
        "title": "Enchantress",
        "desc": "<p>To see an enchantress in your dream symbolizes feminine power and the ability to influence and persuade.<\/p>"
    },
    {
        "title": "Enclosure",
        "desc": "<p>To dream that you are in an enclosure indicates that you are in defensive mode. Some situation in your waking life has put you on guard. You feel the need to protect and defend yourself.<\/p><p>To dream that you are in an enclosure that is shrinking indicates that you feel restrained and confined in some circumstance. It represents actual or perceived limitations. You need to start testing out your boundaries in order to grow.<\/p><p>To dream that you are in an enclosure made of glass suggests that you are too critical about a person or situation.<\/p>"
    },
    {
        "title": "Encyclopedia",
        "desc": "<p>To dream of seeing or searching through encyclopedias symbolizes your pursuit for literary knowledge and the fine arts. Although these pursuits may not be financially beneficial, you are enriching you mind.<\/p>"
    },
    {
        "title": "End",
        "desc": "<p>To dream of an end to something represents an achievement or goal that has been reached. It may also mean that the bad times are coming to an end. Or perhaps your time is running out and you need to come to a decision about some issue. The end of something also signals the beginning of something new.<\/p>"
    },
    {
        "title": "End Credits",
        "desc": "<p>To see the end credits of a movie or show in your dream represents recognition for your work. You are looking for acknowledgement for a job well done.<\/p><p>To see your name in the end credits in your dream symbolizes your confidence in your own ability. You believe that you can succeed in whatever you pursue.<\/p>"
    },
    {
        "title": "Enemy",
        "desc": "<p>To see your enemy in your dream represents opposing ideas and contradictory attitudes. You are in denial about something or you are rejecting someone. Enemies may also represent the enemies within yourself and the inner conflict you have with yourself. Consider the phrase &quot;I am my own worst enemy.&quot; Perhaps you are trying to rid yourself of certain aspects of your character.<\/p><p>To dream that you are dealing with an enemy represents a resolution to some inner conflict or waking life problem.<p>Dreaming that an enemy is singing to you means that you need to reevaluate the negativity you have towards the enemy. Perhaps it is time to let go of the animosity or some of the feelings you are harboring.<\/p>"
    },
    {
        "title": "Energizer BunnyDreaming about the Energizer Bunny relates to your tenacity. You are moving forward in a steady manner. The dream may also be telling you to &quot;keep going!&quot;TOP",
        "desc": "<p>Energy<p>To dream that you are energetic symbolizes growth, activity, expansion and insight. You need to channel your energy in a positive way.<\/p>"
    },
    {
        "title": "Engagement",
        "desc": "<p>To dream that you are engaged to be married represents sexual or relationship needs. You may be trying to resolve your feelings of loneliness. Alternatively, it symbolizes your commitments and desires for security. More directly, if you are unmarried, the dream may indicate your desires for some form of commitment.<\/p><p>If you dream that you are engaged to your father, then it implies that you are looking for a father figure. The dream does not mean that you want to actually marry your father. Perhaps your father is not around much and you just want more of a relationship with him. Alternatively, the dream may mean that you want someone who is as good to you as your father.<\/p><p>To dream that you break an engagement denotes a hasty and unwise decision in some important matter.<\/p><p>To dream of a business engagement signifies concern and worries in some area of your work.<\/p>"
    },
    {
        "title": "Engagement Ring",
        "desc": "<p>To dream about an engagement ring implies that you are thinking about some long term commitment and marriage. It is a symbol of love. If you are thinking about popping the question, then dreaming of an engagement ring may indicate your nervousness about it.<\/p>"
    },
    {
        "title": "Engine",
        "desc": "<p>To see an engine in your dream represents your heart and its power. Consider the condition of the engine and how it is running. If the engine does not start, then it symbolizes some obstacle that is hindering your progress and goals.<\/p><p>To dream that you engine is blown or disabled indicates that you have been betrayed. Alternatively, your old habits and old ways of doing things is hindering your progress.<\/p><p>Dreaming that a car engine is on fire implies that you are experiencing some sort of heartache or heartbreak. Alternatively, the dream symbolizes your passion about a goal.<\/p>"
    },
    {
        "title": "Engineer",
        "desc": "<p>To see an engineer in your dream suggests that you are taking charge of your life. It also indicates that you are evaluating a situation and how the various pieces fit together.<\/p>"
    },
    {
        "title": "Engineering",
        "desc": "<p>To dream of engineering represents your ability to create and to manipulate the external world. You are feeling empowered.<\/p>"
    },
    {
        "title": "England",
        "desc": "<p>To dream that you are in England signifies renewal and fertility. Alternatively, it denotes nobility. You have an elevated sense of self.<\/p>"
    },
    {
        "title": "Entertainment",
        "desc": "<p>To see some form of entertainment in your dream suggests that you are putting an aspect of your life on display. If you are the entertainer in the dream, then it indicates that you are showing off. Consider the performance and the reaction of the audience. In particular, if you dream of an entertainment filled with music and dancing, then it denotes your carefree and pleasant nature. You are in a good mood.<\/p>"
    },
    {
        "title": "Entrails",
        "desc": "<p>To see yours or someone else's entrails represent despair and hopelessness. The dream may also be a metaphor for &quot;in trail&quot; implying that you are on the right track.<\/p><p>To dream that you tear out someone's entrails signify your own cruel intents to further your own interest and gain.<\/p><p>To see the entrails of an animal denote defeat over your adversaries.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/i2.htm#intestines\">Intestines.<\/p>"
    },
    {
        "title": "Entrance",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d3.htm#Door\">Door.<\/p>"
    },
    {
        "title": "Envelope",
        "desc": "<p>To seean envelope in your dream signifies anticipation or opportunity. If you are opening an envelope, then it represents a message that you or someone is trying to convey to you. Alternatively, the dream means that you are &quot;pushing the envelope.&quot; You are testing the limits or boundaries.<\/p><p>To see unopened envelopes indicate sorrow news and missed opportunities.<\/p>"
    },
    {
        "title": "Environment",
        "desc": "<p>To dream about the environment symbolizes freedom, tranquility, and renewal.If the environment is dry or dead, then it eludes to dissatisfaction in your personal relationship. Perhaps you feel that your love life is lacking.<\/p><p>To dream about environmental issues represent the important role you play in the overall big picture. Do not underestimate yourself and your abilities. Alternatively, it signifies a sense of powerlessness. You are feeling overwhelmed by things that are out of your control.<\/p>"
    },
    {
        "title": "Envy",
        "desc": "<p>To dream that you are envious of others represents waking feelings that have carried over to your dream state. The dream may be telling you about subconscious feelings toward that person.<\/p><p>To dream that you are being envied by others indicates that you think highly of yourself. You demand respect and get it. You feel that you are on top.<\/p>"
    },
    {
        "title": "Epaulet",
        "desc": "<p>To see epaulets in your dream indicates that you are looking for someone else to defer to for an important decision.<\/p><p>To dream that you are wearing epaulets symbolize distinction, discipline, rigidity and honor. You may be forcing your opinions and feelings on others.<\/p>"
    },
    {
        "title": "Epicure",
        "desc": "<p>To dream that you are an epicure reflects your fine and high-end taste. You are able to maximize your full potential.<\/p>"
    },
    {
        "title": "Epidemic",
        "desc": "<p>To dream of an epidemic signifies worries of bothersome tasks.<\/p>"
    },
    {
        "title": "Epilepsy",
        "desc": "<p>To dream that you have epilepsy suggests that you are suppressing your feelings. You need to acknowledge and express these emotions.<\/p>"
    },
    {
        "title": "Equal Sign",
        "desc": "<p>To see the equal sign in your dream represents balance and symmetry. You are looking for order in your life. As two parallel lines, the equal sign may also symbolize the number 11.<\/p>"
    },
    {
        "title": "Equation",
        "desc": "<p>To see or solve an equation in you dream means that you are looking for a solution to a waking problem. You need to think rationally and methodically. If you dream that you have the wrong answer or that you cannot solve an equation, then it implies that your approach to a waking problem is all wrong.<\/p>"
    },
    {
        "title": "Equator",
        "desc": "<p>To dream about the equator indicates the search for Self. You are exploring aspect of yourself in order to become more whole.<\/p>"
    },
    {
        "title": "Eraser",
        "desc": "<p>To see or use an eraser in your dream suggests that you need to clear up some mistakes that you have made.<\/p>"
    },
    {
        "title": "Erection",
        "desc": "<p>To dream that you have an erection symbolizes your creative power and energy. You want to take action. Alternatively, if you are a man and dream of an erection, then it suggests a fear of impotence or sexual dysfunction.<\/p>"
    },
    {
        "title": "Ermine",
        "desc": "<p>To wear an ermine in your dream symbolizes wealth, luxury and greed. Alternatively, it denotes wealth.<\/p><p>To see others wearing ermine represents your associations with wealthy people.<\/p>"
    },
    {
        "title": "Erosion",
        "desc": "<p>To dream about erosion refers to a situation or relationship that is wearing away. Some external factor is affecting your relationship in a negative way. You need to give more attention to it.<\/p>"
    },
    {
        "title": "Erotica",
        "desc": "<p>To dream of erotica represents your sexual desires and your sexual appetite. It seeks to reenergize your sex life, rekindle your passion and overcome your inhibitions. The dream may also be a result from watching porn, erotic movies or reading erotic novels.<\/p><p>Dreams of erotica are common dreams if you are approaching you wedding day. This may be due to the intensity of your sexual passion with your fiancé. It also relates to the new roles that you will be taking on and the uncertainty that that may bring. If you are recovering from an injury, surgery, grief or illness, then you may also experience erotic dreams. The dream may serve to provide a dramatic reminder of your vitality and liveliness.<\/p>"
    },
    {
        "title": "Errands",
        "desc": "<p>To dream that you are running errands indicates that you are stuck in a rut. Your daily life is too much of a routine. Alternatively, the dream signifies harmony and mutual understanding in your domestic sphere.<\/p>"
    },
    {
        "title": "Eruption",
        "desc": "<p>To see an eruption in your dream signifies a forceful and jolting outpour of repressed thoughts or urges. You may also be experiencing an upheaval in your life.<\/p>"
    },
    {
        "title": "Escalator",
        "desc": "<p>To see an escalator in your dream indicates movement between various levels of consciousness. If you are moving up in the escalator, then it suggests that you are addressing and confronting emotional issues. You are moving through your spiritual journey with great progress and ease. If you are going down the escalator, then it implies repression and descent back into your subconscious. You may be experiencing a setback.<\/p><p>To dream that you or someone is going up the downside of the escalator implies that you are not confronting your emotions in an effective manner. Perhaps you are afraid of exposing yourself to vulnerabilities. Alternatively, the dream means that you are putting in too much work and effort into something that is not worthwhile. You are wasting your energy on unproductive pursuits.<\/p>"
    },
    {
        "title": "Escape",
        "desc": "<p>To dream that you escape from jail or some place of confinement signifies your need to escape from a restrictive situation or attitude. Alternatively, it suggests that you are refusing to face your problems. You are avoiding the situation, instead of confronting them.<\/p><p>To dream that you escape from injury from an animal, or from any situation, signifies your good health and prosperity. You will experience a favorable turn of events.<\/p><p>Dreaming that you are unable to make an escape represents a feeling of helplessness or not being able to escape from life's problems and stresses. Consider the significance and symbolism of where or what you are trying to escape from. The dream may also point to a lack of direction or confidence.<\/p>"
    },
    {
        "title": "Eskimo",
        "desc": "<p>To see an Eskimo in your dream represents your cold and frigid feelings. Alternatively, it suggests that you are adapting well to a current situation.<\/p><p>To see or live in an igloo in your dream symbolizes something that appears cold and frigid on the outside, but is really a warm and caring person on the inside. Alternatively, the igloo represents the feminine and her hard cold barrier that sometimes need to be broken down.<\/p>"
    },
    {
        "title": "ESP",
        "desc": "<p>To dream that you have ESP suggests that you need to pay more attention to your intuition or gut feeling. Go with your hunch. The dream is a deep message from your subconscious.<\/p>"
    },
    {
        "title": "Espresso",
        "desc": "<p>To make or drink espresso in your dream signifies your need to react quickly. The dream is a pun on &quot;express&quot;. You need to get moving and act, before the opportunity passes you by.<\/p>"
    },
    {
        "title": "Essay",
        "desc": "<p>To dream that you are writing an essay suggests that you need to think things through before acting on them. You need to be more objective when evaluating a situation.<\/p><p>To see or read an essay in your dream represents some deadline or anxiety over an issue. Alternatively, the dream indicates that you are being put though a test.<\/p>"
    },
    {
        "title": "Estate",
        "desc": "<p>To dream that you become an owner of an estate suggests that you cannot rely on others for your sense of security. You need to be secure about yourself.<\/p>"
    },
    {
        "title": "Estranged",
        "desc": "<p>To dream of someone who you are estranged from signifies your desire to rebuild a connection or relationship with this person. It may also mean reconnecting an aspect of your own self that you have ignored or abandoned.<\/p>"
    },
    {
        "title": "ET",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/e2.htm#extraterrestial\">Extraterrestrial.<\/p>"
    },
    {
        "title": "Eucalyptus",
        "desc": "<p>To see a eucalyptus in your dream represents protection and the need to feel protected. Alternatively, it signifies changes, transformation and healing. The dream may also be a metaphor for some sticky situation.<\/p>"
    },
    {
        "title": "Eulogy",
        "desc": "<p>To dream that you are giving a eulogy suggests that there is some repressed thoughts that you need to verbalize. Do not let these thoughts or feelings die.<\/p><p>To listen to a eulogy in your dream indicates that you are learning to express your feelings.<\/p><p>To dream that you are being eulogized indicates that you are reflecting back on your own accomplishments, memories and key moments in life. Alternatively, it symbolizes an end to your old attitudes and outdated beliefs.<\/p>"
    },
    {
        "title": "Eunuch",
        "desc": "<p>To see a eunuch in your dream indicates your fears of sex. You may be trying to desexualize someone who you are attracted to, but can't be with. Alternatively, it represents a lack of creativity, power or strength.<\/p><p>To dream that you are a eunuch refers to fears of losing your virility. Perhaps you feel that an important aspect of yourself is missing.<\/p>"
    },
    {
        "title": "Europe",
        "desc": "<p>If you are not from Europe and dream that you are there, then it indicates that you need to be more expressive. You also need to take time for more leisurely or artistic pursuits. If you are from Europe, then the dream may just be a depiction of your waking landscape. It may also deal with your sense of nationalism. Alternatively, dreaming of Europe indicates original thought or old ways of thinking.<\/p>"
    },
    {
        "title": "Euthanasia",
        "desc": "<p>To dream of euthanasia suggests that you are ready to rid yourself of certain old habits and behavior. You want to end things on your own terms. The dream signals a transformation and a period of self discovery. If you see an animal being euthanized in your dream, then it points to an ending of some carnal behavior.<\/p>"
    },
    {
        "title": "Evacuation",
        "desc": "<p>To dream of an evacuation suggests that you are isolating yourself and holding back your emotions.<\/p><p>To dream that you are in a town that has been evacuated indicates that you are feeling rejected by those around you. You are feeling unaccepted.<\/p>"
    },
    {
        "title": "Evaporation",
        "desc": "<p>To dream that water is evaporating indicates that you are able to deal with and understand your emotions. You are undergoing a positive transformation or elevating yourself to a new level.<\/p>"
    },
    {
        "title": "Eve",
        "desc": "<p>To see Eve in your dream signifies opposition in your social and business circles. The dream may also be on pun on the evening time.<\/p><p>To dream that you impersonate Eve indicates you to be careful when it comes to the persuasions of the opposites sex.<\/p>"
    },
    {
        "title": "Even Numbers",
        "desc": "<p>To see even numbers in your dream signify balance or symmetry in your life. It also symbolizes tranquility.<\/p>"
    },
    {
        "title": "Evening",
        "desc": "<p>To dream that it is evening denotes the end of a cycle, aging or death. It may also be symbolic of unrealized hopes.<\/p>"
    },
    {
        "title": "Evening Gown",
        "desc": "<p>To see or wear an evening gown in your dream represents enjoyment, social pleasures, grace and culture. It also represents the image that you are projecting to others. Consider the color and design of the gown for additional significance. If the gown is very fancy or ornate, then it signifies an elaborate and luxurious lifestyle. If the gown is plain or simple, then it suggests a simplified lifestyle. Alternatively, to dream you are wearing an evening gown indicates that you are seeking or trying to attain some sense of happiness.<\/p>"
    },
    {
        "title": "Evergreen",
        "desc": "<p>To see evergreen trees in your dream signify wealth, happiness, immortality, high aspirations, and knowledge. The dream represents the cycle of life and may be trying to offer you hope in the midst of despair. Alternatively, the dream may be a metaphor to be &quot;ever green&quot; as in to be more environmentally conscious.<\/p>"
    },
    {
        "title": "Eviction",
        "desc": "<p>To dream that you are being evicted suggests that a present situation or relationship is making you feel helpless and powerless. You feel that you cannot fend for yourself and feel you do not belong. Alternatively, you believe that you are being unfairly treated.<\/p>"
    },
    {
        "title": "Evil",
        "desc": "<p>To dream that someone or something is evil denotes a repressed and\/or forbidden aspect of yourself. This part of yourself may be seeking recognition and acknowledgment. Alternatively, evil may also be a reflection of your strong, negative emotions like hate, anger, etc.<\/p>"
    },
    {
        "title": "Ex",
        "desc": "<p>To dream about your ex-boyfriend\/girlfriend or ex-husband\/wife, that you and your ex are kissing\/fighting or that you and your ex got back together again suggests that something or someone in your current life is bringing out similar feelings you felt during that relationship with your ex. The dream may be a way of alerting you to similar behavioral patterns in your current relationship. What you learn from that previous relationship may need to be applied to the present one so that you do no repeat the same mistakes. Alternatively, you may be reflecting on the positive experiences and good times that you shared with your past love.Dreams of getting back together with your ex or of your ex wanting to get back together with you may not necessarily be a reflection of reality. This dream may be triggered by some major change in your current relationship and how far you have come from those past relationships.<\/p><p>In particular, to see your ex-husband\/wife in your dream indicates that you are currently finding yourself in a situation that you do not want to be in. It suggests that you are experiencing a similar relationship or situation which makes you feel unhappy and uncomfortable. Alternatively, dreaming that you are together with your ex-husband\/wife implies that you are subconsciously repeating the same old patterns from that relationship to your current relationship. You are making the same mistakes and reacting the same way.<\/p><p>To dream that your ex-boyfriend or ex-girlfriend is missing you suggests that you &quot;miss&quot; some aspect of that past relationship. A situation in your current life may be reminding you of your relationship with your ex. Alternatively, the dream may mean that you have moved on with your life. The notion that your ex is missing you may be a pun on that he has &quot;missed&quot; his opportunity or &quot;missed&quot; his chance with you.<\/p><p>To see your mate's ex in your dream suggests that you are comparing yourself to the ex. The dream is telling you not to make the same relationship mistakes that ended that relationship.<\/p><p>To dream that you ex has died indicates that your feelings for your ex are completely dead now. The dream is a metaphor of how you have let go of the past and are ready to move on and fully devote yourself to new relationships.<\/p><p>Metaphorically, seeing your ex in your dream may also signify aspects of yourself that you have x'd out or neglected.<\/p>"
    },
    {
        "title": "Ex-Boyfriend",
        "desc": "<p>To see an old ex-boyfriend from childhood in your dream refers to a freer, less encumbered relationship. The dream serves to bring you back to a time where the responsibilities of adulthood (or marriage) did not interfere with the spontaneity of romance. You need to recapture the excitement, freedom, and vitality of youth that is lacking in your present relationship. If your ex-boyfriend hurts or ignores you, then the dream is telling you to move on with your life and stop thinking about your ex. If you dream that you want your ex-boyfriend back, then the dream may reflect waking feelings of actually wanting him back. Alternatively, it means that you miss being in a relationship and to feel wanted.<\/p><p>To dream that your ex-boyfriend is giving you advice about your current relationship suggests that your subconscious is telling you not to repeat the same mistakes that you had made with this ex-boyfriend.<\/p><p>To dream that you are being massaged by your ex-boyfriend suggests that you need to let go of some of that defensiveness that you have been putting forth as a result of a past relationship. You may have put up a wall or armor around you. You need to learn to trust people again.<\/p><p>To dream that your ex-boyfriend is giving you a ring or proposing to you implies that your relationship with him made you feel whole and complete. The dream does not necessarily mean that you want to be together with him again, but that you are longing for a relationship that makes you feel complete. Alternatively, the dream may reflect a final end to something and the beginning of a new stage. You are ready to move on from your ex. By him proposing to you, the power is on your side whether you say yes or no.<\/p><p>To dream that your ex-boyfriend gives you a stuffed animal suggests that you are seeking for reassuring and nurturing aspects of a relationship. This is not to imply that you want you ex-boyfriend back. Alternatively, the dream could represent some immature relationship which may describe the relationship you had with your ex.<\/p><p>To dream that your ex-boyfriend is admitted into the hospital means that you are still dealing with the break-up. There are still some unresolved issues left hanging. If he is released from the hospital, then it means that you have totally let go of the relationship. You have moved on. If you dream that your ex-boyfriend is dressed in a suit at a hospital, then it suggests that you have come to terms with that relationship and have completed the healing process.<\/p><p>To dream that you walk off or walk away with your ex boyfriend indicates that your current love interests are not measuring up to your ex boyfriend.<\/p><p>To dream that you are kidnapped by your ex-boyfriend suggests that your ex still has some sort of emotional hold on you.<\/p><p>Dreaming that you and your ex-boyfriend is taking care of a sick child together suggests that something is still keeping you two in each other's lives. There may be some unfinished business that still has yet to be resolved. Alternatively, the dream may parallel a situation in your waking life where you were stuck.<\/p><p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">If you dream that your ex-boyfriend moves into your house, then it means that you two are able to co-exist and be civil to each other.<\/p>"
    },
    {
        "title": "Ex-Friend",
        "desc": "<p>Todream of an ex-friend suggests that an object or a recent incident has subconsciously reminded you of her or him. Alternatively, the ex-friend represents a lesson you learned from the falling out. You need to apply that lesson to a current issue, problem or relationship.<\/p>"
    },
    {
        "title": "-Girlfriend",
        "desc": "<p>To dream that your ex-girlfriend is pregnant depends if the baby is yours or not. If you dream that the baby is yours, then it implies your subconscious desires to get back with your ex-girlfriend. If the baby is not yours, then it means that you have fully accepted that the relationship is over. You still care for her even though the two of you are no longer together.<\/p><p>To see your ex-girlfriend's mother in your dream indicates some unresolved issues with your ex-girlfriend. You are wanting to reach out to her mother in order to get through to the ex-girlfriend.<\/p><p>Dreaming about your current boyfriend's ex-girlfriend reflects your own feelings of insecurity. You wonder if you measure up. In a way, you feel that she is still a lingering part of your current relationship, whether it is physical or psychological.<\/p><p>If you dream that you have an ex-girlfriend, but you do not actually have one in, then she may represent an old friend from your past. Alternatively, dreaming of a non-existent ex-girlfriend may be about how you are rejecting aspects of your feminine\/emotional side.<\/p>"
    },
    {
        "title": "Exam",
        "desc": "<p>To dream that you are taking an exam signifies insecurities, fear of not meeting others' expectations, and fear of failure.<\/p><p>*For an in depth analysis, click on<a href=\"http:\/\/www.dreammoods.com\/commondreams\/test-dreams.html\">Common Dreams: Exam.<\/p>"
    },
    {
        "title": "Excavation",
        "desc": "<p>To dream that you are excavating something represents personal development. You are making new discoveries about yourself and uncovering your potential.<\/p>"
    },
    {
        "title": "Excavator",
        "desc": "<p>To see or drive an excavator in your dream indicates that you are ready to delve into your subconscious and confront the issues that is holding you back. You are clearing a path in order to make a new start and rid yourself of old habits and beliefs.<\/p>"
    },
    {
        "title": "Exchange",
        "desc": "<p>To dream that you are exchanging ideas, gifts, or other things signifies community and sharing of ideas. You need to give in order to take back.<\/p>"
    },
    {
        "title": "Excitement",
        "desc": "<p>To be particularly excited in your dream implies that you are lacking excitement in your waking life. This is known as a compensation dream. Alternatively, feeling excitement may just mean that you are anticipating for some big event or news.<\/p>"
    },
    {
        "title": "Exclamation Point",
        "desc": "<p>To see an exclamation point in your dream symbolizes excitement, vigor, surprise or disbelief. You are seeing a positive outlook on life. Alternatively, the dream is an expressing an urgency in some matter.<\/p>"
    },
    {
        "title": "Exclude",
        "desc": "<p>To dream that you are excluded or feel excluded represents feelings of rejection or not fitting into a group. It may also highlight fears of not being able to keep up.You are questioning your abilities. The dream may be telling you that you are not utilizing your full potential. If you exclude something or someone, then it indicates that you are ready to let go of the past or move forward.<\/p>"
    },
    {
        "title": "Excrement",
        "desc": "<p>*See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/f.htm#feces\">Feces.<\/p>"
    },
    {
        "title": "Execution",
        "desc": "<p>To see an execution in your dream suggests that there is something or someone you need to cut out from your life.<\/p><p>To dream of your own execution indicates that you are harboring some strong guilt. Perhaps there is a bad habit or aspect of yourself that you want to rid yourself of.<\/p>"
    },
    {
        "title": "Executive",
        "desc": "<p>To dream that you are an executive of a corporation represents your desires for upward job mobility. You are looking for a career and have set high goals for yourself. Alternatively, the dream may be a metaphor that you need to &quot;execute&quot; your plans. It is time to take action.<\/p>"
    },
    {
        "title": "Exercise",
        "desc": "<p>To dream that you are exercising signifies your worries about your health. You may be concerned about fitting into society's ideals of beauty. Or you just need to get up and exercise more! Alternatively, the dream may also indicate that you need to &quot;exercise&quot; your rights and power in some situation.<\/p>"
    },
    {
        "title": "Exfoliate",
        "desc": "<p>To dream that you are exfoliating your skin means that you need to let down your guard. It may also imply that you are ready to reveal your true self.<\/p>"
    },
    {
        "title": "Exhausted",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/t2.htm#Tired\">Tired.<\/p>"
    },
    {
        "title": "Exhibit",
        "desc": "<p>To dream that you are at an exhibit suggests that you need to take a closer look at the various aspects of your life. The different exhibits symbolize the different facets of your personality. Alternatively, the dream indicates your need to cultivate your sense of culture.<\/p>"
    },
    {
        "title": "Exhibitionist",
        "desc": "<p>To dream that you are having sex in a public place signifies something dramatic that may have happened or will happen in the public aspect of your life. You are feeling overly exposed or vulnerable. Perhaps you feel that you are being publicly criticized.<\/p>"
    },
    {
        "title": "Exile",
        "desc": "<p>To dream that you are exiled suggests that you are feeling alienated or alone in a new environment.<\/p>"
    },
    {
        "title": "Exit",
        "desc": "<p>To see an exit in your dream indicates that you are looking for a way out of a waking situation.<\/p>"
    },
    {
        "title": "Exorcism",
        "desc": "<p>To dream that you or others are being exorcised symbolizes your initiative to regain control and take steps toward the direction of your goals. Alternatively, you may not be taking responsibility for your actions and are looking for a scapegoat.<\/p>"
    },
    {
        "title": "Dreaming of performing exorcism on someone indicates that you are stepping up and taking control of a situation. Alternatively, to dream that you are exorcising someone implies that you want control of something that this person has. Consider what this person has that you also want in your life.TOP",
        "desc": "<p>Expedition<\/p><p>To dream that you are on an expedition indicates that you are going on an emotional journey where you do not know where it ends. Alternatively, the dream suggests that you need to be more adventurous and get more involved. Try a new interest or pick up a hobby.<\/p>"
    },
    {
        "title": "Expelled",
        "desc": "<p>To dream that you are expelled represents rejection. Consider what you did in your dream to get expelled and how it may parallel your actions in your waking life.<\/p>"
    },
    {
        "title": "Expense",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/f2.htm#Finance\">Finance.<\/p>"
    },
    {
        "title": "Experiment",
        "desc": "<p>To dream that you are working on an experiment suggests that you need to be more daring and try something new and different. Take a chance.Also consider the type of experiment for significance on which area of your life you need more adventure in or that you need to be more adventuresome.<\/p><p>To dream that you are being experimented on or that you are used as an experiment means that you are feeling completely helpless in some area of your life. You feel that you are at the mercy of someone else and have no control over decisions that affect you.<\/p>"
    },
    {
        "title": "Expert",
        "desc": "<p>To dream that you are an expert at something represents your self confidence and high self esteem. You are confident in your ability.<\/p>"
    },
    {
        "title": "Expiration",
        "desc": "<p>To dream that there is an expiration on something indicates that time has run for you on some project or opportunity. You have missed your chance. Or the dream may relate to your sense of mortality. Alternatively, the dream signifies fear that you will not be able to complete a certain project or task in time. Consider the significance of the number in the expiration date for additional meanings.<\/p>"
    },
    {
        "title": "Explore",
        "desc": "<p>To dream that you are exploring new lands indicates self-discovery. You need to start looking within yourself to discover aspects of your own character and find out what drives you.<\/p>"
    },
    {
        "title": "Explosion",
        "desc": "<p>To see explosions in your dream symbolize your repressed anger. The rage that you have been holding in has come to the surface in a forceful and violent manner. Your subconscious is trying to get your attention.<\/p><p>To dream that your face becomes blackened or mutilated by the explosion indicates that will be confronted with unjust accusations. As a result, you may suffer from the consequences.<\/p><p>To dream that you are enveloped in flames or blown up into the air by an explosion suggests that you are being taken advantage of in some situation. Your trust has been compromised.<\/p><p>To hear the sound of a loud explosion, but you did not see it indicates that something is about to be exposed or come into consciousness.<\/p>"
    },
    {
        "title": "Expressway",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/f3.htm#Freeway\">Freeway.<\/p>"
    },
    {
        "title": "Extension Cord",
        "desc": "<p>To see an extension cord in your dream suggests that you need to associate yourself with energetic people. Acknowledge those aspect of yourself which has been dormant.<\/p>"
    },
    {
        "title": "Exterminator",
        "desc": "<p>To see or call an exterminator in your dream indicates that you need to cut off ties from those who try to pull you down.<\/p><p>To dream that you are an exterminator suggests that you need to confront your weakness and stand up to the challenges ahead.<\/p>"
    },
    {
        "title": "Extraterrestrial",
        "desc": "<p>To dream of an extraterrestrial being or place represents your far-fetched ideas and wild imagination. Your mind does not know any limits. Alternatively, the dream represents your desire to escape from your daily life.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/a2.htm#Aliens\">Aliens.<\/p>"
    },
    {
        "title": "Eye Chart",
        "desc": "<p>To see an eye chart in your dream suggests that you need more focus in some area of your life. It is time to lay out your goals. Alternatively, the dream may indicate that something is not what it seems. Consider the significance of the letters that you are able to see in the dream and what letters are blurry.<\/p>"
    },
    {
        "title": "Eye Color",
        "desc": "<p>If you dream that your eye color is different from the color in real life, then it signifies how you really feel about something. It may also imply that you need a fresh, new perspective on some issue. You are stuck at looking things the same way. To dream that your pupils are red symbolize excitement, energy, power, or anger. Negatively, it also suggests that some negative or evil force has taken over you; you are going on the wrong path. Dreaming that your eyes are brown indicates that you are withdrawn. It also suggests that you need to be more compassionate. If they are green, then it indicates that you are reacting to things with an envious or monetary mindset. You are being too self-centered. Dreaming that you have hazel eyes indicates that you are feeling overwhelmed. You may be taking on too many responsibilities. To dream that you have blue eyes suggests that you are overly emotional. It may also be telling you to be more sympathetic. If you dream that your eyes are black, then it means that are indifferent or emotionless. To dream of golden or yellow eyes refers to health concerns. Dreaming of gray eyes mean that you are indecisive about something.<\/p><p>Dreaming that each of your eyes are of different colors mean that you are accepting of different or diverging views.<\/p><p>To dream that your eye color is rubbing off means that your view or understanding of some situation is wrong. Perhaps you are being mislead.<\/p>"
    },
    {
        "title": "Eye Contact",
        "desc": "<p>To dream that your are making eye contact with someone highlights your confidence, allure and desirability. You are looking for some sort of connection.<\/p>"
    },
    {
        "title": "Eye Drops",
        "desc": "<p>To dream that you are using eye drops suggests that you are seeking clarity in some situation. You may not be seeing something that is right in front of you.<\/p>"
    },
    {
        "title": "Eye Of Horus",
        "desc": "<p>To see the Eye of Horus in your dream indicates that some protective force is watching over you. Something is looking out for your best interest. Alternatively, dreaming of the Eye of Horus is a sign of healing.<\/p>"
    },
    {
        "title": "Eye Of Providence",
        "desc": "<p>To dream of the eye of providence or the all-seeing eye represents enlightenment, spiritual awareness ,and new understanding. Alternatively, the dream may mean that no detail gets passed you.<\/p>"
    },
    {
        "title": "Eye Mask",
        "desc": "<p>To see or wear an eye mask in your dream symbolizes ignorance. You are refusing to confront an uncomfortable or awkward situation.<\/p>"
    },
    {
        "title": "Eye Patch",
        "desc": "<p>To dream that you are wearing an eye patch indicates that you are one-sided in your views and in your thinking. You are refusing to see someone else's viewpoints.<\/p>"
    },
    {
        "title": "Eye Shadow",
        "desc": "<p>To dream that you are putting on eye shadow suggests that you are trying to create an air of mystery.<\/p><p>To dream that your eye shadow is overdone or that the colors are strange means that you may are being overly dramatic about a situation. Perhaps you are drawing it out of proportions.<\/p>"
    },
    {
        "title": "Eyebrows",
        "desc": "<p>To notice eyebrows in your dream represent expressions of amazement, disbelief, surprise, or doubt. It may also indicate concern or disapproval.<\/p><p>To dream that you have no eyebrows suggests that you are lacking emotions. You are not expressing yourself enough.<\/p><p>To dream that you have a unibrow in your dream indicates that you are feeling insecure about your physical appearance. Alternatively, the dream suggests that you are not expressing your feelings enough. Perhaps you are keeping too much of your emotions inside. There is something you are trying to hide.<\/p><p>To dream thatyou or someone is getting their eyebrow pierced may be a metaphor for your &quot;piercing eyes&quot;. Alternatively, the dream is drawing your attention to something disturbing or significant that you saw. Perhaps you saw something you that shouldn't have.<\/p>"
    },
    {
        "title": "Eyeglasses",
        "desc": "<p>To dream that you are wearing eyeglasses and you do not normally wear them suggests that you need a clearer view on a situation. There may have been a misunderstanding or a situation was misperceived and needs to be clarified.<\/p><p>To see broken eyeglasses in your dream indicates that your vision and perception is impaired. You are not seeing the facts correctly.<\/p><p>To see or wear 3D eyeglasses in your dream means that you need to look at some problem or something from a new perspective. You need to consider all the views.<\/p>"
    },
    {
        "title": "Eyelashes",
        "desc": "<p>To notice your eyelashes or dream that they are growing indicates that you are trying to express yourself in some subtle or covert way. It also signifies good luck.<\/p><p>To dream that all your eyelashes fall off suggests that you are having difficulties expressing yourself. It may also mean a loss in your feminine power.If only one eyelash falls off, then it also signifies good luck.<\/p>"
    },
    {
        "title": "Eyelid",
        "desc": "<p>To notice eyelids in your dream implies that you are trying to shut out somebody or some aspect of your life. Alternatively, the dream suggests that you are not being truthful about something.<\/p><p>To dream that your eyelid falls off means that you are unable to block out the negativity in your life. There is something that you are forced to confront. If you try to tape the eyelid back, then it suggests that you are in denial.<\/p>"
    },
    {
        "title": "Eyeliner",
        "desc": "<p>To dream that you are putting on eyelinerindicates that there is something that you need to focus your attention on.<\/p>"
    },
    {
        "title": "Eyes",
        "desc": "<p>To see your own eyes in your dream represent enlightenment, knowledge, comprehension, understanding, and intellectual awareness. Subconscious thoughts may be coming onto the surface. The left eye is symbolic of the moon, while the right eye represents the sun. It may also be a pun on &quot;I&quot; or the self.If you dream that your eyes have turned inside your head and you can now see the inside of your head, then it symbolizes insight and something that you need to be aware of. This dream may be literally telling you that you need to look within yourself. Trust your intuition and instincts.<\/p><p>To dream that you have a glass eye implies that others can see right through you and your true intentions. You also tend to open yourself too easily which makes you vulnerable. To dream that someone has a glass eye means that you can see right through to their intentions.<\/p><p>To dream that you have something in your eye represents obstacles in your path. Alternatively, it may represent your critical view and how you tend to see faults in others. If you dream that you have excessive eye boogers or eye discharge, then it means that you are not seeing a situation clearly. Your judgment is clouded.<\/p><p>To dream that you are washing your eyes means that you are confused about something and are looking for clarity to some problem or situation.<\/p><p>To dream that you have one eye indicates your refusal to accept another viewpoint. It suggests that you are one-sided in your ways of thinking.<\/p><p>To dream that you have a third eye symbolizes inner vision, insight, instinct or some psychic ability you have yet untapped. You are able to see what others cannot. Or you need to start looking within yourself and trust your instincts. If you dream that someone has three eyes, then it indicates that you are seeking out their advice. Pay attention to the message that this person is conveying.<\/p><p>To dream that your eyes are injured or closed suggests your refusal to see the truth about something or the avoidance of intimacy. You may be expressing feelings of hurt, pain or sympathy. Dreaming that you are gouging someone's eyes out represents your fears that he or she can see the truth about you.<\/p><p>To dream that you have or get a black eye indicates unresolved conflict. If you give someone a black eye in your dream, then it means that you are not accepting the truth or of someone's decisions.<\/p><p>To dream that you have crossed eyes denotes that you are not seeing straight with regards to some situation. You may be getting your facts mixed up.<\/p><p>To dream that you are rolling your eyes at someone indicates that you are disinterested in this person and what they have to say. You have a &quot;don't care&quot; attitude about things.<\/p><p>To dream that your eyes are bleeding symbolizes the sacrifices your have made and the difficulties you have endured. Alternatively, the dream signifies some very deep pain or internal conflict within your soul. Although you may not feel any physical pain, you are hurting inside. Perhaps you have been hiding the pain for so long that you forgot what pain feels like. There is some unrest or uneasiness within which needs to be addressed and resolved immediately.<\/p><p>To notice someone else's eyes in your dream indicates an emotional or intimate connection with that person. It also signifies a mutual understanding.<\/p><p>Dreaming of children with no pupils points to a loss of innocence. Someone in your life is totally not who you thought they were. If their eyeballs are red, then it indicates overwhelming anger or evil. If their eyeballs are all white, it means emptiness or illness. And if their eyeballs are completely black, then it indicates a missing soul or a lack of compassion.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=eyesdream1\">Red Eyes&quot;<\/p>"
    },
    {
        "title": "Eyesight",
        "desc": "<p>To dream that your eyesight is blurred or impaired represents difficulties and\/or errors in your judgment. You are experiencing uncertainly in the choices that you are making.<\/p>"
    }
]