[
    {
        "title": "F",
        "desc": "<p>To see the letter &quot;F&quot; in your dream symbolizes failure. It may also denote an expletive as in &quot;F you&quot;.<\/p>"
    },
    {
        "title": "Fable",
        "desc": "<p>To dream of reading fables represent your literary mind and romantic notions. Alternatively, the fable indicates that there is a lesson to be learned or a message that you need to listen to.<\/p><p>To dream that you are living a fable symbolizes your need to face reality. It is better to face a situation head on then to retreat into a fantasy world.<\/p>"
    },
    {
        "title": "Fabric",
        "desc": "<p>To see reams of fabric in your dream signify creativity. You are the one to shape your own experiences. Consider the color and pattern of the fabric and how it parallels a situation in your life.<\/p>"
    },
    {
        "title": "Face",
        "desc": "<p>To see your own face in your dream represents the persona you show to the world as oppose to the real you. It may refer to how you confront problems and deal with issues in your life.<\/p><p>To dream that your face is flawed or pimply symbolizes erupting emotions. You may be suffering an attack on your persona or your reputation. According to folklore, if you dream that your face is swollen, then it means that you will see an improvement to your financial situation.<\/p><p>To dream that your face or someone's face is cracking indicates some deception or big lie. You are unable to maintain a straight face and are about to be exposed.<\/p><p>To dream that you or someone has two faces or that the faces changes quickly from one person to another indicates untrustworthiness. You or someone in your life is acting &quot;two-faced&quot;.<\/p><p>To dream that you are washing your face suggests that you need to come clean about some matter.<\/p><p>To dream that your face warps into a bubble indicates that you are not expressing your feelings enough. You are keeping too much inside.<\/p><p>Dreaming of a blurry face means that you have no sense of who this person really are. Your subconscious is telling you not to trust this person. You may be being deceived.<\/p>"
    },
    {
        "title": "Face Paint",
        "desc": "<p>To dream that you are getting your face painted indicates that you are having trouble expressing and verbalizing your feelings. The face paint represents your mood, attitude and emotions, depending on the color or objects being painted on your face, presents your mood, attitude and emotions.<\/p>"
    },
    {
        "title": "Facebook",
        "desc": "<p>To dream about your Facebook page represents your desires to expand your social circle. You need to reach out to others in a more direct and personal way. It is time to get out there and experience life.<\/p>"
    },
    {
        "title": "Faceless",
        "desc": "<p>To see a faceless figure or person in your dream indicates that you are still searching for your own identity and finding out who you are. Perhaps you are unsure of how to read people and their emotions. Therefore, you are expressing a desire to know and understand these people on a deeper level.<\/p>"
    },
    {
        "title": "Facelift",
        "desc": "<p>To dream that you have a facelift suggests that you are seeking a new self-identity and self-image. You may have experienced a surge in your confidence levels. Alternatively, it symbolizes vanity and you concerns about appearances rather than what is inside.<\/p>"
    },
    {
        "title": "Facial",
        "desc": "<p>To dream that you are getting a facial indicates that you are feeling guilty about something. Alternatively, the dream represents your facade and what you allow other people to see or know about you.<\/p>"
    },
    {
        "title": "Facial Hair",
        "desc": "<p>*Please See: <a href=\"#Beard\">Beard<\/a> or <a href=\"#Mustache\">Mustache<\/a>.<\/p>"
    },
    {
        "title": "Factory",
        "desc": "<p>To dream that you are at a factory represents repetitious thinking and an old way of doing things. It is symbolic of predictability and unchanging habits. Alternatively, it signifies business, productivity, energy and bustling activity. You are a person that can get things done.<\/p><p>Dreaming of an abandoned or run-down factory means that you have broken from your routine or have escaped from a monotonous aspect of your life. You are leaving a meaningless past behind and are thinking for yourself.<\/p>"
    },
    {
        "title": "Fade",
        "desc": "<p>To dream that a color is faded indicates a lack of motivation or inspiration.<\/p>"
    },
    {
        "title": "Failure",
        "desc": "<p>To dream of failure signifies fears of inadequacy and low self-esteem. You are not applying yourself to the fullest potential. Or you are overwhelmed with anxiety and the pressure to excel.<\/p><p>To dream that your business is a failure signifies bad management. You need to be more aggressive and not let fear rule you.<\/p>"
    },
    {
        "title": "Fainting",
        "desc": "<p>To dream that you are fainting suggests your inability to confront some subconscious issues or feelings. You need to be more aware and acknowledge those feelings.<\/p><p>To see a family member faint in your dream signifies that you will hear some indiscreet activities from that person.<\/p>"
    },
    {
        "title": "Fair",
        "desc": "<p>To dream that you are at the fair suggests that you may be regressing into your childhood where times were simpler. You feel you can let your inhibitions go and forget about the cultural mores. Also consider the various side shows and arcades as they could symbolize aspects of your personality. Alternatively, the dream may also be a pun on fairness and being &quot;fair&quot; in a situation or decision.<\/p>"
    },
    {
        "title": "Fairy",
        "desc": "<p>To see a fairy in your dream indicates that you are in search of some help or advice for a problem or decision, but may not want to directly admit you need help. In particular, if the fairy is evil, then it suggests that an aspect of yourself needs to be set free. The fairy is also symbolic of your soul and the feminine aspects of yourself.<\/p><p>Dreaming that a fairy is pushing the moon means that you should not underestimate yourself. It is time to start doing and making things happen.<\/p>"
    },
    {
        "title": "Fairy Tale",
        "desc": "<p>To dream that you are a character in a fairy tale suggests your need to be rescued or to be swept off your feet. It also indicates that you are exploring your limits and trying to awaken your fullest potential.<\/p><p>To dream that you are reading a fairy tale indicates that you are a romantic at heart.<\/p>"
    },
    {
        "title": "Faithless",
        "desc": "<p>*Please See: <a href=\"#Cheating\">Cheating<\/a>.<\/p>"
    },
    {
        "title": "Fake",
        "desc": "<p>To dream that something or someone is fake suggests that you are pretending to be someone you are not. You are putting up front because you are afraid to show your true self.<\/p>"
    },
    {
        "title": "Fakir",
        "desc": "<p>To see a fakir in your dream indicates phenomenal change in your life.<\/p>"
    },
    {
        "title": "Falcon",
        "desc": "<p>To see a falcon in your dream suggests that you are focused in your goals and aspirations.<\/p>"
    },
    {
        "title": "Fall",
        "desc": "<p>To dream that you fall and are not frightened signifies that you will overcome your adversities with ease.<\/p><p>To dream that you fall and are frightened indicates a lack of control, insecurity, and\/or lack of support in your waking life. You may be experiencing some major struggle and\/or overwhelming problem. It may also imply that you have failed to achieve a goal that you have set forth for yourself.<\/p><p>Dreaming that you fall backwards suggests that you prevented yourself from making a bad decision or mistake. It may also mean that you are not ready to move forward and need to take a step back.<\/p><p>To dream that you are free-falling through water indicates that you are feeling overwhelmed with emotions. You may feel that it is easier to give up, then to try to stay afloat or prevent yourself from going under.<\/p><p>To dream of the fall season indicates that something is about to come to an end and something new will begin. Alternatively, the dream is symbolic of the cycle of life. It is time to collect the benefits and rewards that you've worked so hard for.<\/p><p>*For an in depth analysis, see: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/falling-dreams.html\">Common Dreams: Falling<\/a>.<\/p>"
    },
    {
        "title": "False",
        "desc": "<p>*Please See: <a href=\"#Deception\">Deception<\/a>.<\/p>"
    },
    {
        "title": "False Teeth",
        "desc": "<p>To dream that you are wearing false teeth indicates that you are not being completely honest in some waking matter.<\/p><p>To see or dream that others are wearing false teeth suggests that someone in your life is not who they say they are. They are being deceitful.<\/p>"
    },
    {
        "title": "Fame",
        "desc": "<p>To dream that you have famedenotes unrealized achievements or failed aspirations. You constantly need reaffirmation, praises and acknowledgment. You want to be admired and looked up to by those around you.<\/p><p>To see famous people in your dream signifies an increase to your prosperity and honor.<\/p><p>*Please Also See: <a href=\"#Celebrities\">Celebrities<\/a><\/p>"
    },
    {
        "title": "Family",
        "desc": "<p>To see your own family in your dream represents security, warmth and love. It could also symbolize bitterness, jealousy, or rivalry, depending on your relationship with your family. Alternatively, it could mean that you are overly dependent on your family, especially if the family members are in your recurring dreams. Consider also the significance of a particular family member or the relationship you have with them. If you dream that your family does not act or appear as they normally are, then it means that you want to distance yourself from them. Or you simply don't understand where they are coming from.<\/p><p>To see someone else's family in your dream symbolizes togetherness. The dream serves to remind you that other people can come and go out of your life, but you will always have family. Alternatively, dreaming about someone else's family suggests that you are idealizing or romanticizing what a real family should be like. You want what other families have.<\/p><p>Dreaming that a serial killer is killing off members of your family implies that you are feeling cut off from your family.<\/p>"
    },
    {
        "title": "Family Guy",
        "desc": "<p>To dream about the Family Guy cartoon implies how you cope with what life throws at you. You feel that you are a target of criticism. Perhaps you identify with one of the characters in the show. Consider their key traits and how you can relate to those qualities. If you dream that the characters in Family Guy are not behaving like the normally are in the show , then it refers to a situation where you are acting inappropriately. You have gone too far.<\/p>"
    },
    {
        "title": "Famine",
        "desc": "<p>To dream of famine signifies a negative turn in business and in health. Alternatively, it indicates feelings of guilt for what you have, while others are struggling for their livelihood.<\/p><p>To dream that you are famished indicates that you are in need of love, affection and emotional nourishment.<\/p><p>To see others in famine signifies your sympathy toward others. It may also symbolize your dedication to worldly causes.<\/p><p>To dream that you are feeding people in a famine area indicates your ability to offer love to others. If you run out of food, then it suggests that you are emotionally drained.<\/p>"
    },
    {
        "title": "Fan",
        "desc": "<p>To see a fan in your dream refers to the changes in your life. It may also signifies your need to calm down after a highly charged emotional situation or state.<\/p><p>To dream that you are fanning yourself or that someone is fanning you represents your lack of self-confidence. Alternatively, the dream symbolizes secret desires.<\/p>"
    },
    {
        "title": "Fancy",
        "desc": "<p>To dream of fancy things indicates that you are putting up a facade and hiding your true self. You are trying to divert attention to unimportant things.<\/p>"
    },
    {
        "title": "Fangs",
        "desc": "<p>To see fangs in your dream indicate that you have said some words that have been hurtful to others.<\/p>"
    },
    {
        "title": "Fanny Pack",
        "desc": "<p>To dream that you are wearing a fanny pack indicates that you are feeling out of place. You feel you are not fitting in.<\/p>"
    },
    {
        "title": "Fantasy",
        "desc": "<p>To dream of a fantasy world may be a way for your mind to highlight what is normal. Alternatively, the dream may be telling you to expand your thinking and use your imagination and creativity. Explore all your options no matter how strange or illogical it may be.<\/p>"
    },
    {
        "title": "Far",
        "desc": "<p>To see something or someone far away in your dream suggests that you are feeling emotionally distant from that person or what that something means to you. Perhaps you are feeling alone or that you are the odd person out. Alternatively, it represents something that is unattainable or something that you failed to achieve.<\/p>"
    },
    {
        "title": "Fare",
        "desc": "<p>To dream that you are paying a fare represents the price you need to pay for success. You may be putting your work or ambition ahead of your loved ones. The dream may also be a pun on &quot;fair&quot; or &quot;fairness&quot;.<\/p>"
    },
    {
        "title": "Farewell",
        "desc": "<p>To dream that you are saying farewell signifies an end to some relationship or phase in your life.<\/p>"
    },
    {
        "title": "Farm",
        "desc": "<p>To see or live on a farm in your dream suggests that you need to develop an aspect of yourself and utilize your potential. You are ready for growth.<\/p>"
    },
    {
        "title": "Farmer",
        "desc": "<p>To see or dream that you are a farmer points to your productivity. Are you utilizing your fullest potential? It may also suggest that you need to work harder in order to reap its benefits.<\/p>"
    },
    {
        "title": "Farmer's Market",
        "desc": "<p>To dream that you are at a farmer's market suggests that you are looking for spiritual enrichment from a higher source.<\/p>"
    },
    {
        "title": "Farsighted",
        "desc": "<p>To dream that you are farsighted suggests that you are overlooking the little details needed to obtain your goals. You are too distracted by the big picture that you are not paying attention to the smaller things.<\/p>"
    },
    {
        "title": "Farting",
        "desc": "<p>To dream that you are farting suggests that you are being passive aggressive. You need to express your feelings in a more direct manner.<\/p><p>To smell a fart in your dream implies that someone around you is not telling you how he or she really feels. He or she may be avoiding some topic instead of addressing it. Alternatively, the dream indicates that you are offended by someone in your waking life.<\/p>"
    },
    {
        "title": "Fashion",
        "desc": "<p>To dream about fashion suggests that you are depending too much on your looks to get your way. You need to start looking within yourself. Alternatively, the dream indicates that you have blended into the background. You need to step up and be more confident.<\/p>"
    },
    {
        "title": "Fast Food",
        "desc": "<p>To see or eat fast food in your dream indicates that you are not taking the time to cater to your emotions. You are not taking good care of your physical or mental health.<\/p>"
    },
    {
        "title": "Fast Forward",
        "desc": "<p>If your dream is in fast forward, then it suggests that you are living life in the fast lane. You need to slow down. Alternatively, it may indicate that life is passing you by if you do not jump in and participate in it.<\/p>"
    },
    {
        "title": "Fasting",
        "desc": "<p>To dream that you are fasting represents self-renewal and self-cleansing. Fasting may also be way to draw attention to some consciousness or problem. Are you trying to punish yourself? Are you feeling guilty about something?<\/p>"
    },
    {
        "title": "Fat",
        "desc": "<p>To dream that you are fat signifies a fortunate change in your life. You are experiencing abundance in some area of your life. Alternatively, the dream means that you are being overindulgent. You need to learn moderation. A more literal interpretation of this dream is your fears of gaining weight. You have an skewed perception of your own image which may stem from low self-esteem.<\/p><p>To dream that others are fat signifies prosperity. Consider also the phrase &quot;it ain't over till the fat lady sings&quot; and how you need to wait for the final result and not assume the outcome.<\/p><p>*Please see also: <a href=\"#Obese\">Obese<\/a>.<\/p>"
    },
    {
        "title": "Fate",
        "desc": "<p>To dream about your fate suggests that you are unwilling to take responsibility for your actions. You feel that it is always someone's fault or someone else's doing. Alternatively, the dream may be trying to help you visualize your goal and what you want to accomplish.<\/p>"
    },
    {
        "title": "Father",
        "desc": "<p>To see your father in your dream symbolizes authority and protection. It suggests that you need to be more self-reliant. Consider also your waking relationship with your father and how aspects of his character may be incorporated within yourself.<\/p><p>To dream that your father is dead forewarns that you need to proceed with caution in conducting some business matter.<\/p><p>To see your father wrapped in bandages from head to toe suggests that you are feeling restricted or limited with your authority. Perhaps you are being put in charge of something but can't exercise your power.<\/p><p>To dream that you are hitting your father represents a desperate need for greater closeness with your father. You feel that he is not listening to you. In particular, if you are hitting your father with a rubber object indicates that whatever you are doing or telling him has no significant effect on him. Things literally just bounce off him. Conversely, if you dream that your father is the one beating you, then it implies a lack of emotional connection with your father.<\/p><p>To dream that your father is angry at you indicates that you are doing something that he may disapprove. The dream may also be a projection of your own anger towards him. There are some unresolved issues that need to be worked out.<\/p><p>To dream that your father has a girlfriend or mistress, even though he is still married to your mother implies that you are feeling disconnected with one of your parents. The dream may also be a commentary on your own views of marriage.<\/p>"
    },
    {
        "title": "Father-In-Law",
        "desc": "<p>To see your father-in-law in your dream refers to your conscience and your rational side. You need to be more yielding in your point of view and decisions.<\/p>"
    },
    {
        "title": "Fatigue",
        "desc": "<p>To feel fatigue or see others fatigued in your dream suggests that a relationship is worn out and near its ending point.<\/p>"
    },
    {
        "title": "Faucet",
        "desc": "<p>To see a faucet in your dream signifies control of your emotions. You are conscious of what emotions you allow yourself to be expressed. In other words, you have great self control and an ability to turn your emotions on and off at will. If the water is too hot or too cold, then it may be analogous to a situation or relationship in your waking life.<\/p><p>To dream that you cannot turn the faucet on or that no water comes out of the faucet indicates that you need to be more careful when offering emotional support as your may be overextending yourself. Alternatively, it may also be indicative of sadness and depression.<\/p><p>To see a leaky or dripping faucet in your dream represents sexual issues and problems. Alternatively, the dream suggests that you are feeling emotionally drained. Something or someone is draining your emotionally.<\/p>"
    },
    {
        "title": "Faun",
        "desc": "<p>To see a faun in your dream symbolizes mischief. It may also reflect your carefree attitude.<\/p>"
    },
    {
        "title": "Favor",
        "desc": "<p>To dream that you are asking for a favor indicates you need to let go of your pride and seek help when you need it. Alternatively, the dream may be a pun on something or someone that you are &quot;favoring.&quot;<\/p><p>To dream that you are granting a favor represents your compassion and your consideration of others.<\/p>"
    },
    {
        "title": "Fawn",
        "desc": "<p>To see a fawn in your dream symbolizes true friends and faithfulness in love.<\/p>"
    },
    {
        "title": "Fax Machine",
        "desc": "<p>To see or use a fax machine in your dream indicates that you are receiving some message from your subconscious. This message will prove to be the real deal.<\/p>"
    },
    {
        "title": "FBI",
        "desc": "<p>To dream that the FBI is after you indicates feelings of guilt. You may also be feeling overwhelmed by life's challenges. Alternatively, the dream may be a metaphor of being wanted.<\/p><p>To dream that you are an FBI agentsignifies your strong sense of morality and integrity. You are guided by honor, structure and what is right.<\/p>"
    },
    {
        "title": "Fear",
        "desc": "<p>To dream that you feel fear indicates that your achievements will not be as successful as you had anticipated. You are experiencing anxieties in various aspects of your life. The key to overcoming your fear is to discuss them and deal with them openly.<\/p><p>To dream that you worse fears are coming true signifies your resistance to change. You are afraid to confront the unknown aspects of yourself.<\/p><p>*Please see also: <a href=\"#Scared\">Scared<\/a>.<\/p>"
    },
    {
        "title": "Feast",
        "desc": "<p>To see a feast in your dream denotes your emotional needs or sexual appetite. There is a lack of balance in your life. If you are gorging yourself at the feast, then it suggests that you are making too much demands of others. It also indicates greediness and selfishness. If you are the only one who did not get any food at the feast, then it indicates your tendency to always put others ahead of your own needs. As a result, you are compromising your own emotional well being and happiness.<\/p><p>To arrive late to a feast signifies of a bothersome event that will occupy your mind.<\/p>"
    },
    {
        "title": "Feather",
        "desc": "<p>To dream of a feather floating in the air signifies a life of ease, comfort, warmth and of financial gains. It may describe your lightheartedness and enjoyment for life. Alternatively, a feather may represent confusion, hastiness, and loss of dignity.<\/p><p>To see a feather in you dream symbolizes warmth. You are expressing your tender side and a desire to be close to someone. Consider also how the dream may relate to the proverb &quot;birds of a feather flock together&quot;. Perhaps you need to break away from the masses or you need to make new friends. If the feather is wet, then it indicates a temporary setback.<\/p><p>In particular, to see chicken feathers in your dream signify minor annoyances. Eagle feathers represent the realization of your goals and aspirations. To see peacock, ostrich, or any other ornamental feathers, denotes advancement up the social ladder. You will be met with much success in your future. To see the feather of an owl, implies that you need to share your knowledge and wisdom with others.<\/p><p>To dream that you are selling or buying feathers symbolize frugality and thriftiness.<\/p>"
    },
    {
        "title": "Feather Duster",
        "desc": "<p>To see or use a feather duster in your dream indicates that you are uncovering some unused talent. Alternatively, the dream may refer to the monotony of your waking life. You are looking for some excitement.<\/p>"
    },
    {
        "title": "February",
        "desc": "<p>To dream of the month of February signifies sadness, gloom and ill health. The dream may also symbolize love or you need for love.<\/p>"
    },
    {
        "title": "Feces",
        "desc": "<p>To see or come in contact with feces signifies aspects of yourself that are dirty and negative and which you believe to be undesirable and repulsive. You need to acknowledge and express these feelings, even though it may be shameful. Release the negativity in your life. Alternatively, it may also refer to someone who is anal retentive.<\/p><p>To dream that you are unable to dispose of the feces suggests that you are unwilling to let go of your emotions. You have a tendency to hold in and keep your feelings to yourself.<\/p><p>According to Freud, feces is related to possession, pride, shame, money\/financial matters, or aggressive acts. So to dream that you are playing with feces symbolizes your anxiety over money matters and financial security.<\/p><p>See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bathroomdream4\">Filthy Stalls<\/a>&quot;<\/p>"
    },
    {
        "title": "Fedora",
        "desc": "<p>To wear a fedora hat in your dream symbolizes coolness. You don't let stress and pressure get to you. If you see someone wearing a fedora in your dream, it indicates that there is a certain mystique or mystery about them. Perhaps there is something that they are trying to hide.<\/p>"
    },
    {
        "title": "Feeble",
        "desc": "<p>To dream that you are feeble indicates that you are feeling emotionally drained and stressed. You are preoccupied with something in your mind that is causing you much anxiety.<\/p>"
    },
    {
        "title": "Feeding",
        "desc": "<p>To dream that you are feeding someone indicates that someone in your life is in need of love and acceptance. That someone could be an aspect of yourself.<\/p>"
    },
    {
        "title": "Feeling",
        "desc": "<p>*Please See: <a href=\"#Emotions\">Emotions<\/a>.<\/p>"
    },
    {
        "title": "Feet",
        "desc": "<p>To see your own feet in your dream symbolizes your foundation, stability and sense of understanding. It signifies your need to be more practical and sensible. Keep both feet on the ground. Alternatively, feet represents mobility, independence and freedom. Perhaps you have taken a step in the right direction and are contemplating your goals or your next step. The sole of the foot may be a pun of being or feeling like the &quot;sole&quot; or only support of some person or situation. Consider also the idiom of &quot;putting your foot in your mouth&quot;.<\/p><p>To dream that you are washing your feet indicates that others can easily take advantage of you. For Christians, washing your feet symbolizes forgiveness and compassion. If someone is kissing your feet, then it symbolizes humbleness, humility, or devotion.<\/p><p>To dream that you have smelly feet implies that you need to be careful about your next step. If you dream that someone is smelling your feet, then it means that someone is paying attention to the steps that you are taking. To smell someone else's feet in your dream suggests that you are following someone else's path in life instead of paving your own path. The notion of smelling feet may also carry the same interpretation of kissing feet, depending on the context of the dream.<\/p><p>To see only the feet being chased in your dream suggests that you are letting others determine where you go or decide on your goals. You are lacking control over the direction of your own life.<\/p><p>Dreaming about other people's feet implies that you are too concerned with where people are going and where they are headed. Alternatively, to see someone else's feet in your dream represents your admiration for this person.<\/p>"
    },
    {
        "title": "Fellatio",
        "desc": "<p>*Please See: <a href=\"#Oral%20Sex\">Oral Sex<\/a>.<\/p>"
    },
    {
        "title": "Female",
        "desc": "<p>*Please See: <a href=\"#Woman\">Woman<\/a>.<\/p>"
    },
    {
        "title": "Feminine Napkin",
        "desc": "<p>*Please See: <a href=\"#Maxi%20Pad\">Maxi Pad<\/a>.<\/p>"
    },
    {
        "title": "Fence",
        "desc": "<p>To see a fence in your dream signifies an obstacle or barrier that may be standing on your path. You may feel confined and restricted in expressing yourself. Are you feeling fenced in some situation or confined in some relationship?Alternatively, the fence symbolizes your need for privacy. You are trying to shut off the rest of the world. If there is a hole in the fence, then the hole is encouragement that you can overcome and conquer whatever obstacles may be in your way. It may also mean that your privacy is being compromised.<\/p><p>To dream that you are climbing to the top of a fence denotes success. If you climb over the fence, then it indicates that you will accomplish your desires via not so legitimate means. If you dream that you are on the fence, then the dream may be a metaphor indicating that you undecided about something.<\/p><p>To dream that you are building a fence suggests that you are building a solid foundation for success. Alternatively, it indicates that you are blocking something out or you are shutting yourself out.<\/p><p>To dream that you fall from a fence denotes that you are in way over your head in regards to some project which you are dealing with.<\/p><p>To see a fence in the water symbolizes an emotional barrier that you are building up around you. You are afraid to reveal your true feelings and don't want to let people in. The condition of the fence is analogous to your emotional state.<\/p>"
    },
    {
        "title": "Fencing",
        "desc": "<p>To dream that you are fencing suggests that you are at odds with someone in your waking life. Consider the relationship you have with the person you are fencing. If this person is unknown, you may be in conflict with an aspect of yourself. Alternatively, fencing symbolizes, agility, cunningness, and speed. Perhaps you need to incorporate these attributes into a situation in your daily life.<\/p>"
    },
    {
        "title": "Fender",
        "desc": "<p>To dream that your fender is dented indicates that someone is trying to attack your character and break your pride.<\/p><p>To dream that you dent someone else's fender suggests that you need to be more accepting and less critical of others.<\/p>"
    },
    {
        "title": "Feng Shui",
        "desc": "<p>To dream about feng shui represents your search for spiritual balance, understanding and harmony. You are looking for positivity in your life.<\/p>"
    },
    {
        "title": "Fennel",
        "desc": "<p>To see fennel in your dream represents clarity. Perhaps there is something that you are now seeing more clearly. It is also symbolic of rejuvenation and renewal.<\/p>"
    },
    {
        "title": "Fermentation",
        "desc": "<p>To dream about something fermenting symbolizes a spiritual transformation. The process may be slow in its development, but the end result will be worth the wait.<\/p>"
    },
    {
        "title": "Ferns",
        "desc": "<p>To see ferns in your dream symbolize your future hopes and fears. It also represent solitude.<\/p>"
    },
    {
        "title": "Ferret",
        "desc": "<p>To see a ferret in your dream symbolizes distrust and suspicion of others. The dream may also be a pun on searching. If the ferret in your dream is white, then it is highlighting or amplifying some trust issues in your waking life.<\/p>"
    },
    {
        "title": "Ferry",
        "desc": "<p>To dream that you are riding on a ferry indicates that you are going through some transitional phases in your life. It also means that you are setting your sights on a new goal.<\/p><p>To dream that you are waiting for a ferry signifies unforeseen circumstances might hinder your desires and wishes.<\/p>"
    },
    {
        "title": "Ferris Wheel",
        "desc": "<p>To see or ride on a Ferris wheel in your dream suggests that you are going around in circles. You are headed nowhere. Alternatively, it is symbolic of wholeness and the circle of life. Life is full of ups and downs.<\/p>"
    },
    {
        "title": "Fertilizer",
        "desc": "<p>To see or use fertilizer in your dream refers to your growth. You need to continue to absorb knowledge and insights from your surroundings and experiences.<\/p>"
    },
    {
        "title": "Festival",
        "desc": "<p>To dream that you are at festival symbolizes happiness, celebration and joviality. You are in a good place in your life right now. Alternatively, it suggests that you are trying to escape and blend in with the rest of the crowd.<\/p>"
    },
    {
        "title": "Fetishes",
        "desc": "<p>To dream that you have a fetish indicates a lack of maturity or capabilities. It may also be symbolic of a fear.<\/p>"
    },
    {
        "title": "Fetus",
        "desc": "<p>To see a fetus in your dream symbolizes a newly developing relationship or idea in your waking life. Something creative is happening. Alternatively, you may be expressing difficulties in some situation or relationship.<\/p>"
    },
    {
        "title": "Feud",
        "desc": "<p>To dream that you are in the middle of a feud suggests that aspects of your personality are in conflict. In particular, if you dream of a family feud, then it indicates that you are struggling with your identity. The dream may also be a reflection of a waking strife between you and your family members.<\/p>"
    },
    {
        "title": "Fever",
        "desc": "<p>To dream that you have a fever suggests that feelings of anger or hatred are threatening to come to your consciousness. You need to find a safe way to express these feelings. Alternatively, the dream may be analogous to blushing and thus represent some embarrassing situation.<\/p>"
    },
    {
        "title": "Fez",
        "desc": "<p>To see or wear a fez in your dream signifies leisurely pursuits, ease and relaxation.<\/p>"
    },
    {
        "title": "Fictional Character",
        "desc": "<p>To see a fictional character in your dream implies that you are trying to escape from your own reality. Consider the qualities of the fictional character and how you may need to incorporate or acknowledge those qualities within yourself. Alternatively, the fictional character may be an archetypal symbol depending on the character.<\/p>"
    },
    {
        "title": "Fiddle",
        "desc": "<p>To see a fiddle in your dream signifies harmony in the home.<\/p>"
    },
    {
        "title": "Field",
        "desc": "<p>To see green fields in your dream symbolize great abundance, freedom, and happiness. You may also be going through a period of personal growth. Alternatively, this dream may simply be an expression for your love of nature.<\/p><p>To see freshly plowed fields in your dream signify growth, early rise to wealth and fortunate advancements to places of honor.<\/p><p>To see dead or barren fields signifies lack, pessimism and your jaded prospects for the future.<\/p>"
    },
    {
        "title": "Field Trip",
        "desc": "<p>To dream that you are on a field trip indicates that you need to incorporate what you have learned with your experiences. The dream represents a transitional phase. Consider the symbolism of what you see and how your felt during the field trip.<\/p>"
    },
    {
        "title": "Fiend",
        "desc": "<p>To see a fiend in your dream indicates that you need to confront your own demons and dark past. The dream also symbolizes your fears and anger.<\/p>"
    },
    {
        "title": "Fife",
        "desc": "<p>To hear the sound of a fife signifies that you will be unexpected call on to defend your honor.<\/p><p>To dream that you are playing a fife suggests that your strong reputation will remain intact. You will bounce back from anything that may be said about you.<\/p>"
    },
    {
        "title": "Fig Leaf",
        "desc": "<p>To see a fig leaf in your dream represents a loss of innocence or a fall from grace.<\/p>"
    },
    {
        "title": "Fighter Jet",
        "desc": "<p>To see or dream that you are in a fighter jet indicates that you are involved in some fast pace project.<\/p>"
    },
    {
        "title": "Fighting",
        "desc": "<p>To dream that you are in a fight indicates inner turmoil. Some aspect of yourself is in conflict with another aspect of yourself. Perhaps an unresolved or unacknowledged part is fighting for its right to be heard. It may also parallel a fight or struggle that you are going through in your waking life. If you are fighting to the death, then it refers to your refusal to acknowledge some waking conflict or inner turmoil. You are unwilling to change your old attitudes and habits.<\/p><p>To see others fighting in your dream suggests that you are unwilling to acknowledge your own problems and turmoil. You are not taking any responsibility or initiative in trying to resolve issues in your waking life.<\/p><p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">To dream that you are trying to fight, but cannot throw your arms as hard as you want signifies lack of self-esteem and self-confidence in some area of your waking life. You are unsure of your next move. This dream may also reflect your actual state of REM paralysis during the dream state.<\/p>"
    },
    {
        "title": "Figs",
        "desc": "<p>To see or eat figs in your dream represent a positive turn of events. Figs are also often associated with sex, conception and eroticism.<\/p>"
    },
    {
        "title": "Figure",
        "desc": "<p>To see mysterious figures in your dream indicates that you are experiencing confusion and ambiguity in some aspect of your life.<\/p>"
    },
    {
        "title": "Figurehead",
        "desc": "<p>To see the figurehead of a ship in your dream suggests that you are seeking protection for your emotional well being. Consider what the figurehead resembles for additional clues."
    },
    {
        "title": "Figurines To see figurines in your dream indicate that you are underestimating your own abilities and in yourself. You need to stop comparing yourself to others. Consider what the figurine depicts and how you are belittling that quality in yourself.",
        "desc": "<p>Filbert Nut<\/p><p>To see filbert nuts in your dream signify peace, harmony, and profitable business ventures.<\/p><p>To dream that you are eating filbert nuts denote true and dependant friends.<\/p>"
    },
    {
        "title": "File",
        "desc": "<p>To dream that you are filing away your bills or other important documents indicates that you need to keep your life in order.<\/p><p>To see files in your dream symbolize your responsibilities and burdens. There is something important that that you need to tend to.<\/p>"
    },
    {
        "title": "File Cabinet",
        "desc": "<p>To see a file cabinet in your dream suggests that you need to keep your facts and information straight. The file cabinet may also represent the memories or unnecessary details you keep stored in your mind and need to retrieve from time to time.<\/p><p>To dream that the drawers of the file cabinet are wide open denotes your openness toward other viewpoints, opinions, suggestions, and criticism.<\/p><p>To dream that the file cabinet is locked indicates that there is something that you do not want revealed to others. Alternatively, it may indicate that you are being close-minded.<\/p>"
    },
    {
        "title": "File Cart",
        "desc": "<p>To see or use a file cart in your dream represents your inescapable responsibilities. A file cart may also have a similar interpretation as a file cabinet.<\/p>"
    },
    {
        "title": "Filer",
        "desc": "<p>To see a nail file in your dream suggests that you need to smooth out the rough edges of your personality or your relationship with others. You may be a little too harsh and too abrasive toward others.<\/p>"
    },
    {
        "title": "Filling",
        "desc": "<p>To dream that you are filling something indicates that you are replenishing your energies. It is symbolic of renewal and revitalization.<\/p>"
    },
    {
        "title": "Film",
        "desc": "<p>To dream that you are watching a film signifies that you are analyzing yourself and your own thoughts from an objective view. Alternatively, it represents old memories and the past. Perhaps there is something that you can learn from in the past.<\/p><p>To dream that you are developing or exposing film refers to a &quot;developing&quot; relationship or situation. Alternatively, it signifies the completion of a project or task. You are ready to enjoy and reap the benefits of your work. Consider the image that is being developed. If the image on the film does not come out, then it means that you are not ready for the outcome of a situation.<\/p>"
    },
    {
        "title": "Filter",
        "desc": "<p>To see or use a filter in your dream implies that you need to be more cautious in how you express yourself. Think before your speak. Alternatively, a filter means that you need to accept the positives and leave all the negativity behind.<\/p>"
    },
    {
        "title": "Finances",
        "desc": "<p>To dream about your finances signify concerns with money or your worries over your limited resources. Alternatively, the dream may be a metaphor for your emotions and your ability to give love and affection.<\/p>"
    },
    {
        "title": "Finch",
        "desc": "<p>To see a finch in your dream means that you are being underestimated based on your appearance or size. You feel others are pre-judging you.<\/p>"
    },
    {
        "title": "Find",
        "desc": "<p>To dream that you find something suggests that you are coming into contact with some aspect of your psyche or subconscious. You are recognizing a part of yourself that was previously repressed or undeveloped. Alternatively, it represents change.<\/p><p>Dreaming that you are looking for something, but can't find it refers to a lost of identity, direction in life, security, spirituality, etc depending on what the significance of the object . Look up the symbolism of the object that you are trying to find.<\/p><p>To dream that you find someone indicates that you are identifying new facets of a relationship. You may be taking the relationship to a new level and\/or direction.<\/p>"
    },
    {
        "title": "Fingernails",
        "desc": "<p>To notice your fingernails in your dream indicate that your defenses are up. Consider the length of the nails, the color (if applicable), the condition, and the cleanliness of the nails for additional meaning to your dream. If you dream that your nails are long, then it signify your idleness. You are not taking action. If you are wearing fake fingernails, then it suggest that you are reaching out to others, but do not have their best interest in mind. You may be acting in a disingenuous way. If you dream of red fingernails, then it refers to a tempting situation. The red fingernails may also be your subconscious' way of alerting you to a problem that you are overlooking.<\/p><p>To dream that you broke a fingernail suggests that you are trying to avoid some situation or trying to get out of a responsibility. Alternatively, the dream may reflect your self image. You are overly concerned with how others perceive you. Dreaming that your nails are falling or sliding off your fingers implies that you are feeling defenseless. It may also mean that you are letting down your guard.<\/p><p>To dream that you are polishing your fingernails represent glamour.<\/p><p>To dream that you are chewing your nails indicate that a problem is too tough to handle. You are not sure how to go about resolving a situation in your waking life.<\/p><p>To dream that your fingernails are growing rapidly refer to your desires to reach out to someone. You want to be able to extend a part of yourself to others.<\/p><p>To dream that a man has long red fingernails suggest that he is very in touch with his sensitivity and emotions. It may also relate to issues of sexuality and sensuality.<\/p><p>Dreaming that you break or chip a nail means that you need to stop and think about your actions. If you are cutting or clipping your nails, then it means that you are holding something back. You are not being completely honest.<\/p>"
    },
    {
        "title": "Fingerprints",
        "desc": "<p>To dream that you are being fingerprintedindicates guilt. You are expressing some regret in your actions. Alternatively, the dream represents your identity and individualism.<\/p><p>To see someone else's fingerprints in your dream suggest that you are suspicious about something or someone.<\/p>"
    },
    {
        "title": "Fingers",
        "desc": "<p>To see your fingers in you dream symbolize physical and mental dexterity. They indicate manipulation, action and non-verbal communication. If you dream that your fingers fall off, then it suggests that you are letting a situation dominate you or dictate how you behave. You may be literally losing your grip on life. To dream that you are crossing your fingers symbolize optimism, success, luck and hope.<\/p><p>To dream that your fingers are injured or have been chopped off denote your anxieties about your ability to accomplish some demanding task or perform in some waking situation.<\/p><p>To dream of a finger pointing at you signifies self-blame or guilt. Perhaps you have done something and are afraid that you will be exposed.<\/p><p>To dream about your little finger represents mental power, intellect, memory, and the power of communication.<\/p><p>To dream of your index finger or forefinger symbolizes the number one. It also signifies authority, direction, and judgment. Your dream may be trying to make a point.<\/p><p>To dream of your middle finger denotes prudence, practicality, caution, responsibility, and hard work. Alternatively, the middle finger symbolizes the phallus or some insult.<\/p><p>To dream of your ring finger represents success, popularity and creativity. It also has associations with marriage, union, commitments and issues of the heart. In 15th century England, it was the ring finger that doctors used to mix and taste their concocted medicines and thus, the ring finger can be symbolic of healing or the need to be healed.<\/p>"
    },
    {
        "title": "Finish",
        "desc": "<p>To dream that you finish something represents completion and achievement of your goals. You are ready to set your sights on something higher.<\/p>"
    },
    {
        "title": "Finish Line",
        "desc": "<p>To see the finish line in your dream means that your goals are within grasp. If the finish line is blocked off, then it indicates that you have put your own goals on hold. Due to circumstances in your waking life, you had to give up some of your aspirations.<\/p>"
    },
    {
        "title": "Fir",
        "desc": "<p>To see a fir tree in your dream indicates your need for clarity in some situation. It also symbolize an end to some aspect of your life and the beginning of something new.<\/p>"
    },
    {
        "title": "Fire",
        "desc": "<p>Depending on the context of your dream, to see fire in your dream can symbolize destruction, passion, desire, illumination, purification, transformation, enlightenment, or anger. If you are not afraid of the fire and it is under control or contained in one area, then it is a symbol of your own internal fire and inner transformation. Something old is passing and something new is entering into your life. Your thoughts and views are changing. If the fire is encircling you and someone else, then it signifies your bond to that person. The two of you share something significant. The dream may be a metaphor for someone who is &quot;fiery&quot;. It can also represent your drive, motivation, and creative energy. Alternatively, the dream may be warning you of some dangerous or risky activities. You are &quot;playing with fire&quot;.<\/p><p>To dream that you are being burned by fire indicates that your temper is getting out of control. Some issue or situation is burning you up inside.<\/p><p>To dream that a house is on fire indicates that you need to undergo some transformation. If you have recurring dreams of your family house on fire, then it suggests that you are still not ready for the change or that you are fighting against the change. Alternatively, it highlights passion andthe love of those around you.<\/p><p>To dream that you put out a fire signifies that you will overcome your obstacles in your life through much work and effort. If you are setting a fire to something or even to yourself, then it indicates that you are undergoing some great distress. You are at the brink of desperation and want to destroy something or some aspect of yourself.<\/p><p>To dream that you can start fire with your hands represents anger that you are trying to repress. You have difficulty expressing yourself and tend to overreact.<\/p><p>To dream that you can bend fire refers to your ability to control your anger.<\/p><p>Dreaming of an invisible fire highlights a period of cleansing and purification. It is time to make a new start. Alternatively, an invisible fire means that you are underestimating your risks in some endeavor or activity.<\/p><p>To see a bird singing near a fire refers to someone who is consumed by their passion.<\/p><p>Dreaming about fire and water together symbolizes a polarizing issue in your waking life. You are going through an emotional conflict and it is pulling you in two directions.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=firedream1\">Line Of Fire<\/a>&quot; &amp; &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=firedream2\">Smell Of Fire<\/a>&quot;<\/p>"
    },
    {
        "title": "Fire Drill",
        "desc": "<p>To dream of a fire drill represents something where you need to devote more attention to. Something requires your immediate action.<\/p>"
    },
    {
        "title": "Fire Eater",
        "desc": "<p>To see or dream that you are a fire eater indicates that you are able to keep your anger and aggression under control. Alternatively, the dream may also be a metaphor that you are literally being consumed by your anger.<\/p>"
    },
    {
        "title": "Fire Engine \/ Fire Truck",
        "desc": "<p>To see a fire engine in your dream suggests that you are tending to the needs of others and overlooking your own needs. You worry and stress out in situations that are beyond your control. Stop trying to be in the middle of things and stop trying to fix things. Trust that things will work itself out in the end. Use more discretion.<\/p>"
    },
    {
        "title": "Fire Escape",
        "desc": "<p>To see or use a fire escape in your dream suggests that you need to distance yourself from a harmful situation. You need to give yourself space.<\/p>"
    },
    {
        "title": "Fire Extinguisher",
        "desc": "<p>To see or use a fire extinguisher in your dream suggests that you are trying to get your emotions under control. Alternatively, the dream means that you need to let go of whatever anger you are still holding on to.<\/p>"
    },
    {
        "title": "Fireball",
        "desc": "<p>To see a fireball in your dream symbolizes some self-destructive force.<\/p>"
    },
    {
        "title": "Fireboat",
        "desc": "<p>To see or dream that you are on a fireboat indicates that you are ready to confront your anger issues.<\/p>"
    },
    {
        "title": "Firebrand",
        "desc": "<p>To see a firebrand in your dream symbolizes burning passion or some expressed anger. The dream may also be a metaphor to indicate someone who is causing you trouble.<\/p>"
    },
    {
        "title": "Firecracker",
        "desc": "<p>To see a firecracker in your dream represents your outbursts. Your anger is being misdirected.<\/p><p>To light a firecracker in your dream suggests that you are trying to divert the negativity and bad karma away from you. You have a fresh new outlook on life.<\/p>"
    },
    {
        "title": "Fired",
        "desc": "<p>To dream that you are fired from your job indicates that you are wanting to end some relationship or situation in your waking life. It also suggests that you are repressing what you really desire most.<\/p><p>Dreaming that you fire someone implies that you need to cut ties with people who do not have your best interest in mind. Someone who you thought was your friend may actually be working against you.<\/p>"
    },
    {
        "title": "Firefighters",
        "desc": "<p>To see a firefighter in your dream represents your higher Self. You are experiencing a period of cleansing and purification. The firefighter is the symbol of a true hero and of hope.<\/p><p>To dream that you are a firefighter suggests that you need to cool off or douse a heated situation before it gets out of hand. You need to remain level headed even in the heat of the moment.<\/p>"
    },
    {
        "title": "Firefly",
        "desc": "<p>To see a firefly in your dream represents bright ideas that are coming out of your subconscious. It also refers to flashes of ingenuity.<\/p>"
    },
    {
        "title": "Fireman Pole",
        "desc": "<p>To see or slide down a fireman pole in your dream represents dependability and security. Alternatively, the dream may be a phallic symbol.<\/p>"
    },
    {
        "title": "Fireplace",
        "desc": "<p>To see a lit fireplace in your dream symbolizes contentment, warmth, and comfort.<\/p><p>To dream of lighting or stirring a fireplace suggests a burning a desire. You need to get to the heart of some matter or situation.<\/p><p>To see an unlit fireplace is indicative of low energy, disinterest, or disheartenment.<\/p>"
    },
    {
        "title": "Fireplace Damper",
        "desc": "<p>To see a fire damper in your dreamindicates the warmth of friends. You have a lot of love to offer. Alternatively, it may represent your pent up frustrations and anger. You are holding in your negative emotions. If the damper is broken, then it indicates a situation or relationship that has made you cold and bitter.<\/p>"
    },
    {
        "title": "Firewood",
        "desc": "<p>To see firewood in your dream signifies warmth and togetherness. It may also indicate some misunderstanding in a relationship. Alternatively the dream is about hard work, labor and diligence.<\/p>"
    },
    {
        "title": "Fireworks",
        "desc": "<p>To see fireworks in your dream symbolizes enthusiasm, creativity, and talent. It may also indicate that you are showing off and making a spectacle of yourself. Alternatively, fireworks represents release of some pent up or repressed feelings.<\/p>"
    },
    {
        "title": "First Aid Kit",
        "desc": "<p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">To see or look for something in a first aid kit in your dream implies that you are in need of emotional and\/or spiritual healing. It is time to tend to your own needs. If you do not find what you need in the first aid kit, then it means that you are lacking emotional or spiritual support in a waking relationship.<\/p>"
    },
    {
        "title": "First Class",
        "desc": "<p>Dreaming that you are sitting in first class of an airplane means that you have achieved an important goal and are relishing in your success. Alternatively, the dream indicates that you are living the high life.<\/p>"
    },
    {
        "title": "First Lady",
        "desc": "<p>To see the first lady in your dream represents poise and grace. If you are hugging the first lady, then you are embracing her qualities within yourself. Your personal feelings about the first lady will prevail in the significance of your dream. Alternatively, the dream may be a play on words and thus symbolizes your confidence and attitude about being number one in whatever you do.<\/p>"
    },
    {
        "title": "Fish",
        "desc": "<p>To see fish swimming in your dream signifies insights from your subconscious mind. Thus to catch a fish represents insights which have been brought to the surface. In particular, catching a white fish in your dream means that you may be questioning your spiritual beliefs. Alternatively, a fish swimming in your dream may symbolize conception. Some women dream of swimming fish when they get pregnant. The fish is also an ancient symbol of Christianity and Christian beliefs. Consider the common phrases &quot;like a cold fish&quot;, &quot;fish out of water&quot; or something that is &quot;fishy&quot; about a situation. It may also imply a slippery or elusive situation. Perhaps your dream could be telling you that &quot;there are plenty of other fish in the sea&quot;, with regards to some relationship issue.<\/p><p>To dream that you are eating fish symbolizes your beliefs, spirituality, luck, energy and nourishment. It is food for the soul.<\/p><p>To dream of cooking fish indicates that you are incorporating your new realizations with your spiritual feelings and knowledge.<\/p><p>To dream that you are cleaning fish suggests that you are altering your emotional expression in a way that will be presentable to others. You are censoring yourself and not expressing how you completely feel.<\/p><p>To see fish bones in your dream refers to old insights, thoughts or views that have already been brought to light. You have processed these ideas and gained knowledge from it.<\/p><p>To dream that a small fish is attacking a bigger fish implies that you should not underestimate someone's ability because of their size. Consider whether you sympathize with the small fish or with the big fish for further significance of your dream.<\/p><p>To dream that an unusually large fish is attacking you suggests that you are avoiding some emotional issue that is growing into a huge problem. You are suppressing too much of your feelings that it is affecting your well-being.<\/p><p>Dreaming that a giant fish is trying to eat you means that some powerful people are trying to undermine you and your abilities.<\/p><p>To see a fish with legs in your dream suggests that you need to get out of your comfort zone in order to expand your awareness and knowledge.<\/p>"
    },
    {
        "title": "Fish Eye",
        "desc": "<p>To notice or eat fish eyes in your dream means that you need to gain a wider perspective on some situation. If the fish eyes are exceptionally large, then your dream is trying to draw your attention to them. It is telling you that your view on a situation may be distorted. Your perception on something is wrong.<\/p>"
    },
    {
        "title": "Fish Market",
        "desc": "<p>To dream that you go to a fish market signifies pleasure and joy.<\/p><p>To see decayed and rotting fish at the fish market denotes distress that will come in the disguise of happiness.<\/p>"
    },
    {
        "title": "Fish Tank",
        "desc": "<p>To see or clean a fish tank in your dream indicates how you have full control of your emotions. You keep your feelings in check. If you are watching the fish in the fish tank, then you may feel that your life is going nowhere or that you are going in circles with your life.<br><br>To dream that you are living in a fish tank indicates that you are detached from society. You are withdrawn. Alternatively, the dream may mean that you are feeling the pressure of those around you. Consider the phrase of &quot;living in a fishbowl&quot;. You feel that you are being judged, criticized and scrutinized.<\/p>"
    },
    {
        "title": "Fisherman",
        "desc": "<p>To see a fisherman in your dream suggests that you are trying to catch or look for something in your waking life. Perhaps you are looking for an answer to a problem or decision.<\/p>"
    },
    {
        "title": "Fishhooks",
        "desc": "<p>To see fishhooks in your dream refer to an idea or concept that you need to grasp. The dream may also indicate that you are getting hooked on something or being hooked in. You may be deceived into doing or believing something.<\/p><p>To dream that you have fishhooks embedded into your scalp refers to your past relationships. You have yet to get over the relationship or you have yet to learn from the relationship. Alternatively, the dream implies that someone in your past still has a strong influence on your mind and the decisions you are making.<\/p>"
    },
    {
        "title": "Fishing",
        "desc": "<p>To dream that you are fishing indicates that you are confronting and bringing your repressed emotions to the surface. In particular, to dream that you are ice fishing suggests that you are breaking through a hardened emotional barrier and confronting difficult feelings from your subconscious. Alternatively, it represents your need for leisure and relaxation.<\/p><p>Consider the common phrase &quot;fishing for compliments&quot;. Perhaps you are looking for attention.<\/p>"
    },
    {
        "title": "Fishing Rod",
        "desc": "<p>To see a fishing rod in your dream represents your quest and exploration of your subconscious mind. You are ready to confront issues and emotions which you have suppressed.<\/p>"
    },
    {
        "title": "Fishnet",
        "desc": "<p>To see a fishnet in your dream indicates a fear of being found out or caught in the act.<\/p>"
    },
    {
        "title": "Fishnet Stockings",
        "desc": "<p>To see or wear fishnet stockings in your dream symbolizes sexiness, lust, and allure. The dream may be telling you that you need to be more daring.<\/p>"
    },
    {
        "title": "Fishpond",
        "desc": "<p>To see a fishpond in your dream represents subconscious material that is slowly revealing itself. Alternatively, it symbolizes feelings that you need to contain and keep in check.<\/p>"
    },
    {
        "title": "Fist",
        "desc": "<p>To see a fist in your dream symbolizes anger, power and aggression. It is also indicative of your readiness to fight and defend yourself.<\/p>"
    },
    {
        "title": "Fits",
        "desc": "<p>To dream that you are having a fit signifies failing health and loss of employment.<\/p><p>To see others throwing fits denotes unpleasantness and coldness amongst your social and\/or business circle.<\/p>"
    },
    {
        "title": "Fitting Room",
        "desc": "<p>*Please See: <a href=\"#Dressing%20Room\">Dressing Room<\/a><\/p>"
    },
    {
        "title": "Fix",
        "desc": "<p>To dream that you are fixing something indicates that you need to reevaluate and rethink a situation or relationship in your life.<\/p>"
    },
    {
        "title": "Flag",
        "desc": "<p>To see your national flag in your dream signifies peace and\/or prosperity. It may also bring about feelings of patriotism and duty to country. Or the dream is highlighting some political issue. If you see a flag of another nation, then it represents worldly issues.<\/p><p>To wave a flag in your dream symbolizes a warning or distress signal of sorts. An issue may be weighing on your mind. In particular, a white flag indicates surrender. You are giving up. Seeing a red flag suggests your mercilessness and danger. The dream may be telling you to stop something that you are doing. To see a checkered flag in your dream represents success and completion.<\/p><p>To see a flag at half mast in your dream indicates that you are mourning. You are unable to let go of the past.<\/p>"
    },
    {
        "title": "Flagpole",
        "desc": "<p>To see a flagpole in your dream represents a sense of stability in your life. You may find that those around you are ready to support in your whatever you do or decide.<\/p>"
    },
    {
        "title": "Flame",
        "desc": "<p>To see a flame in your dream symbolizes purification. The dream may also be a metaphor for &quot;flaming&quot; or some heated online argument or personal attack. Flaming also refers to someone who is overtly gay or an old flame could refer to someone from your past who you had a crush on or who you were in love with.<\/p><p>To dream that you are fighting flames implies that you will need to invest your best efforts and energy in your road to success and wealth.<\/p><p>*Please also see: <a href=\"#fire\">Fire<\/a>.<\/p>"
    },
    {
        "title": "Flamenco",
        "desc": "<p>To dream that you are dancing the flamenco represents passion and enthusiasm for life.<\/p>"
    },
    {
        "title": "Flamingo",
        "desc": "<p>To see a flamingo in your dream represents you sense of community and cooperation. It also indicates new experiences or situations. Alternatively, you may be overly concerned with your physical appearance.<\/p>"
    },
    {
        "title": "Flannel",
        "desc": "<p>To see or wear flannel in your dream represents comfort, relaxation and warmth. The dream could be telling you that you are in a comfortable place in your life. Consider the color or the type of flannel item for additional significance.<\/p>"
    },
    {
        "title": "Flare Gun",
        "desc": "<p>To see or use a flare gun in your dream indicates a situation or relationship that is in desperate need of your attention.<\/p>"
    },
    {
        "title": "Flasher",
        "desc": "<p>To see a flasher in your dream suggests that you are experiencing frustrations in your sex life. You are denying your sexual urges and needs.<\/p>"
    },
    {
        "title": "Flashlight",
        "desc": "<p>To see a flashlight in your dream suggests that you are questioning certain issues about yourself. You may be trying to shed light on your deeper thoughts and\/or subconscious feelings. It symbolizes sudden awareness, insight, and the ability to find your way in a situation. Alternatively, the flashlight may imply sexual activities.<\/p>"
    },
    {
        "title": "Flashmob",
        "desc": "<p>To see a flashmob in your dream symbolizes unity and cooperation. Consider the significance of what the flashmob is doing. Alternatively, the dream implies that you need to coordinate some mass movement.<\/p><p>To dream that you are part of a flashmob represents your need to belong.<\/p>"
    },
    {
        "title": "Flask",
        "desc": "<p>*Please See: <a href=\"#Thermos\">Thermos<\/a>.<\/p>"
    },
    {
        "title": "Flattery",
        "desc": "<p>*Please See: <a href=\"#Compliment\">Compliment<\/a>.<\/p>"
    },
    {
        "title": "Flavor",
        "desc": "<p>To taste or dream of different flavors in your dream suggests that you need to have more variety in your life. Consider the significance of the specific flavors (i.e. <a href=\"#Sour\">sour<\/a>, <a href=\"#Sweets\">sweet<\/a>, <a href=\"#Salt\">salty<\/a>).<\/p>"
    },
    {
        "title": "Flax",
        "desc": "<p>To see flax in your dream signifies prosperity.<\/p>"
    },
    {
        "title": "Flea Market",
        "desc": "<p>To dream that you are at a flea market suggests that you are feeling undervalued or under-appreciated. You are selling yourself short. Consider the symbolism of the item you are buying and how you feel about it in the dream.<\/p>"
    },
    {
        "title": "Fleas",
        "desc": "<p>To see fleas in your dream signify that you will be provoked into anger and manipulated into retaliation by someone close to you.<\/p><p>To dream that fleas bite you signify that vicious rumors by false friends will slander your character.<\/p>"
    },
    {
        "title": "Fleece",
        "desc": "<p>To see fleece in your dream symbolizes a sense of security.<\/p>"
    },
    {
        "title": "Flesh",
        "desc": "<p>To notice your flesh in your dream represents a heightened sense of feeling and vitality. It symbolizes your sexual urges and physical desires.<\/p><p>To dream of flesh being eaten suggests that you are under tremendous stress and feel drained.<\/p>"
    },
    {
        "title": "Fleet",
        "desc": "<p>To see a large, rapidly moving fleet in your dream signifies a hasty change in the business market.<\/p>"
    },
    {
        "title": "Fleur De Lis",
        "desc": "<p>To see a fleur de lis in your dream symbolizes spiritual power and control.<\/p>"
    },
    {
        "title": "Flies",
        "desc": "<p>To see flies in your dream symbolize filth and dirtiness, either physical or emotional. It indicates feelings of guilt or a breakdown of a plan. Flies may also forewarn of a contagious sickness. Alternatively, the fly could represent an irritating and annoying person in your life. Perhaps someone does not know how to mind their business.<\/p><p>To dream that you kill or exterminate the flies indicate that you will redeem yourself and regain your honor after your fall from grace.<\/p><p>To see a white colored fly in your dream represents death. This may not necessarily be a physical death, but a metaphorical death. You will be undergoing some significant change to your lifestyle.<\/p><p>To dream that there is a fly in your ear implies that someone is trying to discretely tell you something that you don't want to hear.<\/p><p>Dreaming of a room full of flies indicates that something that started out as minor or insignificant is getting out of control. There is an issue that you are ignoring for far too long.<\/p>"
    },
    {
        "title": "Flight",
        "desc": "<p>To dream of an airline flight symbolizes a project that is about to take off. If the flight is delayed, then is suggests that you are unprepared in undertaking the project at hand.<\/p><p>To dream that you miss your flight or a connection or that it was cancelled indicates that you are feeling helpless and trapped by some situation. You feel that you are being held back, either physically or mentally. Alternatively, the dream may also suggest that you are feeling disconnected in some aspect of your life - work, relationship or home life.<\/p><p>To dream of flight signifies a new sense of freedom where you had previously felt restricted and limited.<\/p><p>*For an in depth analysis, click on: <a href=\"http:\/\/dreammoods.com\/cgibin\/flyingdreams.pl?method=exact&amp;header=dreamid&amp;search=flyingintro\">Common Dreams: Flying<\/a>.<\/p>"
    },
    {
        "title": "Flight Attendant",
        "desc": "<p>To see a flight attendant in your dream indicates travel plans in your future. Alternatively, the dream suggests that you are seeking help in a new project.<\/p><p>To dream that you are a flight attendant represents a new project that you need to take care of.<\/p>"
    },
    {
        "title": "Flint",
        "desc": "<p>To see flint in your dream symbolizes endurance, durability, livelihood and longevity. Alternatively, the dream may signify the spark of some new idea.<\/p>"
    },
    {
        "title": "Flip",
        "desc": "<p>To see something flipping signifies excitement.<\/p><p>To dream that you are flipping something indicates that you are feeling regret. The dream may also be a pun that you are driving someone mad or crazy, as in &quot;flipped out&quot;.<\/p>"
    },
    {
        "title": "Flippers",
        "desc": "<p>To wear flippers in your dream indicates that you are moving quickly and effectively through some old emotional issues. You are ready to let go of the past and move ahead. Alternatively, the dream may be a pun on your inability to commit. You are going back and forth over some issue or decision.<\/p>"
    },
    {
        "title": "Flip Flops",
        "desc": "<p>To see or wear flip flops in your dream indicate that you are feeling relaxed and at ease. Or perhaps you need to find time to relax. Alternatively, the dream may be a metaphor that you are unable to commit to something. You are going back and forth over some issue or decision.<\/p>"
    },
    {
        "title": "Flirting",
        "desc": "<p>To dream that you are flirting or that someone is flirting with you represents your need for intimacy and affection. You may be about to enter into a serious commitment or relationship in the near future.<\/p><p>To dream that your spouse or significant other is flirting with someone else or that someone is flirting with your significant other indicates that you are feeling an emotional or physical distance from her or him. There is a lack of communication in the relationship. Or perhaps you are feeling inadequate and that you don't measure up.<\/p>"
    },
    {
        "title": "Floating",
        "desc": "<p>To dream that you are floating on air indicates satisfaction, contentment and acceptance of some situation. You are letting go of your problems and rising above obstacles. You are experiencing new-found freedom and gaining a new perspective on things. Nothing seems overwhelming or too difficult to handle. Alternatively, floating in your dream suggests that you are wandering through life aimlessly with no goals. You are just going with the flow.<\/p><p>To dream that you are floating in water suggests that you have a handle on your emotions.<\/p><p>To dream that you are floating, but are afraid to move suggests that you are questioning your own abilities. You are experiencing doubts in yourself.<\/p>"
    },
    {
        "title": "Flock",
        "desc": "<p>To see a flock of birds in your dream represent a lack of objectivity in your decision-making and thinking process.<\/p>"
    },
    {
        "title": "Flogging",
        "desc": "<p>*Please See: <a href=\"#Beating\">Beating<\/a>.<\/p>"
    },
    {
        "title": "Flood",
        "desc": "<p>To dream that you are in a flood represents your need to release some sexual desires. If the flood is raging, then it represents emotional issues and tensions. Your repressed emotions are overwhelming you. Consider where the flood is for clues as to where in your waking life is causing you stress and tension. Alternatively, the dream indicates that you are overwhelming others with your demands and strong opinion. Still another interpretation could be your desire to wipe everything clean and make a fresh new start.<\/p><p>To see a gentle flood in your dream indicates that your worries over a certain matter will soon be swept away.<\/p><p>To dream that your house is flooded suggests that you are becoming overwhelmed by your emotions. To see houses under water implies that you are very comfortable with your own emotions. Alternatively, the dream may be a reflection of your housing situation. Perhaps you are &quot;underwater&quot; in your mortgage.<\/p>"
    },
    {
        "title": "Floodlights",
        "desc": "<p>To see floodlights in your dreams symbolize your desire to open up and be understood. You need to try to shed as much light on a subject as you can.<\/p><p>To see a floodlight burn out symbolizes that you are being kept out in the dark about certain issues..<\/p>"
    },
    {
        "title": "Floor",
        "desc": "<p>To see the floor in your dream represents your support system and sense of security. You have a firm foundation that you can depend on. The floor in your dream may also symbolize the division between the subconscious and conscious. Alternatively, the dream may be a pun on being &quot;floored&quot; or being completely surprised. Perhaps you have been caught off guard about something. To kiss the floor in your dream implies that you are grateful for the life you have.<\/p><p>To see a polished or waxed floor in your dream indicates that you are keeping your subconscious suppressed. Consider the condition of the floor for further analysis.<\/p><p>To see a slanted floor in your dream indicates that you are deviating too far from your original plans and goals.<\/p><p>To dream about the floors of a building represents your level of understanding, awareness or success. The higher floors signify higher accomplishments and achievements. If you are in the lower floors, then it refers to more primal attitudes, the subconscious and\/or sexuality. It also denotes failures. Consider the significance of the floor number and the type of building the floors are on.<\/p><p>To dream that the floor is made of rubber suggests that you are testing your limits. You are given certain freedoms to explore who you are. Alternatively, dreaming of a rubber floor signifies your forgiving or yielding support system. You are surrounded by people who accept you for your mistakes and flaws.<\/p><p>To dream that you are peeling away layers of flooring implies that you are getting to your subconscious level. Alternatively, the layers of flooring symbolizes the forgotten past. Sometimes you forget how or what got you to where you are today.<\/p>"
    },
    {
        "title": "Floorboards",
        "desc": "<p>To notice the floorboards in your dream suggests that you are being protective of the things that are important to you. Alternatively, it indicates that you are guarded about something in your subconscious. If the floorboards are loose, then it means that you are unsure of the ground that you are standing on. You are feeling insecure about something that you should not be insecure about.<\/p>"
    },
    {
        "title": "Florist",
        "desc": "<p>To see or visit a florist in your dream indicates that you are seeking to bring joy into your life.<\/p><p>Dreaming that you are a florist means that you are surrounded by beauty. Appreciate what you have around you.<\/p>"
    },
    {
        "title": "Floss",
        "desc": "<p>To floss in your dreamsuggests that you are trying to get to the root of some matter. Alternatively, the dream may be a metaphor that you are showing off and flaunting your material things. If your gums become bloody as a result of flossing, then it represents your fears and the negative consequences of your actions.<\/p>"
    },
    {
        "title": "Flounder",
        "desc": "<p>To see or eat a flounder in your dream represents indecision and how you are unable to commit to something. You are going back and forth over some issue or decision.<\/p>"
    },
    {
        "title": "Flour",
        "desc": "<p>To see flour in your dream symbolizes a frugal but happy way of life. It also indicates hard work. This dream symbol may also be a pun on &quot;flower&quot;.<\/p>"
    },
    {
        "title": "Flower",
        "desc": "<p>To see colorful flowers in your dream signify kindness, compassion, gentleness, pleasure, beauty, and gain. It is also symbolic of perfection and spirituality. Your dream may be an expression of love, joy and happiness. Alternatively, flowers in dream, especially if they are blooming, represent your hidden potential and latent talents. Flowers can also denote a particular time or season. If the flowers are white, then it symbolizes sadness. Consider the color of the flower and the type of flower for additional analysis.<\/p><p>To see withered or dead flowers in your dream denotes disappointments and gloomy situations. It may signal an end to a love relationship. Or it could indicate that you may not be utilizing your full potential and talents and letting it go to waste.<\/p><p>To dream that you receive a bouquet offlowers represents respect, approval, admiration, and rewards.<\/p><p>To see flowers blooming in barren soil signify that energy and cheerful nature will enable you to overcome your grievances. If you are picking flowers, then the dream symbolizes blooming love or a new developing relationship.<\/p>"
    },
    {
        "title": "Flowerpot",
        "desc": "<p>To see a flowerpot in your dream symbolizes the womb and the feminine aspects of yourself. It also represents protection and nurturance. Alternatively, a flowerpot means that you creativity is being contained.<\/p>"
    },
    {
        "title": "Fluffy",
        "desc": "<p>To dream about fluffy things signify comfort, contentment, pleasure and peace in your current life. You are satisfied with how things are going. Alternatively, the dream may refer to your lofty goals. Perhaps you are being unrealistic. The dream may also point to a relationship or situation that is &quot;all fluff and no substance.&quot;<\/p>"
    },
    {
        "title": "Flute",
        "desc": "<p>To hear or play the flute in your dream indicates harmony in your life. Things are going smoothly for you. Alternatively, hearing the sound a flute, suggests sorrow and longing. You are experiencing a spectrum of emotions. The flute also symbolizes the phallus or a masculine component in your waking life.<\/p>"
    },
    {
        "title": "Fly",
        "desc": "<p>*Please see: <a href=\"#Flies\">Flies<\/a>.<\/p>"
    },
    {
        "title": "Fly Paper",
        "desc": "<p>To see fly paper in your dream indicates that you are involved in a slightly sticky situation.<\/p>"
    },
    {
        "title": "Fly Trap",
        "desc": "<p>To see a fly trap in your dream denotes a malicious plan set forth against you.<\/p><p>To see a fly trap full of flies signifies minor embarrassments.<\/p>"
    },
    {
        "title": "Flying",
        "desc": "<p>To dream that you are flying signifies a sense of freedom where you had initially felt restricted and limited.<\/p><p>To dream that you are flying with black wings signifies bitter disappointments.<\/p><p>Dreaming that you are flying underwater represents control over your emotions. You are comfortable with confronting your feelings directly.<\/p><p>*For an in depth analysis, click on Dream Mood's <a href=\"http:\/\/www.dreammoods.com\/commondreams\/flying-dreams.html\">Common Dreams: Flying<\/a>.<\/p>"
    },
    {
        "title": "Flying Fish",
        "desc": "<p>To see a flying fish in your dream indicates that you are feeling emotionally free and uninhibited.<\/p>"
    },
    {
        "title": "Flying Machine",
        "desc": "<p>To see a flying machine in your dream foretells of steady and satisfactory progress in your future endeavors.<\/p>"
    },
    {
        "title": "Flying Saucer",
        "desc": "<p>*Please See: <a href=\"#UFO\">UFO<\/a>.<\/p>"
    },
    {
        "title": "Flyswatter",
        "desc": "<p>To see or use a flyswatter in your dream implies that you need to be quick to react in a situation or else the opportunity will pass you by.<\/p>"
    },
    {
        "title": "Foal",
        "desc": "<p>To see a foal in your dream signifies new undertakings and emergence of fresh energy.<\/p>"
    },
    {
        "title": "Foam",
        "desc": "<p>To see foam in your dream signifies light heartedness and pleasure.<\/p>"
    },
    {
        "title": "Fog",
        "desc": "<p>To dream that you are going through a thick fog symbolizes confusion, troubles, scandal, uncertainty and worries. You may not be seeing things the way they really are. You may have lost your sense of direction in life. Alternatively, a fog represents mystery, secrecy and protection.<\/p>"
    },
    {
        "title": "Fog Machine",
        "desc": "<p>To see or use a fog machine in your dream indicates that there is something you are trying to hide. You or someone is diverting attention away from the real issue.<\/p>"
    },
    {
        "title": "Foil",
        "desc": "<p>To see or wrap something in foil in your dream indicates that you are trying to protect or insulate yourself from the harsh realities. Alternatively, wrapping something in foil is analogous to some pent up anger. You internalize your emotions and keep things inside. The dream may also be a pun on &quot;foiling&quot; or thwarting someone's plans.<\/p>"
    },
    {
        "title": "Fold",
        "desc": "<p>To fold or see folded items in your dream means that you need to better compartmentalize your mind and organize your thoughts. Or the dream may be telling you that you are too structured in your thinking. Consider the significance of what you are folding. Alternatively, the dream suggests that you are giving up too easily.<\/p>"
    },
    {
        "title": "Folder",
        "desc": "<p>To see a folder in your dream suggests that you need to sort out your feelings and re-organize some issues in your waking life, especially if you've experienced some trauma or turmoil recently. Consider the contents of the folder for additional clues.<\/p>"
    },
    {
        "title": "Foliage",
        "desc": "<p>*Please See: <a href=\"#Plants\">Plants<\/a>.<\/p>"
    },
    {
        "title": "Followed",
        "desc": "<p>*Please See: <a href=\"#Pursuit\">Pursuit<\/a>.<\/p>"
    },
    {
        "title": "Fondue",
        "desc": "<p>To dream that you are fonduing symbolizes community, wholeness, warmth, and unity. Perhaps you are lacking these qualities or components in your waking life.<\/p>"
    },
    {
        "title": "Foo Dog",
        "desc": "<p>To see a set of foo dog statues in your dream symbolizes a balance between dominance and nurturance. Alternatively, dreaming of foo dogs indicate that you need to be on your guard about something.<\/p>"
    },
    {
        "title": "Food",
        "desc": "<p>To see food in your dream represents physical and emotional nourishment and energies. The different types of food can symbolize a wide range of things. Generally, fruit is symbolic of sensuality, meat represents animalistic desires, and vegetables pertain to healthy pursuits. Frozen foods may refer to your cold emotions and frigid ways. Eating certain foods also refer to qualities that you need to incorporate within your own self.<\/p><p>To dream that you are eating specific cuisines depends on your personal associations with it. Chinese, Italian, or Mexican food may be a go-to comfort food for you, while it may be a reminder of your home life or of mom's cooking other others. If you dream of eating a comfort food, then it indicates that you are looking for comfort in the wrong places.<\/p><p>To dream that you are hording or storing food indicates a fear of deprivation. You do not trust what you already have.<\/p><p>To see or eat stale food in your dream suggests that you are feeling sluggish and emotionally drained. You need to be invigorated and revitalized. If there is mold growing on your food, then it implies that you are too easily susceptible to some negative energy around you.<\/p><p>To eat bad-tasting food in your dream indicates some sourness or resentment in your emotional state of mind.<\/p><p>To see or eat burnt food in your dream suggests that you are experiencing some intense emotion. The dream may also indicate that you are feeling exhausted. You are running out of fuel.<\/p><p>To see fake or plastic food in your dream implies that you are not getting the emotional support that you are looking for. You are feeling emotionally unsatisfied.<\/p><p>To dream that there is hair in your food means that you are entangled in some emotional matter which you are not sure about how to get out of.<\/p><p>*Please also see: <a href=\"#Eating\">Eating<\/a>.<\/p>"
    },
    {
        "title": "Food Court",
        "desc": "<p>To dream that you are in a food court indicates that you are looking for an outlet to express your feelings.<\/p>"
    },
    {
        "title": "Food Fight",
        "desc": "<p>To dream that you are in a food fight suggests that there is a conflict between your physical and emotional well being. There is some issue that you need to resolve in your waking life.<\/p>"
    },
    {
        "title": "Food Poisoning",
        "desc": "<p>To dream that you have food poisoning indicates that there is something harming or interfering with your emotional well being.<\/p>"
    },
    {
        "title": "Food Processor",
        "desc": "<p>To see or use a food processor in your dream indicates that you need to better &quot;process&quot; your emotions so you can understand them in a more effective manner.<\/p>"
    },
    {
        "title": "Food Truck",
        "desc": "<p>To see or eat at a food truck in your dream implies that you are not investing enough time to cater to your emotional well-being.<\/p>"
    },
    {
        "title": "Fool",
        "desc": "<p>*Please see: <a href=\"#Minstrel\">Minstrel<\/a>.<\/p>"
    },
    {
        "title": "Foosball",
        "desc": "<p>To play foosball in your dream refers to a situation where you need to respond or act quickly. You can not afford to lose site of your goal.<\/p>"
    },
    {
        "title": "Foot",
        "desc": "<p>To dream that you injured or hurt your foot signifies a lack of progress, freedom, and independence. Alternatively, the dream suggests that you have taken a step in the wrong direction. In particular, if you dream that your foot is cut by glass, then it indicates passivity. You are hesitant or reluctant in taking the first step toward a goal or decision.<\/p><p>*Please See Also: <a href=\"#Feet\">Feet<\/a>.<\/p>"
    },
    {
        "title": "Football",
        "desc": "<p>To dream that you are watching football indicates that you have great satisfaction in your work. You will achieve your goals as you progress through your life.<\/p><p>To dream that you are playing football or on a football field represents your competitive nature. Alternatively, you are not getting enough cooperation or support in some area of your life. You are being faced with many demanding challenges.<\/p>"
    },
    {
        "title": "Footprints",
        "desc": "<p>To see footprints in your dream symbolize pride and heritage. It may also suggest that you are a follower in someone else's footsteps. You are lacking originality and initiative. Alternatively, footprints indicate something or someone you have missed. Perhaps, you feel that someone is never quite there for you. It could be a sign of distress.<\/p>"
    },
    {
        "title": "Footsteps",
        "desc": "<p>To hear footsteps in your dream indicate that you are worrying over some issue or problem. You are feeling overwhelmed with panic and uneasiness.<\/p>"
    },
    {
        "title": "Footstool",
        "desc": "<p>To see a footstool in your dream suggests that you need to learn to ask for help, in order to move up and advance in life.<\/p>"
    },
    {
        "title": "Force",
        "desc": "<p>To dream that you are being forced to do something indicates negative feelings that are being pushed out of the subconscious. Feelings of hate, aggression or anger which you may have suppressed need to be addressed head on.<\/p>"
    },
    {
        "title": "Foreclosure",
        "desc": "<p>To dream that you are being foreclosed on suggests that you are feeling unsettled or uneasy. Alternatively, the dream denotes that something good is coming to an end.<\/p>"
    },
    {
        "title": "Forehead",
        "desc": "<p>To see a smooth forehead in your dream indicates that you are fair and show good judgment. It is also indicative of your intellectual capacities.<\/p><p>To see a wrinkled forehead in your dream symbolizes worries and burdens. You may be deep in thought.<\/p><p>To dream that you feel the forehead of your child denotes sincere praises.<\/p><p>To dream that you bumped or injured your forehead implies that you have made a poor judgment. It also indicates regret in something you did.<\/p>"
    },
    {
        "title": "Foreign Land",
        "desc": "<p>To dream that you are in a foreign land represents change in your life. Consider how you feel about the surrounding. If you are afraid or lost, then it indicates that you are not ready for the change. You are not willing to leave the past behind. If you are excited or happy in this unknown place, then it suggests that you are ready for change.<\/p>"
    },
    {
        "title": "Foreign Language",
        "desc": "<p>To hear or speak a foreign language in your dream indicates a message from your subconscious that you do not yet understand. Alternatively, you may not be making yourself clear to others.<\/p><p>To dream that you are studying a foreign language suggests that you are having difficulties expressing your thoughts. You are confronted with some unfamiliar problem that you do not know how to approach and resolve in your waking life.<\/p>"
    },
    {
        "title": "Foreigner",
        "desc": "<p>To see a foreigner in your dream represents an aspect of yourself that is unfamiliar or strange to you. You may be neglecting or ignoring some important feelings or talents.<\/p>"
    },
    {
        "title": "Foreplay",
        "desc": "<p>To dream about foreplay indicates your unfulfilled desires and wishes.<\/p>"
    },
    {
        "title": "Forest",
        "desc": "<p>To dream that you are in or walking through the forest signifies a transitional phase. Follow your instincts. Alternatively, it indicates that you want to escape to a simpler way of life. You are feeling weighed down by the demands of your life.<\/p><p>To dream that you are lost in a forest indicates that you are searching through your subconscious for a better understanding of yourself.<\/p><p>To dream of a forest fire indicates that transformation and regeneration is only possible through some hardships. Alternatively, it suggests that your anger is out of control; it is affecting those around you.<\/p><p>*Please see also: <a href=\"#Woods\">Woods<\/a>.<\/p>"
    },
    {
        "title": "Forest Ranger",
        "desc": "<p>*Please see: <a href=\"#Park%20Ranger\">Park Ranger<\/a>.<\/p>"
    },
    {
        "title": "Forgery",
        "desc": "<p>To dream that you are forging documents or a signature represents deception. You are trying to cover up some mistake or some lie.<\/p>"
    },
    {
        "title": "Forget Me Not",
        "desc": "<p>To see forget me not flowers in your dream symbolize your lover and your relationship with her or him. You are feeling neglected in your waking relationship or that your feelings are being overlooked. Open communication is key to the relationship. Alternatively, the dream could be telling you not to forget about someone or something. Or it may denote yearning.<\/p>"
    },
    {
        "title": "Forgetting",
        "desc": "<p>To dream that you are forgetting things signify life's anxieties. You are expressing an overwhelming amount of stress in your life. You feel the need to tend to everything and everyone's needs. Alternatively, forgetting something may represent your subconscious desire to leave that something behind. On a more direct level, the dream could just be your subconscious telling you or reminding you of a forgotten appointment or date.<\/p><p>Dreaming that someone forgets you suggests that you have changed into someone who you are not proud of. Perhaps you are questioning the person you are becoming. Alternatively, to dream about someone forgetting who you are implies that you are feeling insignificant or unimportant.<\/p><p>To dream that you forget where you live suggests that you do not want to go home. Is there a domestic conflict or argument?<\/p><p>To dream that you forget the baby indicates that you are feeling burdened by the responsibility of taking care of someone else.<\/p>"
    },
    {
        "title": "Forgive",
        "desc": "<p>To dream that you forgive someone means that it is time to let go of some past grudge, guilt, or resentment so that you can move ahead with your life. You need to verbalize and express your negative feelings in order to get on the path to forgiveness. Such dreams are often a waking reflection of your need to forgive.<\/p><p>To dream that you are being forgiven indicates that you have accepted some aspect of yourself.<\/p>"
    },
    {
        "title": "Fork",
        "desc": "<p>To see a fork in your dream represents an extension of your reach. You are on the right track toward pursuing your goals. Alternatively, it may be a pun on &quot;fork it over&quot;. Do you feel that you are being coerced or forced?<\/p><p>To dream of being stabbed or attacked with a fork indicates that you are too picky with the ideas\/suggestions presented to you.<\/p><p>To see someone eating with a fork denotes that all your current worries will be cleared up through the help of a friend.<\/p>"
    },
    {
        "title": "Fork In The Road",
        "desc": "<p>To see a fork in the road in your dream represents an important decision that you need to make. It may indicate your choices or ambivalence about some situation. Alternatively, a fork symbolizes the union of opposites. Opposing views\/aspects are coming together.<\/p><p>To see an oak tree at the fork in the road signifies a life-changing decision.<\/p>"
    },
    {
        "title": "Forklift",
        "desc": "<p>To see or use a forklift in your dream suggests that you need to rearrange some of your ideals in order to find a solution to a problem. It may also mean that you need to clear out your old emotions and\/or memories.<\/p>"
    },
    {
        "title": "Formal",
        "desc": "<p>To dream that you are attending a formal represents a situation where you need to be on your best behavior. Or perhaps you feel you have been too pretentious.<\/p>"
    },
    {
        "title": "Formaldehyde",
        "desc": "<p>To see or use formaldehyde in your dream refers to something that you are holding onto for too long. You need to let go of the past and quit dwelling on old emotions.<\/p>"
    },
    {
        "title": "Formula",
        "desc": "<p>To see a formula in your dream suggests that you already have the solution to a waking problem. You need to pay closer attention. Alternatively, the dream may be telling you that you need to figure out what you want to do with your life. It is time to lay your future plans and goals.<\/p>"
    },
    {
        "title": "Fort",
        "desc": "<p>To dream that you are defending a fort indicates that you are always on guard. You are constantly put on the defensive. If your fort is under attack, then it suggests that feel emotionally attacked. Or your dream could be prepping you up for a difficult or demanding situation.<\/p>"
    },
    {
        "title": "Fortress",
        "desc": "<p>To see a fortress in your dream symbolizes protection and healing. Alternatively, it suggests that you are putting up a wall between you and others. You are shutting down emotionally.<\/p>"
    },
    {
        "title": "Fortune",
        "desc": "<p>To dream that you are making a fortune signifies inner riches, untapped resources, and unexpressed talents.<\/p><p>To dream that you lost a fortune indicates lost love, missed opportunities or drained emotions.<\/p>"
    },
    {
        "title": "Fortune Cookie",
        "desc": "<p>To see or eat a fortune cookie in your dream suggests that you are putting your fate in someone else's hand. The fortune inside the cookie may also be some sort of advice or message from your subconscious.<\/p>"
    },
    {
        "title": "Fortune Telling",
        "desc": "<p>To dream that you are having your fortune told signifies fears and anxieties about the future. You have issues of control and the desire to know the unknown.<\/p>"
    },
    {
        "title": "Fossils",
        "desc": "<p>To see fossils in your dream symbolize longevity and wisdom. Some relationship or situation is standing the test of time. The dream may also be a metaphor for someone who is stuck in the past or have outdated ways of thinking. Also consider the object that has been fossilized for hints as to what is outdated in your life.<\/p>"
    },
    {
        "title": "Found",
        "desc": "<p>To dream that you found something suggests that you are coming into contact with some aspect of your psyche or subconscious. You are recognizing a part of yourself that was previously repressed or undeveloped. Alternatively, it represents change.<\/p><p>To dream that you found someone indicates that you are identifying new facets of a relationship. You may be taking the relationship to a new level and\/or direction. The dream may also be a metaphor for finding yourself.<\/p>"
    },
    {
        "title": "Foundation",
        "desc": "<p>To see the foundation of a building represents your belief system. You are well-prepared for any situation before you.<\/p><p>To dream that the foundation is shifting suggests that you are changing your beliefs about something.<\/p>"
    },
    {
        "title": "Fountain",
        "desc": "<p>To see a fountain in your dream represents joy, renewed pleasure or increased sensitivity. You are experiencing an outburst of positive emotions. Perhaps you are entering into a new relationship or a new phase in that relationship. Alternatively, the fountain may be analogous to sexual climax.<\/p><p>To see a dry fountain in your dream indicates that you are coming down from the &quot;high&quot; of a passionate relationship.<\/p>"
    },
    {
        "title": "Fowl",
        "desc": "<p>To see a fowl in your dream denotes temporary worries and disagreements. The dream may also be a pun on a situation or a conversation that is &quot;foul&quot;.<\/p>"
    },
    {
        "title": "Fox",
        "desc": "<p>To see a fox in your dream represents insight, cleverness, cunningness and resourcefulness. Perhaps the dream is telling you that you need to exhibit more of these qualities in your waking life. Or that you need to conceal your thoughts and be more discrete about some situation. The fox may also symbolize someone in your waking life who is sly and sneaky. Alternatively, seeing a fox in your dream indicates a period of isolation or loneliness. You need to take this time to ponder some issue or reflect upon your life. The dream could be a metaphor for someone who is a &quot;fox&quot;, as in a foxy lady.<\/p><p>To dream that a fox is flying into your window means that you need to be careful with who you trust. Someone in your waking life is up to no good.<\/p>"
    },
    {
        "title": "Foxglove",
        "desc": "<p>To see foxglove in your dream suggests that there is something that you are trying to hide or protect. Alternatively, it indicates that you are being insincere or overly cold toward some situation.<\/p>"
    },
    {
        "title": "Foyer",
        "desc": "<p>To dream that you are in a foyer indicates that you are about to make an important announcement or reveal something new about yourself.<\/p>"
    },
    {
        "title": "Fractal",
        "desc": "<p>To see a fractal in your dream signifies introspection and deep thought. There is some force trying to draw you in toward your subconscious. Alternatively, a fractal symbolizes your creative power and positive energy. Consider the color and shapes. Also consider what sort of emotions the image invokes for you.<\/p>"
    },
    {
        "title": "Fraction",
        "desc": "<p>To see fractions in your dream indicate that you are not feeling whole. You are looking for some completion or closure in some matter.<\/p>"
    },
    {
        "title": "Fracture",
        "desc": "<p>To dream that you have a fractured bone indicates that your sense of power is being threatened or compromised.<\/p>"
    },
    {
        "title": "Fragile",
        "desc": "<p>To dream that something is fragile indicates that there is some issue that you need to handle with care. Be gentle in your approach to some situation. Alternatively, the dream symbolizes your vulnerable side.<\/p>"
    },
    {
        "title": "Frame",
        "desc": "<p>To see a frame in your dream represents limitations and boundaries. You or someone else may be putting restrictions on you. Alternatively, it symbolizes vanity. The dream may be a pun on being &quot;framed&quot; for something you did not do. Or it is you who is framing someone else; your dream may be a reflection of a guilty conscience.<\/p><p>To frame a picture in your dream represents a wish to have a current situation or relationship remain the same as it is now. You dread change. Consider what is depicted on the picture for additional significance.<\/p>"
    },
    {
        "title": "Framed",
        "desc": "<p>To dream that you are being framed or set up implies self-guilt. You are refusing to take responsibilities for your actions. Instead, you tend to play the role of the victim.<\/p>"
    },
    {
        "title": "Framework",
        "desc": "<p>To see the framework of a house or other structures in your dream signify integrity and your basic, core characteristics. Houses in dreams represent your self and its framework is symbolic of your belief system. In particular, a wooden framework signifies a warm and yielding quality, where as a steel framework represents a cold and unyielding quality.<\/p>"
    },
    {
        "title": "Frankenstein",
        "desc": "<p>To see or dream that you are Frankenstein indicates that you are tormented or rejected by society. You feel alone and that no one understands you. Alternatively, the dream represents some fear that you do not know how to deal with.<\/p>"
    },
    {
        "title": "Fraternity",
        "desc": "<p>To dream that you are in or join a fraternity symbolizes brotherhood, camaraderie and\/or personal growth. If you are in a fraternity in your waking life, then the dream may just be a reflection of the waking relationship and bear no special significance.<\/p><p>To see fraternity members in your dream may be a metaphor that you need to be more open or friendly.<\/p>"
    },
    {
        "title": "Fraud",
        "desc": "<p>To dream that you are defrauding someone suggests that you need to reevaluate your own character. You may be using people or taking advantage of them in some way. Your dream may thus indicate a guilty conscience.<\/p><p>To dream that a fraud has been committed against you indicates that you are too trusting of others. Be aware of dishonest people around you. Perhaps you are subconsciously suspicious of someone.<\/p>"
    },
    {
        "title": "Freckles",
        "desc": "<p>To dream that you have freckles on your face represent your distinct and unique character. You will stand out in crowd.<\/p>"
    },
    {
        "title": "Freddy Krueger",
        "desc": "<p>To see Freddy Krueger in your dream represents your fears and the rejected aspects of yourself. You are refusing to acknowledge those negative parts. Alternatively, the dream indicates that you are desperate to get a grasp of a problem or situation. Dreaming of Freddy Krueger also implies that you are feeling neglected.<\/p>"
    },
    {
        "title": "Freedom",
        "desc": "<p>To dream about freedom suggests that you are feeling restricted and want to break away from a current situation. Or it is time for you to move out of your comfort zone. Alternatively, the dream may serve as a reminder for you to not take your personal liberties and independence for granted.<\/p>"
    },
    {
        "title": "Freemason",
        "desc": "<p>To dream that you are a freemason represents being part of something exclusive. It may also indicate that a promotion is in your future.<\/p><p>Dreaming of attending a meeting at a freemason lodge implies that you are seeking acceptance or approval. Alternatively, the dream means that there is a secret that you are trying to uncover.<\/p>"
    },
    {
        "title": "Freeway",
        "desc": "<p>To dream that you are on a freeway indicates that you are feeling liberated and free. You are well on your way to achieving your goals. If the freeway is slow moving or blocked, then it suggests frustrations or obstacles that are hindering your path toward your goals.<\/p><p>To dream that the freeway is under construction or is being reconstructed implies that you are experiencing a setback toward accomplishing your goals. Perhaps you need to rethink your approach in some task.<\/p>"
    },
    {
        "title": "Freezer",
        "desc": "<p>To see a freezer in your dream refers to you cold feelings. You are being too frigid. Alternatively, it suggests that you are preserving your ideas and energy so that you can access them later.<\/p>"
    },
    {
        "title": "Freight",
        "desc": "<p>To load freight in your dream suggests that you are carrying a heavy load. You are feeling overburdened.<\/p><p>To unload freight in your dream indicates that you are ready to rid yourself of all that extra baggage that is holding you back. You are ready to let go.<\/p>"
    },
    {
        "title": "Freighter",
        "desc": "<p>To see a freighter in your dream symbolizes the emotional baggage that you are holding onto and carrying around with you.<\/p>"
    },
    {
        "title": "French",
        "desc": "<p>If you do not speak French and you hear French in your dream signifies a sensual and romantic part of yourself. It is often referred to as the language of love. Alternatively, the dream represents your unwillingness to understand some issue. You are not giving enough attention to some waking relationship.<\/p><p>To dream that you are speaking French signifies an expression of love.<\/p>"
    },
    {
        "title": "French Fries",
        "desc": "<p>To see or eat French Fries in your dreamsuggests that you should not overlook the frivolous and seemingly minute things in life.<\/p>"
    },
    {
        "title": "French Kiss",
        "desc": "<p>To dream that you are French kissing in your dream suggests that you need to express emotions in a more honest way. Perhaps you need to show more passion or be more open with your sexuality.<\/p><p>To see others French kissing in your dream indicates that you are entangled in some relationship matter.<\/p>"
    },
    {
        "title": "French Toast",
        "desc": "<p>To see or dream that you are eating French toastindicates that you are satisfied with your current situation in life.<\/p>"
    },
    {
        "title": "Friday",
        "desc": "<p>To dream that it is Friday represents an end to some difficult task. Things are looking up for you. TGIF as the saying goes. In particular, to dream of your significant other on a Friday indicates that this is a meaningful day between the two of you. This may be the day you met, the day your broke up, or perhaps the day you two always went out. Whatever the significance, there is something personal between this particular day and which only you can correlate.<\/p>"
    },
    {
        "title": "Fridge",
        "desc": "<p>*Please see: <a href=\"#Refrigerator\">Refrigerator<\/a>.<\/p>"
    },
    {
        "title": "Fried Food",
        "desc": "<p>To dream of eating fried foods point to some anger issues. Alternatively, dreaming of eating fried foods suggests that you are looking for comfort and warmth. Maybe you are trying to downplay or suppress certain issues. More directly, the dream may indicate an unhealthy lifestyle or diet.<\/p>"
    },
    {
        "title": "Friend",
        "desc": "<p>To see friends in your dream signify aspects of your personality that you have rejected, but are ready to incorporate and acknowledge. The relationships you have with those around you are important in learning about yourself. In particular, to dream about your best friend means that you need to foster or acknowledge some special quality that your best friend has. Ask yourself what makes your best friend your best friend and how you need to work on these attributes within yourself. Alternatively, dreaming of a friend indicates positive news.<\/p><p>To dream that you are having sex with a friend refers to the closeness you share with your friend. Because you two share so much between each other and know so much about each other, the dreaming mind may depict this closeness as sex. Alternatively, such a dream indicates a level of attraction between you and your friend, but you are too afraid to act on it. Thus your desires are manifested in a dream.<\/p><p>To see your childhood friend in your dream signifies regression into your past where you had no responsibilities. Things were much simpler and carefree. You may be wanting to escape the pressures and stresses of adulthood. Consider the relationship you had with this friend and the lessons that were learned. Alternatively, the childhood friend suggests that you have been acting in a childish manner. You need to start acting like an adult.<\/p><p>To see friends from your past in your dream points to your desire to reconnect with a part of yourself that you have lost touch with. Perhaps it is time to pick up that old hobby or put a long hidden talent to use. A more direct interpretation of this dream may simply mean that you should look this friend up and reconnect with them.<\/p><p>To dream that your best friend is dying suggests that some aspect or quality that your best friend possess is dying within your own self.<\/p><p>Dreaming about your friend's friend signifies aspects of your own self that you are still trying to get to know.<\/p><p>If you dream of making a new friend, then it relates to self-acceptance and being true to yourself.<span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 1; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">The qualities you find in your new friend are qualities that you are embracing. You are proud of who you are and have a lot to offer other people.<\/p>"
    },
    {
        "title": "Frightened",
        "desc": "<p>To dream that you are frightened signifies temporary and fleeting worries.<\/p>"
    },
    {
        "title": "Fringe",
        "desc": "<p>To see fringe in your dream suggests that you are feeling torn up inside. You are not sure how to express yourself. In Native American culture, fringe in clothing symbolizes falling rain. Taking the interpretation one step further, falling rain is a metaphor for crying and tears. Alternatively, fringe indicates the beauty you find in others. The dream may also be a metaphor for someone who is on the edge or on the cusp of something new.<\/p>"
    },
    {
        "title": "Frisbee",
        "desc": "<p>To see or play Frisbee in your dream represents an easy-going attitude or a lack of competitive spirit. It also serves to remind you that situations and relationships in life are give and take.<\/p>"
    },
    {
        "title": "Frisk",
        "desc": "<p>To dream that you are getting frisked suggests that you are feeling emotionally vulnerable. You have let down your defenses and your guard. Alternatively, the dream means that you are feeling some sort of guilt and fear getting caught.<\/p><p>To dream that you are frisking someone implies mistrust. Who are you frisking? Alternatively, if you are frisking someone, then it may be a metaphor that you are feeling &quot;frisky&quot; or playful.<\/p><p>To see someone getting frisked indicates that you have nothing to hide.<\/p>"
    },
    {
        "title": "Frog",
        "desc": "<p>To see a frog in your dream represents a potential for change or the unexpected. The frog may be a prince in disguise and thus signify transformation, renewal or rebirth. Alternatively, the frog symbolizes uncleanness or fertility.<\/p><p>If you dream that a frog is catching or eating a bug, then it refers to seizing an opportunity. You need to know when to act and to act quickly.<\/p><p>To see frogs leaping in your dream indicate your lack of commitment. You have a tendency to jump from one thing to another. Alternatively, it may suggest that you are taking major steps toward some goal. It parallels your progress.<\/p><p>To dream that you are catching a frog signifies your carelessness concerning your health.<\/p><p>To hear the sounds of a frog in your dream indicates that you have not accomplished what you wanted.<\/p><p>To eat a frog in your dream represents some unsavory or unpleasant task that you need to perform. If you swallow a whole frog in your dream, then there is something that you need to do or say, that is literally difficult to swallow. Consider the phrase &quot;a frog in your throat&quot; to suggest that you are unable to speak. You feel you have lost your voice.<\/p>"
    },
    {
        "title": "Front",
        "desc": "<p>To see the front of something in your dream indicates that you expressing a desire to keep your distance. The dream may also be a pun on &quot;fronting&quot;. Are you being someone that you are not? Are you overly concerned about how you come across to others and how they see you?<\/p><p>To dream that someone is in front of you implies that there is something or someone you need to face. You can not avoid the issue or this person any longer. Alternatively, the dream represents an aspect of yourself that is surfacing from the subconscious.<\/p>"
    },
    {
        "title": "Frontier",
        "desc": "<p>To dream of a frontier signifies changes occurring in your life. You are going through some new life experiences and incorporating the lessons you learn from them into your Self.<\/p>"
    },
    {
        "title": "Frosting",
        "desc": "<p>To see or taste frosting in your dream represents the results of your creativity and\/or hard work. You have renewed confidence and self-assurance. New opportunities are now opened to you. Alternatively, the dream may point to how you are looking at things on a superficial level. You need to delve deeper in order to find the truth.<\/p>"
    },
    {
        "title": "Frozen",
        "desc": "<p>To dream that something is frozen represents something that has been suppressed, rejected, or denied. It could represent something this is not fully developed. Alternatively, the dream may refer to your emotions and cold or bitter feelings.<\/p><p>To dream that someone is frozen indicates your coldness toward that person or vice versa.<\/p>"
    },
    {
        "title": "Fruit",
        "desc": "<p>To see fruit in your dream signifies growth, abundance and financial gain. They also symbolize lust and sexuality. In particular, green fruit in your dream denotes your hastiness and disappointed efforts. You need to work harder and longer in order to achieve your goals. If the fruit is ripe, then it represents fertility and conception. You desire a child or you are ready to have a child.<\/p><p>To see or eat rotting\/bitter fruit represents your missed opportunities for growth and pleasure. Alternatively, it indicates a situation or relationship that ended prematurely. You are expressing some regret.<\/p><p>To dream that you buy or sell fruit indicates that your efforts are being wasted in a fruitless endeavor.<\/p><p>To see or eat dried fruit in your dream refers to old age and issues about aging. The dream may also relate to infertility.<\/p><p>* See Dream Moods' entries on specific fruits for more information.<\/p>"
    },
    {
        "title": "Frustration",
        "desc": "<p>To dream that you feel frustrated represents your difficulty in coping with a situation in your daily life. It may reflect concerns that your life is not going in the direction you want.<\/p>"
    },
    {
        "title": "Frying Pan",
        "desc": "<p>To see a frying pan in your dream represents completeness in love. Alternatively, it suggests that you need to start accepting the consequences of your actions. You may have found yourself in an inescapable situation.<\/p>"
    },
    {
        "title": "Fudge",
        "desc": "<p>To make or eat fudge in your dream indicates that you are enjoying life to the fullest. However, be careful not to overindulge in too many excesses. Alternatively, the dream may be a pun on how you are &quot;fudging&quot; some records or answers.<\/p>"
    },
    {
        "title": "Fuel",
        "desc": "<p>To dream that you run out of fuel suggests that you are lacking energy in your waking life. Alternatively, the dream indicates that your body may be deficient in vitamins or not getting enough nutrients.<\/p><p>If your dream involved jet fuel, then it refers to your high and upbeat energy level. You need to always be on the move.<\/p><p>*Please See Also: <a href=\"#Gasoline\">Gasoline<\/a>.<\/p>"
    },
    {
        "title": "Fugitive",
        "desc": "<p>To dream that you are a fugitive implies that you are refusing to accept responsibility for your actions. There is an issue that you are refusing to confront. Alternatively, the dream indicates that you are running away from a relationship or situation. You are feeling confined and restricted.<\/p><p>To see or aid a fugitive in your dream suggests that you are compromising your beliefs. Your integrity is being called into question.<\/p>"
    },
    {
        "title": "Fumigation",
        "desc": "<p>To dream that you are fumigating something indicates that you need to rid yourself of some negative influence in your life. You need to clean out these undesirable elements that are causing you more harm than good.<\/p>"
    },
    {
        "title": "Function",
        "desc": "<p>To dream that you are attending a function symbolizes your celebration of life. You are in a good place and are embracing what life has to offer. Alternatively, the dream may be a metaphor that you need to find &quot;purpose&quot; in life.<\/p>"
    },
    {
        "title": "Funeral",
        "desc": "<p>To dream of your own funeralsymbolizes an ending to a situation or aspect of yourself. You may be repressing some of your feelings or parts of yourself. Thus, the dream may be a signal for you to recognize and acknowledge those feelings. Instead of confronting a situation, you are dealing with it by burying it and trying to forget about it. If you are nearing death, a funeral dream may relate to your feelings\/anxieties about your own death.<\/p><p>To dream that you are at somebody else's funeral signifies that you are burying an old relationship and closing the lid on the past. You may be letting go some of the feelings (resentment, anger, hostility toward someone) that you have been clinging onto.<\/p><p>To dream that you are attending a funeral for a still-living parent suggests that you need to separate yourself from your parent's restrictions and confines. The symbolic death may give you the courage you need to take the next step toward your independence and autonomy.<\/p><p>To dream that you are at the funeral of an unknown person suggests that something in your life needs to put to rest or put aside so that you can make room for something new. You need to investigate further what aspect or component of your life you need to let go.<\/p><p>*Please also see: <a href=\"#Burial\">Burial<\/a>.<\/p>"
    },
    {
        "title": "Fungus",
        "desc": "<p>To see fungus in your dream represents negative emotions that are expanding and growing in your subconscious. You need to find a productive way to express them before it grows out of control.<\/p>"
    },
    {
        "title": "Funhouse",
        "desc": "<p>To dream that you are in a funhouse indicates that you have overcame your fears to the point where you can now chuckle at it. You need to learn to let loose. Alternatively, the dream may be eluding to your distorted or skewed sense of reality. The distortion is of your own self image.<\/p>"
    },
    {
        "title": "Funnel",
        "desc": "<p>To see or use a funnel in your dream suggests that you need to channel your emotions in a more effective way. You also need to spend some time to focus and build on your existing relationships.<\/p>"
    },
    {
        "title": "Funnel Cloud",
        "desc": "<p>To see a funnel cloud in your dream symbolizes anger that you are trying to hold back, but it must be expressed.<\/p>"
    },
    {
        "title": "Furby",
        "desc": "<p>To see or play with a Furby in your dream implies that you are not being clear in how your express yourself. As a result, there may have been a misunderstanding in some situation.<\/p>"
    },
    {
        "title": "Furnace",
        "desc": "<p>To see a furnace in your dream symbolizes power and energy. In particular, dreaming of a furnace in a basement implies that you are suppressing some energy or denying your own power.<\/p>"
    },
    {
        "title": "Furniture",
        "desc": "<p>To see furniture in your dream represents how you feel about yourself and your family. It refers to your relationships with others and how they fit into your life.<\/p><p>To dream that you are moving furniture indicates that you are going out of your way to please others. Also, you may be changing your ways and trying to reevaluate your relationships\/attitudes. Consider how easy or how difficult it is to move the furniture as they may indicate the level of burden or responsibility you are feeling.<\/p><p>To see old or worn furniture in your dream symbolizes outdated attitudes former relationships, and\/or old ways of thinking.<\/p><p>*Please also refer to specific pieces of furniture.<\/p>"
    },
    {
        "title": "Furry",
        "desc": "<p>To feel or see something furry in your dream symbolizes warmth. You feel complete emotionally.<\/p>"
    },
    {
        "title": "Furs",
        "desc": "<p>To see or wear furs in your dream represent prosperity, status, and luxury. You are shielded from the cold or from poverty. To others, furs can signify cruelty and torture. Alternatively, the dream may also be symbolic of your animalistic and instinctual nature.<\/p><p>If you are against wearing fur in real life, but dream that you are wearing fur suggests that someone is not who you thought they were. Or you are less than proud of yourself with something that you did.<\/p>"
    },
    {
        "title": "Fuse",
        "desc": "<p>To blow a fuse in your dream suggests that something in your life is in jeopardy of breaking down due to stress. The dream may also be a metaphor for losing your temper.<\/p>"
    },
    {
        "title": "Future",
        "desc": "<p>To dream that you are in the future signifies your hopes or your fears of how things will turn out. You are feeling apprehensive about the future.<\/p>"
    },
    {
        "title": "Fuzzy",
        "desc": "<p>To have a fuzzy dream indicates that there is something you are not confronting or are refusing to see. Life may be passing you by if you do not participate in it. It also represents secrets and confusion. Perhaps you think that someone is trying to keep something from you.<\/p><p>If you dream of a soft or fuzzy texture, then it implies a warm and welcoming situation.<\/p>"
    }
]