[
    {
        "title": "G",
        "desc": "<p>To see the letter &quot;G&quot; in your dream may be a pun on money.<\/p>"
    },
    {
        "title": "G-String",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/t2.htm#Thong\">Thong<\/p>"
    },
    {
        "title": "Gag",
        "desc": "<p>To dream that you are gagging denotes that you are not able to express yourself in how you really feel about a situation. Alternatively, this dream may forewarn that you need to keep quiet before you put your foot in your mouth.<\/p><p>To dream that you are being gaggedindicates that you are being prevented from saying what you really want to say.<\/p>"
    },
    {
        "title": "Gala",
        "desc": "<p>To dream that you are attending a gala symbolizes your celebration of life. You are in a good place and are embracing what life has to offer.<\/p>"
    },
    {
        "title": "Galaxy",
        "desc": "<p>To see the galaxy in your dream represents your creativity. It also means that you are looking at the broader picture and are more aware of your surroundings.<\/p>"
    },
    {
        "title": "Gale",
        "desc": "<p>To dream of being caught in a gale indicates that you are losing control on things that you never had control of in the first place. You need to find another way to approach and solve your problems. Alternatively, the dream may also be telling you that you are too serious. You need to lighten up.<\/p>"
    },
    {
        "title": "Gall Bladder",
        "desc": "<p>To dream of your gall bladder suggests that you need to rid yourself of negative energy. You need to let go of your guilt or bitterness in order to grow.<\/p>"
    },
    {
        "title": "Gallows",
        "desc": "<p>To see the gallows in your dream indicate that you are feeling threatened in your waking life. The dream may be a metaphor for something that you have left hanging or unfinished. If someone dies on the gallows, then it represents a transitional phase in your life.<\/p>"
    },
    {
        "title": "Gambling",
        "desc": "<p>To dream that are gambling suggests that you are too impulsive and relying too much on fate. You are not taking responsibility for your own decisions or actions. Alternatively, the dream symbolizes risk-taking activities.<\/p><p>If you are not a gambler and dream that you are gambling denotes that you need to take a chance or let up on yourself. Be a little more spontaneous!<\/p>"
    },
    {
        "title": "Game",
        "desc": "<p>To dream that you are hunting, shooting at, or killing game refers to the game of life. It also represents your ability to keep your animalistic nature in check and in control.<\/p>"
    },
    {
        "title": "GameShow",
        "desc": "<p>To dream that you are on a game show suggests that you need to change some aspect of your life around. You may be experiencing feelings of uncertainty and what the future may hold. Consider the type of game show or the name of the game show. What are you playing for and what is its significance relative to your waking life.<\/p>"
    },
    {
        "title": "Games",
        "desc": "<p>Todream that you are playing games indicates that you need to take a break from your daily life. It is time to relax. Alternatively, the dream symbolizes the spirit of competition and the rules you live by. Consider the type of game you are playing for additional significance.<\/p>"
    },
    {
        "title": "Gandhi",
        "desc": "<p>To dream of Gandhi indicates that you can still get your way without use of force. The dream serves to remind you of the power of the mind.<\/p>"
    },
    {
        "title": "Gang",
        "desc": "<p>To dream that you are a gang member signifies your need to achieve and accomplish things through force and intimidation. The dream draws attention to the primitive, unruly aspect of yourself.<\/p><p>To dream that you are confronted or threatened by a gang signifies circumstances or situations in your waking life that are becoming overwhelming. You feel that you are being &quot;ganged&quot; up on.<\/p>"
    },
    {
        "title": "Gangrene",
        "desc": "<p>To see someone affected with gangrene in your dream foretells of grief and loss.<\/p>"
    },
    {
        "title": "Gap",
        "desc": "<p>To see a gap in your dream suggests that you need to bring two sides together. The dream may also indicate that there is something lacking in your idea or argument.<\/p>"
    },
    {
        "title": "Garage",
        "desc": "<p>To dream that you are in a garage signifies a period of inactivity and idleness in your life. You feel that you are lacking direction or guidance in achieving your goals.<\/p><p>To dream that you are pulling your car into the garage represents security and stability brought about by your accomplishments and efforts.<\/p><p>To dream that you are opening the garage door denotes that you have made a decision about a matter. You have decided on the path you want to take to reach your opportunities and goals. On the other hand, if you are closing the garage door, then it suggests that you are putting off your goals for the sake of others around you.<\/p><p>To dream that there is a homeless family living in your garage indicates that something is missing in your life. Perhaps you are headed in the wrong direction. Your current path is leaving you unfulfilled and unsatisfied. Alternatively, the dream means that you need to be more resourceful and make the best of an undesirable situation.<\/p>"
    },
    {
        "title": "Garage Sale",
        "desc": "<p>To hold or be at a garage sale in your dream indicates that you are recycling past experiences and finding use for your old skills and ideas. You are learning from your past and making productive use of the lessons you have learned.<\/p>"
    },
    {
        "title": "Garbage",
        "desc": "<p>To dream that you are throwing away garbage suggests that you are kicking your old negative habits and throwing away your bad characteristics and unwanted traits.Alternatively, garbage indicates that you are not taking responsibility for something.<\/p><p>To see piles of garbage in your dream represent rejected or unwanted aspects of yourself.<\/p><p>To find something valuable in the garbage suggests that you can find value in the least expected of places. Do not undervalue or underestimate things. The dream may also be telling you that one man's trash is another man's treasure. Perhaps you need to view things from a different perspective.<\/p>"
    },
    {
        "title": "Garbage Can",
        "desc": "<p>To see a garbage can in your dream symbolizes unwanted ideas, thoughts or memories. It is time to rid yourself of the baggage. Alternatively, the garbage can means that you are rejecting an idea or emotion.<\/p>"
    },
    {
        "title": "Garbage Truck",
        "desc": "<p>To see or drive a garbage truck in your dream indicates that you need to rid yourself of your old habits. You are carrying around too much negativity.<\/p>"
    },
    {
        "title": "Garden",
        "desc": "<p>To see a vegetable or fruit garden in your dream indicates that your hard work and diligence will pay off in the end. It is also symbolic of stability, potential, and inner growth. You need to cultivate a new skill or nurture your spiritual and personal growth.<\/p><p>To see a flower garden in your dream represents tranquility, comfort, love and domestic bliss. You need to be more nurturing.<\/p><p>To see a sparse, weed-infested garden suggests that you have neglected your spiritual needs. You are not on top of things.<\/p><p>Dreaming of a tropical garden implies that you are seeking warmth and comfort.<\/p>"
    },
    {
        "title": "Garden of Eden",
        "desc": "<p>To dream that you are in the Garden of Eden suggests that you are seeking to recapture innocence that is lost. It is also a symbol of beauty, harmony and tranquility.<\/p>"
    },
    {
        "title": "Gardening",
        "desc": "<p>To dream that you are gardening symbolizes work or career issues. Consider how you feel about gardening or the condition of the garden and how it parallels a waking work issue or situation.<\/p>"
    },
    {
        "title": "Gargoyle",
        "desc": "<p>To see a gargoyle in your dream signifies hidden and embarrassing fears over some secret matters that you have not shared with anyone.<\/p>"
    },
    {
        "title": "Garland",
        "desc": "<p>To see a garland in your dream represents wholeness and completeness.<\/p><p>To dream that you are wearing a garland suggests a bond.<\/p>"
    },
    {
        "title": "Garlic",
        "desc": "<p>To dream that you are eating garlic signifies your practicality and sensibility in matters of the heart; you look for security over love.<\/p><p>To see a clove of garlic in your dream indicates protection against some danger. You will overcome your barriers.<\/p>"
    },
    {
        "title": "Garnet",
        "desc": "<p>To see a garnet in your dream symbolizes loyalty, vitality and devotion. Alternatively, the dream suggest that you are overcoming your negative feelings.<\/p>"
    },
    {
        "title": "Garret",
        "desc": "<p>To climb up to a garret in your dream indicates a general betterment of your life and an improvement in your financial situation.<\/p>"
    },
    {
        "title": "Garter",
        "desc": "<p>To see or dreamthat you are wearing a garter represents seduction and titillation. You are looking to be more sexual adventurous.<\/p>"
    },
    {
        "title": "Garuda",
        "desc": "<p>To see Garuda in your dream symbolizes agility, fear, fierceness, superiority and power. You are strongly connected to your spirituality. The dream also represents your courageous struggles toward achieving your highest ambitions and goals.<\/p>"
    },
    {
        "title": "Gas",
        "desc": "<p>To smell or see gas in your dream indicates that you need to be reenergized.There may be a situation in your life that you are having difficulty in getting a handle on.<\/p>"
    },
    {
        "title": "Gas Chamber",
        "desc": "<p>To dream that you or someone is in the gas chamber suggests that you need to get rid of something in your life that is causing you much sickness, distress, or negativity.It is even harmful to your well-being.<\/p>"
    },
    {
        "title": "Gas Mask",
        "desc": "<p>To see or wear a gas mask in your dream suggests that the information that you are receiving from others is being filtered. You are not getting the full information. Others may perceive you as fragile or vulnerable.<\/p>"
    },
    {
        "title": "Gas Station",
        "desc": "<p>To dream that you are at a gas station indicates a need to reenergize and revitalize yourself. You may be running low on energy and need to take time out to refuel. The dream also represents your ability to convert outside resources and use it for your own needs. Alternatively, dreaming that you are in a gas station means that you need to reach out to others and offer your help.<\/p>"
    },
    {
        "title": "Gas Tank",
        "desc": "<p>To dream that your gas tank is empty suggests that you need to stop and reenergize yourself. You may be feeling overextended.<\/p>"
    },
    {
        "title": "Gasoline",
        "desc": "<p>To see gasoline in your dream represents energy and spirituality. Thus, to dream that you run out of gas suggests that you are wearing yourself out. Take a time out.<\/p><p>To dream that you are filling your car with gasoline symbolizes your need to take better care of your Self. You need to be revitalized.<\/p><p>Dreaming that someone is pouring gasoline on you implies that an issue is burning up inside of you. You are holding in a lot of anger.<\/p><p>If you dream that you are buying the wrong gas for your car, then it implies that you are inefficient in how you complete your projects or goals.<\/p>"
    },
    {
        "title": "Gasp",
        "desc": "<p>To hear a gasp in your dream means that you need to stop and pay special attention to what is occurring or what is being said in the dream. Your subconscious is trying to alert you with a special message that you are overlooking.<\/p>"
    },
    {
        "title": "Gate",
        "desc": "<p>To see or pass through a gate in your dream suggests that you are walking through a new phase of life. It also represents new opportunities and possibilities, especially if the gate is opened or swinging.<\/p><p>To see a closed gate in your dream signifies your inability to overcome current difficulties. If you are unable to open the gate, then it indicates that your hard work will be seen as unsatisfactory. It may also mean that you are not ready or not prepared to move on to the next step.<\/p><p>To dream that you are climbing to the top of a gate suggests that you are trying to gain an upper hand on some situation. You want to know what is ahead for you before you commit to something. If you climb over the gate, then it means that you are looking for a shortcut in life. It may also refer to your impatience.<\/p>"
    },
    {
        "title": "Gatekeeper",
        "desc": "<p>To dream that you are a gatekeeper indicates that you need to be more careful about who you let into your life.<\/p>"
    },
    {
        "title": "Gathering",
        "desc": "<p>To see a gathering in your dream indicates that you are trying to merge various aspects of your character and personality. Perhaps you wish to incorporate the qualities of others into yourself. Consider how well you know these people for additional hints. The dream may also be a pun on &quot;gather&quot; or &quot;get something together&quot;, i.e. evidence, information or just stuff.<\/p>"
    },
    {
        "title": "Gauge",
        "desc": "<p>To see a gauge in our dream suggests that you need to better balance aspects of your life.<\/p>"
    },
    {
        "title": "Gauntlet",
        "desc": "<p>To see or wear a gauntlet in your dream indicates that you tend to handle issues or problems in an aggressive or physical manner. Alternatively, dreaming of gauntlets suggest that you are feeling defensive. Perhaps your strength or will is being put to the test.<\/p>"
    },
    {
        "title": "Gauze",
        "desc": "<p>To dream that you are dressed in gauze signifies uncertainty in wealth.<\/p>"
    },
    {
        "title": "Gavel",
        "desc": "<p>To see a gavel in your dream symbolizes justice, authority and absolute power. It may refer to a problem that you need to acknowledge and confront.<\/p><p>To dream that you are using a gavel represents a resolution to a problem. A decision has been made.<\/p>"
    },
    {
        "title": "Gay",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/h3.htm#Homosexual\">Homosexual.<\/p>"
    },
    {
        "title": "Gazebo",
        "desc": "<p>To see or dream that you are in a gazebo represents your openness and receptiveness toward some relationship. It also symbolizes your idealistic notions, contentment, and satisfaction.<\/p>"
    },
    {
        "title": "Gazelle",
        "desc": "<p>To see a gazelle in your dream symbolizes, grace, speed, and the soul. It also suggests that you should not take life so seriously. Lighten up.<\/p>"
    },
    {
        "title": "Gear",
        "desc": "<p>To dream that you are putting your car in gear suggests that you are ready to move forward with a new project in your life. You are headed into a new direction.<\/p>"
    },
    {
        "title": "Gears",
        "desc": "<p>To see gears in your dream symbolize cooperation and working together. You can not do it all by yourself.<\/p>"
    },
    {
        "title": "Gecko",
        "desc": "<p>To see a gecko in your dream represents an agreement or affirmation. The answer to a decision that you need to make is &quot;yes&quot;. Alternatively, the dream signifies renewal.<\/p>"
    },
    {
        "title": "Geese",
        "desc": "<p>To see geese in your dream represent domesticity and lifelong companionship. It may also indicate your tendency to go with the crowd. Alternatively, the dream means that you are well grounded.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/g2.htm#Goose\">Goose.<\/p>"
    },
    {
        "title": "Geisha",
        "desc": "<p>To see a geisha in your dream represents beauty, charm, poise and grace.<\/p><p>To dream that you are a geisha indicates that you are well-balanced in your personal, social, and professional life. You adjust well in various situations.<\/p>"
    },
    {
        "title": "Gel",
        "desc": "<p>To use hair gel in your dream represents your desire for order. You need everything to be in place.<\/p>"
    },
    {
        "title": "Gelatin",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/j.htm#Jelly\">Jelly.<\/p>"
    },
    {
        "title": "Gemini",
        "desc": "<p>To dream that someone is a Gemini represents your quick thinking ability and keen wit. You are versatile and able to adapt to any situation. Alternatively, it signifies your connections and your ability (or inability) to reach out to others.<\/p>"
    },
    {
        "title": "Gems",
        "desc": "<p>To see gems in your dream symbolize riches, ambition or spiritual protection. The dream may also be a metaphor for the attributes and things that you treasure and value.<\/p>"
    },
    {
        "title": "Gender",
        "desc": "<p>To dream about your gender indicates that you are evaluating your role and how you are perceived by society. Perhaps you are feeling self-conscious about specific gender roles. If you dream of the opposite gender than your own, then it means that you need to incorporate aspects of the opposite sex into your own character.<\/p><p>If you are pregnant and dream of the gender of the baby, then the dream reflects your waking preoccupation with the gender of the baby. It is normal to wonder whether you are having a boy or a girl. In fact, when others find out that you are pregnant, they often ask if you are having a boy or a girl. There is no evidence that dreams can &quot;tell&quot; you the sex of the baby.<\/p>"
    },
    {
        "title": "General",
        "desc": "<p>To see a general in your dream symbolizes experience and authority. A general may represent your father or father figure.<\/p><p>Dreaming that you are a military general refers to your ability to take charge of a situation and command attention. Others are depending on you.<\/p>"
    },
    {
        "title": "Generator",
        "desc": "<p>To see a generator in your dream symbolizes your motivation, drive and will to pursue your goals. Alternatively, the dream may be a metaphor that you are generating something new or different.<\/p>"
    },
    {
        "title": "Genie",
        "desc": "<p>To see a genie in your dream represents your creativity and mind power.Alternatively, the dream may mean that you have let the genie out of the bottle and are unable to control the consequences.<\/p>"
    },
    {
        "title": "Genitals",
        "desc": "<p>To dream of your genitals represent your feelings toward sex and sexuality and your attitudes toward femininity and masculinity. It also relates to issues of commitment and pleasure.<\/p><p>To dream that your genitals disappear indicate your fears or lack of confidence toward sex. You feel inadequate.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/p2.htm#Penis\">Penis and<a href=\"http:\/\/www.dreammoods.com\/v.htm#vagina\">Vagina.<\/p>"
    },
    {
        "title": "Genius",
        "desc": "<p>To dream that you are a genius represents your potential. Alternatively, you may be feeling inferior or not good enough.<\/p>"
    },
    {
        "title": "Genocide",
        "desc": "<p>To dream about a genocide points to your fear of other people's differences. You are having difficulties accepting others and their differences. Alternatively, the dream is a wake up call about the hostilities in the world.<\/p>"
    },
    {
        "title": "Geode",
        "desc": "<p>To see a geode in your dream symbolizes the beauty within. Things are not always what it seems. Thus you that you cannot always accept things at face value. Alternatively, the geode represents your spiritual connection. Consider the color and size of the geode.<\/p>"
    },
    {
        "title": "Geoduck",
        "desc": "<p>To see or eat geoduck in your dream represents your primal sexual desire. Your libido is on overdrive. Alternatively, the dream signifies longevity and toughness.<\/p>"
    },
    {
        "title": "Geography",
        "desc": "<p>To dream that you are studying geography foretells of much travels in your future. You like to learn about different cultures. Perhaps you are looking to move.<\/p>"
    },
    {
        "title": "Geometry",
        "desc": "<p>To dream about geometry refers to your understanding of your relationship with others and how your presence affects them.<\/p>"
    },
    {
        "title": "Georgia",
        "desc": "<p>To dream that you are in the state of Georgia suggests that you are longing for the comfort of home or of more familiar surroundings.<\/p>"
    },
    {
        "title": "Geranium",
        "desc": "<p>To see geranium in your dream symbolizes long lasting beauty and enduring elegance.<\/p>"
    },
    {
        "title": "Gerbil",
        "desc": "<p>To see a gerbil in your dream represents hyperactivity and energy. It may mean that you are seeking for social activity or companionship.<\/p>"
    },
    {
        "title": "German Shepherd",
        "desc": "<p>To see a German Shepherd in your dream highlights your protective instincts and attentiveness to a situation. This is no time for you to be nervous and\/or lose control.<\/p><p>To dream that you are training a German Shepherd suggests that you are open to new ideas and\/or easily influenced. You make be seeking some reassurance.<\/p><p>Dreaming of being attacked by a German Shepherd means that you have let your guard down and it is time to put it back up.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d2.htm#Dog\">Dog.<\/p>"
    },
    {
        "title": "Germs",
        "desc": "<p>To have a dream about germs represent small and irrational fears that you are feeling in your waking life. You may be lacking energy and motivation. Focus on your purpose and goals in life.<\/p>"
    },
    {
        "title": "Geyser",
        "desc": "<p>To see a geyser in your dream symbolizes an outburst of emotion. You need to acknowledge and express your pent up anger and feelings before they explode.<\/p>"
    },
    {
        "title": "Ghetto",
        "desc": "<p>To dream that you are in a ghetto indicates that you are emotionally impoverished. You are lacking support or love. Alternatively, the dream may be a reflection of your actual living situation.<\/p>"
    },
    {
        "title": "Ghillie Suit",
        "desc": "<p>To see or wear a ghillie suit in your dream represents your desires to blend into the background and not be noticed. Perhaps you are trying to hide from someone. Alternatively, the dream indicates that you want to be one with nature.<\/p>"
    },
    {
        "title": "Ghost",
        "desc": "<p>To see a ghost in your dream represents something that is no longer obtainable or within reach. It indicates that you are feeling disconnected from life and society. Try to figure out what the ghost wants or what it is looking for. The dream may also be a calling for you to move on and abandon your outdated modes of thinking and behavior.<\/p><p>To see your own ghost in your dream symbolizes aspects of yourself that you fear. This may involve a painful memory, guilt, or some repressed thoughts. Or you may be afraid of death and dying.<\/p><p>To dream that you turn into a ghost implies that you are desperate to escape from a situation.<\/p><p>To dream that you reach out to touch a ghost, but it disappears indicates that you are taking steps to acknowledging some painful or repressed thoughts even though you are not ready to fully confront them.<\/p><p>To see the ghost of a living relative or friend in your dream signifies that you are in danger of malice acts by that person.<\/p><p>To see the ghost of a dead friend\/relative in your dream suggests guilt and regrets concerning the past relationships with that particular person.<\/p><p>To dream that ghosts are trying to kill you implies that you are ready to confront your past and your repressed emotions, despite how painful it may be. You are ready to move forward with your life and leave the past behind. If a ghost is choking you in your dream, then it means that some past situation is preventing you from fully expressing yourself.<\/p><p>Dreaming that you are being stalked or haunted by a ghost indicates that you are refusing to confront issues from your past which is affecting your present life.<\/p>"
    },
    {
        "title": "Ghost Town",
        "desc": "<p>To dream that you are in a ghost town suggests that you are feeling rejected by society. You may be isolating yourself from others. Alternatively, the dream means that you are living in the past and clinging onto memories. It is time to let go and live in the present times.<\/p>"
    },
    {
        "title": "Ghoul",
        "desc": "<p>To see a ghoul in your dream suggests that your habits and negative ways are hindering your growth. The dream may also represent a fresh beginning.<\/p>"
    },
    {
        "title": "Giant",
        "desc": "<p>To see a giant in your dream indicates a great struggle between you and your opponents. You are trying to overcome an overwhelming obstacle. Alternatively, a giant symbolizes an issue, a person or a feeling that is dominating you.You are having an inferiority complex.<\/p><p>To dream that you turn into a giant indicates feelings of inferiority.<\/p>"
    },
    {
        "title": "Gift",
        "desc": "<p>To dream that you are giving a gift signifies your generosity towards others. Alternatively, you may be trying to express some feeling or have something awkward to say that has to be carefully packaged. If you are showering someone with gifts, then it indicates that you are being overly pushy with your advice. Or that you are trying too hard to be accepted.If you are buying or giving someone expensive gifts, then it symbolizes the sacrifices you are making for that person. You want to make them feel important.<\/p><p>To dream that you receive a gift indicates that you are being rewarded and recognized for your generosity and giving nature. You are held in high esteem by those around you.If someone gives you an inappropriate gift, then it suggests that you are the subject of unwelcome attention from someone. If you dream that you give someone an inappropriate gift, then it suggests that your true nature will eventually be exposed. Analyze the gift you give or receive for additional significance.<\/p><p>To see a pile of gifts symbolizes unutilized or unrecognized skills and talents.<\/p><p>To open a gift and find something disgusting inside symbolizes disappointments or unexpected failures.<\/p>"
    },
    {
        "title": "Gift Card",
        "desc": "<p>To see a gift card in your dream means that there is something you didn't realize you needed or that there is something missing from your life. Ask yourself which store the gift card is for and how it relates to something you may be lacking.<\/p>"
    },
    {
        "title": "Gift Wrap",
        "desc": "<p>To see gift wrap in your dream suggests that there is something that you are trying to cover up or hide. You are trying to present something unpleasant in a more inviting or cheerful manner. Consider what you are wrapping, as well as the color, pattern and occasion of the wrapping paper for additional significance. Alternatively, the dream symbolizes celebration and happiness. You are acknowledging a special occasion.<\/p>"
    },
    {
        "title": "Gig",
        "desc": "<p>To dream of playing at a gig represents a freedom of expression and the ability to let go of the confines in your daily life.<\/p>"
    },
    {
        "title": "Gills",
        "desc": "<p>To dream that you have gills implies that you are ready to confront your true feelings and submerge yourself in your emotions.<\/p>"
    },
    {
        "title": "Ginger",
        "desc": "<p>To see ginger in your dream indicates security and comfort in your life. However, you need to add a little more excitement and variety to you life.<\/p>"
    },
    {
        "title": "Gingerbread",
        "desc": "<p>To see or eat gingerbread in your dream refers to homeliness and the comforts of home. You are in a happy place. In particular. to see a gingerbread man signifies family togetherness and joy.<\/p>"
    },
    {
        "title": "Ginseng",
        "desc": "<p>To see ginseng in your dream represents virility, longevity and life."
    },
    {
        "title": "Giraffe",
        "desc": "<p>To see a giraffe in your dream suggests that you need to consider the overall picture. Take a broader view on your life and where it is headed. The dream may also be a metaphor on how you are &quot;sticking your neck out&quot; for someone.<\/p><p>To dream that you are riding a giraffe represents your desire to stand up amongst the crowd. You want attention, but aren't getting it.<\/p><p>To dream that a giraffe is running implies that you are avoiding the truth. It also suggests that you saw something that you shouldn't have seen.<\/p>"
    },
    {
        "title": "Girdle",
        "desc": "<p>To dream that you are wearing a girdle suggests that you are feeling restricted and limited in the expression of your ideas and feelings. Alternatively, the dream points to your tendency to bear pain in order to please others.<\/p>"
    },
    {
        "title": "Girl Scout",
        "desc": "<p>To dream that you are a girl scout symbolizes sisterhood, camaraderie, characters and strong values. You need to exemplify these qualities.<\/p><p>To see a girl scout in your dream suggests that you need to be more dedicated to your goals and achievements. Alternatively, a girl scout may represent model behavior which you are trying to emulate.<\/p>"
    },
    {
        "title": "Girlfriend",
        "desc": "<p>To see your girlfriend in your dream represents your waking relationship with her and how you feel about her.<\/p><p>To dream that you are pretending to be someone's girlfriend implies that you are not ready to settle down into a committed relationship. You don't want to be tied down.<\/p><p>To dream that you are meeting your girlfriend's parents is a rehearsal for the actual meeting. You may be nervous about meeting them and it's probably been weighing on your mind. If you have already meet your girlfriend's parents and dream of meeting them again, then the dream is a reminder for you to be on your best behavior. You tend to be more on your toes when it comes to someone else's parents.<\/p><p>Dreaming that you are watching your girlfriend have sex with someone else suggests that you are taking a passive role in your sex life. Maybe you feel that you are not satisfying her. The dream is signaling you to communicate your sexual concerns and\/or desires. Alternatively, the dream may reflect a personal fantasy you have.<\/p>"
    },
    {
        "title": "Girls",
        "desc": "<p>To see a girl in your dream represents your playful, innocent, and childlike nature. Perhaps you are behaving immaturely in some situation. Alternatively, a girl represents the feminine qualities of your character.<\/p><p>To dream about a girl that you just met represents your anxieties and thoughts of whether you had made a good impression on her and what she thought of you. If she told you that she disliked you in the dream, then it may be an excuse for you to dismiss her and not pursue a relationship further.<\/p>"
    },
    {
        "title": "Giving",
        "desc": "<p>To dream that you are giving something away indicates that you need to give more in some relationship or situation. To be able to give helps fulfill your need to share and to belong.Consider also how you were received.<\/p><p>To dream that something is given to you suggests that you need to appreciate the gifts you have.<\/p>"
    },
    {
        "title": "Gizzard",
        "desc": "<p>To see or eat gizzards in your dream refers to a difficult or emotional situation that you are trying to process and understand.<\/p>"
    },
    {
        "title": "Glacier",
        "desc": "<p>To see a glacier in your dream refers to your cold feelings. You are shutting down emotionally. Alternatively, glaciers denote evitable changes.<\/p>"
    },
    {
        "title": "Gladiator",
        "desc": "<p>To dream that you are a gladiator represents a situation where you are fighting for your survival. You feel that others are working against you. Alternatively, the dream means that you are confronting issues from your subconscious.<\/p>"
    },
    {
        "title": "Gladiolas",
        "desc": "<p>To see gladiolas in your dream represent heartaches and issues of the heart. It serves to remind you that sometimes love hurts.<\/p>"
    },
    {
        "title": "Glass",
        "desc": "<p>To see glass in your dream symbolizes passivity or protection. You may be putting up an invisible barrier to protect yourself in a situation or relationship. If the glass is dirty, cloudy or discolored, then it suggests that you are not seeing something clearly. You need more clarity in a situation. To dream that you are drinking from a glass is an omen of good luck.<\/p><p>To dream that you are looking through glass represents your openness and non-defensiveness. Alternatively, you may be putting up an invisible emotional barrier around yourself.<\/p><p>To see broken glass in your dream signifies disappointments and negative changes in your life. Alternatively, it could be symbolic of an aspect of your life that is in pieces. A relationship or situation has come to an abrupt and untimely end. If you are walking on broken glass, then it suggests that you will be experiencing some heartache or pain.You are unsure with how to proceed with your life.<\/p><p>Dreaming of glass suddenly shattering symbolizes a major breakthrough in some area of your life. You have overcome some obstacle.<\/p><p>To dream that you are eating glass highlights your vulnerability, confusion and frailty. You may have difficulties in communicating your thoughts across and getting the right words out. Alternatively, it may symbolize your hurtful and cutting comments. Perhaps you have been hurt or disappointed by something that someone had said. Or you need to be careful in how you phrase and word things or run the risk of offending others.<\/p>"
    },
    {
        "title": "Glass Case",
        "desc": "<p>To see a glass case in your dream implies that you are distancing yourself emotionally from some situation or relationship. You are guarded about your feelings. Consider the significance of what is inside the glass case. Alternatively, the dream symbolizes a cherished memory.<\/p>"
    },
    {
        "title": "Glass House",
        "desc": "<p>To see a glass house in your dream suggests that you need to be cautious about what people are telling you. They may be telling you what you want to hear, and not necessarily what you need to hear.<\/p><p>To dream that you are living in a glass house signifies a threat to your reputation. It may also suggest that you are being watched or are under scrutiny. Consider the proverb of how people who live in glass houses shouldn't throw stones. In other words, the dream may be advising you not to criticize others, especially if you are also guilty of those same faults. You need to be more accepting.<\/p>"
    },
    {
        "title": "Glass Slipper",
        "desc": "<p>To see or wear glass slippers in your dream symbolize truth and transformation.<\/p>"
    },
    {
        "title": "Glassblower",
        "desc": "<p>To see a glassblower in your dream represents your ability to mold and shape the lives around you.<\/p>"
    },
    {
        "title": "Glassware",
        "desc": "<p>To see a drinking glass in your dream signifies healing, rejuvenation, and healing. Alternatively, it indicates a transcendence into a realm of higher consciousness. Is the glass half-full or half-empty? Do you see life from an optimistic or pessimistic point of view. Consider also the contents of the glass. If you are drinking from a glass, then it is a positive omen.<\/p><p>To see a broken glass in your dream denotes feelings of powerlessness, guilt and\/or low self-esteem. Perhaps you feel unqualified or inadequate in dealing with a situation. You believe others can see your shortcomings or insecurities.<\/p><p>To dream that you are washing glassware or drinking glasses suggests that you are looking for clarity in a situation.<\/p><p>Dreaming that you throw a drinking glass on the ground and it doesn't break as expected refers to your resilience and your ability bounce back from hardship. You or someone is not as fragile as you had thought.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/e2.htm#Eyeglasses\">Eyeglasses.<\/p>"
    },
    {
        "title": "Glider",
        "desc": "<p>To see or ride a glider in your dream represents your tendency to go with the flow of things instead of taking your own initiative and making changes in your life. It may also mean that things are a breeze for you.<\/p>"
    },
    {
        "title": "Glitter",
        "desc": "<p>To see or throw glitter in your dream suggests that you need to be more outgoing. Express yourself! The dream may also be a metaphor for fame, glitz, and glamour, as in the glitter of Hollywood.<\/p><p>To dream that something is glittering indicates that something or someone is trying to get your attention. Alternatively, the dream may indicate that things are not always what it seems. Consider the phrase &quot;all that glitters is not gold.&quot; Don't be fooled by what is on the outside or how things may appear to be.<\/p>"
    },
    {
        "title": "Globe",
        "desc": "<p>To see a globe in your dream suggests that you need to step back and look at the wider perspective. It also indicates that you are in complete control of your life.<\/p><p>To see a spinning globe in your dream signifies that your life is going out of control.<\/p>"
    },
    {
        "title": "Gloomy",
        "desc": "<p>To be surrounded by gloomy things and situations in your dream indicates that you need some direction or clarity in a waking situation. A situation or person in your life is having a negative impact on you.<\/p>"
    },
    {
        "title": "Gloves",
        "desc": "<p>To see or wear gloves in your dream represent the way you handle things. You are getting a handle on a problem. Consider the phrase &quot;handle with kid gloves&quot; and how you need to be more cautious in some situation. Or perhaps you are overly cautious. Alternatively, wearing gloves may mean that your creative abilities are still latent. You need to acknowledge and express that creative side.<\/p><p>To dream that you are taking off gloves symbolize respect.<\/p><p>To dream that you are wearing work gloves represent a difficult situation that may get your hands dirty. If you are wearing driving gloves, then it means that you need to take control of your life. If you are wearing boxing gloves, that it indicate that you are involved in a some sort of conflict. Is there something in your life that you are struggling with? To wear white gloves in your dream signify luxury and richness.<\/p><p>To dream that you throw a glove on the floor suggests that you need to challenge or address someone about an issue that is bothering you.<\/p>"
    },
    {
        "title": "Glow",
        "desc": "<p>To see a glow in your dream symbolizes enlightenment and understanding. New light has been shed onto a situation. You have gained a fresh perspective.<\/p><p>To dream that a person is glowing means that you finally understand this person in a new way. Alternatively, a person who is glowing represents someone who is offering their guidance and support.<\/p>"
    },
    {
        "title": "Glow Stick",
        "desc": "<p>To see a glow stick in your dream indicates a new direction that you are taking. You may also be seeking some guidance in the course of your actions.<\/p>"
    },
    {
        "title": "Glue",
        "desc": "<p>To see glue in your dream indicates a fear of being trapped in some situation and not being able to get out of it. You have a fear of partnership or commitment and a general distrust of people around you. On the flip side, you may be too clingy. Alternatively, you are holding on to some false hope.<\/p><p>To dream that you are gluing something together suggests that you are piecing together aspects of yourself and acknowledging those previously rejected parts.Alternatively, the dream may be a metaphor for a sticky situation.<\/p>"
    },
    {
        "title": "Gnat",
        "desc": "<p>To see a gnat in your dream signifies some nagging or annoying issue. Alternatively, it represents that a sweet opportunity is nearby.<\/p>"
    },
    {
        "title": "Gnaw",
        "desc": "<p>To dream that you are gnawing at something suggests that you are trying to attack or confront a situation or problem that has been menacing you. The dream may also be a metaphor to mean &quot;nah&quot; or &quot;no&quot;.<\/p>"
    },
    {
        "title": "Gnome",
        "desc": "<p>To see a gnome in your dream signifies the inner child and its fantasies. Alternatively, a gnome represents protection, luck, fruitfulness and fertility.<\/p>"
    },
    {
        "title": "Gnu",
        "desc": "<p>To see a gnu in your dream indicates a lack of control in your life. You are letting your bitter feelings and negative emotions get the best of you. Alternatively, a gnu may be a pun on &quot;knew&quot;. The dream may be telling you that you already hold the truth.<\/p>"
    },
    {
        "title": "Go-Kart",
        "desc": "<p>To see or drive a go-kart in your dream represents your ability to navigate through life's twists and turns. The dream may also be a pun on your &quot;drive&quot; and ambition.<\/p>"
    },
    {
        "title": "Goal",
        "desc": "<p>To score a goal in your dream symbolizes your achievements and successes. Your path to success is within reach. The dream may also be a metaphor for the goals you have in your life. Or it may suggests that you need to start making goals for your future.<\/p><p>To miss a goal in your dream indicates that you are not utilizing all your resources to achieve your goals. You need to reevaluate your choices.<\/p>"
    },
    {
        "title": "Goal Post",
        "desc": "<p>To see a goal post in your dream symbolizes your personal goals or an opportunity that is within your grasp. Alternatively, the dream means that you need to be more receptive to some idea or notion.<\/p>"
    },
    {
        "title": "Goalie",
        "desc": "<p>To see or dream that you are a goalie represents your capabilities and your ability to achieve. You are feeling confident and empowered.<\/p>"
    },
    {
        "title": "Goat",
        "desc": "<p>To see a goat in your dream represents your lack of judgment and your gullibility. Alternatively, goats are symbolic of sexuality, sexual desire, and lechery. Also consider the associations with the goat as in &quot;scapegoat&quot; or &quot;getting someone's goat&quot;. Do you feel that you have been blamed for someone else's deed?<\/p><p>To dream that a billy goat butts you forewarns of deceit, underhandedness, and lies.<\/p>"
    },
    {
        "title": "Goatee",
        "desc": "<p>To see someone with a goatee in your dream represents mistrust and dishonesty.<\/p><p>Dreaming that you have a goatee means that you need to approach a problem via unconventional methods. Think outside the box. The dream may also be telling you to go against the crowd.<\/p>"
    },
    {
        "title": "Goblet",
        "desc": "<p>To see or drink from a goblet in your dream symbolizes the womb and the feminine. It also means that you are open to new ideas and receptive to change. Alternatively, a goblet represents your ability to enjoy the smaller things in life.<\/p>"
    },
    {
        "title": "Goblin",
        "desc": "<p>To see a goblin in your dream refers to a negative person who is working against you. Or it may mean that you have a self-defeatist attitude. You are already setting yourself up for failure.<\/p>"
    },
    {
        "title": "God",
        "desc": "<p>To see God in your dream signifies your spirituality and expression of your feelings about divinity. God also symbolizes an untouchable, unreachable, and unattainable notion of perfection. Thus such a dream may highlight your struggles and attempts with trying to be perfect.<\/p><p>To dream that you are worshipping God signifies repentance of your actions and errors.<\/p><p>To dream that God speaks to you signifies feelings of guilt, eternal punishment, and damnation.<\/p><p>To dream that you are a god implies your own special talents which you have not yet recognized or fully developed. Alternatively, it refers to your feelings of superiority over others. You think you are above others and have a tendency to look down on people.<\/p><p>To dream that God has the bluest eyes refers to your deep and intimate connection with God. Through his eyes, you also see his wisdom and devotion. He is your spiritual guide.<\/p><p>**See the Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=bridgedream1\">God Is Dead&quot;<\/p>"
    },
    {
        "title": "Goddess",
        "desc": "<p>To see a goddess in your dream symbolizes your femininity or feminine side. For a man to dream of a goddess indicates his fears about the female.<\/p>"
    },
    {
        "title": "Godfather",
        "desc": "<p>To see your godfather in your dream signifies a fear for authority. If you have a godfather in real life, then it is important to consider your personal relationship with him.<\/p><p>To dream that you are a godfather indicates that you are an authority figure. Someone is looking to you for advice.<\/p>"
    },
    {
        "title": "Godmother",
        "desc": "<p>To see your godmother in your dream indicates that you are looking for advice and direction in life.<\/p><p>To dream that you have a fairy godmother refers to your need to feel protected. Perhaps you are unsure about a decision you are making.<\/p>"
    },
    {
        "title": "Godzilla",
        "desc": "<p>To see Godzilla in your dream signifies feelings of being out of control. A certain situation is getting the best of you.<\/p><p>**See the Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/chasedreams.pl?method=exact&amp;header=dreamid&amp;search=chasedream9\">Godzilla In K-Mart&quot;<\/p>"
    },
    {
        "title": "Goggles",
        "desc": "<p>To see or wear goggles in your dream suggest that you are trying to protect yourself from emotional harm. Perhaps you need to confront something in your waking like that you know is hurting you.<\/p>"
    },
    {
        "title": "Goiter",
        "desc": "<p>To dream that you have a goiter indicates that you are overlooking some minor issue that will have significant consequences. Alternatively, a goiter represents a situation that you are having difficulty confronting or accepting.<\/p>"
    },
    {
        "title": "Gold",
        "desc": "<p>To see gold in your dream symbolizes wealth, riches, natural healing, illumination and\/or spirituality.It is also a symbol of love, longevity and domestic bliss. Negatively, gold may represent greed, corruption and temptation.<\/p><p>To find gold in your dream indicates that you have discovered something valuable about yourself. This may be some hidden talent or knowledge.<\/p><p>To bury gold in your dream suggests that you are trying to hide something about yourself.<\/p>"
    },
    {
        "title": "Gold Digger",
        "desc": "<p>To dream that you are a gold digger implies that you have an extremely high sense of self worth.<\/p><p>Dreaming that someone is a gold digger indicates that you are reevaluating your own path to success.<\/p>"
    },
    {
        "title": "Gold Leaves",
        "desc": "<p>To see gold leaves in your dream indicates a pleasant and bright future ahead for you.<\/p>"
    },
    {
        "title": "Golden Gate Bridge",
        "desc": "<p>To see the Golden Gate Bridge in your dream signifies hope, possibilities and activism. The Golden Gate Bridge is also an indication that you are going through an important transition.<\/p>"
    },
    {
        "title": "Golden Retriever",
        "desc": "<p>To see a golden retriever in your dream represents your family ideals. The dream may also be a pun on something that you need to &quot;retrieve&quot; or regain control of.<\/p>"
    },
    {
        "title": "Goldenrod",
        "desc": "<p>To see a goldenrod in your dream indicates that something or someone is causing you much annoyance and irritation.<\/p>"
    },
    {
        "title": "Goldfinch",
        "desc": "<p>To see a goldfinch in your dream symbolizes your soul. It is also an indication of the sacrifices you have made.<\/p>"
    },
    {
        "title": "Goldfish",
        "desc": "<p>To see a goldfish in your dream signifies, wealth, success, and pleasant adventures. Alternatively, goldfish represents some important emotional matter or valuable insight.<\/p>"
    },
    {
        "title": "Golf",
        "desc": "<p>To dream that you are playing or watching golf signifies pleasant indulgences. It may also indicate that you are idling and wasting time. Alternatively, the dream symbolizes your individual accomplishments and your drive to succeed.<\/p><p>To dream that you are on a golf course represents your desires for freedom. You want to escape the grind of your occupation. Alternatively, the dream may be a pun of how you are green or environmentally conscious.<\/p><p><span id=\"ucPreviewMsg_lblMessage0\" class=\"PreviewMsgText visualIEFloatFix\">Dreaming that you are attending a golf tournament indicates that you are not getting the full picture. You are only seeing what you want to see.<\/p>"
    },
    {
        "title": "Golf Ball",
        "desc": "<p>To see a golf ball in your dream symbolizes a frivolous matter or situation. Don't let the small things get to you.<\/p>"
    },
    {
        "title": "Golf Cart",
        "desc": "<p>To see or ride a golf cart in your dream suggests that you are too lackadaisical in the pursuit of your goals. You have no sense of urgency in things.<\/p>"
    },
    {
        "title": "Golf Club",
        "desc": "<p>To see or hold a golf club in your dream symbolizes your drive, energy and determination. These are the qualities that you need to achieve your goals.<\/p><p>Dreaming of a bag of golf clubs highlights exclusivity, wealth and prestige.<\/p>"
    },
    {
        "title": "Golf Tee",
        "desc": "<p>To see or use a golf tee in your dream refers to your supporting role in a situation. Don't underestimate your abilities and what you can offer to a situation.<\/p>"
    },
    {
        "title": "Gondola",
        "desc": "<p>To see or ride in a gondola in your dream refers to romance, fantasy, and idealistic love. Things are going well in your relationship or some aspect of your waking life. Alternatively, a gondola indicates your need to take time off and go off on an adventure.<\/p>"
    },
    {
        "title": "Gong",
        "desc": "<p>To hear the sound of a gong in your dream represents an end or beginning of something. The sound may be alerting you to something that needs your immediate attention. Alternatively, the gong symbolizes protection from some negative or evil force.<\/p>"
    },
    {
        "title": "Goodbye",
        "desc": "<p>To dream that you are saying goodbye to someone indicates an end to your worries, to a relationship or and to a chapter in your life. You are moving on into a new stage of your life.<\/p><p>To dream that someone is saying goodbye to you suggests that you are going on a journey of self-discovery. You are entering a new phase in your life.<\/p>"
    },
    {
        "title": "Goon",
        "desc": "<p>To dream that you have your own goons or that you are surrounded or chased by goons mean that there is an issue that you are avoiding. You have unresolved inner conflicts and are refusing to address certain issues or feelings directly.<\/p>"
    },
    {
        "title": "Goose",
        "desc": "<p>To see a goose in your dream symbolizes fertility and motherly love. The goose may also represent a message from your subconscious.Alternatively, the dream suggests that you are on a &quot;wild goose chase&quot;. Perhaps you are going about a problem all wrong.<\/p>"
    },
    {
        "title": "Goose Egg",
        "desc": "<p>To dream that you have a goose egg on your head means that you are acting impulsively. You are not thinking through the consequences of your action.<\/p>"
    },
    {
        "title": "Goosebumps",
        "desc": "<p>To dream that you have goosebumps indicate validity and truth to what you have just said or heard. Alternatively, it may symbolize fear and\/or your frigid attitude.<\/p>"
    },
    {
        "title": "Gooseberries",
        "desc": "<p>To pick or gather gooseberries in your dream signify a happy and bright outlook. You have successfully overcome your problems.<\/p><p>To see or eat gooseberries in your dream suggest that you are enjoying your time of leisure.<\/p>"
    },
    {
        "title": "Gopher",
        "desc": "<p>To see a gopher in your dream means that you are being used and manipulated by others. Alternatively, the dream may be a pun on &quot;go for&quot; it. You need to take initiative and act now.<\/p>"
    },
    {
        "title": "Gorilla",
        "desc": "<p>To see a gorilla in your dream suggests that you may be too &quot;over the top&quot; in your behavior. Perhaps you are compensating for your rigidity and stiffness in your waking life. Alternatively, the gorilla symbolizes your primitive impulses, wild nature and repressed sexual energy.<\/p>"
    },
    {
        "title": "Gossip",
        "desc": "<p>To dream that you are gossiping suggests that you are engaging in counterproductive activity.<\/p><p>To hear gossip in your dream indicates that you are using others to get information that may not be accurate.<\/p>"
    },
    {
        "title": "Goth",
        "desc": "<p>If you are not goth in waking life, but dream that you or someone is goth, then it refers to something that you are still trying to understand. Perhaps it is your feelings that you are trying to understand. Alternatively, the dream implies that you are going against the masses and expressing your own personal freedom.<\/p>"
    },
    {
        "title": "Gourd",
        "desc": "<p>To see a gourd in your dream represents abundance, longevity and fertility. It is also a feminine symbol denoting the womb.<\/p>"
    },
    {
        "title": "Gout",
        "desc": "<p>To dream you have gout represents obstacles. Something may be hindering or slowing your progress.<\/p>"
    },
    {
        "title": "Government",
        "desc": "<p>To dream of the government signifies power and the qualities or feelings that rule your life. Do greed, lust, or love guide you in how you live? The dream may also reflect your views about society at large.<\/p>"
    },
    {
        "title": "Gown",
        "desc": "<p>To see or wear an evening gown in your dream represents enjoyment, social pleasures, grace and culture. It also represents the image that you are projecting to others. Consider the color and design of the gown for additional significance. If the gown is very fancy or ornate, then it signifies an elaborate and luxurious lifestyle. If the gown is plain or simple, then it suggests a simplified lifestyle. Alternatively, to dream you are wearing an evening gown indicates that you are looking for happiness.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/n2.htm#Nightgown\">Nightgown.<\/p>"
    },
    {
        "title": "GPS",
        "desc": "<p>To dream that you are using a GPS indicates that you are on a path of self discovery. It symbolizes your goal and purpose in life.<\/p>"
    },
    {
        "title": "Grade",
        "desc": "<p>To see your grade in your dream represents how well you are doing in life's lesson and how your are progressing through each stage in your life. Consider the significance of the letter. Perhaps it refers to someone's initials.<\/p>"
    },
    {
        "title": "Graduation",
        "desc": "<p>To dream that you are at a graduation represents your achievements. You are successfully transitioning to a higher level and moving forward to important things.<\/p><p>To dream that you do not have enough units or credits to graduate suggests that you are not giving yourself enough credit to your successes and achievements. You are short-changing yourself of your accomplishments.<\/p><p>To dream that you forget your graduation means that you are not mentally prepared for the next phase of your life. You are subconsciously trying to hold yourself back.<\/p>"
    },
    {
        "title": "Graffiti",
        "desc": "<p>To see graffiti in your dream indicates that you have low self-worth. If the graffiti in your dream is a positive symbol, then it suggests that you see the good in everything and everyone.<\/p>"
    },
    {
        "title": "Grafting",
        "desc": "<p>To dream that you are grafting something indicates that you are making connections and bonds. You may be bringing together two different things that would better exist apart.<\/p>"
    },
    {
        "title": "Grain",
        "desc": "<p>To see grains your dream signify abundance, wealth, fertility, growth and happiness. It also represents all the hard work that you have done and completed.<\/p>"
    },
    {
        "title": "Grammar",
        "desc": "<p>To dream that you are studying grammar suggests difficulties in getting your point across and communicating your ideas.<\/p>"
    },
    {
        "title": "Grandchild",
        "desc": "<p>To see your grandchild in your dream represents the renewal of life and reflection of your own past.It refers to your family line, generations and tradition, as well as innocence and purity. Alternatively, you may be expressing a desire to escape from your daily responsibilities and problems.<\/p>"
    },
    {
        "title": "Grandfather",
        "desc": "<p>To see your grandfather in your dream symbolizes tradition, protection, wisdom, and a caring nature. Consider the qualities and characteristics that exist in your own grandfather.<\/p><p>If your grandfather is dead and you dream that he is alive, then it may just mean that you miss them and are trying to relive the time you spent with them when he was alive. If you dream that your grandfather is doing odd things, then it implies that you are still trying to understand his death. Perhaps you haven't come to terms with why he passed away.<\/p>"
    },
    {
        "title": "Grandfather Clock",
        "desc": "<p>To see a grandfather clock in your dream signifies the past or a passage of time. Perhaps a decision has been weighing on your mind for quite some time. Alternatively, a grandfather clock may refer to the patriarch and perhaps some outdated views and way of thinking.<\/p><p>*Please see also the Dream Moods' interpretation for<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c3.htm#Clock\">Clock.<\/p>"
    },
    {
        "title": "Grandmother",
        "desc": "<p>To see your grandmother in your dream represents nurturance, protection, and unconditional love. Consider the qualities and characteristics that exist in your own grandmother.She may also be the archetypal symbol of the wise old woman.<\/p>"
    },
    {
        "title": "Grandparents",
        "desc": "<p>To see your grandparents in your dream symbolize love, security, wisdom and protection.<\/p><p>To dream that you are searching for your grandparents signify your search for love and protection. You may be regressing to childhood needs.<\/p><p>To dream of your grandparents' home refers to longevity, security and good old fashion values. You need to lay a solid foundation in order to grow. Obviously, your own personal associations with your grandparents' home will factory strongly into its significance. What did you do while you were at your grandparents? What sort of memories did you have? What did you do when you visited your grandparents?<\/p>"
    },
    {
        "title": "Grandstands",
        "desc": "<p>To dream that you are in the grandstands represents your goals and your plans on how to achieve them. Alternatively, dreaming of being in the grandstands indicate that you are seeking praise and attention from others. Or that you are trying to hard to impress others.<\/p>"
    },
    {
        "title": "Granite",
        "desc": "<p>To see granite in your dream refers to your toughness and rigidity. You tend to be unyielding and inflexible in your thinking.<\/p>"
    },
    {
        "title": "Grapefruit",
        "desc": "<p>To see or eat a grapefruit in your dream represents a sense of well-being and a refreshed state of mind. Your are experiencing an uplift in your spirits and a rejuvenation of your body.<\/p><p>To see a grapefruit tree in your dream is symbolic of your talents, belief system and good deeds. It may also represent the fruits of your labor.<\/p>"
    },
    {
        "title": "Grapes",
        "desc": "<p>To see grape vines in your dream symbolize opulence, wealth, and decadence. It also indicates fortitude and your ability to offer happiness to others.<\/p><p>To see or eat grapes in your dream represent wealth and prosperity. In the end, your hard work will pay off and you will be rewarded for your labor. Alternatively, grapes refer to immortality and sacrifices.<\/p><p>To dream that you are picking and gathering grapes signify profit and the realization of your desires."
    },
    {
        "title": "Grappling Hook",
        "desc": "<p>To see or use a grappling hook in your dream refers to something that is just beyond your grasp. Sometimes you need the support of those around you to help you achieve your goals. Alternatively, a grappling hook indicates that you are overextending yourself or overstepping your boundaries.<\/p>"
    },
    {
        "title": "Grass To see green grass in your dream suggests that there is a part of yourself that you can always rely on. The dream is also symbolic of natural protection. Also consider the phrase &quot;the grass is always greener on the other side.&quot; Do you always compare yourself with others and look at what other people have?",
        "desc": "<p>To dream that you are planting grass indicates that your hard work and efforts will pay off in the end.<\/p><p>Dreaming that there is grass in your mouth or that you are eating grass represents a situation that you have a difficult time accepting or an emotion that you don't want to acknowledge.<\/p>"
    },
    {
        "title": "Grasshopper",
        "desc": "<p>To see a grasshopper in your dream symbolizes freedom, independence or spiritual enlightenment. Alternatively, it indicates your inability to settle down or commit to a decision.<\/p>"
    },
    {
        "title": "Grassland",
        "desc": "<p>To see or dream that you are on a grassland symbolizes openness and concealment at the same time. You need to learn to balance when to reveal information about yourself and when to hold back.<\/p>"
    },
    {
        "title": "Grater",
        "desc": "<p>To see or use a grater in your dream implies that you need to process things in smaller sizes so that you do not get overwhelmed. Alternatively, the dream is a pun on &quot;great&quot; or &quot;greater&quot;. The dream may be telling you that big things are in store for you.<\/p>"
    },
    {
        "title": "Grave",
        "desc": "<p>To dream that you are at a grave indicates that you need to delve into your own subconscious in search of an issue that you thought had been put to rest. You need to stand up for yourself for no one else can do it for you. Alternatively, it represents something is about to be completed in your life. You are leaving behind the old and making a new start. The dream may also be a pun on feeling grave or concerns about a serious or sad situation.<\/p><p>To dream that you are digging a grave denotes some nervousness and uneasiness over some undertaking.<\/p><p>To dream that your dead uncle calls to tell you that he is digging graves indicates that your subconscious is telling you about some hidden truth or family secret that needs to be uncovered.<\/p>"
    },
    {
        "title": "Gravel",
        "desc": "<p>To see gravel in your dream signifies practicality.<\/p>"
    },
    {
        "title": "Gravestone",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/h.htm#Headstone\">Headstone.<\/p><p>Graveyard<\/p><p>To dream that you are at a graveyard represents the discarded aspects of yourself. You may be fearing the unknown. Alternatively, the graveyard indicates a loss or a period of mourning.<\/p>"
    },
    {
        "title": "Gravity",
        "desc": "<p>To feel gravity in your dream represents the weight and pressure you feel on you. You are feeling overwhelmed. Problems, work or stress is literally weighing you down.<\/p><p>To dream that you feel no gravity suggests that you are able to let go of your problems and rise above the situation. You are experiencing new found freedom. Nothing seems overwhelming or too difficult to handle.<\/p>"
    },
    {
        "title": "Gravy",
        "desc": "<p>To dream that you are eating gravy symbolizes your ability to enjoy the simpler things in life. Alternatively, the dream means that you are taking advantage of some situation.<\/p>"
    },
    {
        "title": "Grease",
        "desc": "<p>To dream that you are covered in grease suggests that you need to get your life straighten out and running smoothly again. You may find a situation where you have lost the advantage.<\/p>"
    },
    {
        "title": "Great Dane",
        "desc": "<p>To see a Great Dane in your dream refers to your strong will, good nature and easy going attitude. You need to learn to be an independent thinker and not let others influence you too much.<\/p>"
    },
    {
        "title": "Great Wall of China",
        "desc": "<p>Tosee or dream that you are at the Great Wall of China refers to your ability to shut some people out, while letting others through. You are careful with who you let into your life.<\/p>"
    },
    {
        "title": "Greed",
        "desc": "<p>To dream that you are greedy suggests that you are making too many demands in your walking life. You are asking for too much of others.<\/p>"
    },
    {
        "title": "Greek",
        "desc": "<p>To dream that you read Greek signifies discussion and acceptance of your ideas. Consider the phrase &quot;it's all Greek to me&quot; to indicate your lack of understanding in some area of your life.<\/p>"
    },
    {
        "title": "Greenhouse",
        "desc": "<p>To see or dream that you are in a greenhouse represents transformation. You are experiencing some changes in your life brought about mainly as a result of your own doing. It also suggests that you may be too overly controlling. You want things done your way, but in the process you may be isolating yourself.<\/p>"
    },
    {
        "title": "Greeting Card",
        "desc": "<p>To see a greeting card in your dream suggests that surprises are in store ahead. If you are giving or receiving a card, then it indicates a need for you to make contact with the sender or recipient of the card.<\/p>"
    },
    {
        "title": "Gremlins",
        "desc": "<p>To see gremlins in your dream symbolize mischief and trouble. There is a problem that you may not be fully aware of, but it is nagging at your subconscious.<\/p>"
    },
    {
        "title": "Grenade",
        "desc": "<p>To see a grenade in your dream suggests that your suppressed emotions are about to explode. It also points to some pent up anger and violence.<\/p>"
    },
    {
        "title": "Greyhound",
        "desc": "<p>To see a greyhound in your dream represents your quiet, calm and reserved side. Greyhounds are also often synonymous with grace, speed and agility. Perhaps you need to adopt some of these qualities into some waking situation.<\/p>"
    },
    {
        "title": "Grid",
        "desc": "<p>To see a grid in your dream indicates that you are too rigid in your thinking. You want things to be perfectly planned out.<\/p>"
    },
    {
        "title": "Grief",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b2.htm#Bereavement\">Bereavement.<\/p>"
    },
    {
        "title": "Griffon",
        "desc": "<p>To see a griffon in your dream symbolizes the positive aspects of change. You possess the physical power and stability of the lion and the vision, spirit and alertness of the eagle. It also represents intellect, physical strength, and the sun.<\/p><p>**See The Meaning In Action:<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=griffondream1\">Griffon Attack?<\/p>"
    },
    {
        "title": "Grill",
        "desc": "<p>To see a grill in your dream represents togetherness, comfort, and relaxation. It also invokes summertime. Perhaps the dream is telling you to spend more time with your family. Alternatively, the dream may be a pun on &quot;being grilled&quot; or interrogated. Do you feel that you are being questioned in some area of your life?<\/p>"
    },
    {
        "title": "Grim Reaper",
        "desc": "<p>To see the grim reaper in your dream signifies the negative, rejected aspects of your personality. It represents aspects of yourself that you have repressed. Alternatively, it symbolizes death. The dream may parallel an end to some situation, habit, or relationship in your waking life.<\/p>"
    },
    {
        "title": "Grinch",
        "desc": "<p>To see the Grinch in your dream suggests that you are no longer centered. You are going along a crooked path. You need to get down to the core of some matter. Alternatively, the Grinch indicates that you need to treat yourself to something special instead of constantly catering to the needs of others.<\/p>"
    },
    {
        "title": "Grind",
        "desc": "<p>To dream that you are grinding something represents repetition. Your life is too much of a routine. The dream may thus be a metaphor for the &quot;daily grind&quot;. Alternatively, the dream indicates that you have &quot;an axe to grind&quot; with someone. Are you harboring any feelings of resentment?<\/p>"
    },
    {
        "title": "Grindstone",
        "desc": "<p>To dream that you are turning a grindstone symbolizes vitality and well-directed energy which will lead to prosperity.<\/p><p>To dream that you are sharpening tools on a grindstone signifies that your friends will always be there to lend a helping hand.<\/p>"
    },
    {
        "title": "Grip",
        "desc": "<p>To dream that you are gripping something implies control, hope, determination, possession or endurance. Consider the significance and symbolism of the object that you are gripping. If your grip is slipping, then it means that it is time to let go, whether it be a relationship, goal or situation. You may be holding on to false hope.<\/p>"
    },
    {
        "title": "Gritty",
        "desc": "<p>To dream of a gritty texture symbolizes hesitance or tentativeness about a decision, situation or relationship. Alternatively, the gritty texture may refer to your perseverance and courage.<\/p>"
    },
    {
        "title": "Groans",
        "desc": "<p>To hear groans in your dream suggest that you need to act quickly or else others will take advantage of the situation. You need to effectively map out your action. Alternatively, the dream indicates that you or someone is in pain, either emotionally or physically.<\/p>"
    },
    {
        "title": "Groceries",
        "desc": "<p>To shop for groceries in your dream represents some emotional of physical need that you are currently lacking in your life. You may be in need of nurturance and some fulfillment. Consider the specific items that you are shopping for.<\/p>"
    },
    {
        "title": "Grocery Cart",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s2.htm#ShoppingCart\">Shopping Cart.<\/p>"
    },
    {
        "title": "Grocery Store",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m.htm#Market\">Market.<\/p><p>Groin<\/p><p>*Please see<a href=\"http:\/\/www.dreammoods.com\/p2.htm#Pelvis\">Pelvis.<\/p>"
    },
    {
        "title": "Groom",
        "desc": "<p>To dream that you are a groom represents your commitment to a relationship or situation. Alternatively, it suggests that your strong assertive side is getting ready to merge with your intuitive nurturing side.<\/p><p>If you are female and see a groom in your dream then it represents your desire to be in a committed relationship or to be married. Maybe you are ready to enter into a partnership.<\/p>"
    },
    {
        "title": "Groomsman",
        "desc": "<p>To dream that you are a groomsman refers to your self-confidence. You are the &quot;best&quot; person for the job. Alternatively, the dream implies that you are moving toward becoming a better person.<\/p><p>If you are a woman and dream that you are a groomsman indicates that you are breaking down gender roles. Sometimes the best man for the job is not necessarily a man.<\/p>"
    },
    {
        "title": "Grope",
        "desc": "<p>To dream that you are groping someone indicates your desires to feel a connection with that person or with some aspect of yourself. If you are groping something, then consider what that something represents and how you need to be more in tune with its characteristics. Perhaps you need to evaluate your surroundings more carefully before making some decision.<\/p><p>To dream that you are being groped suggests that boundaries are being crossed. Consider where you are being groped.<\/p>"
    },
    {
        "title": "Grotto",
        "desc": "<p>To see a grotto in your dream signifies your dark emotions and suppressed sexuality. The dream relates to the underworld.<\/p>"
    },
    {
        "title": "Ground",
        "desc": "<p>To dream that you are on the ground represents your foundation and support system. It is also the boundary between your conscious and subconscious. You may be getting closer in confronting and acknowledging your subconscious thoughts. The dream may be a pun on being well-grounded and down to earth or that you have been grounded. Perhaps you are feeling restricted in some aspects of your life.<\/p>"
    },
    {
        "title": "Grounded",
        "desc": "<p>To dream that you have been grounded indicates that you need to reflect on your negative actions and bad behavior. Learn from your past mistakes.<\/p><p>To dream that an airplane is grounded indicates that your idea or plan is not taking off. You feel you are being held back, either physically or mentally.<\/p>"
    },
    {
        "title": "Groundhog",
        "desc": "<p>To see a groundhog in your dream represents subconscious material that is coming to the surface. You are ready to confront some news.<\/p>"
    },
    {
        "title": "Groupie",
        "desc": "<p>To see a groupie in your dream signifies loneliness. You are wasting time on meaningless pursuits.<\/p><p>Dreaming that you have groupies following you suggests that you are surrounded by superficial relationships. You are lacking some emotional connection.<\/p><p>If you dream that you are a groupie, then it implies that you are attracted to fame and power but do not necessarily want to put forth the work to achieve it. Alternatively, dreaming of being a groupie means that you are goals are superficial and shallow.<\/p>"
    },
    {
        "title": "Groups",
        "desc": "<p>To see a group in your dream refers to the merging of various aspects of your character and personality.<\/p>"
    },
    {
        "title": "Grout",
        "desc": "<p>To dream that you are applying grout indicates that you need solidify some new ideas. You need to piece together some relationship or situation.<\/p>"
    },
    {
        "title": "Growing",
        "desc": "<p>To see something growing in your dream indicates that you have reached a new level of maturity or spiritual enlightenment.<\/p>"
    },
    {
        "title": "Growl",
        "desc": "<p>To dream that you are growling signifies repressed anger. You are holding back your negative feelings and need to let it out.<\/p><p>To hear a growl in your dream indicates danger.<\/p>"
    },
    {
        "title": "Grudge",
        "desc": "<p>To dream that you are holding a grudge against someone represents some unresolved issues. The dream is a reflection of how you feel in your waking hours. You need to let go and stop dwelling on old issues.<\/p>"
    },
    {
        "title": "Guacamole",
        "desc": "<p>To eat or make guacamole in your dream indicates a positive change.<\/p>"
    },
    {
        "title": "Guard",
        "desc": "<p>To see an armed guard in your dream represents rational thinking. You are being cautious and practical.The dream may also be on pun that you need to be &quot;on guard&quot; or alert about a situation.<\/p><p>To see a prison guard in your dream suggests that your belief and\/or your way of thinking is restricting your own growth. Your fear of making mistakes is preventing you from experiencing life.<\/p>"
    },
    {
        "title": "Guardian",
        "desc": "<p>To see your guardian in your dream signifies that you will be treaded with consideration by your friends.<\/p>"
    },
    {
        "title": "Guava",
        "desc": "<p>To see or eat a guava in your dream symbolizes fertility and\/or romance.<\/p>"
    },
    {
        "title": "Guest",
        "desc": "<p>Tosee a guest in your dream signifies new challenges and interests in your life. You are ready for an adventure.<\/p><p>To dream that you are a guest denotes a circumstance or problem in your life that is temporary. Consider if you were being welcomed as a guest.<\/p>"
    },
    {
        "title": "Guide",
        "desc": "<p>Tosee or dream that you are a guide indicates that a higher force is guiding you toward your goals. You are on the right path toward personal development or spiritual enlightenment.<\/p>"
    },
    {
        "title": "Guillotine",
        "desc": "<p>To see a guillotine in your dream symbolizes anger, hostility and the eruption of some strong emotions. You are not using your head and your better judgment.You need to think things through before you act.<\/p>"
    },
    {
        "title": "Guilt",
        "desc": "<p>Todream that you feel guilty about something relates to how you are handling your successes and failures or competence and incompetence. You may feel undeserving of your achievements. Or on the other hand, you feel that you have let others down. Alternatively, the dream is symbolic of repressed and negative feelings that you may have about yourself.<\/p>"
    },
    {
        "title": "Guinea Pig",
        "desc": "<p>To see a guinea pig in your dream represents your need to be more responsible and attentive. Alternatively, it suggests that through experimentation and taking risks, you learn how and how not to do something. You learn from your mistakes.<\/p>"
    },
    {
        "title": "Guitar",
        "desc": "<p>Tosee or play a guitar in your dream represents passion and emotion. It also relates to sexual connotations and may signal an erotic or sensual dream.<\/p><p>To see an unstrung or broken guitar signifies disappointments in love.<\/p>"
    },
    {
        "title": "Guitar Pick",
        "desc": "<p>To see or use a guitar pick in your dream implies that you need to focus your energies on your true passion. It may also mean that you need to express your emotions in a clearer way. Because of its triangular shape, a guitar pick may symbolize your aspirations or potential.<\/p>"
    },
    {
        "title": "Gulls",
        "desc": "<p>To see sea gulls in your dream indicate a desire to get away from your problems or the demands of your walking life. Alternatively, it represents your relationship with logic\/objectivity and the subconscious\/subjectivity.<\/p><p>To see soaring gulls in your dream indicate a clear perspective.<\/p><p>To see dead gulls in your dream denote separation. A relationship or situation is unraveling or drifting apart.<\/p>"
    },
    {
        "title": "Gum",
        "desc": "<p>To dream that you are chewing gum suggests that you are unable to express yourself effectively. You may feel vulnerable. Alternatively, it symbolizes a sticky situation that you are involved in.<\/p><p>To dream that you are unable to get rid of your gum suggests that you are experiencing some indecision, powerlessness or frustration. You may lack understanding in a situation or find that a current problem is overwhelming. The gum in your mouth is a metaphor for something that you are trying to process or digest. Perhaps you feel that you have bitten off more than you can chew.<\/p>"
    },
    {
        "title": "Gumball Machine",
        "desc": "<p>To see a gumball machine in your dream indicates that you are searching to be whole again. You are looking for something or someone to complete you. Alternatively, the dream suggests that you need to be more in tune with the inner child within.<\/p>"
    },
    {
        "title": "Gummi Bears",
        "desc": "<p>To see or eat gummi bears in your dream implies that your tenacity and perseverance will pay off in the end. The dream may be telling you to be more flexible or yielding. It also symbolizes the sweet rewards in life. Consider the color of the gummi bear for additional significance.<\/p><p>To dream that gummi bears are coming to life indicates that something that may seem innocent or insignificant is suddenly becoming a problematic issue. Alternatively, the dream suggests that you need to be careful who you trust or who you believe.<\/p>"
    },
    {
        "title": "Gummy Worms",
        "desc": "<p>To see or eat gummy worms in your dream indicates that an unappealing situation or person is being presented in a more palatable way. The dream is also telling you that you are being misguided or deceived and need to make better, informed decisions.<\/p>"
    },
    {
        "title": "Gums",
        "desc": "<p>To notice your gums in your dream suggests that you are having difficulties communicating your emotions or thoughts. If your gums are sore, then it means that you have been holding back those negative emotions and thoughts for too long. You need to let go and start expressing your emotions.<\/p><p>To dream that your gums are bleeding indicates that you feel others are working against you.<\/p><p>To dream that a thick, gray discharge is oozing out of your gums implies that you need to confront some fear or depression. You have been trying to avoid these feelings.<\/p><p>*Please See Also<a href=\"http:\/\/dreammoods.com\/cgibin\/teethdreams.pl?method=exact&amp;header=dreamid&amp;search=teethintro\">Common Dreams: Teeth<\/p>"
    },
    {
        "title": "Gun",
        "desc": "<p>To see a gun in your dream represents aggression, anger, and potential danger. You could be on the defensive about something. Or you may be dealing with issues of passiveness\/aggressiveness and authority\/dependence. Alternatively, a gun is a symbol of power and pride. Perhaps you are looking for shelter or protection in your dream. From a Freudian perspective, a gun represents the penis and male sexual drive. Thus, the gun may mean power or impotence, depending on whether the gun went off or misfired.<\/p><p>To dream that you are loading a gun forewarns that you should be careful in not letting your temper get out of control. It may also signify your ability to defend yourself in a situation.<\/p><p>To dream that a gun jams or fails to fire indicates that you are feeling powerless in some waking situation. Perhaps you need to attack your problems from a different approach. Alternatively, a malfunctioning gun represents sexual impotence or fear of impotence.<\/p><p>To dream that you are hiding a gun implies that you are repressing your angry feelings.<\/p><p>To dream that you shoot someone with a gun denotes your aggressive feeling and hidden anger toward that particular person. You may be trying to blame them for something.<\/p><p>To dream that someone is shooting you with a gun suggests that you are experiencing some confrontation in your waking life. You feel victimized in a situation or that you are being targeted.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p3.htm#Pistol\">Pistol or<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s2.htm#Shot\">Shot.<\/p>"
    },
    {
        "title": "Gunpowder",
        "desc": "<p>To see gunpowder in your dream indicates that you are on the verge of losing your temper or about to blow up over some matter. Alternatively, it suggests that you need to proceed cautiously and approach an issue with careful consideration.<\/p>"
    },
    {
        "title": "Gurney",
        "desc": "<p>To see or lie on a gurney in your dream suggests that you need to slow down. Your lifestyle or life decisions may be jeopardizing your well being. You need to reevaluate your choices.<\/p>"
    },
    {
        "title": "Guru",
        "desc": "<p>To seek a guru in your dream suggests that you are trying to be more influential and powerful in the world. You are always in search for knowledge and inspiration.<\/p>"
    },
    {
        "title": "Guru Nanak",
        "desc": "<p>To see Guru Nanak in your dream symbolizes integrity and honesty. Put your faith in God. The symbol may have deeper significance for believers of Sikhism.<\/p>"
    },
    {
        "title": "Guts",
        "desc": "<p>To see guts in your dream represent fortitude, strength, and stamina. Consider the common phrase &quot;you have a lot of guts&quot;<\/p>"
    },
    {
        "title": "Gutter",
        "desc": "<p>To notice the gutter in your dream signifies degradation and unhappiness. You are feeling low and sad. The dream may also be a metaphor telling you to &quot;get your mind out of the gutter.&quot;<\/p><p>To find valuables in the gutter in your dream suggest that you can find value in the least expected of places. Do not undervalue or underestimate things.<\/p>"
    },
    {
        "title": "Guy",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m2.htm#Man\">Man or<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b4.htm#Boy\">Boy.<\/p>"
    },
    {
        "title": "Gymnasium",
        "desc": "<p>To dream that you are in a gymnasium indicates that you need to apply what you learned and incorporate it into your daily life. Alternatively, the gym may be telling you that you need to get more exercise.<\/p>"
    },
    {
        "title": "Gymnast",
        "desc": "<p>To see a gymnast in your dream signifies agility, strength, and grace.<\/p>"
    },
    {
        "title": "Gynecologist",
        "desc": "<p>To see a gynecologist in your dream indicates that there is something that you do not want to know. There is a situation that you are dreading. Alternatively, the dream may just represent your anxiety about seeing the gynecologist. Perhaps you are concerned about issues with fertility, cancer, venereal diseases or sex.<\/p>"
    },
    {
        "title": "Gypsy",
        "desc": "<p>To see a gypsy in your dream signifies your desire to roam freely without responsibility and obligation. Alternatively, this symbol may suggest that you need to look toward the future.<\/p>"
    }
]