[
    {
        "title": "H",
        "desc": "<p>To see the letter &quot;H&quot; in your dream symbolizes cooperation, balance and teamwork.<\/p>"
    },
    {
        "title": "Habit",
        "desc": "<p>To dream about an old habit or a habit that you recently quit is an expression of your subconscious desires. Your suppressed urges are making themselves known via your dreams.<\/p>"
    },
    {
        "title": "Hack",
        "desc": "<p>To dream that someone is hacking into your computer or files symbolizes your vulnerabilities and weaknesses. The dream may be a way of telling you that you need to work on building up your self esteem.<\/p><p>To dream that you are hacking into someone else's computer indicates that you are overstepping your boundaries in some situation or relationship."
    },
    {
        "title": "Hacky Sack",
        "desc": "<p>To play hacky sack in your dream refers to your ability to act quickly on your feet. You like to keep things moving along.<\/p><p>To see a hacky sack in your dream implies that you need to be more flexible.<\/p>"
    },
    {
        "title": "Hag",
        "desc": "<p>To see a hag in your dream represents the &quot;Wise Old Woman&quot; figure and thus refers to nurturance. Negatively, to see a hag in your dream signifies the devouring mother.<\/p>"
    },
    {
        "title": "Haggard",
        "desc": "<p>To see a haggard face in your dream suggests that you are growing tiresome or weary of a situation.<\/p>"
    },
    {
        "title": "Hagstone",
        "desc": "<p>To see a hagstone in your dream signifies your need to be protected.<\/p>"
    },
    {
        "title": "Hail",
        "desc": "<p>To dream that you are caught in a hailstorm suggests that you are emotionally withdrawn. Some situation beyond your control is causing you to shut down emotionally.<\/p><p>To hear hail in your dream indicates that you are going through a period of difficult times.<\/p>"
    },
    {
        "title": "Hair",
        "desc": "<p>To see hair in your dream signifies sexual virility, seduction, sensuality, vanity, and health.<\/p><p>It is indicative of your attitudes. If your hair is knotted or tangled, then it is symbolic of uncertainty and confusion in your life. You may be unable to think straight. If you dream that you make a drastic change to your hairstyle, then it means that you are taking a drastic, new approach to some issue in your waking life.<\/p><p>To dream that you are cutting your hair suggests that you are experiencing a loss in strength. You may feel that someone is trying to censor you. Alternatively, you may be reshaping your thinking or ambitions and eliminating unwanted thoughts\/habits.<\/p><p>To dream that you are combing, stroking or styling your hair suggests that you are taking on and evaluating a new idea, concept, outlook, or way of thinking. You may be putting your thoughts in order and getting your facts straight. A more literal interpretation suggests your concerns about your self-image and appearance.<\/p><p>To dream that you have long hair indicates that you are thinking long and carefully before making some decision. You are concentrating on some plan or situation.<\/p><p>Dreaming that you have hair so long that it gets in your way suggests that your thoughts and\/or ideas are preventing you from moving forward. Perhaps you are doing too much thinking and not taking action.<\/p><p>To dream that you have short hair implies that you need to downsize your lifestyle.<\/p><p>To dream that you are losing your hair denotes that you are concerned with the notion that you are getting older and losing your sex appeal and virility. You are preoccupied with aging and your appearance. Losing your hair also signifies a lack of strength; you do not have the power to succeed in an undertaking. You may be feeling weak and vulnerable.<\/p><p>To dream that someone is smelling your hair indicates sexual curiosity and your need for some sensual stimulation. You have a lot to learn about a relationship. The way yours or someone else's hair smell may remind you of a particular person.<\/p><p>To dream that you are reaching for or running your fingers through someone's hair suggests that you are trying to connect with that person on a spiritual or intellectual level. It also refers to sympathy, protectiveness, and fraternal love.<\/p><p>To dream that the wind is blowing through your hair signifies freedom to express uninhibited feelings. You are &quot;letting your hair down&quot;.<\/p><p>Dreaming that you have gray or white hair indicates that something important has just been made aware to you. It is a symbol of knowledge, wisdom and insight. The dream may also be a metaphor suggesting that you are feeling &quot;light-headed&quot;.<\/p><p>Dreaming of someone with black or raven hair refers to someone who is mysterious. If you dream that you have black hair or that you are dying your hair black, then it indicates that you are feeling closed off. You are trying to cover up your true feelings.<\/p><p>To dream that there are endless amount of bugs coming out of your hair suggests that something is weighing on your mind that you are confused about. Perhaps you are making a big deal out of a minor matter. Alternatively, the dream refers to concerns over your public image.<\/p>"
    },
    {
        "title": "Hair Clippers",
        "desc": "<p>To see or use hair clippers in your dream means that you are shedding off some unwanted aspect of yourself.<\/p>"
    },
    {
        "title": "Hair Dryer",
        "desc": "<p>To use a hair dryer in your dream indicates that you need to clear your thoughts and get a fresh perspective on things.<\/p>"
    },
    {
        "title": "Hairclip",
        "desc": "<p>*Please See: <a href=\"#Barrette\">Barrette<\/a>.<\/p>"
    },
    {
        "title": "Haircut",
        "desc": "<p>To dream that someone is giving you a haircut suggests that you are experiencing a decreased sense of power. You feel you are being criticized unfairly. Alternatively, your dream haircut symbolizes a fresh start. You are shedding off some unwanted aspect of yourself.<\/p>"
    },
    {
        "title": "Hairdresser",
        "desc": "<p>To dream that you are a hairdresser suggests that you are imposing your ideas and opinions on others. Perhaps you need to work on your self-image and improve on your image. Alternatively, it refers to your attitude toward your own sexuality.<\/p><p>To dream that you are at the hairdresser implies that you are looking to change your attitude. You are ready for change and move in a different direction.<\/p><p>*Please see also: <a href=\"#Salon\">Salon<\/a>.<\/p>"
    },
    {
        "title": "Hairnet",
        "desc": "<p>To see or wear a hairnet in your dream means that you need to show restraint and control in your feelings.<\/p>"
    },
    {
        "title": "Hairpiece",
        "desc": "<p>To dream that you are wearing a hairpiece indicates some sort of deception. You may be giving off a false impression and passing the views of others as your own.<\/p><p>To dream that you lose your hairpiece suggests that you are beginning to lose your mind. The dream may also be a pun on losing your &quot;peace&quot; of mind.<\/p>"
    },
    {
        "title": "Hairpin",
        "desc": "<p>*Please see: <a href=\"#Bobby%20pin\">Bobby Pin<\/a>.<\/p>"
    },
    {
        "title": "Hairspray",
        "desc": "<p>To use hairspray in your dream suggests that you are overly concerned with your looks and image. You care too much with what others think of you.<\/p>"
    },
    {
        "title": "Half",
        "desc": "<p>To dream about half of something indicates that something in your waking life is incomplete or unresolved. It may also indicate that you are only partially acknowledging your feelings. You or someone else is limiting or restricting you. Alternatively, the dream suggests that you need to be open to compromise and meet halfway.<\/p>"
    },
    {
        "title": "Hall",
        "desc": "<p>To dream that you are in a hall represents your ability to share and get along with others. If the hall is empty, then it symbolizes the unexplored and untapped aspects of your character. Consider the activity that is taking place in the hall and the people that were there.<\/p>"
    },
    {
        "title": "Halloween",
        "desc": "<p>To dream of Halloween signifies death and the underworld. Halloween also represents the temporary adoption of a new persona where you feel less inhibited and more comfortable to freely express yourself.<\/p><p>You may also be trying to hide your true self.<\/p><p>Alternatively, dreaming of Halloween reflects your childhood and the corresponding feelings that you associated with the holiday.<\/p>"
    },
    {
        "title": "Hallucination",
        "desc": "<p>To have a hallucination in your dream symbolizes an image from your subconscious. They can also represent repressed emotions and feelings that you do not want to confront. Your dream may be telling you to be more alert and to express yourself more clearly. Alternatively, it refers to self-deception. What are you trying to hide?<\/p>"
    },
    {
        "title": "Hallway",
        "desc": "<p>To see a hallway in your dream symbolizes self exploration. It is the beginning of the path that you are taking in life. You are going through a transitional phase and journeying into the unknown. It also signals spiritual enlightenment, emotional growth physical prowess, new opportunities and mental passages in your life.<\/p>"
    },
    {
        "title": "Halo",
        "desc": "<p>To dream that you have a halo signifies that you are a perfectionist. Alternatively, it represents some significant spiritual development and supernatural energy.<\/p>"
    },
    {
        "title": "Halter",
        "desc": "<p>To dream that you are putting a halter on a horse suggests that you are trying to persuade someone into your way of thinking.<\/p>"
    },
    {
        "title": "Ham",
        "desc": "<p>To dream that you are eating ham indicates that you need to preserve your energy.<\/p><p>To see a ham in your dream indicates that you are experiencing some emotional difficulties. The symbol may also be metaphor to suggest your desire for attention.<\/p>"
    },
    {
        "title": "Hamburger",
        "desc": "<p>To see or eat a hamburger in your dream suggests that you are lacking some emotional, intellectual, or physical component in order to feel whole again. You may be feeling unsatisfied with some situation or relationship. It is also symbolic of your experiences and how you need to learn from them. Look at the big picture.<\/p>"
    },
    {
        "title": "Hamlet",
        "desc": "<p>To see Hamlet in your dream refers to your indecisiveness. You need to make a choice and take action.<\/p>"
    },
    {
        "title": "Hammer",
        "desc": "<p>To see a hammer in your dream signifies power, strength, virility, and masculine attitudes. It also symbolizes growth and construction. Alternatively, the dream may also be a pun on &quot;being hammered&quot; or intoxicated.<\/p><p>To dream that you are using a hammer represents your determination and drive in pursing your goals. You will accomplish your tasks with great success. However be careful not to be too forceful. Alternatively, it suggests that you may be dealing with old demons and inner struggles.<\/p>"
    },
    {
        "title": "Hammock",
        "desc": "<p>To see a hammock in your dream implies that you need to take some time out for pleasure and leisurely activity. You need to relax!<\/p><p>To dream that you are lying in a hammock refers to your appreciation of life. You are taking the time to stop and enjoy life. Alternatively, the dream suggests that you have realized your goals. You have accomplished what you set out to do.<\/p><p>To dream that you fall off a hammock implies that you are being mislead into thinking that everything is okay when it is not. You are in for a rude awakening! Alternatively, falling off a hammock means that you still have some unfinished work to deal with.<\/p>"
    },
    {
        "title": "Hamper",
        "desc": "<p>To see a hamper in your dream indicates that you need to find a more productive way to express your negative feelings.<\/p>"
    },
    {
        "title": "Hamster",
        "desc": "<p>To see a hamster in your dream represents underdeveloped emotions. You are distancing yourself from others so that you won't end up getting hurt. It may also indicate that issues of sexuality are trivial to you. You are able to separate sex and love.<\/p>"
    },
    {
        "title": "Hamster Wheel",
        "desc": "<p>To see a hamster wheel in your dream implies that your efforts are too insignificant to make a difference. You are going in circles. Or perhaps you feel someone is giving you the runaround.<\/p><p>Dreaming that you are running around in a giant hamster wheel means that you feel you are headed no where in life.<\/p>"
    },
    {
        "title": "Hand",
        "desc": "<p>To dream of your hands represent your relationships with those around you and how you connect with the world. Hands serve as a form of communication and can represent authority, hate, protection, justice, etc depending on the gesture. Perhaps you need to lend a helping hand to someone. If someone else is giving you a helping hand, then it implies your need for help. Do not be afraid to ask for assistance or to depend on others from time to time. Moreover, the left hand symbolizes your graciousness and your feminine, receptive qualities, while the right hand symbolizes the masculine and active attributes. The right hand may also be a pun for some decision or something being &quot;right&quot;. If you dream that your hands are detached or see disembodied hands, then it indicates that you are not getting your point of view across. You are not being understood or someone is not understanding you. The dream may also symbolize feelings of loneliness. If you see disembodied baby hands in your dream, then it points to your maternal eagerness or your desires to feel needed.<\/p><p>To dream that you are holding hands with someone represents love, affection and your connection with that person. Your dream may also reflect anxieties about losing touch with her\/him or that you are drifting apart.<\/p><p>To dream that you hands are injured denote an attack on your ego.<\/p><p>To dream that your hands are clasped or closed signify unity, completeness, acceptance or agreement. On a more negative note, it may suggest that you are close-minded, ungiving or unwilling to help.<\/p><p>To dream that you have unusually large hands denote success in achieving your goals.<\/p><p>To dream that your hands are hairy or rough imply your lack of gentleness in dealing with others. You may be too brash and abrasive.<\/p><p>To see blood on your hands signifies that you are experiencing some sort of guilt.<\/p><p>To dream that you are washing your hands represent a worrisome issue that you need to work through. Alternatively, it suggests that you are in denial or no longer taking responsibility of some matter. You are letting go and getting things out of your system.<\/p><p>To dream that your hands are itchy indicate issues with money. If the left hand is itchy, then it signifies money being received. If the right hand or both hands are itchy, then it signifies money being given or lost.<\/p>"
    },
    {
        "title": "Hand Grenade",
        "desc": "<p>To see or throw a hand grenade in your dream represents pent up anger that is ready to explode at any moment. You are no longer able to contain or repress your emotions.<\/p>"
    },
    {
        "title": "Hand Truck",
        "desc": "<p>To see or use a hand truck in your dream means that you are looking for ways to ease your load.<\/p>"
    },
    {
        "title": "Handbag",
        "desc": "<p>*Please See: <a href=\"#Purse\">Purse<\/a>.<\/p>"
    },
    {
        "title": "Handcuffs",
        "desc": "<p>To dream that you are in handcuffs suggest that something or someone is holding back your success. Opportunities are shut off to you. You are experiencing a loss of power and effectiveness.<\/p><p>Alternatively, your own fears and doubts may be holding you back.<\/p><p>To see others in handcuffs or to put handcuffs on others indicate that you are being overly possessive.<\/p><p>In particular, to dream that you or someone is in fuzzy handcuffs implies that you are ready to take a relationship to the next level.<\/p>"
    },
    {
        "title": "Handball",
        "desc": "<p>To watch or play team handball in your dream refers to the importance of teamwork and cooperation in order to achieve the goals in your waking life. The dream is a reminder that you cannot succeed without the assistance of others. Alternatively, the dream may be telling you that you need to be more hands on in some project.<\/p>"
    },
    {
        "title": "Handicap",
        "desc": "<p>To dream that you or someone is handicap symbolizes your own weakness and neediness. You are being confronted with many challenges and need to maximize your full potential. Consider which part of your body is handicap and its symbolism. Alternatively, it suggests that you are becoming too arrogant for your own good. You need to be more humble.<\/p>"
    },
    {
        "title": "Handkerchiefs",
        "desc": "<p>To see or use a handkerchief in your dream indicates that you will be disgraced or embarrassed in some way. Alternatively, it symbolizes tears and sadness.<\/p><p>To dream that you lose you handkerchief indicates separation from your loved ones.<\/p><p>To dream that your handkerchief is soiled or torn represents severed relationships.<\/p>"
    },
    {
        "title": "Handle",
        "desc": "<p>To see a handle in your dream suggests that you are in control of the situation. The dream may a metaphor indicating that you have a &quot;handle&quot; on a situation or on life. If the handle is broken, then it may mean that you need to get a handle on who you are. Draw on your inner strength.<\/p>"
    },
    {
        "title": "Handprint",
        "desc": "<p>To make a handprint in your dream indicates your desire to do something important and leave an impression on others.<\/p><p>Dreaming of a child's handprint signifies possibilities.<\/p>"
    },
    {
        "title": "Handshake",
        "desc": "<p>To dream that you are shaking hands with someone symbolizes either a new beginning or an ending to a situation. You have reached an agreement or a decision to a problem. The dream may also mean that you are welcoming something new into your life. In particular, if you are shaking hands with someone famous or someone important, then it suggests that you are well regarded by others.<\/p>"
    },
    {
        "title": "Handsome",
        "desc": "<p>To dream that you are handsome refers to your confidence and self-esteem level. Alternatively, to dream about your looks points to your concerns about how others perceive you.<\/p><p>To see someone handsome in your dream represents qualities that you need to accept or incorporate into your own self.<\/p>"
    },
    {
        "title": "Handstand",
        "desc": "<p>To dream that you are doing a handstand refers to ability to balance many responsibilities at the same time. Alternatively, the dream means that you feel that you need to go out of your way to please others.<\/p><p>To see someone doing a handstand in your dream suggests that you are a hard person to please.<\/p>"
    },
    {
        "title": "Handwriting",
        "desc": "<p>To see or dream about your handwriting represents your self-expression and creativity. Consider the symbolism of what you are handwriting and how it relates to your waking life.<\/p><p>The dream may be trying to warn you against something as in &quot;the handwriting is on the wall&quot;.<\/p>"
    },
    {
        "title": "Hang Gliding",
        "desc": "<p>To dream that you are hang gliding symbolizes freedom in your personal life. It also represents trust. You believe in destiny.<\/p><p>To dream that you crash a hang glider represents a lack of self confidence. You do not have enough faith in yourself.<\/p>"
    },
    {
        "title": "Hangar",
        "desc": "<p>To see an airplane hangar in your dream represents your goals and aspirations. If the hangar is empty, then it means that you are feeling unmotivated. You have lost your way.<\/p>"
    },
    {
        "title": "Hanger",
        "desc": "<p>To see a hanger in your dream suggests that you are getting the hang of some situation or some task. Or it may mean that you are just hanging in there. You need more motivation and encouragement.<\/p>"
    },
    {
        "title": "Hanging",
        "desc": "<p>To watch a hanging in your dream represents feelings of insecurity. The hanging may symbolize aspects of yourself that you want to eliminate.<\/p><p>To dream that you are hanging yourself suggests that you are trying to escape from some guilt or fear. Consider also the image as a pun for something in your life which you have left hanging or unfinished.<\/p><p>To dream that you are hanging up clothes suggests that you are clarifying your thoughts and elevating yourself to a new state of awareness.<\/p><p>To dream that you are hanging out with friends or other people is a way for your dreaming mind to decompress and wind down. Perhaps you do not have time to socialize during the day. Alternatively, the dream may be telling you that there is something you can learn from your friends or others. You need to incorporate this quality into yourself.<\/p>"
    },
    {
        "title": "Hangman",
        "desc": "<p>To play hangman in your dream represents a message from your subconscious. Alternatively, playing hangman may be analogous to feelings of guilt.<\/p>"
    },
    {
        "title": "Hangover",
        "desc": "<p>To dream that you have a hangover signifies unresolved problems.<\/p>"
    },
    {
        "title": "Hang Ups",
        "desc": "<p>To dream that you are getting hang up calls represent a problem with your line of communication in a waking relationship with your loved one or family member. You feel that you are not able to express yourself and communicate your feelings. Perhaps, you are being denied to speak. Alternatively, the dream may be a pun on your personal &quot;hang ups&quot;. You need to let go of certain things and stop letting it bug you.<\/p>"
    },
    {
        "title": "Hanukkah",
        "desc": "<p>Also known as the festival of lights, thus to dream about Hanukkah signifies enlightenment, knowledge and spiritual guidance.<\/p>"
    },
    {
        "title": "Happy",
        "desc": "<p>To dream that you are happy may be a compensatory dream and is often a dream of the contrary. You may be trying to compensate for the sadness or stress in your waking life.<\/p>"
    },
    {
        "title": "Harass",
        "desc": "<p>To dream that you are being harassed indicates that you are feeling powerless and helpless in some waking situation. You are under tremendous emotional stress which you need to confront. Consider the significance of who is harassing you and how you felt.<\/p><p>To see someone else being harassed in your dream means that you need to be more supportive to this person. Perhaps you feel you have been neglecting them. Alternatively, the dream represents your pent-up anger toward this person.<\/p>"
    },
    {
        "title": "Harbor",
        "desc": "<p>Tosee a harbor in your dream signifies shelter from a stormy relationship or chaotic situation. You may be seeking refuge until you can recollect your thoughts and prepare for the challenges ahead. The dream may also be a metaphor suggesting that you are &quot;harboring&quot; some ill feelings.<\/p>"
    },
    {
        "title": "Hard Drive",
        "desc": "<p>To dream that your hard drive crashed indicates that you are being overwhelmed with information. Perhaps something is taking a emotional toll on you. Alternatively, the dream may be a metaphor that your unusually strong will and drive will set you on a crash course.<\/p><p>To see a hard drive in your dream represents old memories, your abilities and your experiences. A hard drive may also be analogous to your &quot;hard driving&quot; demeanor and attitude.<\/p><p>If you are erasing or formatting a hard drive, then it implies that you are trying to take on a new identity. In a way, you are erasing the past and starting anew.<\/p>"
    },
    {
        "title": "Hard Hat",
        "desc": "<p>To see or wear a hard hat in your dream implies that you need to protect your ideas. Someone may be trying to take credit for your work. Alternatively, the dream may be telling you that you are being hard-headed.<\/p>"
    },
    {
        "title": "Hardware Store",
        "desc": "<p>To dream that you are at the hardware store indicates that you need to make some self-improvements in your life. You need to adjust your attitudes.<\/p>"
    },
    {
        "title": "Hare",
        "desc": "<p>Tosee a hare in your dream represents swiftness, transformation or self-sacrifice. What are you giving up or sacrificing in your waking life? It may also symbolize your rash behavior or cleverness.<\/p><p>*Please See also: <a href=\"#Rabbit\">Rabbit<\/a>.<\/p>"
    },
    {
        "title": "Harem",
        "desc": "<p>To dream that your are part of a harem signifies your repressed sexual energy and inhibitions. You need to be open to sexual experimentation.<\/p><p>To dream that you are held prisoner of a harem suggests that you are seeking acceptance of your own sexuality.<\/p><p>To dream that you keep a harem suggests that you are wasting your time and energy on frivolous pursuits. You need to rethink your goals and the direction you want to take in life.<\/p>"
    },
    {
        "title": "Harley Quinn",
        "desc": "<p>To see Harley Quinn in your dream points to an unhealthy, abusive relationship. Alternatively, the dream may indicate that you are blind to something that everyone else is clearly seeing. You are living in your own reality.<\/p>"
    },
    {
        "title": "Harmonica",
        "desc": "<p>Tosee or hear a harmonica in your dream suggests that you need to let more joy and pleasure come into your life. It is also symbolic of a harmonious situation.<\/p><p>To dream that you are playing a harmonica indicates that there is some emotions that you need to release and integrate into your daily life.<\/p>"
    },
    {
        "title": "Harmony",
        "desc": "<p>Please See: <a href=\"#Music\">Music<\/a>.<\/p>"
    },
    {
        "title": "Harness",
        "desc": "<p>To see or use a harness in your dream symbolizes control and lack of freedom. Perhaps you feel that you are being held back either by your own fears or by others.<\/p>"
    },
    {
        "title": "Harp",
        "desc": "<p>To see or play a harp in your dream represents spiritual harmony. It is a healing symbol. Alternatively, the harp may be a pun on how you are &quot;harping on&quot; someone and getting on their case about something.<\/p>"
    },
    {
        "title": "Harpoon",
        "desc": "<p>To see or use a harpoon in your dream represents your desire to nail down a solution to a waking problem. You are ready to explore and confront certain emotions. A harpoon is also seen as a phallic symbol and thus represent all things masculine.<\/p>"
    },
    {
        "title": "Harpy",
        "desc": "<p>To see a harpy in your dream symbolizes the devouring female. It also suggests that you are in the middle of some emotional turmoil.<\/p>"
    },
    {
        "title": "Harry Potter",
        "desc": "<p>To see Harry Potter in your dream indicates that you have the potential to accomplish amazing things in the face of insurmountable hardships. Harry Potter reflects a more modern, atypical version of a movie hero with glasses and a quiet yet immensely strong personality.<\/p><p>To dream that you are Harry Potter represents your desires to escape from reality. You are living in your own fantasy world.<\/p>"
    },
    {
        "title": "Harvesting",
        "desc": "<p>To dream that you are harvesting crops denotes that you still have some ways to go before fully developing your career and goals. Alternatively, a harvest symbolizes plentitude and abundance. You are about to reap the benefits of your hard work. If you grew up on a farm, then the dream could be bringing you back to a simpler time or to a time where you felt a certain way.<\/p>"
    },
    {
        "title": "Hash Browns",
        "desc": "<p>To see or eat hash browns in your dream indicate a positive outlook to your day. You are getting off to a good start for some project.<\/p>"
    },
    {
        "title": "Hat",
        "desc": "<p>To see or wear a hat in your dream indicates that you are hiding an aspect of yourself or that you are covering up something. Alternatively, it represents your attitude or the various roles and responsibilities you have in your waking life.<\/p><p>To dream that you are wearing different hats symbolize the many different roles you have in your waking life. Perhaps you feel you are stretched too thin and overburdened by daily responsibilities.<\/p><p>To dream that you are changing hats represent your changing opinions and thoughts.<\/p>"
    },
    {
        "title": "Hatch",
        "desc": "<p>To see eggs hatching in your dream indicates that you will realize your goals. It also means that your ideas are coming to fruition.<\/p>"
    },
    {
        "title": "Hatchet",
        "desc": "<p>*Please See: <a href=\"#Ax\">Ax<\/a>.<\/p>"
    },
    {
        "title": "Hate",
        "desc": "<p>To dream about hate indicates repressed aggression and your fear of confrontations. On the other hand, you may forcing your views and opinions onto others. Consider the symbolism of other elements in the dream to find out what is it that you really hate.<\/p>"
    },
    {
        "title": "Haunted",
        "desc": "<p>To dream that you are being haunted indicates early unpleasant traumas and repressed feelings or memories. You are experiencing some fear or guilt about your past activities and thoughts.<\/p><p>To see a haunted car in your dream represents unfinished goals. You had started off on a path or journey, but never reached the end. Perhaps life has taken you on a different direction than you had planned or intended.<\/p>"
    },
    {
        "title": "Haunted House",
        "desc": "<p>To dream of a haunted house signifies unfinished emotional business related to your childhood family, dead relatives, or repressed memories and feelings.<\/p><p>To dream that you buy a house that is possessed or haunted suggests that you are trying to run away from the past. However, things have a way of catching up with you and you must deal with them or live with the consequences.<\/p>"
    },
    {
        "title": "Hawaii",
        "desc": "<p>To see or dream about Hawaii symbolizes relaxation and leisure. You are trying to escape from your daily problems.<\/p>"
    },
    {
        "title": "Hawaiian Shirt",
        "desc": "<p>To see or wear a Hawaiian Shirt in your dream represents your relaxed attitude. It also points to your warmth and approachability. You have a welcoming demeanor.<\/p>"
    },
    {
        "title": "Hawk",
        "desc": "<p>To see a hawk in your dream denotes that suspicions are lurking around you and your activities. You need to proceed with caution. Alternatively, a hawk symbolizes insight. Consider the phrase &quot;hawk's eye&quot; to mean that you need to keep a close watch on someone or some situation.<\/p><p>Dreaming of a dead hawk implies that you are being kept in the dark about some problem or issue. Someone is preventing you from knowing the truth.<\/p><p>If you dream of killing a hawk, then it suggests that you are lacking vision in some area of your life. Perhaps you are being too narrow-minded.<\/p>"
    },
    {
        "title": "Hawthorn",
        "desc": "<p>To see a hawthorn tree in your dream symbolizes fertility and rebirth. It also indicates a new surge in your creativity and personal development.<\/p><p>To smell a hawthorn in your dream represents sex, lust, or sensuality.<\/p>"
    },
    {
        "title": "Hay",
        "desc": "<p>To see hay in your dream represents the necessity of hard work; nothing in life comes easy. You may also be feeling hopeless about a situation. Alternatively, hay indicates the need to nurture your maternal instincts, masculine energy, and\/or your sexual urges. Consider also the symbol as a pun on &quot;hey&quot;. Your dream may be trying to call your attention to something.<\/p>"
    },
    {
        "title": "Hazard",
        "desc": "<p>To see a hazard in your dream suggests that you need to exercise caution in some aspect of your life. Weigh your options carefully and think through your actions.<\/p>"
    },
    {
        "title": "Hazelnut",
        "desc": "<p>To see or eat a hazelnut in your dream represents untainted love and honored devotion. You have no lingering doubt or mistrust in your relationship.<\/p>"
    },
    {
        "title": "Head",
        "desc": "<p>To see a head in your dream signifies wisdom, intellect, understanding and rationality. It may also represent your accomplishments, self-image, and perception of the world. The dream may also be metaphor to indicate that you are &quot;ahead&quot; in some situation or that you need to get ahead.<\/p><p>To dream that someone is trying to rip your head off suggests that you are not seeing a situation or problem clearly. Perhaps you are refusing to see the truth. You have to confront the situation or the person despite the pain and discomfort you might feel in doing so.<\/p><p>To dream that you have two heads indicate that you need to learn to ask for help and accept assistance. Consider the metaphor &quot;two heads are better than one&quot;. Do not try to do everything yourself.<\/p><p>To dream that your head is particularly heavy or weighing you down means that you are over-thinking or over-analyzing some situation. As a result, you are unable to move forward.<\/p>"
    },
    {
        "title": "Headache",
        "desc": "<p>To dream that you have a headache suggests that you are heading in the wrong direction. You are ignoring your intellect and rational thinking. You need to utilize your mind and not let your emotions get out of control.<\/p>"
    },
    {
        "title": "Headband",
        "desc": "<p>To see or wear a headband in your dream indicates that you are holding back some information. There is a secret that you are not revealing. Alternatively, the dream relates to some intellectual matter. Perhaps there is something that you need to think carefully about.<\/p>"
    },
    {
        "title": "Headboard",
        "desc": "<p>To see a headboard in your dream suggests that you are being shielded from some information. Alternatively, the headboard may be a play on words and indicates that you are mentally bored or uninterested in something.<\/p>"
    },
    {
        "title": "Headdress",
        "desc": "<p>To see or wear a headdress in your dream suggests that you will win out in some argument, battle or negotiation. You attack your problems head on.<\/p>"
    },
    {
        "title": "Headless",
        "desc": "<p>To see a headless body walking around or dream that you are headless means that you are not using your head. You are not thinking clearly. Or the dream suggests that you have literally lost your mind. Consider how the body is dressed or the condition of the body. If the body is naked, then it implies that you are being too gullible or too trusting of others. If part of the body is burnt or wounded, then it indicates that your mindlessness have put you in harm's way.<\/p><p>To see a headless horseman in your dream suggests that you are under some negative influence. It is usually a bad sign indicating that something is coming to an end.<\/p><p>To dream that you are a headless horseman implies that you have an inflated sense of power. It may also mean that you are being secretive about something.<\/p>"
    },
    {
        "title": "Headlights",
        "desc": "<p>To see a car's headlights in your dream indicate your inability to look beyond the past. You are dwelling on old issues. Alternatively, the dream suggests that you are being caught off guard or caught by surprised as in a &quot;deer in the headlights.&quot;<\/p><p>If your headlights are on high beam, then it means that you are forcing your opinions and views on others.<\/p>"
    },
    {
        "title": "Headline",
        "desc": "<p>To dream that you are reading a headline indicates a special message from your subconscious. Try to determine the significance of the message and how it applies to your waking life.<\/p>"
    },
    {
        "title": "Headphones",
        "desc": "<p>To dream that you are wearing headphones indicate that you are the only one getting the message. Furthermore, it means that you are in tune with your intuition.<\/p>"
    },
    {
        "title": "Headstand",
        "desc": "<p>To dream that you are doing a headstand implies that you need to think through things more clearly. You need to look at the issues from a different perspective. Alternatively, the dream means that you feel that you need to go out of your way to please others.<\/p>"
    },
    {
        "title": "Headstone",
        "desc": "<p>To see a headstone in your dream represents a forgotten or buried aspect of yourself which you need to acknowledge. Consider also the message on the headstone. It may indicate a statement about your life and its condition.<\/p>"
    },
    {
        "title": "Healing",
        "desc": "<p>To dream of healing represents your need for emotional and\/or physical healing. You need to find the power to rectify and care for the issues in your life.<\/p>"
    },
    {
        "title": "Health Club",
        "desc": "<p>*Please See: <a href=\"#Gynasium\">Gymnasium<\/a>.<\/p>"
    },
    {
        "title": "Hear",
        "desc": "<p>To dream that no one hears you refers to a waking situation where you feel that no one is listening to you or paying attention to what you are saying. You feel you are being overlooked or overshadowed.<\/p>"
    },
    {
        "title": "Hearing Aid",
        "desc": "<p>To see or wear a hearing aid in your dream suggests that you are not paying enough attention to what someone is trying to tell you. You are not picking up on certain cues.<\/p>"
    },
    {
        "title": "Hearse",
        "desc": "<p>To see a hearse in your dream indicates that you are moving into a new phase. You need to carry away and let go of some unfinished issues. Start taking action and making the necessary changes that will carry you into a new transitional level.<\/p><p>Dreaming of a hearse at wedding represents a major transition in your life. The symbolism of both the hearse and the wedding is about an end to something and the beginning of a new phase in your life.<\/p>"
    },
    {
        "title": "Heart",
        "desc": "<p>To see your heart in your dream signifies truth, courage, love, and romance. It is representative of how you are currently dealing with your feelings and expressing your emotions. Also consider the saying &quot;the heart of the matter&quot; which implies that you may need to get down to the core of a situation before proceeding.<\/p><p>To see a winged heart in your dream represents the power of love and its ability to penetrate through to anyone.<\/p><p>To dream that your heart is bleeding oraching represents desperation, despair, extreme sadness and sympathy. You are lacking support or love in some a situation in your life.<p>To dream that you have a heart transplant or heart surgery indicates a huge change in your personal relationship. Perhaps you are involved in a rebound relationship.<\/p><p>Dreaming that you are eating a human heart implies that you are looking to process and understand some emotional issue. You may also be trying to fill an emotional void.<\/p><p>To see or hold a red paper heart in your dream represents your vulnerabilities. You are exposing your emotions. Alternatively, the red paper heart is symbolic of an innocent heart.<\/p>"
    },
    {
        "title": "Heart Attack",
        "desc": "<p>To dream that you have a heart attack refers to a lack of support and acceptance. Perhaps you also feel a loss of love.<\/p>"
    },
    {
        "title": "Heartbeat",
        "desc": "<p>To hear a heartbeat in your dream suggests that you are not confronting or recognizing your feelings. You need to approaching things head-on. Alternatively, a heartbeat may symbolize life or fear. Perhaps, you are feeling threatened in some way.<\/p>"
    },
    {
        "title": "Heartbreak",
        "desc": "<p>To dream that you are going through a heartbreak signifies transitions and changes. Alternatively, the dream suggest that you are lacking love or support in some endeavor in your life. There is an imbalance. A more literal interpretation of this dream means that you are going through some sort of emotional turmoil in your waking life. You do not know how to deal with those feelings.<\/p>"
    },
    {
        "title": "Hearth",
        "desc": "<p>To see the hearth in your dream signifies nurturance, security, and comfort. It also indicates close family values and tight connections.<\/p>"
    },
    {
        "title": "Heat",
        "desc": "<p>To feel heat in your dream indicates a feeling of shame or embarrassment. Alternatively, it represents purity, creative energy or intense passion.<\/p>"
    },
    {
        "title": "Heating Pad",
        "desc": "<p>To see or use a heating pad in your dream implies that you are harboring a lot of anger. You are keeping it all in instead of trying to deal with it.<\/p>"
    },
    {
        "title": "Heater",
        "desc": "<p>To see or use a heater in your dream signifies warmth, nurturance, and comfort. It may also mean that you have opened up your feelings and allow yourself to love and be loved.<\/p>"
    },
    {
        "title": "Heather",
        "desc": "<p>To see heathers in your dream symbolize luck, good fortune, longevity and tranquil life. Alternatively, the dream may be a pun on someone who is named Heather.<\/p>"
    },
    {
        "title": "Heaven",
        "desc": "<p>To see heaven in your dream signifies your desires to find perfect happiness. You may be trying to escape from the difficulties you are experiencing in your life. The dream serves as a medium in which you can restore your faith, optimism, and hope.<\/p>"
    },
    {
        "title": "Heavy",
        "desc": "<p>To dream that something is too heavy symbolizes your burdens, work load and responsibilities. You are carrying too much on your shoulders and need to prioritize. Take a break and lighten up.<\/p>"
    },
    {
        "title": "Hedge",
        "desc": "<p>To see hedges in your dream symbolize restrictions and obstacles that are inhibiting your progress.<\/p><p>To dream that you are trimming a hedge denotes your acceptance of the restrictions you are facing. You are making the best out of a negative situation.<\/p>"
    },
    {
        "title": "Hedgehog",
        "desc": "<p>To see a hedgehog in your dream suggests that you are being overly sensitive. You are taking everything too personally. Alternatively, it refers to losing your soul.<\/p>"
    },
    {
        "title": "Heel",
        "desc": "<p>To see your heel in your dream signifies oppression, lowliness, and vulnerability. The dream may also be a pun on &quot;heal&quot;. Perhaps the dream is telling you that you need time to heal and recovery, either emotionally or physically.<\/p>"
    },
    {
        "title": "Height",
        "desc": "<p>To dream that you are at a great height signifies that you have reached one of your highest goals or objectives.<\/p><p>To dream that you are afraid of heights denotes that you are striving for goals that seem beyond your reach.<\/p>"
    },
    {
        "title": "Heimlich Maneuver",
        "desc": "<p>To perform the Heimlich Maneuver on someone in your dream suggests that you are trying to get that person to open up to you.<\/p><p>To dream that someone is performing the Heimlich Maneuver on you indicates that you are beginning to open up to others. All the emotions that you have been holding back are coming to the surface.<\/p>"
    },
    {
        "title": "Helicopter",
        "desc": "<p>To see a helicopter in your dream represents your ambitions and achievements. You are in full pursuit of your goals.<\/p><p>To dream that you are in a helicopter indicates that you are living beyond your means. You need to slow down and not try to please everyone. Alternatively, you may be experiencing a higher level of consciousness, new-found freedom and greater awareness.<\/p><p>To dream that you are chased or stalked by a helicopter indicates that you are feeling trapped by your aspirations. You feel you are pursuing others people's goals instead of your own.<\/p>"
    },
    {
        "title": "Helix",
        "desc": "<p>To see a helix in your dream symbolizes energy, fertility or immortality. In particular, to dream of a double helix (DNA) signifies life, humanity and science.<\/p>"
    },
    {
        "title": "Hell",
        "desc": "<p>To dream of hell suggests that you are suffering from a seemingly inescapable situation. You may have placed your decision or course of action into someone else's hand. Alternatively, you may be possessing a guilty conscious, some inner fears or repressed negative feelings. It is time to quit punishing yourself and take it easy for awhile.<\/p>"
    },
    {
        "title": "Hello Kitty",
        "desc": "<p>To see Hello Kitty in your dream represents the youthful side of your persona. You are trying to recapture your innocence. in some way.<\/p>"
    },
    {
        "title": "Helm",
        "desc": "<p>To dream that you are at the helm of a ship represents your willpower and motivation to move forward toward your goals in your life. If someone else is at the helm, then it indicates that this person has an important influence in the direction that your life is headed.<\/p>"
    },
    {
        "title": "Helmet",
        "desc": "<p>To see a helmet in your dream symbolizes protection. It also indicates that you need to keep your thoughts and ideas closely guarded.<\/p>"
    },
    {
        "title": "Help",
        "desc": "<p>To dream that you are helping someone indicates your willingness to compromise your beliefs toward a greater accomplishment. It also represents your efforts to combine your talents or energies to achieve a mutual goal. In particular, if you are helping an enemy or someone you do not like, then it suggests that you need to come to an understanding or some sort of middle ground in order to move forward with your life.<\/p><p>To dream that you are calling or signaling for help suggests that you are feeling lost, overwhelmed, and\/or inadequate.<\/p>"
    },
    {
        "title": "Helpless",
        "desc": "<p>To dream that you are or feel helpless suggests that you are experiencing difficulties in confronting a situation or relationship. You feel that you are unable to take charge of yourself.<\/p>"
    },
    {
        "title": "Hem",
        "desc": "<p>To dream that you are sewing a hem represents your indecisiveness. Alternatively, it suggests that you are tying up the loose ends of a project.<\/p>"
    },
    {
        "title": "Hemorrhage",
        "desc": "<p>Todream that you are hemorrhaging suggests loss of vitality, loss of faith in yourself, and lack of self-confidence. Also consider where you are hemorrhaging from and analyze the symbolism of that body part.<\/p><p>*Please see also: <a href=\"#Blood\">Blood<\/a>.<\/p>"
    },
    {
        "title": "Hemorrhoids",
        "desc": "<p>To dream that you have hemorrhoids indicate difficulties in accepting who you are and loving yourself. Alternatively, it suggests that you are suppressing your thoughts and feelings.<\/p>"
    },
    {
        "title": "Hemp",
        "desc": "<p>*Please See: <a href=\"#Marijuana\">Marijuana<\/a>.<\/p>"
    },
    {
        "title": "Hen",
        "desc": "<p>To see a hen in your dream symbolizes gossip and calamity.<\/p><p>You have a tendency to brag about minor things. The hen is also a maternal figure. Consider the metaphor of being &quot;hen-pecked&quot; or that you feel being picked on.<\/p>"
    },
    {
        "title": "Henchman",
        "desc": "<p>To dream that you have your own henchmen or that you are surrounded or chased by henchmen indicate that there is an issue that you are avoiding. You have unresolved inner conflicts and are refusing to address certain issues or feelings directly.<\/p>"
    },
    {
        "title": "Henna",
        "desc": "<p>To dream that you have a henna tattoo signifies good luck. You are transitioning into a new phase in your life.<\/p>"
    },
    {
        "title": "Herbs",
        "desc": "<p>To dream of herbs indicate your need to take a new approach toward some situation or relationship. You need to look at things from a different perspective and live life with some zest.<\/p><p>Alternatively, it is symbolic of healing and magic. Consider the smell, color, and shape of the herb for additional significance.<\/p>"
    },
    {
        "title": "Hercules",
        "desc": "<p>To see Hercules in your dream suggests your individual struggle for freedom and immortality.<\/p>"
    },
    {
        "title": "Herd",
        "desc": "<p>To see a herd in your dream indicates that you are a follower. You tend to go along with the crowd. Learn to make your own decision and take initiative. The dream may also be a pun on &quot;heard&quot;. Perhaps you heard something that was not meant for your ears. Consider also the specific animal in the herd.<\/p>"
    },
    {
        "title": "Hermaphrodite",
        "desc": "<p>* Please See: <a href=\"#Intersex\">Intersex<\/a>.<\/p>"
    },
    {
        "title": "Hermit",
        "desc": "<p>To dream that you are a hermit represents your need to be alone or that you are feeling alone. You are withdrawing from daily life and distancing yourself from others. Find a way to get out of this rut.<\/p>"
    },
    {
        "title": "Hero",
        "desc": "<p>To dream that you are a hero signifies your inner strengths and weaknesses. The dream refers to your ability, determination and level of confidence. You have the power to bravely face the secrets of your subconscious and confront life's challenges.<\/p>"
    },
    {
        "title": "Heroin",
        "desc": "<p>To use heroin in your dream refers to your desire to escape from the pain of reality instead of confronting them. You are looking for a &quot;fix&quot; because you are feeling broken.<\/p>"
    },
    {
        "title": "Heron",
        "desc": "<p>To see a heron in your dream represents self-reliance, stability, tactfulness and careful forethought. You will achieve much success through your efforts. Alternatively, dreaming of a heron signifies your ability to explore and delve into your subconscious.<\/p>"
    },
    {
        "title": "Herpes",
        "desc": "<p>To dream that you or someone has herpes refers to your sexual anxiety and worries. Perhaps you have practiced unsafe sex and are expressing your regrets.<\/p>"
    },
    {
        "title": "Hershey's Kiss",
        "desc": "<p>To see a Hershey's Kiss in your dream symbolizes a sweetheart or some sweet love in your life.<\/p>"
    },
    {
        "title": "Heterosexual",
        "desc": "<p>If you are not heterosexual in your waking life, but dream that you are heterosexual, then it means that you are trying to bring together opposing forces.<\/p><p>If you are heterosexual in your waking life, then the dream is simply a reflection of your own self.<\/p>"
    },
    {
        "title": "Hex",
        "desc": "<p>To dream that you are putting a hex on someone represents your vengeful nature and vindictiveness.<\/p><p>To dream that someone is putting a hex on you symbolizes angry and hurtful feelings. You are unable to cope in some painful situation.<\/p>"
    },
    {
        "title": "Hexagon",
        "desc": "<p>To see a hexagon in your dream signifies your direction or position in life as represented by each of the six corner and sides. The dream may be telling to you move up or down, forward or backward and left or right. Alternatively, a hexagon symbolizes death.<\/p>"
    },
    {
        "title": "Hexagram",
        "desc": "<p>To see a hexagram in your dream symbolizes order and harmony in some aspect of your life. It represents balance between the feminine and masculine and between the spiritual and the physical.<\/p>"
    },
    {
        "title": "Hibiscus",
        "desc": "<p>To see hibiscus in your dream signifies respect. It is also synonymous with gentleness, fragility and delicate beauty.<\/p><p>To dream that someone gives you hibiscus indicates that you need to take advantage of some opportunity.<\/p>"
    },
    {
        "title": "Hiccup",
        "desc": "<p>To dream that you have hiccups symbolize minor interruptions and annoyances. You need to pace yourself and take your time in moving toward your goals.<\/p>"
    },
    {
        "title": "Hickey",
        "desc": "<p>To dream that you have a hickey represents a split between your rational thinking and your emotional thinking. You may be acting with your heart instead of thinking things out more clearly. Alternatively, you may be feeling emotionally or physically drained. You feel that you are giving too much of yourself in a relationship or situation.<\/p>"
    },
    {
        "title": "Hide 'N Seek",
        "desc": "<p>To dream that you are playing hide 'n seek means that you are keeping some information or secret that you cannot keep inside any longer. Consider whether you were the one hiding or the one seeking. If you were the one hiding, then it indicates that there is something that you are not revealing or sharing. If you are the one that is seeking, then it represents your inquisitive mind and your desire to find more information about a particular situation. Alternatively, the dream may be a regression of your childhood where the times were more carefree and simpler.<\/p>"
    },
    {
        "title": "Hiding",
        "desc": "<p>To dream that you are hiding suggests that you are keeping some secret or withholding some information. You may not be facing up to a situation or dealing with some issue. However, you may be getting ready to reveal something and confess before somebody finds out. In particular, to dream that you are hiding from some authority figure (police, parent, teacher...), implies feelings of guilt.<\/p><p>To dream that someone is hiding indicates that you are looking for a sense of security and protection.<\/p>"
    },
    {
        "title": "Hieroglyphics",
        "desc": "<p>To see hieroglyphics in your dream denote that you will face many obstacles as you try to figure out your path in life.<\/p>"
    },
    {
        "title": "High Chair",
        "desc": "<p>To see a high chair in your dream indicates that you are trying to gain a better perspective on some issue.<\/p><p>To dream that you are sitting on a high chair suggests that you have a tendency to look down on others. You expect others to be at your feet. It represents your elevated sense of self and high ambition.<\/p>"
    },
    {
        "title": "High Five",
        "desc": "<p>To dream that you high five someone indicates that you are looking for approval, validation and acknowledgement for your work. Also consider the significance of the number five.<\/p>"
    },
    {
        "title": "High Heels",
        "desc": "<p>To dream that you are wearing high heels represent femininity and glamour. You feel confident and self-assured. Alternatively, high heels indicate that you are feeling restricted and limited in your role as a female. You do not think that you can fully and freely express yourself.<\/p>"
    },
    {
        "title": "High Priestess",
        "desc": "<p>To see the High Priestess in your dream indicates that there is something emerging from your subconscious. The dream symbol is telling you to go with your gut feeling and trust your intuition. Alternatively, the High Priestess is a symbol of creativity and inner wisdom.<\/p>"
    },
    {
        "title": "High School",
        "desc": "<p>To dream about high school refers to the bonds and friendships that you made while you were in high school. What spiritual lessons have you learned? The dream may also be telling you that you need to start preparing for the real world.<\/p><p>To dream that you have to repeat high school suggests that you are doubting your accomplishments and the goals that you have already completed. You feel that you may not be measuring up to the expectation of others. The dream may occur because some recent situation may have awakened old anxieties and insecurities.<\/p><p>*Please See Also: <a href=\"#School\">School<\/a>.<\/p>"
    },
    {
        "title": "High Top",
        "desc": "<p>To dream that you are wearing high top shoes means that you are always on the move. The dream may also be telling you that there is a situation where you need to take quick and decisive action.<\/p>"
    },
    {
        "title": "Highlighter",
        "desc": "<p>To see a highlighter marker in your dream represents enlightenment. There is something that you need to pay closer attention to. Consider what you are highlighting and the significance of the message.<\/p>"
    },
    {
        "title": "Highlights",
        "desc": "<p>To dream that you are highlighting your hair indicates that you are ready for a change in your life. You are looking at things from a different perspective.<\/p>"
    },
    {
        "title": "Highway",
        "desc": "<p>To see a highway in your dream represents your sense of direction and your life's path. Consider the conditions of the highway which will reveal how much you feel in charge of your life. A smooth, straight highway signifies inner peace, while a winding, bumpy road reflects emotional distress\/disharmony.<\/p><p>To see an elevated highway in your dream implies that you are taking the higher road in some situation. Alternatively, the dream means that you believe your way of doing things is more superior.<\/p><p>*Please See Also: <a href=\"#Road\">Road<\/a>.<\/p>"
    },
    {
        "title": "Hijack",
        "desc": "<p>To dream that something has been hijacked symbolizes your loss of control. The dream may be analogous to someone or something that has taken over an aspect of your life. In particular, to dream that an airplane is hijacked signifies disturbing feelings and past emotions in your subconscious mind.<\/p>"
    },
    {
        "title": "Hiking",
        "desc": "<p>To dream that you are hiking represents progress and achievement. With perseverance and strong-will, you will make it far in life.<\/p>"
    },
    {
        "title": "Hill",
        "desc": "<p>To dream that you are climbing a hill signifies your struggles in achieving a goal. You need to focus your energies on the prize. To dream that you are standing on top of a hill suggests that you have succeeded in your endeavors. You have the necessary resources to complete the task at hand.<\/p><p>Dreaming that you are going down a hill means that things are not going your way. You are experiencing some setbacks. Alternatively, the dream signifies regression or repressed thoughts.<\/p><p>To see a hill in your dream symbolizes challenges or obstacles that you will confront in the near future. Alternatively, the hill may represent your desire to escape from your current situation. Dreaming of rolling hills refer to life's ups and downs.<\/p>"
    },
    {
        "title": "Hinge",
        "desc": "<p>To see a hinge in your dream represents your access to opportunities or information.<\/p>"
    },
    {
        "title": "Hippie",
        "desc": "<p>To see a hippie in your dream represents excess and freedom of expression.<\/p><p>To dream that you are a hippie suggests that you want to be different. You are rejecting some aspect of society.<\/p>"
    },
    {
        "title": "Hippopotamus",
        "desc": "<p>To see a hippopotamus in your dream symbolizes your aggressive nature and your hidden strengths. You have more influence and power than you realize.<\/p><p>Alternatively, it indicates that you are being territorial. Perhaps someone is overstepping their boundaries.<\/p><p>To see a group of hippopotamuses in your dream suggest that you need to escape from the daily grind and relax.<\/p>"
    },
    {
        "title": "Hips",
        "desc": "<p>To notice your hips in your dream represents your mobility and adaptability to some situation. It relates to getting things done. The dream may also be a pun on being hip.<\/p>"
    },
    {
        "title": "Hire",
        "desc": "<p>To dream that you are hiring someone means that you are lacking a certain quality of the person you are hiring and need to incorporate that quality within your own self. There is a void that you need to fill. Alternatively, the dream may be a pun on a &quot;higher' self.<\/p>"
    },
    {
        "title": "History",
        "desc": "<p>To dream of history suggest that you are regressing in to an earlier time. You may be trying to recapture or relive past emotions. Or you are holding on to old beliefs and outdated ways of thinking.<\/p>"
    },
    {
        "title": "Hit",
        "desc": "<p>To dream that you hit something or someone symbolizes unexpressed anger and aggression. You tend to keep your negative feelings inside instead of expressing them in a healthy way.<\/p><p>To dream that someone is hitting you implies that you are feeling helpless or powerless in some waking situation. Someone is trying to force their opinion or view on you.<\/p><p>To dream that you are almost hit or were ran over by a car suggests that your lifestyle, beliefs or goals may be in conflict with another's. It may also be symbolic of a jolting experience or injured pride.<span style=\"color: rgb(0, 0, 0); font-family: Arial, helvetica, sans-serif; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">If you are almost hit by a car that looks like a cat, then it suggests that you are hindering someone's goals or not letting them be who they are.<\/p>"
    },
    {
        "title": "Hit And Run",
        "desc": "<p>To dream that you are a victim of a hit and run means that certain aspects of your life beyond your control. Alternatively, dreaming of a hit and run implies that someone else's goal and life path are affecting your own personal goals and path. If your dream involved you running away from a hit and run accident, then it implies that you are running away from some waking responsibility. You are refusing to take responsibility for your actions.<\/p>"
    },
    {
        "title": "Hitchhiking",
        "desc": "<p>To dream that you are hitchhiking suggests that you have not earned or deserved to be in this position you are at currently. The dream may also be a metaphor that you are getting a free ride. You are becoming too dependent on others and\/or using them to get what you want.<\/p><p>To pick up a hitchhiker in your dream indicates that you are taking on too many responsibilities. There is a fine line between helping others and letting them take advantage of you.<\/p>"
    },
    {
        "title": "Hitler",
        "desc": "<p>To see Hitler in your dream symbolizes oppression, fear, manipulation of power, and absolute control. The dream could be brought about by a situation where you are feeling helpless or by someone who is overly controlling or is making you feel less than human.<\/p>"
    },
    {
        "title": "Hitman",
        "desc": "<p>To dream that you are a hitman or that you hire one indicates that there is some aspect of yourself that you are desperately trying to rid yourself of.<\/p>"
    },
    {
        "title": "Hive",
        "desc": "<p>*Please see: <a href=\"#beehive\">Beehive<\/a>.<\/p>"
    },
    {
        "title": "Hives",
        "desc": "<p>To dream that you break out in hives indicate that you are worried about some situation or decision. It also signifies nervousness or fear.<\/p>"
    },
    {
        "title": "Hoarding",
        "desc": "<p>To dream that you are hoarding symbolizes selfishness. You need to learn to share. Alternatively, the dream implies that you are afraid of letting the past go. You are trying to hold on to memories.<\/p>"
    },
    {
        "title": "Hoarse",
        "desc": "<p>To hear or dream that you have a hoarse voice suggests that you or someone is not being truthful.<\/p>"
    },
    {
        "title": "Hobbit",
        "desc": "<p>To see or dream that you are a hobbit refers to your potential for greatness. You hold the power to change.<\/p>"
    },
    {
        "title": "Hobby",
        "desc": "<p>To dream that you are taking up a new hobby suggests that you need to acknowledge your hidden talents or desires. Alternatively, you need to allocate some time for yourself so you can pursue your own interests.<\/p>"
    },
    {
        "title": "Hobo",
        "desc": "<p>*Please see: <a href=\"#Vagrant\">Vagrant<\/a>.<\/p>"
    },
    {
        "title": "Hockey",
        "desc": "<p>To dream that you are playing or watching hockey is analogous to how you are achieving and protecting of your goals. It also suggests that you may be dealt with a lot of hard blows in your life.<\/p>"
    },
    {
        "title": "Hoe",
        "desc": "<p>To see or use a hoe in your dream suggests that you are breaking though the barriers and limits. You are laying the groundwork and ready for growth.<\/p>"
    },
    {
        "title": "Hog",
        "desc": "<p>To see a hog in your dream symbolizes abundance. The dream may also be a pun on how you are &quot;hogging&quot; everything instead of sharing.<\/p><p>To see a hog playing in the mud suggests that you are lowering your standards.<\/p><p>*Please Also See: <a href=\"#Pig\">Pig<\/a>.<\/p>"
    },
    {
        "title": "Hold",
        "desc": "<p>To dream that you are holding something suggests that you are trying to control or manipulate this object. Consider the significance and symbolism of this object. Holding may also signify protection, responsibility, or possession.<\/p>"
    },
    {
        "title": "Hole",
        "desc": "<p>To see a hole in the ground denotes hidden aspects of your activities. On the other hand, it may mean that you are feeling hollow or empty inside. This dream may be an awakening for you to get out and expose yourself to new interests and activities. Alternatively, the dream may be a pun on &quot;wholeness&quot; or completeness.<\/p><p>To dream that you fall into a hole represents a pitfall in some waking situation. You feel you are stuck. Perhaps, you have dug yourself into a hole and cannot get out of it.<\/p><p>To dream that there is a hole in your clothing indicates that there are some flaws in your thinking or thought process.<\/p><p>You may need to undergo an image makeover.<\/p>"
    },
    {
        "title": "Holidays",
        "desc": "<p>To dream that you are on holiday represents a need for a break or time for rest. You are expressing a wish to escape from your responsibilities. Depending on the activities related to the holiday, the dream may also indicate family issues, personal attitudes or some difficulty.<\/p>"
    },
    {
        "title": "Hollow",
        "desc": "<p>To dream of something that is hollow represents the womb and nurturance. It may also symbolize some hidden secrets. Alternatively, it may indicate that you are feeling empty, worthless, or insignificant in your waking life.<\/p>"
    },
    {
        "title": "Holly",
        "desc": "<p>To see holly in your dream represents holiday festivities and memories of friends and family. It also symbolizes eternity and magic. The dream may be a metaphor for someone named &quot;Holly&quot; in your waking life.<\/p>"
    },
    {
        "title": "Hollywood",
        "desc": "<p>To dream that you are in Hollywoodsymbolizes fame and glamour. The dream may be telling you to be more realistic with your goals. You need to come down from you lofty ambitions or idealistic notions.<\/p>"
    },
    {
        "title": "Holocaust",
        "desc": "<p>Todream about the Holocaust indicates that you are being unjustly blamed for something. The dream may also be brought about by a movie or book related to the Holocaust. Perhaps, the disturbing events may have left a strong impression in your mind. Note that your own personal feelings about the Holocaust will overrule any other interpretation.<\/p>"
    },
    {
        "title": "Hologram",
        "desc": "<p>To see a hologram in your dream suggests that you need to look at the overall picture instead of just at pieces of it in order to get the whole story. Alternatively, the dream symbolizes your ideal self and your notions of perfection.<\/p>"
    },
    {
        "title": "Holy Child",
        "desc": "<p>To see a holy child in your dream indicates that you are undergoing an important transformation in some aspect of your life. You are ready to confront some childhood pain trauma and move forward with your life.<\/p>"
    },
    {
        "title": "Holy Grail",
        "desc": "<p>To dream that you are on the quest for the Holy Grail indicates wish fulfillment. You are trying to find yourself or are looking for some aspect of yourself that may have been suppressed or forgotten.<\/p>"
    },
    {
        "title": "Holy Spirit",
        "desc": "<p>To dream of the Holy Spirit indicates your connection with God. You are looking for guidance to stay on the right path. The dream may be a sign that you have accepted and received the Holy Spirit as part of your daily life.<\/p>"
    },
    {
        "title": "Holy Water",
        "desc": "<p>To drink or splash holy water in your dream represents a need for spiritual cleansing and rejuvenation. You are seeking calmness and tranquility.<\/p>"
    },
    {
        "title": "Home",
        "desc": "<p>To see your home in your dream signifiessecurity, basic needs, and values. You may be feeling at &quot;home&quot; or settled at your new job or environment.<\/p><p>Alternatively, the dream represents your basic needs and priorities. In particular, to see your childhood home, your hometown, or a home that you previously lived in, indicates your own desires for building a family and your family ideologies. It also reflects aspects of yourself that were prominent or developed during the time you lived in that home. You may experience some unfinished feelings that are being triggered by some waking situation. Alternatively, the dream may represent your outdated thinking.<\/p><p>To dream that you cannot find your way home indicates that you have lost faith and belief in yourself. It may also signify a major transition in your life.<\/p>"
    },
    {
        "title": "Home Improvements",
        "desc": "<p>To dream of making home improvements or working on home improvement projects refers to improvements that you need to make on yourself. Consider the type of improvement made in the dream for additional analysis. If you are adding onto your home, then it suggests that you need to expand your way of thinking. You need a wider perspective on things. If you are re-roofing in your dream, then it suggests that you need to raise your goals. You need to set your sights higher.<\/p>"
    },
    {
        "title": "Homecoming",
        "desc": "<p>To dream that you are at a homecoming event suggests that you need to acknowledge the past and recognize those former relationships that has brought you to where you are today. Perhaps you need to express some gratitude to those who supported you along the way. Alternatively the dream may be a pun on &quot;coming home&quot; or returning home.<\/p>"
    },
    {
        "title": "Homeless",
        "desc": "<p>To dream that you are homeless indicates that you are feeling powerless and insecure. You are unsure of yourself and where you are headed.<\/p><p>Seeing someone who is homeless in your dream is a reminder to cherish and value what you already have. If you dream that you are mean or cruel to the homeless, then it implies that you are taking what you already have for granted.<\/p><p>To dream that there is a homeless family living in your garage indicates that something is missing in your life. Perhaps you are headed in the wrong direction. Your current path is leaving you unfulfilled and unsatisfied. Alternatively, the dream means that you need to be more resourceful and make the best of an undesirable situation.<\/p>"
    },
    {
        "title": "Homeschool",
        "desc": "<p>To dream that you are being homeschooled symbolizes an important lesson that you can only learn from your parents or from some aspect of your home life. Alternatively, to dream of homeschooling refers to some area where you need to better focus your attention.<\/p>"
    },
    {
        "title": "Homosexual",
        "desc": "<p>If you are not homosexual in your waking life and dream that you are homosexual represents a union with aspects of yourself. It is symbolic of self-love, self-acceptance, and compassion.<\/p><p>If you are uncomfortable with homosexuality in your dream, then it suggests some fears or anxieties about femininity (if you are female) and your masculinity (if you are male).<\/p><p>You may be experiencing some insecurity in your relations with the opposite sex.<\/p><p>To dream that the guy you like in real life is gay represents your anxieties and fears that he won't like you back. By seeing him as gay, then it would be easier for you to dismiss your feelings for him because you have no chance with him.<\/p><p>Dreaming that you are in a relationship with someone who is homosexual in real life implies that you are looking for specific qualities as represented by this person. Alternatively, being in a relationship with a homosexual person means that you are looking for something unattainable in your current relationship.<\/p><p>On a side note, it is common for expectant fathers to have dreams of homosexual encounters.<\/p><p>If you are homosexual in your waking life, then the dream is simply a reflection of your own self.<\/p>"
    },
    {
        "title": "Hometown",
        "desc": "<p>To dream of your hometown indicates that you may be experiencing some unexpressed feelings. You may feel that you are not able to fully express your emotions. This could be triggered by some unfinished feeling in your waking life. The dream could also reflect aspects of yourself that were prominent or developed when you were living in your hometown. Did you abandon certain values or ideals when you moved to the big city? Did you forget some aspect of yourself and who you really are?<\/p>"
    },
    {
        "title": "Homework",
        "desc": "<p>To dream that you are doing homework symbolizes the lessons that have learned or are learning. Pay attention to the assignment in your dream and figure out how it can be applied to your waking life. Alternatively, the dream represents your anxieties about your ability and performance. If you have a homework assignment that is due in real life, then the dream may just be your preoccupation and worry over the assignment.<\/p>"
    },
    {
        "title": "Homicide",
        "desc": "<p>*Please See: <a href=\"#Murder\">Murder<\/a>.<\/p>"
    },
    {
        "title": "Honesty",
        "desc": "<p>To dream that someone is honest to you implies that you are seeking the truth. You feel that you are being mislead in some way in your waking life. Someone is not being open about their motives or feelings.<\/p>"
    },
    {
        "title": "Honey",
        "desc": "<p>To see honey in your dream denotes that you need to be less meek and more honest in communicating with others. You need to assert yourself and make sure you are heard. Alternatively, seeing or eating honey in your dream represents gentleness, sweetness, compassion, wisdom, peace, longevity and joy. It is also symbolic of fertility and productivity. The dream may also be a pun on the &quot;honey&quot; in your life.<\/p><p>To see a honey bear jar in your dream represents a love one. If the honey bear is talking, then it refers to some advice that you should listen to or consider.<\/p>"
    },
    {
        "title": "Honeycomb",
        "desc": "<p>To see a honeycomb in your dream suggests that you are trying to hold on to the sweetness and pleasures that you are experiencing in your life. It is also symbolic of your desire for love and affection.<\/p>"
    },
    {
        "title": "Honeydew",
        "desc": "<p>To see or eat honeydew in your dream implies that you are in a relaxed state in your relationship. You feel at ease and that you can be yourself. Alternatively, the dream may be a metaphor for something you want your significant other (honey) to do.<\/p>"
    },
    {
        "title": "Honeymoon",
        "desc": "<p>To dream that you are on your honeymoon indicates that you are expressing some fear in your sex life. You may also be expressing a desire for some new excitement in your relationship. Perhaps you are nervous about some new turn that the relationship is taking. Alternatively, the dream may represent your desires for a dream honeymoon.<\/p><p>You are looking forward to a getaway.<\/p>"
    },
    {
        "title": "Honeysuckle",
        "desc": "<p>To see honeysuckle in your dream symbolizes your ambition and drive. Alternatively, it represents eroticism, lust and sexuality. You have a lot of love to give.<\/p>"
    },
    {
        "title": "Hood",
        "desc": "<p>To see a hood in your dream signifies that you are hiding and cowering from a person or situation. You or someone may be deceitful about something. Consider also the saying, &quot;having the hood pulled over your eyes&quot;.<\/p><p>To see the hood of a car in your dream symbolizes your protective emotional cover. You tend to hide your true feelings. If you dream that the hood of the car is damaged, then it represents the emotional hurts you have experienced or are going through in your waking life.<\/p>"
    },
    {
        "title": "Hoodie",
        "desc": "<p>To wear a hoodie in your dream signifies warmth and comfort. Alternatively, wearing a hoodie implies that you are hiding from something or someone. You are trying to cover-up your true feelings about some matter.<\/p>"
    },
    {
        "title": "Hoof",
        "desc": "<p>To see a hoof in your dream represents balance, grace, and discipline. To dream that the hoof is broken indicates you inability to balance various aspects of your life. You are lacking discipline.<\/p>"
    },
    {
        "title": "Hookah",
        "desc": "<p>To see or smoke a hookah in your dream represents ease and relaxation. Alternatively, it refers to the difficulties your are facing in your waking life. You may be bottling up your emotions.<\/p>"
    },
    {
        "title": "Hooker",
        "desc": "<p>*Please See: <a href=\"#Prostitute\">Prostitute<\/a>.<\/p>"
    },
    {
        "title": "Hookie",
        "desc": "<p>To dream that you are playing hookie from school or work suggests that you are trying to &quot;ditch&quot; or avoid some responsibility. You are not owning up to your duties. It also denotes self guilt.<\/p>"
    },
    {
        "title": "Hooks",
        "desc": "<p>To see a hook in your dream suggests that you are caught in some mischief and deceit. It also indicates your quest for material gains or feelings of deprivation.<\/p><p>There is a force that is drawing you toward a certain direction, thinking or habit.<\/p><p>To dream that you are catching something with a hook suggests that you need to acknowledge and incorporate some aspect or characteristic into your self-image. Alternatively, the dream refers to a sexual relationship. It may refer to your love or sexual relationship and issues of intimacy.<\/p>"
    },
    {
        "title": "Hoopoe",
        "desc": "<p>To see a hoopoe in your dream signifies betrayal. Someone is working against you. Alternatively, the dream represents filial responsibility and devotion.<\/p>"
    },
    {
        "title": "Hopping",
        "desc": "<p>To dream that you are hopping implies that you need to get both feet off the ground in order to move forward in life. If you are in a hopping race, then it means that you need to act quickly if you want to get ahead.<\/p>"
    },
    {
        "title": "Hopscotch",
        "desc": "<p>To dream that you are playing hopscotch represents your childish and\/or immature behavior. Alternatively, it may indicate your tendency to jump from task to task or not being able to stay in one place.<\/p>"
    },
    {
        "title": "Horizon",
        "desc": "<p>To see the horizon in your dream symbolizes a new beginning or a somber conclusion. The horizon represents your goals and future plans. You are in a continual state of growth, rebirth, and regeneration.<\/p>"
    },
    {
        "title": "Horizontal",
        "desc": "<p>To dream of a horizontal line or something that is horizontal symbolizes the material world and physical plane.<\/p>"
    },
    {
        "title": "Horn",
        "desc": "<p>To see or hear a horn in your dream signifies your need to pay attention to your inner voices and intuition. Alternatively, you may be bragging and &quot;blowing your own horn&quot;.<\/p><p>To see the horns of an animal in your dream represent conflict and confrontation. You are at odds with someone. Alternatively, the dream also means that you have a hardened shell.<\/p>"
    },
    {
        "title": "Hornets",
        "desc": "<p>To see a hornet in your dream signifies disappointments and anger. It symbolizes troubles and danger ahead for you. You may be letting your anger and temper get the best of you.<\/p><p>To dream that you are stung by a hornet is an indication of revenge and vengeful attitudes. It may also be a metaphor for some stinging remark.<\/p><p>To see a hornet's nest in your dream represents a lingering threat or a bitter confrontation that you should avoid.<\/p>"
    },
    {
        "title": "Horoscope",
        "desc": "<p>To read the horoscopes in your dream indicate that you are expressing some concerns about your future. Consider the significance of the astrological sign. What does the horoscope says and how it can applied to your waking life. The dream may offer a significant message or some advice.<\/p>"
    },
    {
        "title": "Horror",
        "desc": "<p>To dream that you are in horror over something symbolizes genuine fear and parallels your waking feelings of horror.<\/p><p>Dreaming of horrific things implies that you are numb by the things around you. You are becoming too indifferent.<\/p>"
    },
    {
        "title": "Horse",
        "desc": "<p>To see a horse in your dream symbolizes strength, power, endurance, virility and sexual prowess. It also represents a strong, physical energy. You need to tame the wild forces within. The dream may also be a pun that you are &quot;horsing around&quot;. Alternatively, to see a horse in your dream indicates that you need to be less arrogant and &quot;get off your high horse&quot;. If the horse has two heads (one on each end), then it implies that you are being pulled into two different directions. Perhaps your strength or power is being divided. Or you are confused about some sexual matter.<\/p><p>To see a black or dark horse in your dream signifies mystery, wildness, and the unknown. You are taking a chance or a gamble at some unknown situation. It may even refer to occult forces. If the horse is white, then it signifies purity, prosperity and good fortunes. To dream that you are being chased by a white horse may be a pun on chaste. Perhaps you are having difficulties dealing with issues of intimacy and sexuality.<\/p><p>To see a dead horse in your dream indicates that something in your life that initially offered you strength is now gone. This may refer to a relationship or situation. Consider the phrase &quot;beating a dead horse&quot; to indicate that you may have maximized the usefulness of a certain circumstance.<\/p><p>To see a herd of wild horses in your dream signifies a sense of freedom and lack of responsibilities and duties. Perhaps it may also indicate your uncontrolled emotions. If you are riding a wild horse, then it represents unrestrained sexual desires.<\/p><p>To dream that you are riding a horse suggests that you are in a high position or position of power. Alternatively, it indicates that you will achieve success through underhanded means. You lack integrity. If you are riding a horse that is out of control, then it means that you are being carried away by your passions.<\/p><p>To see an armored or medieval horse in your dream refers to your fierceness, aggression, power and\/or rigidity. You may be too confrontational. Alternatively, you may be trying to protect yourself from subconscious material or sexual desires that is emerging.<\/p><p>To dream that you are bathing a horse represents a renewal of strength and vigor. You are experiencing a burst of energy in some aspect of your life.<\/p><p>To dream about a talking horse refers to higher knowledge. Consider the significance of what the horse is saying. If the horse is black, then the message may be coming from your subconscious. If the horse is blue, then the message may be of sadness. You or someone is looking for help, but don't know how to go about getting it. The dream may also a metaphor for the idiom &quot;straight from the horse's mouth&quot;.<\/p>"
    },
    {
        "title": "Horse Trailer",
        "desc": "<p>To see a horse trailer means that you are underutilizing your power and strength. You may be waiting for the right moment to exert your power.<\/p>"
    },
    {
        "title": "Horseman",
        "desc": "<p>To see a headless horseman in your dream suggests that you are under some negative influence. It is usually a bad sign indicating that something is coming to an end.<\/p><p>To dream that you are a headless horseman implies that you have an inflated sense of power. It may also mean that you are being secretive about something.<\/p>"
    },
    {
        "title": "Horseback Riding",
        "desc": "<p>To dream that go horseback riding indicates that you are in a high position or in a position of power. You have confidence in your ability. Alternatively, the dream represents your lack of integrity. You will achieve success through underhanded means. If you are riding a horse that is out of control, then it means that you are being carried away by your passions.<\/p>"
    },
    {
        "title": "Horsemeat",
        "desc": "<p>If eating horsemeat is not accepted in your culture, then the dream refers to a situation where you do not want to know details about. If you enjoy eating horsemeat, then it implies that you are open to difference experiences. If eating horsemeat is culturally accepted for you, then the dream has the same significance as eating meat.<\/p>"
    },
    {
        "title": "Horserace",
        "desc": "<p>To dream that you are watching a horserace represents the power and drive you need to move forward in life. You need to believe that you are capable of succeeding in all your endeavors. The dream also symbolizes your sexual energy or competitive nature.<\/p>"
    },
    {
        "title": "Horseradish",
        "desc": "<p>To see or taste horseradish in your dream suggests that you have made an overly strong statement. You may have offended others without knowing it.<\/p>"
    },
    {
        "title": "Horseshoe",
        "desc": "<p>To see a horseshoe in your dream signifies luck and success in your endeavors. It may also indicate a wedding in the near future. If the horseshoe is turned downward, then it has the opposite meaning and is considered unlucky. All the energy that you are putting into a project may not be worthwhile.<\/p>"
    },
    {
        "title": "Hose",
        "desc": "<p>To see a hose in your dream is symbolic of how you are directing and expressing your emotions. A hose represents renewal, rejuvenation and cleansing. You need to heal those emotional wounds so that you can continue to grow as a person. Alternatively, a hose may be a metaphor for sex and sexual gratification. Or it may be a pun that you are &quot;getting hosed&quot; or blindsided in some situation.<\/p>"
    },
    {
        "title": "Hospital",
        "desc": "<p>To see or dream that you are in a hospital symbolizes your need to heal or improve your physical or mental health. You need to get back to the flow of everyday life. Alternatively, the dream suggests that you are giving up control of your own body. Perhaps you are afraid of losing control of your body.<\/p>"
    },
    {
        "title": "Hospitality",
        "desc": "<p>To dream that you have hospitality denotes your generosity and kindness toward others. You do things without expecting anything in return.<\/p>"
    },
    {
        "title": "Hostage",
        "desc": "<p>To dream that you are a hostage indicates that you are feeling victimized or powerless. You feel limited in your choices or physically immobilized. Perhaps this dream is paralleling some situation\/difficulties in your daily life or relationship. Alternatively, to dream that you are a hostage suggests that a part of yourself is not fully expressed.<\/p>"
    },
    {
        "title": "Hostility",
        "desc": "<p>To dream of hostility suggests that you are repressing these feelings in your waking life and they are manifesting in your dream. You need to find a way to confront and deal with these hostile feelings.<\/p>"
    },
    {
        "title": "Hot",
        "desc": "<p>To dream that you are hot signifies passion and heated emotions. It may reflect a situation that is potentially dangerous or a relationship where you are getting burned. Alternatively, the dream may represent a person who is great looking or perhaps you are lusting after someone. On the other hand, you may be feeling beautiful.<\/p>"
    },
    {
        "title": "Hot Air Balloon",
        "desc": "<p>To see or dream that you are in a hot air balloon suggests that it is time to overcome your depression. The dream may be a metaphor indicating that you are losing your ground or your foothold on some situation\/problem. Alternatively, it represents the process of individuation and your quest to fulfill some spiritual needs. Perhaps, you want to be elevated in someone's eyes.<\/p>"
    },
    {
        "title": "Hot Chocolate",
        "desc": "<p>To make or drink hot chocolate in your dream symbolizes contentment, warmth and love.<\/p>"
    },
    {
        "title": "Hot Dog",
        "desc": "<p>To see or eat a hot dog in your dream is phallic symbol representing masculinity, sexual energy, and vigor. Alternatively, a hot dog refers to simple and short-lived pleasures.<\/p>"
    },
    {
        "title": "Hot Dog Cart",
        "desc": "<p>To see or eat at a hot dog cart in your dream implies that you are not investing enough time to cater to your emotional or sexual well-being.<\/p>"
    },
    {
        "title": "Hot Pepper",
        "desc": "<p>To see or eat hot pepper in your dream symbolizes your hot temper. A debate or argument is becoming heated. Alternatively, it suggests that you need to add a little fire and spice into your relationship.<\/p>"
    },
    {
        "title": "Hot Sauce",
        "desc": "<p>To see or taste hot sauce in your dream implies that you need to add some pizzazz to your life. Perhaps you are in need of a jumpstart in some area. Hot sauce also refers to fire, drive, and passion.<\/p>"
    },
    {
        "title": "Hot Spring",
        "desc": "<p>To see a hot spring in your dream symbolizes relaxation. You are feeling at ease. Alternatively, the dream may refer to your emotions. Perhaps you are feeling &quot;steamed' about something.<\/p>"
    },
    {
        "title": "Hot Tub",
        "desc": "<p>To dream that you are in a hot tub indicates that you are unveiling aspects of your subconscious. Alternatively, it refers to relaxation and recuperation. You are looking to escape from your daily problems. The dream may also be a metaphor suggesting that you are in a lot of hot water or that you are in deep trouble.<\/p>"
    },
    {
        "title": "Hotel",
        "desc": "<p>To see a hotel in your dream signifies a new state of mind or a shift in personal identity. You are undergoing some sort of transition and need to move away from your old habits and old way of thinking. You need to temporarily escape from your daily life.<\/p><p>Alternatively, the dream may imply a loss in your personal identity.<\/p>"
    },
    {
        "title": "Hound",
        "desc": "<p>To see a hound in your dream indicates that you are sticking your nose into other people's business. Something or someone may be &quot;hounding&quot; you. You will not be able to run away from it until you confront the issue or the person.<\/p>"
    },
    {
        "title": "Hour",
        "desc": "<p>To dream about the hour refers to a passage of time. The dream may serve to remind you of an appointment, deadline, or anniversary. Consider the significance of a particular number or any superstitions that may be associated with a particular hour. AM and PM times refer to how aware you are about a particular thought or situation. For example,12pm represents some confrontation or turning point.<\/p><p>To dream about happy hour represents sensual enjoyment, stimulation, and relaxation. You are filled with inspirational power and enlightenment. Alternatively, it indicates avoidance in dealing with your problems and in facing your anxieties.<\/p>"
    },
    {
        "title": "Hourglass",
        "desc": "<p>To see an hourglass in your dream denotes that time is running out for you. This may be a deadline that you have to meet for school or work. Alternatively, an hourglass represents a situation that is being turned upside down.<\/p>"
    },
    {
        "title": "House",
        "desc": "<p>To see a house in your dream represents your own soul and self. Specific rooms in the house indicate a specific aspect of your psyche. In general, the attic represents your intellect, the basement represents the subconscious, etc. If the house is empty, then it indicates feelings of insecurity. If the house is shifting, then it suggests that you are going through some personal changes and changing your belief system. To dream that a house has no walls represents a lack of privacy. You feel that everyone is looking over your shoulder or up in your business.<\/p><p>To see an abandoned house in your dream implies that you have left behind your past. You are ready to move forward toward the future.<\/p><p>To dream that you are cleaning your house signifies your need to clear out your thoughts and get rid of old ways. You are seeking self-improvement.<\/p><p>If you live with others in your waking life, but dream that you are living alone suggests that you need to take new steps toward independence. You need to accept responsibilities and be more self-reliant.<\/p><p>To see an old, run-down house in your dream represents your old beliefs, attitudes and how you used to think or feel. A situation in your current life may be bringing about those same old attitudes and feelings. Alternatively, the old house may symbolize your need to update you mode of thinking. If you see messy and\/or dilapidated houses in your dream, then it implies that an aspect of your own life is in chaos. You may be suffering from some emotional or psychological clutter. You need to release these feelings in order to regain control. To dream that your house is damaged indicates your waking concerns about the condition of your house.<\/p><p>To dream of a house that looks beautiful from the outside and\/or downstairs, but the upstairs is falling apart implies that you are too concerned with outward appearances that your mental and emotional health is being neglected.<\/p><p>Dreaming that a house falls down a level without collapsing suggests that you are suppressing your feelings or thoughts. You may be trying to shut out loved ones.<\/p><p>To dream that you are inside a stranger's house indicates that there is something that you have yet to discover about yourself. It may mean that there are repressed memories, fears or emotions that you are not confronting.<\/p><p>To dream that you are building a house implies that you need to work on some aspect if yourself and better your mind or body. Alternatively, the dream is also representative of your maturing mindset.<\/p><p>To see a new house in your dream indicates that you are entering into a new phase or new area in your life. You are becoming more emotionally mature.<\/p><p>If you are locked out of the house, then it represents rejection and insecurity. You feel you are being left behind.<\/p><p>To dream that your house is broken into suggests that you are feeling violated. It may refer to a particular relationship or current situation in your life. Alternatively, it indicates that some subconscious material is attempting to make itself known. There are some aspects of yourself that you have denied.<\/p><p>To dream of a haunted house signifies unfinished emotional business, related to your childhood family, dead relatives, or repressed memories and feelings.<\/p><p>Dreaming that you are in the house of someone who has passed away indicates that you have yet to come to terms with their death. Perhaps you feel there was something that could've been done. The dream also indicates that you are trying to hold onto the memories you had with her or him.<\/p><p>To dream that a house has disappeared indicates that you are not feeling grounded. You feel uprooted by a particular circumstance or relationship in your life.<\/p><p>To dream that water is rising up in your house suggests that you are becoming overwhelmed by your emotions. To see houses under water implies that you are very comfortable with your own emotions. Alternatively, the dream may be a reflection of your housing situation. Perhaps you are &quot;underwater&quot; in your mortgage. If you dream that there is water damage inside your house, then it stands for an emotional breakdown.<\/p><p>To dream that a house has legs and is walking or chasing you points to dissatisfaction with your current waking life. You are expressing a desire to start new some place else.<\/p><p>Dreaming that the house is flying or floating means that you do not feel grounded. Perhaps you need to do some soul searching. It may also point to your lofty aspirations.<span style=\"color: rgb(0, 0, 0); font-family: Arial; font-size: small; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none;\">If you dream that you are floating away on a piece of the house that has broken off, then it means that you are feeling conflicted by your goals and between making others happy or making yourself happy.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=housedream1\">Haunted House&quot;. Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/r3.htm#Room\">Room.<\/p>"
    },
    {
        "title": "House Sitting",
        "desc": "<p>To dream that you are house sitting means that you are tending to the needs of others and putting their needs first instead of your needs. You are neglecting aspects of your own self. Alternatively, dreaming of house sitting indicates that you are trying to be someone you are really not.<\/p>"
    },
    {
        "title": "Houseboat",
        "desc": "<p>To see or live in a houseboat in your dream suggests that you are extremely in tune with your emotions. You know how to express your emotions in a healthy way. Consider the condition of the water to indicate how you are feeling. Alternatively, the dream may mean that you need to find time to escape for life's daily demands.<\/p>"
    },
    {
        "title": "Houseguest",
        "desc": "<p>To dream that you have a houseguest represents your accommodating nature. You tend to cater to the needs of others before your own. If you dream of an unwanted houseguest, then it indicates a realization that you are being taken advantage of in some area of your life.<\/p>"
    },
    {
        "title": "Housekeeper",
        "desc": "<p>To dream that you have a housekeeper indicates that someone may be trying to run your life from the sideline or background. They may be dominating or manipulating you in some way. Alternatively, the dream suggests that you need to sort out your problems and emotions. It is time to get your life in order.<\/p>"
    },
    {
        "title": "Housewife",
        "desc": "<p>To dream that you are a housewife suggests that your work is never done. There is always something that needs to be tended to. Alternatively, you may be feeling undervalued.<\/p>"
    },
    {
        "title": "Housework",
        "desc": "<p>To dream that you are doing housework suggests that you are making changes in your lifestyle and the way you are living. You are doing away with your old ways and habits and starting anew.<\/p><p>Alternatively, the dream may just be a reflection of the monotony of your daily life. Do something adventurous.<\/p>"
    },
    {
        "title": "Hovercraft",
        "desc": "<p>To see or ride in a hovercraft in your dream signifies your ability to adapt to various environments and situations. You have control over your emotions. Alternatively, the dream means that you are well-grounded, even though you appear to be flighty at times.<\/p>"
    },
    {
        "title": "Howling",
        "desc": "<p>To dream that you are howling represents wounded feelings and hidden fears.<\/p><p>To hear howling in your dream refers to loneliness or solitude.<\/p>"
    },
    {
        "title": "Hubcaps",
        "desc": "<p>To see a hubcap in your dream represents continuity and repetition. Your life has become monotonous.<\/p><p>To dream that a hubcap fell off your tire indicates that you need a break from the monotony. You are ready to try something different.<\/p>"
    },
    {
        "title": "Hugging",
        "desc": "<p>To dream that you are hugging someone symbolizes your loving and caring nature. You are holding someone or something close to your heart. Alternatively, it may indicate your need to be more affectionate.<\/p><p>To dream that someone is hugging you suggests that you need to let down your guard and allow your true feelings to show. It also means that you need to allow yourself to heal emotionally.<\/p>"
    },
    {
        "title": "Hula Dancing",
        "desc": "<p>To hula dance in your dream represents an appreciation and celebration of life. You are living life to the fullest.<\/p><p>To see hula dancing in your dream symbolizes joy. Pay attention to the message that the dance is trying to convey.<\/p>"
    },
    {
        "title": "Hula Hoop",
        "desc": "<p>To see a hula hoop or to hula hoop in your dream indicates that some aspect of your life is taking you in circles. You are going nowhere.<\/p>"
    },
    {
        "title": "Hula Skirt",
        "desc": "<p>To see or wear a hula skirt in your dream signifies your need for more leisure time or your desires to escape. It is synonymous with Hawaii. Perhaps you are in need of a vacation.<\/p>"
    },
    {
        "title": "Humid",
        "desc": "<p>To dream that it is humid suggests that you may be lacking some understanding in a situation. As a result, you are feeling anxious.<\/p>"
    },
    {
        "title": "Humidicrib",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/i.htm#Incubator\">Incubator.<\/p>"
    },
    {
        "title": "Humidifier",
        "desc": "<p>To see or use a humidifier in your dream suggests that you are looking for a fresh infusion of ideas within your creative or work life. Alternatively, the dream means that you are in need of a spiritual renewal or cleansing.<\/p>"
    },
    {
        "title": "Hummer",
        "desc": "<p>To see or drive a Hummer in your dreamsuggests that you have little or no regard for others. You have a larger than life attitude and exhibit a sense of entitlement. Alternatively, the dream may highlight the need to conserve. Do not max out your resources if you don't need to. The hummer may also be a sexual innuendo to represent your desire for oral sex.<\/p>"
    },
    {
        "title": "Humming",
        "desc": "<p>To dream that your ear is humming or that you hear humming suggests that you need to have some balance in your life. You need to balance all the demands in your daily life.<\/p><p>To hum in your dream suggests that there is something that you are trying to block from your conscious. You are in denial about something. Alternatively, it signifies boredom.<\/p>"
    },
    {
        "title": "Hummingbird",
        "desc": "<p>To see hummingbirds in your dream suggest that seemingly small ideas and concepts can possess much potential and power. Alternatively, it symbolizes your flighty thoughts and frivolous ideas. The hummingbird may also be seen as a metaphor for your inability to commit to a relationship.<\/p>"
    },
    {
        "title": "Humor",
        "desc": "<p>*Please See: <a href=\"#Laughing\">Laughing<\/a>.<\/p>"
    },
    {
        "title": "Humpty Dumpty",
        "desc": "<p>To see Humpty Dumpty in your dream suggests that you need to exercise care in some fragile situation. Alternatively, it refers to some irreversible plan or action. You can not go back to the past; you need to just accept the consequences of your actions.<\/p>"
    },
    {
        "title": "Hunchback",
        "desc": "<p>To see a hunchback in your dream indicates that you are feeling burdened by your daily responsibilities and problems. Alternatively, the dream may be telling you that you need to stand tall.<\/p>"
    },
    {
        "title": "Hunger",
        "desc": "<p>To dream that you are hungry signifies a feeling of unfulfilment in some area of your life. You may be starving for love. recognition, power, sex, wealth, or fame. You are longing to achieve something that you have desired for awhile. Alternatively, the dream may simply be that you are really feeling hungry and it is being manifested in your dream.<\/p>"
    },
    {
        "title": "Hunting",
        "desc": "<p>To dream that you are hunting suggests that you are seeking or pursuing some inner desire, either emotional or physical. You may be &quot;hunting&quot; for a solution or for a sexual conquest.<\/p><p>To dream that you hunt and kill an animal signifies that you are trying to repress or destroy an instinctive part of yourself.<\/p><p>To dream that you are being hunted indicates that you are being overwhelmed by life's challenges.<\/p><p>To see someone else hunting an animal in your dream suggests that you are trying to locate a hidden aspect of your own self. You be trying to indirectly approach a challenge or situation.<\/p>"
    },
    {
        "title": "Hurdle",
        "desc": "<p>To see hurdles in your dream symbolize the barriers and obstacles that are in your way throughout your life. If you jump over the hurdles, then it indicates that you are goal-oriented and do not let anything get in your way of your success. If you knock over the hurdle, then it represents difficulties. You will need to work hard in order to achieve your goals.<\/p>"
    },
    {
        "title": "Hurricane",
        "desc": "<p>To see a hurricane in your dream indicates sudden unexpected changes occurring in your life. You may be experiencing some destructive and powerful emotions.<\/p><p>To dream that you are swept up in a hurricane suggests that both your mental and emotional forces are building up inside and making themselves known. You may be literally consumed by your emotions. Alternatively, the dream indicates that you are being pressured and pushed against your will toward something you do not want to do.<\/p>"
    },
    {
        "title": "Hurry",
        "desc": "<p>To dream that you are in a hurry suggests that may be unprepared for a situation. There is a lack in your planning of things. Alternatively, to dream that you are in a hurry means that you are feeling out of place. This dream may also be a literal reflection of your daily life where you feel that you are always in a rush. And that there is not enough time to do all the things you want to do. The dream may occur due to this type of stress.<\/p>"
    },
    {
        "title": "Hurt",
        "desc": "<p>To dream that you are hurt signifies wounded emotions or feelings that you may have suppressed. You need to address these feelings in order to properly heal.<\/p>"
    },
    {
        "title": "Husband",
        "desc": "<p>To see your husband in your dream signifies the waking relationship with your husband and the subconscious feelings you have towards him. The dream may be trying to focus on hidden elements that you are not addressing in your waking life.<\/p><p>To dream that you have a husband (but you do not in your waking life) symbolizes some sort of partnership and\/or commitment. Often, your dream husband represents the qualities of your father in which you projected onto this figure or the masculine side of your own personality.<\/p><p>To dream that your husband has no teeth or is wearing dentures implies that he is not being honest or truthful about some matter. Perhaps he is hiding something.<\/p><p>To dream that you are searching for your husband implies that you feel he is not always there for you. You are feeling disconnected and neglected, both emotionally and physically.<\/p>"
    },
    {
        "title": "Hut",
        "desc": "<p>To see or live in a hut in your dream represents the basic necessities and comforts. You need to simplify your life and get back to the bare basics. Accept what you already have and know that that is enough.<\/p>"
    },
    {
        "title": "Hyacinth",
        "desc": "<p>To see hyacinth in your dream symbolizes severe jealousy.<\/p>"
    },
    {
        "title": "Hybrids",
        "desc": "<p>To see or dream that you drive a hybrid car suggests that you need to be more environmentally aware. You play an important role in the grand scheme of things. Do not underestimate what one person can do. Alternatively, the dream may be telling you that you need to be more resourceful.<\/p>"
    },
    {
        "title": "Hydra",
        "desc": "<p>To see a hydra in your dream signifies a huge obstacle that is standing in your way toward your goals. Perhaps the dream is trying to tell you that you need to &quot;use your head&quot;. Alternatively, the dream symbolizes rebirth, regeneration and fertility.<\/p>"
    },
    {
        "title": "Hydrant",
        "desc": "<p>To see a hydrant in your dream symbolizes renewal and rejuvenation. You are ready to make a fresh start.<\/p><p>To dream of a bursting fire hydrant indicates an outburst of emotions. You need to acknowledge and express you pent up anger and feelings before they explode.<\/p>"
    },
    {
        "title": "Hydraulic Jack",
        "desc": "<p>To see or use a hydraulic jack or lift in your dream signifies your willpower and internal strength. Dreaming of a hydraulic leak is equivalent to some idea or feeling emerging from the subconscious.<\/p>"
    },
    {
        "title": "Hydroplane",
        "desc": "<p>To see a hydroplane in your dream suggests that you will get through an emotional issue with relative ease.<\/p>"
    },
    {
        "title": "Hyena",
        "desc": "<p>To see a hyena in your dream indicates greed or uncleanness. It also suggests that you are overwhelmed with responsibilities. You feel that someone is relying on you too much. Alternatively, a hyena represents someone in your waking life who has a sense of humor or someone who is laughing at you.<\/p>"
    },
    {
        "title": "Hypnotist",
        "desc": "<p>To dream that you are a hypnotist represents your powerful influence over others.<\/p>"
    },
    {
        "title": "Hypnotize",
        "desc": "<p>To dream that you are hypnotized signifies your limitations. You are being influenced or swayed by others.<\/p><p>To dream that you fail to be hypnotized indicates that trouble is looming over you. You are the only one who can confront the problem and rise above it.<\/p>"
    },
    {
        "title": "Hypocrite",
        "desc": "<p>To dream that you are a hypocrite implies that you are feeling divided about an issue.<\/p><p>Dreaming that someone is being a hypocrite indicates that you are questioning someone's action. You need to trust your instincts.<\/p>"
    },
    {
        "title": "Hypothermia",
        "desc": "<p>To dream that you have hypothermia suggests that you are feeling emotionally numb. You may be lacking compassion for someone in your life.<\/p>"
    },
    {
        "title": "Hysterectomy",
        "desc": "<p>To dream that you have a hysterectomy indicates that you are going into new stage of growth in your life.<\/p><p>However if you dream that your father or mother performed the hysterectomy, then it suggests that your father or mother has wronged you in some way. You may even feel violated.<\/p><p>Women who have had hysterectomies in real life often experience dreams of being attacked or assaulted. Such dreams represent the body's feelings of being violated by the surgery.<\/p>"
    }
]