[
    {
        "title": "I",
        "desc": "<p>To see the letter &quot;I&quot; in your dream is on pun on me, myself and I. You need to focus on you. Or the dream may be an indication that you are being too selfish. Alternatively, the letter represents action and responsibility.<\/p>"
    },
    {
        "title": "Ibis",
        "desc": "<p>To see an ibis in your dream symbolizes devotion, perseverance and aspirations.<\/p>"
    },
    {
        "title": "Ice",
        "desc": "<p>To see ice in your dream suggests that you are lacking a flow of ideas and thoughts. You are not seeing any progress in your life. Alternatively, the dream implies that you are taking risks that you shouldn't be taking.<p>To dream that you slip on ice symbolizes your insecurities and self-esteem issues. There may also be an obstacle ahead for you.<\/p><p>To dream that you fall through ice suggests that your emotions are threatening to come crashing through.<\/p><p>To dream of melting ice implies that you are slowly warming up to a situation. You are acknowledging your negative emotions.<\/p>"
    },
    {
        "title": "Ice Cream",
        "desc": "<p>To see or eat ice cream in your dream denotes good luck, pleasure, success in love and satisfaction with your life. You need to savor the moment and enjoy it. Alternatively, the dream may suggest that you need to cool off and not let your temper get out of hand. On the other hand, the ice cream may be a pun on &quot;I scream&quot;. Perhaps there is something that you need to let out.<\/p><p>To dream that you are eating bad or sour ice cream signifies sorrow, disillusionment, or betrayal.<\/p><p>To see ice cream melt in your dream symbolizes failure to realize your hopes and desires.<\/p>"
    },
    {
        "title": "Ice Cream Truck",
        "desc": "<p>To see an ice cream truck in your dream refers to opportunities that can potentially pass you by. You need to be more aware of your surroundings. If you are chasing down the ice cream truck, then it indicates missed opportunities or lost rewards.<\/p>"
    },
    {
        "title": "Ice Cube",
        "desc": "<p>To make or see ice cubes in your dream symbolizes your frigid emotions. Alternatively, it suggests that you need to cool off. You are letting your temper get out of hand. The ice cubes may also refer to a refreshment. Perhaps you need to kick back and relax.<\/p>"
    },
    {
        "title": "Ice Maker",
        "desc": "<p>To see an ice maker in your dream indicates that you are shutting others out and closing off your emotions. If the ice maker is broken, then it means that you are feeling weary.<\/p>"
    },
    {
        "title": "Ice Pick",
        "desc": "<p>To see an ice pick in your dream represents suppression of your cold feelings. Alternatively, the dream represents the phallus. It may point to some sexual aggression.<\/p>"
    },
    {
        "title": "Ice Sculpture",
        "desc": "<p>To see an ice sculpture in your dream indicates that a situation or event has caused your life to come to a standstill. You are not making any progress in your life or feel that you cannot move forward.Consider the significance of the design and shape of the ice sculpture.<\/p>"
    },
    {
        "title": "Ice Skating",
        "desc": "<p>To dream that you or others are ice skating suggests that you need to trust in yourself and your actions. The dream may also indicate that you need to proceed carefully into some situation or relationship.<\/p>"
    },
    {
        "title": "Iceberg",
        "desc": "<p>To see an iceberg in your dream suggests that you are not utilizing your fullest potential and strengths. Or you are trying to hide under a facade. Alternatively, the dream means that you are not looking deep enough into some decision or problem. You need to look beyond the surface and the obvious.<\/p>"
    },
    {
        "title": "Icicles",
        "desc": "<p>To see icicles in your dream indicate a problem or concern that has been lingering over you. If the icicles are melting in your dream, then it indicate that the tough times are almost over. You will overcome your problems.<\/p><p>To see icicles forming in your dream symbolize difficulties in your life. You feel unsupported by those around you.<\/p>"
    },
    {
        "title": "Icing",
        "desc": "<p>To put icing on a cake or pastry indicates that you are behaving superficially. Something may look good on the exterior, but prove empty or unsubstantial on the inside. In other words, looks can be deceiving. Alternatively, the dream represents the finishing touches in your life that brings about fulfillment and completion.<\/p><p>To see or eat icing in your dream suggests that what may seem good in the beginning, will ultimately be unsatisfying and unfulfilling.<\/p>"
    },
    {
        "title": "Ideal",
        "desc": "<p>To dream that you meet the ideal person suggests that you may be too unrealistic. You have high expectations of others.<\/p><p>To dream of having ideals indicate that you are ambitious and goal oriented.<\/p>"
    },
    {
        "title": "Identification",
        "desc": "<p>To see your I.D. in your dream signifies your own self-confidence. To dream that you lose your I.D. denotes confusion about your own self-identity and your sense of individuality.<\/p>"
    },
    {
        "title": "Identity Theft",
        "desc": "<p>To dream that you are a victim of identity theft means that someone in your waking life is taking credit for your work. Alternatively, you may be having this dream because you are experiencing an identity crisis. You feel lost and not sure where you are headed.<\/p><p>Conversely, if you dream that you steal someone else's identity, then it implies that you are not being true to yourself. Perhaps you are pretending to be someone that you are not in order to fit in. If applicable, consider the significance of the identity of the person you have stolen and the qualities of this person that you admire.<\/p>"
    },
    {
        "title": "Idiot",
        "desc": "<p>To dream that you are an idiot or call somebody one indicates that you are making a situation more difficult than it need by. Your thought process lacks clarity.<\/p>"
    },
    {
        "title": "Idle",
        "desc": "<p>To dream that you are idling represents boredom. You lack initiative to take action in what you really want to do.<\/p><p>To see idling people in your dream suggests that you are not using your time and energy wisely.<\/p>"
    },
    {
        "title": "Idols",
        "desc": "<p>To dream that you are worshipping an idol signifies little progress in attaining your goals. You are worshipping false values and ideas.<\/p>"
    },
    {
        "title": "Igloo",
        "desc": "<p>To see or live in an igloo in your dream symbolizes someone who appears cold and frigid on the outside, but is really a warm and caring person on the inside. Alternatively, the igloo represents the feminine and her hard cold barrier that sometimes need to be broken down.<\/p>"
    },
    {
        "title": "Ignition",
        "desc": "<p>To turn the ignition in your dream suggests that you are set to move forward toward your goals. You are ready to grow. If you are having problems with the ignition, then it indicates that you are experiencing problems with how to get started with some project or goal. Alternatively, the dream may be a metaphor for something that you need to ignite in your life.<\/p>"
    },
    {
        "title": "Ignorance",
        "desc": "<p>To dream that you or someone is ignorant means that you are overly critical of your achievements. It also signifies low self-esteem.<\/p>"
    },
    {
        "title": "Ignore",
        "desc": "<p>To dream that you are ignoring someone or being ignored represents some aspect of yourself which you are not paying enough attention to. Perhaps you are overlooking something. Alternatively, it may reflect your real waking experiences of being ignored by that person.<\/p>"
    },
    {
        "title": "Iguana",
        "desc": "<p>To see an iguana in your dream represents harshness, cold-heartedness or fierceness. You approach situations or problems with both hostility and unstoppable determination. The iguana may also remind you of someone or some situation in your waking life that you find frightening yet awe inspiring.<\/p>"
    },
    {
        "title": "Illness",
        "desc": "<p>To dream that you have an illness denotes despair, unpleasant changes, or some emotional breakdown. The illness may be symbolic of your inability to cope with a situation. You see that being ill is an easy way out. On a more direct note, this dream may signal you to pay closer attention to your health especially to the areas of body revealed in the dream.<\/p><p>In particular, to dream that you have a terminal illness or disease implies that you are living on &quot;borrowed time&quot;. The dream is a reminder that life is too precious and that you need to make the most of your time everyday. Alternatively, to have a terminal illness in your dream signifies hopelessness, grief and self-pity. What area of your life is making you feel this way?<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s2.htm#Sick\">Sick.<\/p>"
    },
    {
        "title": "Illumination",
        "desc": "<p>To see a strange illumination in your dream represents thoughts from the primal aspects and less developed parts of your subconscious.<\/p><p>To see an illuminated face in your dream symbolizes awareness, insight and clearer understanding in some matter. You have found the truth to a situation or an answer to a problem.<\/p>"
    },
    {
        "title": "Imitation",
        "desc": "<p>To dream that you are being imitated suggests that you are setting an example of yourself. Others are looking up to you. It is said that imitation is the best form of flattery.<\/p><p>To dream that you are imitating others suggests that you are experiencing doubts in your own decisions and actions. Alternatively, it means that you hold them in high regards and are trying to learn from their wisdom.<\/p>"
    },
    {
        "title": "Immaculate Conception",
        "desc": "<p>To dream of an immaculate conception indicates that you are opening up yourself to a new level of spirituality or consciousness. You are touched by some higher source.<\/p>"
    },
    {
        "title": "Immigrant",
        "desc": "<p>If you are not an immigrant and dream that you or someone is an immigrant, then it implies that you are acknowledging an aspect of yourself that was unexpressed. If you are helping an illegal immigrant in your dream, then it means acceptance. Alternatively, the dream may reflect your waking experience as an immigrant. Or it may refer to the experiences of your parents or ancestors. Consider how you or they feel as an immigrant and what they endured or went through.<\/p>"
    },
    {
        "title": "Immobile",
        "desc": "<p>To dream that you are immobile signifies feelings of being trapped. Alternatively, it shows that you are too rigid in your attitudes and decisions.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p.htm#paralyzed\">Paralyzed.<\/p>"
    },
    {
        "title": "Immolation",
        "desc": "<p>To see someone being immolated in your dream indicates that a major transformation is taking place in your life.<\/p><p>To dream that you immolate yourself suggests that you are being consumed by your drive, your passion and\/or your goals to the point where some aspects of your life are being neglected.<\/p><p>Dreaming that someone immolates you implies that an issue is burning up inside of you. You are holding in a lot of anger.<\/p>"
    },
    {
        "title": "Immortal",
        "desc": "<p>To dream that you are immortal represents longevity, continuity, or fearlessness. You feel that you are better than others. Alternatively, it signifies reluctance in starting over or in taking a new direction. You are adverse to change.<\/p>"
    },
    {
        "title": "Immunity",
        "desc": "<p>To dream that you are immune to some disease or virus means that you are feeling empowered and undefeatable. You do not let negativity phase you or bring your down.<\/p>"
    },
    {
        "title": "Imp",
        "desc": "<p>To see an imp in your dream represents chaos and disorder. You are undergoing some difficulty in your waking life. Alternatively, the imp symbolizes the negative and repressed aspect as yourself<\/p>"
    },
    {
        "title": "Impale",
        "desc": "<p>To dream that you are being impaled suggests a forceful, violent or passionate release of your repressed emotions. You feel that you have been freed from the physical limitations of your own psyche. You are more aggressive and direct about your pent up emotions. Consider which part of the body is being impaled and what that part of the body symbolizes.<\/p>"
    },
    {
        "title": "Impeach",
        "desc": "<p>To dream that you or someone has been impeached indicates your desire to challenge authority. You are not afraid of letting others know about your position, even though it may not a popular one.<\/p>"
    },
    {
        "title": "Implants",
        "desc": "<p>To dream that you get or have breast implants refer to your body image issues. You are feeling insecure and self-conscious about the way you look. You are not measuring up to others. Alternatively, the dream is expressing your desires to be more sexual and\/or sensual. The dream may also reflect your subconscious desires for bigger boobs.<\/p>"
    },
    {
        "title": "Implements",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/t3.htm#Tools\">Tools.<\/p>"
    },
    {
        "title": "Implosion",
        "desc": "<p>To see an implosion in your dream symbolizes controlled anger. You are not fully letting yourself go.<\/p>"
    },
    {
        "title": "Imposter",
        "desc": "<p>To dream that you have an imposter suggests that you aretrying to be someone you are not. The dream may be pointing out qualities that are uncharacteristic of your personality.<\/p>"
    },
    {
        "title": "Impotence",
        "desc": "<p>To dream that you are impotent signifies a fear of losing power. Maybe you are afraid that you won't measure up to a particular person or task in your life. A more direct interpretation suggest that you may be having problems with sex in your waking life.<\/p>"
    },
    {
        "title": "Imprint",
        "desc": "<p>To make an imprint in your dream means that you want to leave a lasting impression in some area of your life. It also refers to a memory or to something in the past that you are holding onto. Consider what kind of imprint is being made.<\/p>"
    },
    {
        "title": "Imprisonment",
        "desc": "<p>To dream that you are imprisoned suggests that you are feeling trapped or unable to move beyond a certain point. Perhaps your outdated beliefs or old ways of thinking is preventing you from going forward.<\/p>"
    },
    {
        "title": "In-Law",
        "desc": "<p>To see your in-law in your dream represents a working relationship which has many different possibilities. You need to be more understanding or yielding in some situation. The dream may also be a pun on being more careful, playing by the rules and abiding by the law.<\/p>"
    },
    {
        "title": "Inauguration",
        "desc": "<p>To dream of an inauguration signifies personal growth or a rise in your current status. You are being recognized for your achievements.<\/p>"
    },
    {
        "title": "Incense",
        "desc": "<p>To dream that you are burning incense indicates spiritual learning. It represents a high level of awareness.<\/p>"
    },
    {
        "title": "Incest",
        "desc": "<p>If this dream relates to real-life experiences with incest, then you need to seek professional advice or counseling.<\/p><p>To dream of incestuous practices signifies erotic desires. It may also be representative of the union between feminine and masculine aspects of yourself. You are at a phase in your life where you are not quite a child and not quite an adult, and thus this dream may be symbolic of the merging of the child and adult within yourself. Alternatively, if you have been arguing with this family member and are expressing your desire to make up, then the dream may be trying to depict forgiveness in an extreme way.Or perhaps you are in a relationship with someone who reminds you of your own father, mother or other family member.<\/p>"
    },
    {
        "title": "Incoherent",
        "desc": "<p>To dream that you are incoherent symbolizes extreme nervousness or excitement. Alternatively, the dream means that you are lacking power or authority, especially when confronted by others. Such feelings may stem from a lack of self esteem or self confidence.<\/p>"
    },
    {
        "title": "Income",
        "desc": "<p>To dream about your income indicates financial concerns and worries. Money issues are one of the top concerns in our lives, so no doubt the topic will manifest itself in your dreams.Alternatively, the dream represents some emotional issue. You may be holding back your feelings or are more cautious about expressing them.<\/p>"
    },
    {
        "title": "Incompetent",
        "desc": "<p>To dream that you or someone is incompetent indicates your own feelings of insecurity. You may feel unprepared for a task or lack confidence in your abilities.<\/p>"
    },
    {
        "title": "Incredible Hulk",
        "desc": "<p>To see or dream that you are the Incredible Hulk suggests that you need to better control your emotions, especially your anger. It also means that your subconscious feelings must be confronted and dealt with before it gets out of control and expresses itself in a violent manner. Alternatively, the dream implies that you need to exhibit more self-confidence.<\/p>"
    },
    {
        "title": "Incubator",
        "desc": "<p>To see an incubator in your dream suggests that you need some stability and calmness in your life. Alternatively, it is symbolic of fresh and new ideas, growth, and development of the Self.<\/p><p>To dream that you are in an incubator indicates that you have been acting prematurely. It may also suggest that you are trying to escape from the burdens and responsibilities of your waking life.<\/p>"
    },
    {
        "title": "Incubus",
        "desc": "<p>To see or dream of an incubus symbolizes some deep fear. If the incubus is vague and unrecognizable, then it suggests that you need to be more direct with your sexuality. If the incubus is clear and identifiable, then it indicates that there is some strong force that is inconveniencing you in a waking situation.<\/p>"
    },
    {
        "title": "Indecision",
        "desc": "<p>To dream that you are indecisive reflects your waking state of indecision. You are second guessing or over-thinking your choices. You are not sure which decision is right. Alternatively, dreams of indecision indicates that you are being pulled in opposite directions.<\/p>"
    },
    {
        "title": "Independent",
        "desc": "<p>To dream that you are independent represents endless possibilities. The dream may also be telling you that you need to stand up for yourself, make your own decisions and think on your own.<\/p>"
    },
    {
        "title": "India",
        "desc": "<p>To dream that you are in India depends on your own personal associations with the country. If you have never been to India, then the dream may represent your determination to rise above a situation and overcome life's difficulties. You want to defy expectations.<\/p>"
    },
    {
        "title": "Indian",
        "desc": "<p>To see an Indian in your dream represents the primitive and instinctual aspect of yourself. You need to be in more control of your waking-life situations and surroundings. You also need to be more self-reliant and exercise your personal power. Alternatively, this dream symbolizes honesty, dedication, and wisdom.<\/p>"
    },
    {
        "title": "Indifferent",
        "desc": "<p>To dream that you are being indifferent suggests that you are trying to hide your true concerns. You do not want to let on that you care or that you really feel a certain way.<\/p><p>To dream that someone is indifferent towards you implies that you are unsure of their intentions or feelings.<\/p>"
    },
    {
        "title": "Indigo",
        "desc": "<p>To see indigo in your dream suggests that you are taking advantage of others.<\/p>"
    },
    {
        "title": "Indigestion",
        "desc": "<p>To dream that you have indigestion suggests that there is an issue or problem plaguing you. You are involved in a situation that is making you uneasy. Perhaps you have made a decision that is not sitting well with you or that you are doubting.<\/p>"
    },
    {
        "title": "Infant",
        "desc": "<p>To see an infant in your dream represents a brand new project. It signifies possibilities and potentials.<\/p><p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b.htm\">Baby.<\/p>"
    },
    {
        "title": "Infection",
        "desc": "<p>To dream that you have an infection indicates negative thoughts and ideas that you have internalized. Consider also where in the body is this infection for more significance.<\/p>"
    },
    {
        "title": "Infertile",
        "desc": "<p>To dream that you are infertile represents a lack of creativity. Something in your waking life is not working out the way you want it to. The dream may also reflect your own state of infertility and the struggles to have a baby.<\/p>"
    },
    {
        "title": "Infestation",
        "desc": "<p>To dream of an infestation points to problems and issues that you have ignored or avoided for too long. What may have started as minor has now become a huge problem. Alternatively, dreaming of an infestation represents an intrusion into your personal life. You feel that your privacy has been invaded.<\/p>"
    },
    {
        "title": "Infidelity",
        "desc": "<p>To dream of infidelity (either by you or someone else) represents issues of abandonment and neglect in a relationship. Or you are feeling emotionally confined and need an outlet for your feelings. Alternatively, a dream of infidelity indicates that you are feeling unsatisfied with your current relationship. You are harboring guilt over a sexual relationship or you are looking for a more erotic sex life.<\/p><p>**Go to DM's<a href=\"http:\/\/www.dreammoods.com\/commondreams\/cheating-dreams.html\">Common Dreams: Cheating Dreams for further analysis. Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/a.htm#Adultery\">Adultery.<\/p>"
    },
    {
        "title": "Infinity",
        "desc": "<p>To see the infinity symbol in your dream represents time and longevity. Alternatively, it symbolizes wealth or the number 8.<\/p>"
    },
    {
        "title": "Inflatable Bed",
        "desc": "<p>To see or sleep on an inflatable bed refers to a temporary situation or relationship. You are not in it for the long term.<\/p><p>Dreaming that you are inflating an air mattressindicates that you are putting too much effort into a one-sided relationship. You are putting in more than you are getting back.<\/p><p>If you dream of blowing up the inflatable mattress in one breath, thenit means that you are overly ambitious. You are taking on more than you can handle.<\/p>"
    },
    {
        "title": "Inflate",
        "desc": "<p>To dream that you are inflating something represents intellect, awareness, knowledge and a higher power. Alternatively, it may symbolize your inflated ego or inflated sense of self, especially if it is your body that is blowing up or inflating.<\/p>"
    },
    {
        "title": "Information Booth",
        "desc": "<p>To see or dream that you are in front of an information booth indicates hat you are looking for advice and for some direction in your life.You are exploring your options. Alternatively, the information booth represents a message from your subconscious.<\/p>"
    },
    {
        "title": "Infringement",
        "desc": "<p>To dream of an infringement indicates that you are infringing on another's (dm) copyright. This is not a real dream symbol.<\/p>"
    },
    {
        "title": "Inhaling",
        "desc": "<p>To dream that you are inhaling represents wish fulfillment.<\/p>"
    },
    {
        "title": "Inheritance",
        "desc": "<p>To dream that you receive an inheritance represents the opportunities that areavailable to you in your waking life.Alternatively, it suggests that you usually get your own way without any difficulties or struggles.<\/p>"
    },
    {
        "title": "Initials",
        "desc": "<p>To see initials in your dreammay be a pun on a phrase or a metaphor. For example, the initials T.C. may be a pun on &quot;teasing&quot;. Or the initials J.J., may be symbolic of double hooks. As a more direct interpretation, seeing initials represent someone in your waking life who shares that same initial. D.M.<\/p>"
    },
    {
        "title": "Initiation",
        "desc": "<p>To dream of an initiation indicates that you are pursuing a new path or goal. You are making a career change or getting a promotion.<\/p>"
    },
    {
        "title": "Injection",
        "desc": "<p>To dream that you are being injected for medical reasons indicates that you need to develop yourself on a mental and spiritual level. You are looking for an emotional uplift or need some time to heal. Alternatively, the dream may be a metaphor that you need to &quot;inject&quot; more energy into your walking life.<\/p><p>To dream that someone is forcibly injecting you represents your negative attitudes about a particular situation\/person. It also indicates the influence of peer pressure working against you. You are recognizing that someone is forcing their negative and unwelcome views\/values on you.<\/p><p>*Please see also Dream Moods' Interpretation for<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s5.htm#Syringe\">Syringe.<\/p>"
    },
    {
        "title": "Injury",
        "desc": "<p>To dream that you are injured suggests that you need to work on healing old wounds and hurts.You need to stop and slow down. Consider where or how you were injured for further significance.<\/p>"
    },
    {
        "title": "Ink",
        "desc": "<p>To see ink in your dream represents creativity. You are adopting a new way of looking at things. If ink is spilled in your dream, then it symbolizes a blemish or minor problem. Or perhaps you are about to be exposed. Alternatively, ink may also be a metaphor for &quot;getting ink&quot; or getting a tattoo.<\/p><p>To see bottles of ink in your dream suggest that a solution to your problem will soon become apparent.<\/p>"
    },
    {
        "title": "Inn",
        "desc": "<p>To see an inn in your dream represents a transition in your waking life. Perhaps you are in need of a temporary escape from reality. Alternatively, the dream may also be a pun on being &quot;in&quot;, as in being part of the group. Thus, it may symbolize acceptance.<\/p><p>If the inn in your dream is abandoned or rundown then it indicates that you are losing an aspect of your identity.<\/p>"
    },
    {
        "title": "Inner Tube",
        "desc": "<p>To see an inner tube in your dream represents the Self. You are not feeling emotionally whole.<\/p><p>To dream that you are inner tubing suggests that you are on experiencing emotional ups and downs.<\/p>"
    },
    {
        "title": "Inquisition",
        "desc": "<p>To dream that you are part of an inquisition indicates feelings of guilt. Perhaps you are dwelling too much on the past. It is time to move on and look toward the future.<\/p>"
    },
    {
        "title": "Insanity",
        "desc": "<p>To dream that you or someone is insane represents your retreat from reality. Alternatively, the dream suggests that some waking aspects of your life is out of control. You have difficulties telling what is right and wrong.<\/p>"
    },
    {
        "title": "Inscription",
        "desc": "<p>To see an inscription in your dream signifies a message from your subconscious. Consider what or where the inscription is written on.<\/p>"
    },
    {
        "title": "Insect",
        "desc": "<p>To see insects in your dream signify minor obstacles that you must overcome. There are small problems and annoyances that need to be dealt with. You feel that you are under attack. Or something or someone may be &quot;bugging&quot; or pestering you. Alternatively, insects are symbolic of precision, alertness, and sensitivity. You may need to organize your thoughts and sort out your values. Sometimes they are seen as divine messengers.<\/p><p>Dreaming about the wings of an insect indicate that you are unable to stay in one place for too long. You are flighty and always on the move. Alternatively, insect wings means that your ideas or way of thinking is all over the place. You need focus.<\/p>"
    },
    {
        "title": "Insecticide",
        "desc": "<p>To see or use an insecticide in your dream implies that you need to rid yourself of some anxiety in your life. The insecticide may be analogous to anxiety medication that you are considering taking. Alternatively, the dream refers to a small problem that has blown up to be a bigger issue.<\/p>"
    },
    {
        "title": "Inside",
        "desc": "<p>To dream that you are inside suggests that you need to take time for some self introspection. The dream may be a metaphor that you need to look within yourself. It is what is in the inside that matters. Alternatively, dreaming that you are inside indicates that there are some family or domestic issues that you need to deal with.<\/p>"
    },
    {
        "title": "Inside Out",
        "desc": "<p>To dream that your clothes are worn inside out represents your non-conformist attitude. You like to go against what everybody else says or does.<\/p><p>To turn your clothes inside out in your dream suggests that you are trying to protect yourself against something. You don't want to get hurt.<\/p>"
    },
    {
        "title": "Insomnia",
        "desc": "<p>To dream that you have insomnia indicates that you are feeling overwhelmed. You need to better manage your time and prioritize your responsibilities.<\/p>"
    },
    {
        "title": "Inspection",
        "desc": "<p>To dream of a house inspection indicates that you are dealing with criticism about your self and\/or your body. Alternatively, the dream means that you need to take better care of yourself.<\/p><p>To dream about a car inspection implies that it is time to review your goals and how you are going about in achieving them. You need to determine if it is still worth pursuing. Or perhaps it is time for you to set new goals.<\/p><p>Dreaming about a food inspection means that you need to reevaluate your support system. Someone in your social circle may not have your best interest in mind.<\/p>"
    },
    {
        "title": "Instant Message",
        "desc": "<p>To dream that you receive an instant message signifies an urgent message from your subconscious. It implies self-confidence.<\/p><p>To dream that you are sending an instant message represents your connection to others and your network of friendships. Alternatively, the dream may also be a pun on &quot;I am&quot; and thus symbolize the act of &quot;being&quot;.<\/p>"
    },
    {
        "title": "Intuition",
        "desc": "<p>To have a dream about your intuition may be your subconscious trying to focus your attention on it. Your other senses have perceived something that you have overlooked or dismissed. It is time to listen to your instincts.<\/p>"
    },
    {
        "title": "Instructions",
        "desc": "<p>To follow or read instructions in your dream suggests that you are seeking some advice on what you should do next. Consider what the instructions are for and how it relates to a waking life issue. For example, to read instructions on how to assemble a table indicates that you are trying to be more sociable and open. To read instructions on how to operate an electronic item means you need to learn to make your life less complicated.<\/p><p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d.htm#Directions\">Directions<\/p>"
    },
    {
        "title": "Instrument",
        "desc": "<p>To see musical instruments in your dream indicate the expectation of fun and pleasures. You are focused on enjoying life and all that it has to offer. The dream also represents your talents and your ability to communicate with others. Alternatively, the dream may be telling you that you have been &quot;played&quot; or taken advantage of. Certain musical instruments are symbolic of sexual organs and thus point to your sexuality.If you play a musical instrument in your waking life then the dream may serve as a rehearsal to improve your technique.<\/p><p>To see surgical or medical instruments in your dream mean that you need to carefully plan out your next move. You need to act with deliberate action and precision.<\/p>"
    },
    {
        "title": "Insulation",
        "desc": "<p>To see or install insulation in your dream symbolizes protection and warmth. Alternatively, the dream may be telling you to conserve your energy.<\/p>"
    },
    {
        "title": "Insult",
        "desc": "<p>To dream that you insult someone indicates that you are feeling insecure about a waking relationship or situation. Alternatively, the dream suggests that you are trying to hide your true feelings. You are expressing your anger towards someone within the confines of your dream. You need to confront this person in real life.<\/p><p>To dream that you have been insulted suggests that you are suffering from low self esteem.<\/p>"
    },
    {
        "title": "Insurance",
        "desc": "<p>To dream that you are buying insurance refers to a lack of trust. You are afraid of losing something that means a lot to you. Alternatively, it represents your need for security.<\/p>"
    },
    {
        "title": "Intercom",
        "desc": "<p>To see or use an intercom in your dream suggests that you are always readily available to those who need your help. It also symbolizes your acute awareness to your surroundings and to those around you.<\/p><p>To hear a voice over an intercom represents messages from your subconscious. Your subconscious is trying to make you aware of a solution to a problem.<\/p>"
    },
    {
        "title": "Intercourse",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s2.htm#Sex\">Sex.<\/p>"
    },
    {
        "title": "Interest",
        "desc": "<p>To dream that you are earning interest in an account implies that your hard work will pay off in the long run. The dream may serve as way to motivate you. Alternatively, interest may be a pun. You are &quot;interested&quot; in someone and want to gain their favor.<\/p>"
    },
    {
        "title": "Internet",
        "desc": "<p>To dream of the internet signifies your need to connect and communicate with a larger network of people. The dream may be highlighting the importance of networking. Consider the types or names of the websites you were looking at for additional significance.<\/p>"
    },
    {
        "title": "Interpreter",
        "desc": "<p>To see or use an interpreter in your dream suggests that there is an issue or problem that you are having difficulties understanding. The dream may be telling you to seek help from others.<\/p>"
    },
    {
        "title": "Interrogation",
        "desc": "<p>To dream that you are being interrogated indicates that something or someone in your waking life is trying to squeeze every bit of energy or information out of you. You are feeling stressed or burdened.<\/p>"
    },
    {
        "title": "Interrupt",
        "desc": "<p>To dream that you are being interrupted suggests that things in your waking life are not going as smoothly as you would like. You may feel that you are continually being sidetracked and that you are unable to get your point across.<\/p>"
    },
    {
        "title": "Intersection",
        "desc": "<p>To dream that you are at an intersection represents a decision or choice that you need to make in order to progress forward.<\/p>"
    },
    {
        "title": "Intersex",
        "desc": "<p>To see or dream that you are intersex represents the union of opposites and balance. Alternatively, the dreams suggest that you are trying to conceal your sexuality. Perhaps you are feeling ambiguous about your sexuality.<\/p>"
    },
    {
        "title": "Interstate",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/h2.htm#Highway\">Highway.<\/p>"
    },
    {
        "title": "Interview",
        "desc": "<p>To dream that you are at an interview denotes your anxiety over being judged by others. You may be experiencing some dissatisfaction with some aspect of yourself.<\/p>"
    },
    {
        "title": "Intestines",
        "desc": "<p>To see intestines in your dream signify compassion. The image is analogous to the twist and turns of life. The dream may also be a metaphor for courage and your gutsiness.<\/p>"
    },
    {
        "title": "Intimacy",
        "desc": "<p>To dream about an intimate issue relates to your sexual identity. Perhaps something is lacking in your personal relationship. You are feeling unsatisfied or something is missing in your relationship. It is important to remember that a healthy relationship takes work. Thus your dream may be trying to help you resolve the some issue at hand.<\/p>"
    },
    {
        "title": "Intoxicated",
        "desc": "<p>To dream that you are intoxicated indicates that you are losing control of some situation. Alternatively, the dream suggests that you have attained a new level of awareness.<\/p><p>*Please See also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d3.htm#Drunk\">Drunk.<\/p>"
    },
    {
        "title": "Intravenous Drip",
        "desc": "<p>To see or have an intravenous drip in your dream represents a time for healing. Alternatively, it denotes an urgent message that needs to be delivered.<\/p>"
    },
    {
        "title": "Introduce",
        "desc": "<p>To dream that you are being introduced to someone indicates that you are looking for acceptance.<\/p><p>Dreaming of introducing someone implies that you are acknowledging and accepting an unexpressed aspect of yourself.<\/p>"
    },
    {
        "title": "Intruder",
        "desc": "<p>To see an intruder in your dream represents your feelings of guilt. Consider also what unfamiliar feelings or thoughts may be breaking into your peace of mind. Alternatively, an intruder symbolizes self-indulgent behavior or unwanted sexual attention.<\/p>"
    },
    {
        "title": "Invalid",
        "desc": "<p>To see an invalid in your dream suggests that you are feeling weak and vulnerable. You are too dependent on others. Alternatively, the dream may be a pun on an argument or problem that is &quot;not valid&quot;.<\/p>"
    },
    {
        "title": "Invasion",
        "desc": "<p>To dream of an invasion represents your need to be more assertive. Stand up for yourself and let your voice be known. Don't let others tell you what to do.<\/p>"
    },
    {
        "title": "Inventor",
        "desc": "<p>To see an inventor in your dream symbolizes your achievements. You may be trying to elevate yourself to a higher level of consciousness.<\/p><p>To dream that you are an inventor represents your creative side and aspirations.<\/p>"
    },
    {
        "title": "Inventory",
        "desc": "<p>To dream that you are taking or counting inventory symbolizes abundance. Alternatively, the dream means that you are assessing your needs and resources.<\/p>"
    },
    {
        "title": "Inversion Table",
        "desc": "<p>To see or use an inversion table in your dream implies that you need to look at something from an entirely different angle or perspective. Alternatively, the dream suggests that you are looking to align yourself with certain people or groups.<\/p>"
    },
    {
        "title": "Investigator",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d2.htm#Detective\">Detective.<\/p>"
    },
    {
        "title": "Investment",
        "desc": "<p>To dream that you are making an investment represents your preparation for the future. You have laid out a solid groundwork for success.<\/p>"
    },
    {
        "title": "Invincible",
        "desc": "<p>To dream that you are invincible symbolizes power and confidence. Such dreams also forewarns that you may be too overly confident.<\/p>"
    },
    {
        "title": "Invisible",
        "desc": "<p>To dream that you are invisible signifies feelings of not being noticed or recognized for what is important to you. You feel you are being overlooked. Alternatively, the dream indicates that you are trying to withdraw from the realities of life.<\/p>"
    },
    {
        "title": "Invitation",
        "desc": "<p>To see or respond to an invitation in your dream suggests that you need to join or incorporate certain characteristics into yourself.<\/p>"
    },
    {
        "title": "Invite",
        "desc": "<p>To dream that you are invited to an event represents acceptance of who you are.<\/p><p>If you dream that you were not invited to an event, then it indicates feelings of rejection or a sense of not belonging.<\/p><p>Dreaming that you invite friends over, but then you forgot they were coming means that you are taking their friendships for granted.<\/p>"
    },
    {
        "title": "Iodine",
        "desc": "<p>To see iodine in your dream suggests that you need to pace yourself in whatever you do. Don't rush through things. At the same time, you don't want to be lazy.<\/p>"
    },
    {
        "title": "IPad",
        "desc": "<p>To see an iPad in your dream represents modern life and your connections with others. It also suggests that you want to put something on display. Consider the significance of what you are doing on the iPad and how that parallels an aspect of your waking life. Alternatively, seeing an iPad in your dream may be a pun on &quot;your home&quot; or &quot;your place&quot;.<\/p>"
    },
    {
        "title": "IPod",
        "desc": "<p>To see or listen to an iPod in your dream indicates a need for enjoyment. You need a distraction from the demands of everyday life. An ipod in your dream also implies that you have total control over your emotions. Consider the type of music and the title of the song that you are listening to. The dream may also denote a message from your subconscious.<\/p><p>To dream that your iPod screen is cracked implies that you are not expressing yourself in a healthy manner.<\/p><p>Dreaming that you lose your iPod points to old memories that you need to let go of.<\/p>"
    },
    {
        "title": "IQ Test",
        "desc": "<p>To see or dream that you are taking an IQ test signifies feelings of insecurities and concerns about your performance in a waking area of your life. You feel that you are not measuring up.<\/p>"
    },
    {
        "title": "Iris",
        "desc": "<p>To see an iris in your dream symbolizes wisdom, faith, valor, peace and purity. The dream may also be a metaphor for the iris in your eye. Perhaps there is something you need to see.<\/p>"
    },
    {
        "title": "Iron",
        "desc": "<p>To see iron metal in your dream symbolizes harshness,anger, aggression, ruthlessness, and conflict. On a positive note, it may signify strength, endurance, and willpower.<\/p><p>To see red, hot iron in your dream represents action. Perhaps the dream is telling you to &quot;strike while the iron is hot&quot;. You need to take advantage of certain opportunities while it is still available.<\/p><p>To see old, rusty iron in your dream signifies poverty and disappointment.<\/p>"
    },
    {
        "title": "Ironing",
        "desc": "<p>To dream that you are ironing signifies domestic comfort and orderliness. Alternatively, the dream represents the monotony of your daily routine. You may be bored and are looking for some excitement to your life. The dream may also be a pun that you need to &quot;iron the wrinkles&quot; out of your life.<\/p><p>To dream that you burn your hands while ironing signify loss of tranquility, illness, or jealousy. Alternatively, the dream may suggest that you need to stop interfering into other people's business.<\/p>"
    },
    {
        "title": "Irrigate",
        "desc": "<p>To dream that you are irrigating crops or plants represents a process of healing. It signals spiritual enrichment and emotional growth.<\/p>"
    },
    {
        "title": "Irritation",
        "desc": "<p>To dream that you are irritated indicates that something is not sitting well with you. You need to learn to express your negative emotions instead of keeping it bottled up. Usually, such dreams parallel your waking state of feeling bothered or agitated. These feelings carry into your dream world because you are repressing them.<\/p>"
    },
    {
        "title": "Island",
        "desc": "<p>To see or dream that you are on an island signifies ease, relaxation and comfort.The dream is telling you that you need a vacation and escape the stresses in your life. It is time for some solitude.<\/p><p>To dream that you are stranded on an island suggests that you need to get away from the demands of your daily life. Or perhaps you are running away from a situation instead of trying to confront it. Alternatively, the dream means that you feel cut off from society. You are in a rut and do not know what to do with your life.<\/p>"
    },
    {
        "title": "Israel",
        "desc": "<p>To dream that you are going or in Israel indicates that you are experiencing some personal spiritual unrest. You are feeling conflicted.<\/p>"
    },
    {
        "title": "Itch",
        "desc": "<p>To dream that you have an itch refers to sexual urges. Alternatively, it indicates something in your life that you always wanted to do for a long time. Perhaps you have some unfulfilled desires or unfinished business.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s.htm#Scratch\">Scratch.<\/p>"
    },
    {
        "title": "Ivory",
        "desc": "<p>To see ivory in your dream symbolizes purity, strength, and endurance.<\/p>"
    },
    {
        "title": "Ivy",
        "desc": "<p>To see ivy in your dream symbolizes longevity and immortality. It may be a metaphor for an ivy-league college. Alternatively, the ivy represents your close-knit relationships and the security and comfort they provide. However, it can also lead to clinginess and dependency issues.<\/p><p>To see withered ivy in your dream denotes broken engagements and sadness.<\/p>"
    }
]