[
    {
        "title": "K",
        "desc": "<p>To see the letter &quot;K&quot; in your dream implies that something is &quot;okay&quot;. Alternatively, the dream may be a pun on someone named &quot;Kay&quot; or whose initial starts with K.<\/p>"
    },
    {
        "title": "Kabbalah",
        "desc": "<p>To convert to Kabbalism or dream of Kabbalism signifies your connection with God and your understanding of the world you live in. You need to gain a better insight of your surroundings and environment.<\/p>"
    },
    {
        "title": "Kaleidoscope",
        "desc": "<p>To see a kaleidoscope in your dream symbolizes the different fragments andfacets that make up character. Various aspects of your life are coming together. Alternatively akaleidoscope foretells of difficulties in achieving your goals and choosing your path in life."
    },
    {
        "title": "Kali",
        "desc": "<p>To see the Hindu goddess, Kali in your dream symbolizes the protective mother. For Hindus, the symbol may have deeper significance.<\/p>"
    },
    {
        "title": "Kangaroo",
        "desc": "<p>To see a kangaroo in your dream refers to maternal and paternal protection. You may be expressing your nurturing and mothering nature. Perhaps, you are being too overly protective. Alternatively, a kangaroo symbolizes aggression. If the kangaroo is hopping, then the dream is analogous to how you jump from one thing to another. You lack the ability to stick to one thing.<\/p><p>To dream that a kangaroo attacks youindicates that your reputation is being called into question.<\/p>"
    },
    {
        "title": "Karaoke",
        "desc": "<p>To dream that you are taking part in karaoke suggests that you are too overly confident in your abilities. Alternatively, you may not be utilizing your talents to its fullest potential.<\/p>"
    },
    {
        "title": "Karate",
        "desc": "<p>To dream that you are doing karate suggests that you need to direct your energy and concentrate them toward your goals.<\/p>"
    },
    {
        "title": "Karma",
        "desc": "<p>To dream about karma represents your relationships and what you give and receive from others. Consider if the feel of the dream is a positive or negative one.<\/p>"
    },
    {
        "title": "Katydids",
        "desc": "<p>To see katydids in your dream represents your lackadaisical attitude. Your laid back attitude will cause you to miss out on life's opportunities.<\/p><p>To hear katydids in your dream signify your over-reliance on others. You are being too dependent.<\/p>"
    },
    {
        "title": "Kayak",
        "desc": "<p>To see a kayak or go kayaking in your dream indicates that you are emotionally well balanced. You are in tune with your feelings. Alternatively, the dream means that you are succeeding through your own willpower, determination and drive. Keep up your energy!<\/p>"
    },
    {
        "title": "Keel",
        "desc": "<p>To dream of the keel represents emotional balance and strength.<\/p>"
    },
    {
        "title": "Keepsake",
        "desc": "<p>To dream of a keepsake represents your acceptance to love and being loved. The keepsake in your dream may serve to remind you of how far you have come and what you have been through.<\/p>"
    },
    {
        "title": "Keg",
        "desc": "<p>To see a keg in your dream symbolizes your struggles against adversity. If the keg is full, then it suggests that you need to carry on the same course. If the keg is empty, then it indicates that you need to deviate from your plans. Alternatively, the dream indicates that you need to conserve your energy.<\/p>"
    },
    {
        "title": "Kelp",
        "desc": "<p>To see kelp in your dream symbolizes the emotional difficulties that you experience in life. Although you might get caught up in it at some point in your life, you will persevere.<\/p>"
    },
    {
        "title": "Kennel",
        "desc": "<p>To dream that you are at the kennel indicates that you are being left out of some situation or relationship.<\/p>"
    },
    {
        "title": "Kerosene",
        "desc": "<p>To see or use kerosene in your dream symbolizes vigor, vitality and power. You are experiencing a burst of energy. It also suggests that a new idea is coming to fruition.<\/p>"
    },
    {
        "title": "Ketchup",
        "desc": "<p>To see or eat ketchup in your dream represents simplicity, youth, and happiness. Alternatively, the dream may be a pun on your need to &quot;catch up&quot; on something.<\/p>"
    },
    {
        "title": "Kettle",
        "desc": "<p>To see a kettle in your dream symbolizes the mundane aspects of your life. Perhaps you are taking certain things for granted or overlooking something or someone.<\/p><p>To see a kettle of boiling water in your dreams signifies great and laborious work ahead. If the kettle is whistling, then it indicates that your emotions have literally reached the boiling point. Some heated emotion needs your immediate attention.<\/p>"
    },
    {
        "title": "Key",
        "desc": "<p>To see a key in your dream symbolizes opportunities, access, control, secrets, freedom, knowledge or responsibilities. You may be locking away your own inner feelings and emotions. Or you are unlocking the answer to some problem. To see a ring of keys represents status, authority, and power. It also highlights your adaptability to a situation. In particular, if you see a skeleton key, then it refers to old emotions or memories that you have stored or locked away. If the key is gold, then it suggests that influence, power and wealth will give you access to almost anything you want.<\/p><p>Alternatively, keys have sexual connotations. They can represent intercourse, impotence, infidelity, etc. depending on the condition and usage of the key.<\/p><p>To dream that you lose your keys signify fears of losing control of yourself or losing your position or status in life. It may also indicate unexpected changes, frustrations, and unpleasant adventures. The dream could be analogous to lost or missed opportunities. If you give your key away, then it suggests that you have given up control of some situation or responsibility.<\/p><p>To dream that you find a key indicates that you have found a solution to a problem.<\/p><p>To see broken keys in your dream represent a lost in status. You are denied access to a place where you were previously allowed. If the key is rusty, then it symbolizes a talent or skill that you have neglected.<\/p><p>To hear the sound of keys rattling in your dream indicate that you have the right attitude toward life. You are heading in the right direction and asking all the right questions in the process. It is also a sign of decisive action.<\/p>"
    },
    {
        "title": "Key Chain",
        "desc": "<p>To see a key chain in your dream indicates your ability to adapt to most any situations. You fit in with anybody and anywhere.<\/p>"
    },
    {
        "title": "Key Maker",
        "desc": "<p>To see a key maker in your dream suggests that there is something that you need help to unlock or uncover. You cannot do everything by yourself.<\/p><p>To dream that you are making a spare key means that there are several approaches to tackle the same problem.<\/p>"
    },
    {
        "title": "Keyboard",
        "desc": "<p>To see a computer keyboard in your dream indicates that there is a message that you need to get out or an idea that you need to share. The keyboard also symbolizes something that you have to get done.<\/p><p>To see or play a musical keyboard in your dream represents harmony. Your life is well balanced.<\/p>"
    },
    {
        "title": "Keyhole",
        "desc": "<p>To dream that you are peeping through a keyhole suggests that you do not have full view of some situation. You need to gain a better perspective on things. Alternatively, it indicates that you are overstepping your boundaries and prying into other people's business.<\/p><p>To dream that someone is looking through a keyhole suggests that your privacy is being invaded. Alternatively, the dream means that you are shutting others out.<\/p>"
    },
    {
        "title": "hakis",
        "desc": "<p>To wear khakis in your dream suggest that there is something that you are not seeing clearly on. Or that something may not be what it seems. Alternatively, the dream refers to your desires to conform and fit in.<\/p>"
    },
    {
        "title": "Kick",
        "desc": "<p>To dream that you are kicking someone represents suppressed aggression that you are unable to express in your waking life.<\/p><p>To dream that you are being kicked indicates that you feel victimized or taken advantage of. The dream may be telling you to stop feeling sorry for yourself. Alternatively, being kicked is a way for your subconscious to push you ahead and motivate you to continue on toward your goals. Sometimes you need a kick. You need to be more aggressive.<\/p><p>If you dream that you are kicking something, then it implies that you are trying to distance yourself from a situation. You do not want it to be part of your life. Consider the significance or symbolism of what you are kicking. If you dream of kicking down a door or wall, then it signifies determination. You are not letting any obstacles getting in the way of your goals.<\/p>"
    },
    {
        "title": "Kick Scooter",
        "desc": "<p>To see or ride on a kick scooter in your dream implies that you are trying to balance various areas of your life. The dream also means that you need to be decisive in what you are doing.<\/p><p>Dreaming of seeing someone on a kick scooter represents a carefree attitude.<\/p>"
    },
    {
        "title": "Kickball",
        "desc": "<p>To dream that you are kicking a ball indicates a carefree time free of worries and responsibilities. It could also mean your need for control.<\/p>"
    },
    {
        "title": "Kid",
        "desc": "<p>To see a kid (baby goat) in your dream represents a small lapse in judgment Alternatively, it may mean that you are spending too much time on pleasure and leisure. As a result, your professional or educational pursuits may suffer.<\/p><p>*Please See Also: <a href=\"#Children\">Children<\/a>.<\/p>"
    },
    {
        "title": "Kidnap",
        "desc": "<p>To dream that you are being kidnapped denotes feelings of being trapped and restricted. Someone or some situation may be diverting your concentration and your attention away from your goals. In particular, to dream that you are kidnapped by your ex-boyfriend suggests that your ex still has some sort of emotional hold on you.<\/p><p>To dream that someone has been kidnapped indicates that you are not letting aspects and characteristics of that person to be expressed within you. You are trying to contain and\/or suppress the qualities of the kidnapped person.<\/p><p>To dream that you are a kidnapper signifies that you are holding on to something that you need to let go. You may be forcing your views and opinions on others.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=aliendream1\">Kidnapped By Aliens<\/a>&quot;<\/p>"
    },
    {
        "title": "Kidneys",
        "desc": "<p>To dream of your kidneys represent a need for cleansing.<\/p>"
    },
    {
        "title": "Killing",
        "desc": "<p>To dream that you kill someone indicates that you are on the verge of losing your temper and self-control. Consider the person you have killed and ask yourself if you feel any rage towards her or him in your waking life. Your dream may be expressing some hidden anger. Alternatively, you may be trying to kill an aspect of yourself that is represented by the person killed. Identify the characteristics of this person and ask yourself which of these qualities you are trying to put an end to.<\/p><p>To dream that you have been killed suggests that your actions are disconnected from your emotions and conscience. The dream refers to drastic changes that you are trying to make. There is a characteristic that you want to get rid of or a habit that you want to end within yourself. Killing represents the killing off of the old parts and old habits. Alternatively, the dream represents feelings of being let down or betrayed by someone in your waking life. You are feeling overwhelmed, shocked and disappointed.<\/p><p>*Please see also: <a href=\"#Murder\">Murder<\/a>.<\/p>"
    },
    {
        "title": "ller",
        "desc": "<p>To see a killer in your dream suggests that an essential aspect of your emotions have been cut off. You feel that you are losing your identity and your individuality. Alternatively, this dream may represent purification and the healing process. You are standing up for yourself and putting a dramatic end to something.<\/p>"
    },
    {
        "title": "Killer Whale",
        "desc": "<p>To see a killer whale in your dream indicates that you need to be more social or more vocal about something. Step up and speak up. Alternatively, the dream symbolizes spiritual guidance. You are ready to explore your emotions, but you need to make the connection between the conscious and subconscious aspects of yourself.<\/p>"
    },
    {
        "title": "Kilt",
        "desc": "<p>To see or wear a kilt in your dream signifies kinship camaraderie and masculinity. You are expressing a desire to belong. Consider the color and the pattern of the kilt for additional significance.<\/p>"
    },
    {
        "title": "Kimchi",
        "desc": "<p>To see or eat kimchi in your dream represents an emotional barrier. You are wanting to prevent yourself from getting hurt in a relationship.<\/p>"
    },
    {
        "title": "Kimono",
        "desc": "<p>To see or wear a kimono in your dream symbolizes Japan. You are expressing some connection to the country. A kimono also represents elegance, beauty, and docility.<\/p>"
    },
    {
        "title": "Kindergarten",
        "desc": "<p>To dream that you are in kindergarten suggests that you are going through a transitional phase in your life. The dream may also represent some unresolved feelings of anxiety or separation.<\/p>"
    },
    {
        "title": "King",
        "desc": "<p>To see a king in your dream indicates that success and prestige are within reach. You will rise above your problems and adversities. The king is symbolic of power and control. Alternatively, the king symbolizes your father or some father figure. You are looking for support.<\/p><p>To dream that you are the king represents your masculine power. Alternatively, it indicates that you have attained a high level of authority and power. Perhaps you are becoming too domineering or overly confident.<\/p><p>Dreaming of the king of heart card symbolizes a compassionate male figure in your life. It may also mean that you are that compassionate person.<\/p>"
    },
    {
        "title": "King Kong",
        "desc": "<p>To see King Kong in your dream represents an imposing obstacle which is blocking your progress. If King Kong is chasing you, then you need to confront and overcome current difficulties before you can move forward with your life. Alternatively, King Kong symbolizes some primitive impulse and raw sexual energy.<\/p>"
    },
    {
        "title": "Kingfisher",
        "desc": "<p>To see a kingfisher in your dream symbolizes calmness and dignity.<\/p>"
    },
    {
        "title": "Kiosk",
        "desc": "<p>To see a kiosk in your dream signifies your openness and receptiveness toward some relationship. Alternatively, a kiosk suggests that you are looking for advice and for some direction in your life.<\/p>"
    },
    {
        "title": "Kiss",
        "desc": "<p>To dream of a kiss denotes love, affection, tranquility, harmony, and contentment. In particular, if you are dreaming of your first kiss, then it may just be the anticipation of experiencing your actual first kiss. This dream is also symbolic of young love and fresh romance. Perhaps the dream is telling you that you need to inject some more romance into your waking relationship. To see others kissing in your dream suggest that you are too involved in someone else's personal lives and relationship. You need to give them some space. If the dream ends just about as you are about to kiss someone, then it indicates that you are unsure of how he or she really feels about you. You are looking for some sort of relationship with this person but you are not sure about how to go about achieving it. If you are heterosexual and you dream that you are kissing someone of the same sex, then it represents self-acceptance. You are acknowledging the feminine or masculine side. To dream that you are kissing yourself also represents self-acceptance, as well as self-love. You need to accept and love who you are, even your flaws or shortcomings.<\/p><p>To dream that you are kissing someone's hand or someone is kissing your hand signifies respect, reverence and admiration. If you are kissing someone's foot, then it denotes respect and humility. If you are kissing someone on the cheek or someone is kissing you on the cheek, then it signifies adoration, courtesy, friendship and\/or respect. To dream that you are kissing someone on the neck or vice versa refers to uninhibited passion and lust. You are giving into your physical desires.<\/p><p>To dream that you are kissing someone else's boyfriend or girlfriend indicates your wish to be in a relationship and to experience the energy of love. Perhaps you are somewhat jealous. You may be sexually acting out and desire to awaken your passion. Alternatively, the dream indicates a lack of integrity on your part.<\/p><p>To dream that you are kissing your ex indicates that you are looking back on the positive experiences and good times that you shared with your past love. This dream may be triggered by some major change in your current relationship and how far you have come from those past relationships.<\/p><p>If you are kissing a close friend, then it represents your respect and adoration for your friend. You are seeking some intimate closeness that is lacking in some waking relationship. It may or may not signify a romantic interest for her or him.<\/p><p>If you dream that you are kissing a stranger, then it represents acknowledgement and acceptance of the repressed aspect of yourself. If you are kissed by a stranger, then your dream is one of self-discovery. You need to get more acquainted with some aspect of yourself.<\/p><p>To dream that you are kissing a celebrity indicates your drive to be successful. Consider what qualities or movies you associate this celebrity with or what makes this celebrity famous for clues as to where and what you want to achieve success in. Alternatively, the dream may just represent your waking fascination or obsession with this particular celebrity. You may be fantasizing about idealistic romance and love.<\/p><p>To dream of kissing an enemy signifies betrayal, hostility, or reconciliation with an angry friend. Consider also the saying &quot;this kiss of death&quot;. If someone tries to kiss you against your will, then it means that someone is shoving their ideas, beliefs and opinions in your face. He or she is forcing you to do something that you do not really want to do. This dream may also mean that you are refusing to accept some repressed aspect of yourself.<\/p><p>Dreaming of giving or receiving a bloody kiss symbolizes the depth of your passion. You do not hold back in your relationship and tend to give your full self into it.<\/p>"
    },
    {
        "title": "Kitchen",
        "desc": "<p>To see a kitchen in your dream signifies your need for warmth, spiritual nourishment and\/or some emotional healing. It may also symbolize the nurturing mother and how you are there for your loved ones. Alternatively, the kitchen represents a transformation; something new or life altering is about to occur. The dream could also be telling you that if &quot;you can't stand the heat, then you need to get out of the kitchen&quot;. In other words, it is time to abort your plans.<\/p>"
    },
    {
        "title": "Kite",
        "desc": "<p>To dream that you are flying a kite suggests that even though you have high ambitions and goals, you still remain well-grounded. Persistence will pay off in the end no matter how difficult your current task may be. Alternatively, the dream implies that some choice or gift comes with strings attached. There is a price you will need to pay. Or it may suggest that someone is pulling the strings. You are not really in control of the direction that your life is taking.<\/p><p>To see a kite in your dream symbolizes your spiritual or childlike awareness. Consider the design, shape and color of the kite for additional significance.<\/p>"
    },
    {
        "title": "Kitten",
        "desc": "<p>To see a kitten in your dream represents a transitional phase toward independence. You are ready to explore new things that life has to offer. Alternatively, the dream symbolizes innocence and purity.<\/p><p>To dream that you kill a kitten in your dream indicates that you have trouble expressing yourself in a personal relationship. You are feeling frustrated in this relationship.<\/p><p>To dream that a kitten turns into a puppy signifies a transformation in your personal life. You are moving away from only looking out for yourself to caring for somebody else. You are seeking companionship.<\/p><p>To dream that you rescue a kitten on the highway refers to your desire to help those headed in the wrong path or in the wrong direction.<\/p>"
    },
    {
        "title": "Kiwi",
        "desc": "<p>To see or eat a kiwi fruit in your dream suggests a need to be reenergized or revitalized. You are looking for that little bit of strength in order to move forward in a situation.<\/p><p>To see a kiwi bird in your dream indicates that there is a situation that you are trying to avoid or hide from.<\/p>"
    },
    {
        "title": "Kleenex",
        "desc": "<p>To see or use a Kleenex tissue in your dream indicates that it is time to let go of the past and move on. You need to confront your current problems in order to progress forward.<\/p>"
    },
    {
        "title": "Knapsack",
        "desc": "<p>To see or carry a knapsack in your dream represents your hopes, desires, and secrets. It may also be symbolic of the knowledge you have acquired over the years. Alternatively, a knapsack signifies the emotional baggage and responsibilities that you are carrying around and weighing you down.<\/p>"
    },
    {
        "title": "Knee",
        "desc": "<p>To dream of your knees symbolize a level of support you may be receiving. You are feeling very emotional. Feelings of inadequacy or weakness and issues of power\/control also come into play. Perhaps, you are taking on more than you can handle.<\/p>"
    },
    {
        "title": "Kneel",
        "desc": "<p>To dream that you are kneeling represents your humbleness. Alternatively, it indicates that you are open to the influences of others. You may even be yielding or surrendering some aspect of your self.<\/p>"
    },
    {
        "title": "Knife",
        "desc": "<p>To dream that you are carrying a knife signifies anger, aggression and\/or separation. There may be something in your life that you need to cut out and get rid of. Perhaps you need to cut ties or sever some relationship. Be more divisive. Alternatively, a knife refers to some sexual tension or sexual confrontation.<\/p><p>If the knife is dull, then it denotes that your hard work will result in little or no gain.<\/p><p>To dream that you are wounded by a knife is symbolic of masculine or animalistic aggression.<\/p><p>To see someone holding a knife in your dream suggests that you lack control or power in a situation or relationship. Alternatively, the person holding a knife in your dream may be symbolic of a dominant male figure in your waking life.<\/p><p>To see an electric knife in your dream indicates your power to get down to the truth of a situation quickly.<\/p><p>**Please See Also: <a href=\"#Blade\">Blade<\/a>. See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=abortiondream1\">Boiling A Rabbit<\/a>&quot;<\/p>"
    },
    {
        "title": "Knife Grinder",
        "desc": "<p>To see a knife grinder in your dream signifies a loss of freedom.<\/p>"
    },
    {
        "title": "Knight",
        "desc": "<p>To see a knight in your dream signifies honor, loyalty, protection and security. The knight can be seen as a savior or someone who sweeps you off your feet, as in the &quot;knight in shining armor&quot;.<\/p><p>To dream that you are knighted indicates that you are being recognized for your good character. You are being entrusted with power and authority.<\/p>"
    },
    {
        "title": "Knitting",
        "desc": "<p>To dream that you are knitting signifies a quiet, peaceful and loving home life. It may also refer to someone in your life (past or present) who you associate with knitting. Alternatively, knitting symbolizes your creativity or accomplishments. You need to take time out from your regular routine.<\/p><p>To dream that you have difficulties knitting means that you are avoiding some issue.<\/p><p>To see knitting needles in your dream suggest that you are manipulating a situation in order to get a desired outcome.<\/p>"
    },
    {
        "title": "Knob",
        "desc": "<p>To see a knob in your dream signifies turning issues or conditions around you. You need to get a &quot;handle&quot; on these things.<\/p>"
    },
    {
        "title": "Knocker",
        "desc": "<p>To see or use a knocker in your dream symbolizes opportunities and welcomed expectations. You are seeking for assistance and spiritual guidance. On a negative note, to see a knocker in your dream signifies repressed thoughts, death, and dreaded expectations. It is a bad omen.<\/p><p>Consider also a knocker as a sexual innuendo referring to a woman's breasts.<\/p>"
    },
    {
        "title": "Knocking",
        "desc": "<p>To hear knocking in your dreams suggests that your subconscious is trying to attract your attention to some aspect of yourself or to some waking situation. A new opportunity may be presented to you. Alternatively, the dream may be a pun that you are &quot;knocking&quot; on or insulting something or someone. Or perhaps there is a habit or behavior that you to stop or &quot;knock it off&quot;.<\/p>"
    },
    {
        "title": "Knots",
        "desc": "<p>To see knots in your dream signify your worries over minor problems and small matters. You may be trying to find a resolution to a situation. It also denotes constraints and restrictions in your thoughts, feelings and actions.<\/p><p>To dream that you are tying a knot symbolizes your independent and unyielding nature. You have everything under control. It may also mean a union of two people or a commitment to a relationship as suggested by the coming phrase &quot;tying the knot&quot;.<\/p>"
    },
    {
        "title": "Knuckles",
        "desc": "<p>To see knuckles in your dream represent hard work and diligence.<\/p>"
    },
    {
        "title": "Koala",
        "desc": "<p>To see a koala in your dream represents your link the physical world, the subconscious, and the spiritual realm. The koala also symbolizes security, nurturance, protection, and\/or feminine qualities. You may be expressing a desire to regress back into infantile dependence and escape from your daily responsibilities\/problems.<\/p>"
    },
    {
        "title": "Koi Fish",
        "desc": "<p>To see a koi fish in your dream indicates that you need to put aside your pride and ego and not let it get in the way of friendships and relationships. Alternatively, the koi fish is symbolic of patience, perseverance, determination, ambition, tenacity, courage and success. The koi serves as a reminder that you will overcome life's obstacles and adversities.<\/p><p>To see or keep a koi fish pond in your dream represents love, affection and friendship.<\/p>"
    },
    {
        "title": "Komodo Dragon",
        "desc": "<p>To see a komodo dragon in your dream means that you need to be more flexible in your thinking or decision making. Your agility and stealth will get you what you want. You also need to take advantage of the opportunities presented to you. Alternatively, a komodo dragon symbolizes genuine fear.<\/p>"
    },
    {
        "title": "Kookaburra",
        "desc": "<p>To see a kookaburra in your dream means that you are not taking things seriously enough.<\/p>"
    },
    {
        "title": "Koran",
        "desc": "<p>To see or read the Koran in your dream indicates a message from your subconscious or your higher self.<\/p>"
    },
    {
        "title": "Kraken",
        "desc": "<p>To see the Kraken in your dream indicates that all that anger you have suppressed is coming to the surface in a violent way. You are emotionally overwhelmed.<\/p>"
    },
    {
        "title": "Krishna",
        "desc": "<p>To see Krishna in your dream symbolizes divine love and spiritual knowledge.<\/p>"
    },
    {
        "title": "Kumquats",
        "desc": "<p>To see kumquats in your dream symbolize luck and prosperity.<\/p>"
    }
]