[
    {
        "title": "L",
        "desc": "<p>To see the letter &quot;L&quot; in your dream is symbolic of loser. Alternatively, the dream may suggests that you need to take a break from whatever you are doing. The letter L may also signify your fear of the &quot;l-word&quot;. You cannot even bring your dreaming mind to express love.<\/p>"
    },
    {
        "title": "Lab Coat",
        "desc": "<p>To see or wear a lab coat in your dream symbolizes your protective nature. Alternatively, the dream implies your desire to sanitize a situation. Perhaps you are even trying to cover it up."
    },
    {
        "title": "Label",
        "desc": "<p>To dream that you are labeling something represents your need for organization and order. Alternatively, it may also indicates that you are too quick to label something and pigeonhole it. Perhaps you are the one being labeled.<p>To see or read labels in your dream indicate that you have unknowingly exposed certain private matters, due to your carelessness and neglect.<\/p><p>To dream that something is mislabeled indicates that you are looking at things the wrong way. Try another perspective.<\/p><p>To dream that a label is missing on something indicates that you are feeling lost. You are in need of some direction.<\/p>"
    },
    {
        "title": "Labor",
        "desc": "<p>To dream that you are laboring suggests that your goals will take a lot of hard work to accomplish.<\/p><p>If you are a woman and dream that you are in labor indicates your desire to be pregnant and to start a family. To experience or feel pre-term labor pains or Braxton Hicks contractions in your dream indicate the anticipation of hard work ahead. If you are actually pregnant, then the dream serves as a rehearsal for the actual birth. The dream is trying to prepare you for labor and proper breathing.<\/p><p>To dream that someone goes into labor prematurely implies that you need to be better prepared for unexpected challenges that may come your way.<\/p>"
    },
    {
        "title": "Laboratory",
        "desc": "<p>To dream that you are in a laboratory suggests that you are experimenting with your inner feelings, beliefs, or fears. You are testing yourself or some relationship. Alternatively, being in a laboratory means you are going through some sort of transformation.<\/p>"
    },
    {
        "title": "Labrador",
        "desc": "<p>To see a Labrador in your dream is a sign that you are on the right path. The Labrador may also be sending you a message of loyalty, commitment and unconditional love. Perhaps these are things that you need to build or work on in your waking relationships.<\/p>"
    },
    {
        "title": "Labyrinth",
        "desc": "<p>To see or dream that you are in a labyrinth indicates your desires to get to the center of some issue or problem. Alternatively, it suggests that you are feeling trapped in some situation. You feel lost and that there is no way out.<\/p>"
    },
    {
        "title": "Lace",
        "desc": "<p>To see lace in your dream points to your sensuality and femininity. Alternatively, it denotes tradition and old fashioned ideals. Perhaps you are being overly practical in some area of your life.<\/p>"
    },
    {
        "title": "Lacrosse",
        "desc": "<p>To watch or play lacrosse in your dream symbolizes teamwork and cooperation. You can achieve your goals through hard work and dedication. Alternatively, the dream is a metaphor for the game of sex. Your behavior and game play represents your attitudes toward sex.<\/p>"
    },
    {
        "title": "Lactating",
        "desc": "<p>To dream that you are lactating refers to your strong maternal bond and instincts. If you are leaking or squirting milk, then it implies your enthusiasm or desire to be a mother. Referred to as &quot;letdown&quot;, the dream may also be a metaphor that someone is letting you down.<\/p><p>*Please See Also: <a href=\"#Breastfeeding\">Breastfeeding<\/a>.<\/p>"
    },
    {
        "title": "Ladder",
        "desc": "<p>To dream that you are climbing up a ladder suggests that you have reached a new level of achievement. It is symbolic of prosperity, hard work and your efforts. Consider also the phrase of &quot;climbing the social ladder&quot; in which you have achieved a promotion, a higher status, more power, or an important goal. Alternatively, it indicates meditation and prayer. You are setting forth on a spiritual path and higher awareness. Each rung of the ladder is symbolic of a stage in your spiritual awareness. The dream may also highlight how you are looking things from a different perspective.<\/p><p>To dream that you are climbing down a ladder suggests that you are escaping from your spiritual responsibilities. It is an indication of future disappointments.<\/p><p>To dream that you are walking under a ladder signifies bad luck. Perhaps you are having regrets over a decision you made.<\/p><p>To dream that someone is holding a ladder for you indicates that you will find success if you have the support of others. You will rise to a level of prominence.<\/p><p>To dream that you fall from a ladder denotes the hardships, risks or failures you are faced with in your endeavors.<\/p><p>To see a broken ladder in your dream indicates consistent failures in your undertakings. You may feel that you are being handicapped in pursuing your goals.<\/p><p>To dream that you escape by means of a ladder signifies that you will be successful after much struggle and obstacles.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?search=ladderdream1&amp;method=exact&amp;header=dreamid\">Stuck At The Top<\/a>&quot;<\/p>"
    },
    {
        "title": "Ladle",
        "desc": "<p>To see a ladle in your dream suggests that you are being nourished with love. It is symbolic of healing and comfort. Also consider what you are ladling.<\/p><p>To see a broken ladle denotes grief and sorrow in love.<\/p>"
    },
    {
        "title": "Ladybug",
        "desc": "<p>To see a ladybug in your dream symbolizes beauty and good luck. The dream may also be a metaphor for a lady who is bugging you in your waking life. Perhaps there is an issue that you need to address with this lady. If the ladybug is unusually big, then it is analogous to the magnitude of the problem.<\/p>"
    },
    {
        "title": "Lagoon",
        "desc": "<p>To see a lagoon in your dream signifies some misunderstanding and doubt in what you are saying. Alternatively, it symbolizes stagnant emotions.<\/p>"
    },
    {
        "title": "Lair",
        "desc": "<p>To see or dream that you are in an animal lair symbolizes your subconscious mind. It signals self discovery. Alternatively, it represents a place where you feel safe and protected. Figure out what or who you are hiding from. Consider also the type of animal lair and look up the significance of that particular animal.<\/p>"
    },
    {
        "title": "Lake",
        "desc": "<p>To see a lake in your dream signifies your emotional state of mind. You feel restricted and that you can't express your emotions freely. Alternatively, the lake may provide you with solace, security, and peace of mind. If the lake is clear and calm, then it symbolizes your inner peace. If the lake is disturbed, then you may be going through some emotional turmoil.<\/p>"
    },
    {
        "title": "Lamb",
        "desc": "<p>To see a lamb in your dream symbolizes deception. The lamb is also representative of something vulnerable, pure and innocent. Consider the metaphor &quot;as gentle as a lamb&quot;.<\/p><p>To dream that you are holding a lamb in your arms refers to the sacrifices in your life.<\/p>"
    },
    {
        "title": "Lamborghini",
        "desc": "<p>To see or drive a Lamborghini in your dream suggests that you are moving too quickly and aggressively in some area of your life. You are living life in the fast lane.<\/p>"
    },
    {
        "title": "Lame",
        "desc": "<p>To dream that you or someone is lame signifies disappointments and failures in realizing your hopes and desires. Ask yourself who or what is holding you back. You may have lost your confidence. Don't be afraid to ask for help when you need it.<\/p>"
    },
    {
        "title": "Lament",
        "desc": "<p>To lament for something in your dream indicates that you are still in mourning over a loss. Alternatively, the dream suggests that you need to stop feeling sorry for yourself and have a more positive outlook in your life. Only after overcoming your issues and adversities will you enjoy pleasure and realize personal gains.<\/p>"
    },
    {
        "title": "Lamia",
        "desc": "<p>To see Lamia in your dream suggests that you are rejecting your inner child. Alternatively, dreaming of Lamia indicates that a woman figure in your life who may be untrustworthy or cutthroat. She may be sucking away your energy and\/or resources.<\/p>"
    },
    {
        "title": "Lamp",
        "desc": "<p>To see a lamp in your dream symbolizes guidance, hope, inspiration, enlightenment and reassurance. If the lamp is dimly lit or unlit, then it suggests that you are feeling overwhelmed by emotional issues. You have lost your ability to find your own way or see things clearly.<\/p><p>To see a broken lamp in your dream suggests that you are shutting out those who are trying to help you. It is also symbolic of disappointments, misfortune and bad luck.<\/p>"
    },
    {
        "title": "Lamppost",
        "desc": "<p>To see a lamppost in your dream indicates that light needs to be shed on some dark situation. Alternatively, the dream suggests that you are coming out of a depressing or gloomy phase.<\/p>"
    },
    {
        "title": "Lampshade",
        "desc": "<p>To see a lampshade in your dream indicates that you are seeking protection from some intense energy or power. You may be trying to shield yourself or be less noticeable.<\/p>"
    },
    {
        "title": "Lanai",
        "desc": "<p>To see or dream that you are in a lanai indicates that you are open-mined and easy-going. You are receptive to new ideas. As a Hawaiian island, it symbolizes your need to escape and get away from your daily responsibilities. Give yourself a vacation.<\/p>"
    },
    {
        "title": "Lance",
        "desc": "<p>To see a lance in your dream represents initiative and direction. You have set your sight on a goal or path and are taking a firm stance on your beliefs. The lance is also symbolic of masculine power and may have phallic connotations.<\/p><p>To dream that you are wounded by a lance denotes that you have made a poor judgment and are facing the consequences.<\/p>"
    },
    {
        "title": "Land",
        "desc": "<p>To see land in your dream represents your need to be more grounded or down to earth. You are looking for a strong foundation and some stability. Alternatively, the dream may be a metaphor for something that you have &quot;landed&quot; as in a job, a part in a play, etc.<\/p><p>To see rocky or barren land denotes failure in your undertakings.<\/p>"
    },
    {
        "title": "Land Mine",
        "desc": "<p>To see or set a land mine in your dreamsuggests that you are under some extreme pressure or stress. You fear making mistakes or tripping up on some project. Alternatively, a land mine symbolizes emotions or issues that can potentially explode if they are not properly addressed.<\/p>"
    },
    {
        "title": "Landau",
        "desc": "<p>To dream that you are riding in a landau represents light-hearted companionships.<\/p><p>To see an overturned landau in your dream indicates that the good times are about to come to an abrupt end.<\/p>"
    },
    {
        "title": "Landfill",
        "desc": "<p>To see a landfill in your dream represents ideas that you have discarded. It also refers to rejected aspects of yourself or of someone's character. You may be trying to confront or come to terms with these rejections.<\/p>"
    },
    {
        "title": "Landing",
        "desc": "<p>To see the landing of an aircraft in your dream signifies completion of a journey or some task. Some issues that were previously out of control have been resolved.<\/p>"
    },
    {
        "title": "Landlord",
        "desc": "<p>To see your landlord in your dream represents the part of yourself that is always in control. It refers to your rational and responsible side. Perhaps you need to show more restraint and control in certain areas of your psyche.<\/p>"
    },
    {
        "title": "Landscape",
        "desc": "<p>To dream of various landscapes in your dream represent where you are in your life or in your relationships. How do you see yourself with respect to the rest of the world and those around you? Consider what is going on in the landscape and how it may parallel your own waking life. In particular, a barren or dry landscape depicts dissatisfaction in your love life. According to Freud, the dream landscape symbolizes the human body. A landscape with gentle contours symbolize the female body, while a rocky landscape represents the male body. Also consider the feelings that the landscape invokes.<\/p><p>To dream of ever changing landscapes indicates psychological transitions or emotional progress. It represents the various stages in your life. Alternatively, it may be offering you various viewpoints in looking at the same idea or situation. Something may be slipping away from your grasp. Look at the symbolism of key elements in the landscape.<\/p>"
    },
    {
        "title": "Landslide",
        "desc": "<p>To see a landslide in your dream represents emotions that you have been holding back for a long time. You are on the verge of emotional overload. Your emotions are erupting in an unexpected or violent way. The dream may also symbolize the stresses in your life and all the responsibilities that rest on your shoulders.<\/p>"
    },
    {
        "title": "Lane",
        "desc": "<p>To dream that you are changing lanes indicate your impatience. It also means that you need to change your attitude and your way of thinking.<\/p>"
    },
    {
        "title": "Language",
        "desc": "<p>To dream that you are studying a language suggests that you are having difficulties expressing your thoughts. You are confronted with an unfamiliar problem that you do not know how to approach and resolve.<\/p><p>To hear foul or vulgar language in your dream signifies an embarrassing situation.<\/p><p>To hear or speak a foreign language in your dream indicates a message from your subconscious that you do not yet understand.<\/p>"
    },
    {
        "title": "Lantern",
        "desc": "<p>Tosee or carry a lantern in your dream represents the feelings and wisdom that are radiating from within you. These qualities will serve to guide you through life's journey.<\/p>"
    },
    {
        "title": "Lap",
        "desc": "<p>To notice your lap in your dream implies opportunities or problems. It also refers to loneliness and loss.<\/p><p>Todream that you are sitting on someone's lap represents your search for stability and security.<\/p><p>To dream that you are holding someone on your lap signifies your caring and supportive nature. Alternatively, the dream implies that you are open to criticism.<\/p>"
    },
    {
        "title": "Lap Dance",
        "desc": "<p>To give or perform a lap dance in your dream suggests that you may be repressing your sexual desires. Perhaps you are feeling inhibited in discussing your sexual pleasures.<\/p><p>To see or receive a lap dance in your dream indicates your need for a little more excitement in your sex life. Or you are looking for some intimacy.<\/p>"
    },
    {
        "title": "Lapis",
        "desc": "<p>To see a lapis in your dream suggests that no one is perfect. You need to accept yourself along with your imperfections. Look within your own self and your inner strength. Alternatively, the dream represents success, wisdom and divine power.<\/p>"
    },
    {
        "title": "Laptop",
        "desc": "<p>To see or use a laptop in your dream represents your need to reach out and communicate with others in any circumstance.<\/p><p>To dream that your laptop is missing or stolen indicates that you are relying too much on your social network. You need to try and make it on your own abilities and merit.<\/p>"
    },
    {
        "title": "Lard",
        "desc": "<p>Tosee or eat lard in your dream suggests that you need to be vigilant about cutting out the negativities in your life. Alternatively, the dream represents your concerns over food and health issues.<\/p>"
    },
    {
        "title": "Large",
        "desc": "<p>*Please See: <a href=\"#Big\">Big<\/a>.<\/p>"
    },
    {
        "title": "Lark",
        "desc": "<p>Tosee larks flying in your dream symbolize high aspirations. If they fall during flight, then it indicates your fall from grace and loss of innocence.<\/p><p>To hear larks singing in your dream signify success, pleasure and joy. You need to consider a change of environment in order to find happiness.<\/p>"
    },
    {
        "title": "Larva",
        "desc": "<p>To see a larva in your dream symbolizes a rebirth. You are undergoing some inner changes and transformation.<\/p>"
    },
    {
        "title": "Laryngitis",
        "desc": "<p>Todream that you have laryngitis indicates a loss of identity and a lack of personal power. You are unable to speak up and stand up for yourself. Alternatively, the dream points to your inability to convey a certain message. You are not sure how to put into words what you want to say to somebody.<\/p>"
    },
    {
        "title": "Las Vegas",
        "desc": "<p>Todream that you are in Las Vegas refers to excess and overindulgence. You need to show some restraint in some area of your life. Alternatively, to dream of Vegas suggests that your good judgment is being clouded by all the emotional turmoil and chaos.<\/p>"
    },
    {
        "title": "Lasagna",
        "desc": "<p>To see or eat lasagna in your dreamsymbolizes warmth and comfort. Alternatively, it denotes the layers of your emotions.<\/p>"
    },
    {
        "title": "Laser",
        "desc": "<p>To see a laser in your dream symbolizes clarity and truth. You are seeing and understanding things much more clearly. Alternatively, it suggests that you need to focus your attention and concentrate on one task at a time.<\/p>"
    },
    {
        "title": "Lasso",
        "desc": "<p>To dream that you are swinging a lasso suggests that there is some situation, object or relationship that you are trying to hold on to. Consider the significance of what you are lassoing.<\/p><p>*Please See Also: <a href=\"#Rope\">Rope<\/a>.<\/p>"
    },
    {
        "title": "Latch",
        "desc": "<p>To see a latch in your dream symbolizes your sense of security. It refers to the things you reveal and the aspects of yourself that you keep to yourself.<\/p>"
    },
    {
        "title": "Late",
        "desc": "<p>To dream that you are late signifies your fear of change and your ambivalence about seizing an opportunity. You may feel unready, unworthy, or unsupported in your current circumstances. Additionally, you may be overwhelmed or conflicted with decisions about your future. Time is running out and you no longer have time to accomplish all the things you want. Alternatively, being late in your dream could be telling you that it is better late than never.<\/p>"
    },
    {
        "title": "Latin",
        "desc": "<p>To dream that you are studying Latin indicates your position of prominence and distinction. It also refers to your scholarly pursuits.<\/p>"
    },
    {
        "title": "Laudanum",
        "desc": "<p>To dream that you or someone is taking laudanum represents your lack of willpower. You are easily persuaded and influenced by others.<\/p>"
    },
    {
        "title": "Laughing",
        "desc": "<p>To hear laughing or dream that you are laughing suggests that you need to lighten up and let go of your problems. Don't put so much pressure on yourself. Laughing is also a sign of joyous release and pleasure. If you are being laughed at, then it indicates your insecurities and fears of not being accepted.<\/p><p>To hear evil, demonic laughing in your dream represents feelings of humiliation and\/or helplessness. You feel that someone is working against you.<\/p>"
    },
    {
        "title": "Laughing Gas",
        "desc": "<p>To inhale laughing gas in your dream suggests that you are being too serious or uptight. You need to lighten up. Alternatively, laughing gas implies that you are trying to numb yourself from some emotional pain. You are trying to escape from your waking problems.<\/p>"
    },
    {
        "title": "Launch",
        "desc": "<p>To see a successful launch in your dream indicates that a new project or relationship is taking off.<\/p><p>To see a failed launch in your dream represents failed attempts and disappointments. There is a weakness in your way of thinking.<\/p>"
    },
    {
        "title": "Laundromat",
        "desc": "<p>To dream that you are at a Laundromat represents a transformation or cleansing. You are ready to rid yourself of past hurts. It is time for new changes.<\/p>"
    },
    {
        "title": "Laundry",
        "desc": "<p>To dream that you are doing your laundry suggests that you are cleaning up your act or changing your image. Perhaps, you are too concerned about how you appear to others.<\/p><p>To dream that you are sorting the laundry indicates that you are trying to understand your own feelings and sort your attitudes.<\/p>"
    },
    {
        "title": "Laundry Chute",
        "desc": "<p>To see a laundry chute in your dream suggests that you are not allowing others dictate how your should look or act. Your mind is your own. Alternatively, it signifies exploration of your subconscious and\/or acknowledgement of your negative emotions.<\/p>"
    },
    {
        "title": "Laurel",
        "desc": "<p>To see or wear a laurel in your dream symbolizes success and victory. You have overcome a difficult task and are being rewarded for a job well done. Alternatively, the dream may be a pun on someone who is named &quot;Laurel&quot; in your life.<\/p>"
    },
    {
        "title": "Lava",
        "desc": "<p>To see lava in your dream signifies violent anger which you have kept inside for a period of time.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=lavadream1\">Lava<\/a>&quot;<\/p>"
    },
    {
        "title": "Lava Lamp",
        "desc": "<p>To see a lava lamp in your dream represents slow, fluid motion. Something in your waking life is moving in a similar fashion as the lava lamp. Perhaps, you are taking your time to do something and making sure it is thorough. Consider the color of the lava lamp for clues.<\/p>"
    },
    {
        "title": "Lavender",
        "desc": "<p>To see lavender in you dream indicates mysticism and spiritual cleansing.<\/p><p>To smell lavender in your dream symbolizes calmness, peace and serenity. You need to cool off.<\/p>"
    },
    {
        "title": "Law",
        "desc": "<p>To dream that you are referring to the law suggests that you need to show more restraint in certain areas of your life.<\/p><p>To dream that you are studying law denotes success in your endeavors and projects.<\/p>"
    },
    {
        "title": "Lawn",
        "desc": "<p>To see a green lawn in your dream represents hope, pleasure, and well-being. You are in control and are making steady and smooth progress. If the lawn is overgrown or full of weeds, then it means that you are not taking good care of yourself.<\/p><p>To see a dead or brown lawn in your dream signifies dissatisfaction with some aspect of your home life. You may also be too concerned about what other people think.<\/p>"
    },
    {
        "title": "Lawn Mower",
        "desc": "<p>To see a lawn mower in your dream suggests that you need to channel your negative thinking into positive energy. You also need to keep your temper and attitude under control. Alternatively, the dream points to your need to keep up your appearances.<\/p>"
    },
    {
        "title": "Lawsuits",
        "desc": "<p>To dream that you are involved in a lawsuit indicates feelings of guilt and fear of being caught. You have insecurities and concerns of being judged or criticized for your actions.<\/p>"
    },
    {
        "title": "Lawyer",
        "desc": "<p>To see or dream that you are a lawyer means that help is available to you if you ask. You need to put aside your pride and look upon others for their assistance. On a more direct level, the dream indicates that you are concerned or preoccupied with some legal issue in your waking life.<\/p>"
    },
    {
        "title": "Laxative",
        "desc": "<p>To see or take a laxative in your dream suggests that you need to let go of the emotional hurt and fears that you are still harboring inside. It is time to cleanse your body and spirits.<\/p>"
    },
    {
        "title": "Lazy",
        "desc": "<p>To dream that you are feeling lazy means that you are feeling emotionally drained; you need to take a break from life. The dream may be an actual reflection of your waking state.<\/p><p>To dream that others are lazy indicates feelings of resentment. You feel that you are doing the work, while others are not pulling their own weight.<\/p>"
    },
    {
        "title": "Lazy Susan",
        "desc": "<p>To see or use a lazy susan in your dream implies that you are in a state of stagnation. You feel that you are going no where with your life. Alternatively, a lazy susan may have the same symbolism as a circle.<\/p>"
    },
    {
        "title": "Lead",
        "desc": "<p>To see lead in your dream indicates that there is a problem or issue that is burdening you. Perhaps a relationship or some guilt is weighing you down.<\/p><p>To see a lead mine in your dream denotes deceit.<\/p>"
    },
    {
        "title": "Leader",
        "desc": "<p>To dream that you are a leader represents your ability to assert your ideas and\/or offer guidance to others. The dream may also be telling you that you are being too passive and need to take a more active role in a situation. Take control over your life and behavior.<\/p>"
    },
    {
        "title": "Leaf Blower",
        "desc": "<p>To see or use a leaf blower in your dream means that you need to collect your thoughts and\/or ideas together in order to better process and understand.<\/p>"
    },
    {
        "title": "Leaflet",
        "desc": "<p>To see or read a leaflet in your dream refers to your open-mindedness and quest for knowledge. You are open to other viewpoints and opinions.<\/p>"
    },
    {
        "title": "Leak",
        "desc": "<p>To see a leak in your dream symbolizes loss, disappointments, frustrations and distress. You are wasting your energy on fruitless endeavors. Alternatively, the dream indicates some repressed feelings emerging from your subconscious or from your past. Metaphorically, the dream may suggest that some secret information has &quot;leaked&quot; out.<\/p>"
    },
    {
        "title": "Leaning",
        "desc": "<p>To dream that you are leaning on somebody symbolizes your dependency on that person. You need to learn to stand on your own. Conversely, if someone is leaning on you in your dream, then it signifies your responsibilities. You are feeling the weight of other's burdens.<\/p>"
    },
    {
        "title": "Leaping",
        "desc": "<p>To dream that you are leaping over an object indicates that you will eventually achieve your desires and goals after some effort and struggle. Alternatively, the dream may be a metaphor for &quot;taking a leap&quot; or taking a chance on a new relationship or situation. Try to step outside your comfort zone. Consider also the phrase &quot;leap of faith&quot;.<\/p><p>*Please also see: <a href=\"#jumping\">Jumping<\/a>.<\/p>"
    },
    {
        "title": "Learn",
        "desc": "<p>To dream that you are learning something signifies your never-ending quest in acquiring knowledge. You are seeking a deeper knowledge and a deeper understanding of yourself.<\/p><p>To dream that you are in a place of learning represents your success and your rise to distinction.<\/p>"
    },
    {
        "title": "Leash",
        "desc": "<p>To dream that you are holding a leash indicates a need for more control in your life. You need to take the lead in some projection or situation.<\/p><p>To dream that you are wearing a leash suggests that you need to show more restraint with regards to your sexual urges and desires. Alternatively, the dream indicates that you are too easily led or too easily influenced. You are letting other people control you and take you in a direction that you do not really want to go.<\/p><p>To dream that the leash is broken or that your pet has broken free from the leash implies that you have successfully broken away from somebody's control and influence.<\/p>"
    },
    {
        "title": "Leather",
        "desc": "<p>To see or wear leather in your dream represents toughness and ruggedness. It may imply your thick-skinned nature. Or perhaps you are seeking protection from the elements. Alternatively, the dream refers to your instinctual and animalistic nature. It may also have sexual connotations.<\/p>"
    },
    {
        "title": "Leaves",
        "desc": "<p>To see leaves in your dream signify new found happiness and improvements in various aspects of your life. It is symbolic of fertility, growth and openness. Alternatively, leaves represent a passage of time. Depending on the color and type of leaf, the dream could be highlighting a certain period of time. The leaves may also be a metaphor to &quot;leave&quot; you alone.<\/p><p>To see brown or withered leaves in your dream signifies fallen hopes, despair, sadness and loss. If you are sweeping or raking leaves, then it represents the end of a project, relationship or situation. It also signifies experience.<\/p><p>To dream that you are digging leaves out of your ear literally means that your dream is trying to tell you to &quot;leave&quot; some situation or relationship.<\/p>"
    },
    {
        "title": "Leaving",
        "desc": "<p>To dream that someone is leaving you refers to feelings of rejection or of not being able to keep up. You are questioning your abilities. Perhaps you are not utilizing your full potential. Alternatively, the dream indicates an end to something; you are ready to let go of the past and move forward.<\/p>"
    },
    {
        "title": "Lecture",
        "desc": "<p>To dream that you are giving a lecture suggests that you are becoming somewhat of a bore. You need to improve your communications skills. Alternatively, your dream may serve as a continuation of your intellectual thinking, carried over from your waking hours.<\/p><p>To dream that you are listening to a lecture indicates that you need to do some research and weigh out your options before making a decision on some matter.<\/p>"
    },
    {
        "title": "Ledge",
        "desc": "<p>To dream that you are standing on a ledge indicates that you are feeling tense, anxious and\/or excited. Consider what direction you are looking? Up? Down? Straight Ahead? The direction to which you are looking relates to your viewpoint, whether it be an optimistic one, pessimistic one or realistic one. On a more positive note, this dream may signify a sense of freedom and liberation.<p>To dream that someone is standing on a ledge denotes a sign of desperation and a cry for help.<\/p>"
    },
    {
        "title": "Ledger",
        "desc": "<p>To dream that you are keeping a ledger indicates a complicated situation which you have been left to fight on your own. If the accounts on the ledger are in good standing, then it refers to an improvement or positive turn to your situation. If the accounts on the ledger are senseless, then it signify losses, suffering or negativity.<\/p><p>If you find errors in the ledger, then it indicates that some minor disputes.<\/p>"
    },
    {
        "title": "Leeches",
        "desc": "<p>To see or be bitten by leeches in your dream refer to something in your life that is draining the energy and vigor out of you. The dream may refer to people, habits, or negative emotions that are sucking you out of your vitality. Alternatively, if your body is covered in leeches, then you are feeling disgusted by your own body or repulsed by something you have done.<\/p>"
    },
    {
        "title": "Leeks",
        "desc": "<p>To see a leek in your dream symbolizes victory and protection. The dream may also be a metaphor for a &quot;leak&quot;.<\/p>"
    },
    {
        "title": "Leeward",
        "desc": "<p>To dream that you are sailing leeward denotes pleasant occasions and joyous gatherings.<\/p>"
    },
    {
        "title": "Left",
        "desc": "<p>To dream of the direction left symbolizes the subconscious and your repressed thoughts\/emotions. It is an indication of passivity.<\/p><p>To dream that you are left behind represents feelings of rejection or not fitting into a group. It may also highlight fears of not being able to keep up. You are questioning your abilities. The dream may be telling you that you are not utilizing your full potential. If you left something or someone behind, then it indicates that you are ready to let go of the past or move forward.<\/p>"
    },
    {
        "title": "Leftovers",
        "desc": "<p>To see or eat leftovers in your dream symbolize resentment for the things that you are still clinging on to. It is time to let it go and let love in.<\/p>"
    },
    {
        "title": "Leg Warmers",
        "desc": "<p>To see or wear leg warmers in your dream suggests that you are headed toward the right direction in life.<\/p>"
    },
    {
        "title": "Leggings",
        "desc": "<p>To wear leggings in your dream implies that you are flexible and open to change. You can adapt to various situations.<\/p>"
    },
    {
        "title": "Legislature",
        "desc": "<p>To dream that you are a member of a legislature suggests that you will experience many difficulties in moving ahead. The dream may be encouraging you to be more tenacious and determined in achieving your goals.<\/p>"
    },
    {
        "title": "Lego",
        "desc": "<p>To see or play with Lego blocks in your dream refers to your ability to make something out of a single block. It may refer to the &quot;building blocks&quot; or foundation of some plan. The dream may also be a pun on &quot;let go&quot;. Is there something in your waking life that you need to let go.<\/p><p>To dream that something is make of Legos represents your imagination and creative mind. If you dream that a house is made of Lego blocks, then it symbolizes your creative self and your ability to manipulate how you want to be perceived.<\/p>"
    },
    {
        "title": "Legs",
        "desc": "<p>To see your legs in your dream indicate that you have regained confidence to stand up and take control again. It also implies progress and your ability to navigate through life. If your legs are weak, then you may be feeling emotionally vulnerable. If you dream that you are crossing your legs, then it implies defensiveness or your close minded attitude.<\/p><p>To see someone else's legs in your dream represent your admiration for that person. You need to adopt some of the ways that this person does things.<\/p><p>To dream that your leg is broken, wounded or crippled signifies a lack of balance, autonomy, or independence in your life. You may be unable or unwilling to stand up for yourself. Perhaps you are lacking courage and refuse to make a stand. If you dream that someone has one leg, then it refers to some sort of failing relationship.<\/p><p>If you are a woman and dream that your legs are hairy, then it suggests that you are too domineering. You may be overly controlling in a relationship. If you are trying to cover up your hairy legs, then it points to your passive aggressive nature.<\/p><p>To dream that one of your leg is shorter than the other suggests that there is some imbalance in some aspect of your life. You are placing more emphasis and weight on one thing, while ignoring other important aspects that need attention as well.<\/p><p>To dream that you have three or more legs denotes that you are undertaking too many projects. You are taking on more things that you can handle. Some of these projects will prove counterproductive.<\/p><p>To dream that you have a stick leg or a wooden leg suggests that balance has been restored in your once chaotic or hectic life. You are able to stand up again with the help and support of others. Alternatively, the dream may be telling you to slow down.<\/p><p>Dreaming that there are bite marks on your legs means that you need to proceed with caution. Someone doesn't want you to succeed and may even try to stall your efforts. If you dream that you have staples or stitches on your leg, then it means that you are not letting obstacles stop you from proceeding with your goals.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=legdream1\">Wounded Leg<\/a>&quot;<\/p>"
    },
    {
        "title": "Legumes",
        "desc": "<p>To see legumes in your dream symbolize small annoyances and minor problems.<\/p>"
    },
    {
        "title": "Lei",
        "desc": "<p>To dream that someone is giving you a lei signifies a welcoming, acceptance, and acknowledgement. The dream may also be a pun on &quot;getting laid&quot;.<\/p><p>*Please also see: <a href=\"#Garland\">Garland<\/a>.<\/p>"
    },
    {
        "title": "Lemmings",
        "desc": "<p>To see lemmings in your dream suggest that you need to rethink the risks you are taking. It forewarns of some dangerous situation.<\/p>"
    },
    {
        "title": "Lemniscate",
        "desc": "<p>To see a lemniscate in your dream symbolizes time, longevity or possibilities. If you see objects shaped like a lemniscate, then the dream may be drawing your attention to the number 8. Consider the significance of this number in your waking life.<\/p>"
    },
    {
        "title": "Lemonade",
        "desc": "<p>To dream that you are drinking lemonade suggests your need to cool off. Perhaps you are involved in an argument that is getting too heated. Metaphorically, the dream denotes a spiritual cleansing.<\/p>"
    },
    {
        "title": "Lemons",
        "desc": "<p>To see a lemon in your dream indicates something that is inferior in quality. Perhaps a situation or relationship has turned sour.<\/p><p>To eat or suck on a lemon in your dream refers to your need for cleansing or healing.<\/p><p>To dream that you are squeezing a lemon suggest your need to be more economical.<\/p>"
    },
    {
        "title": "Lemur",
        "desc": "<p>To see a lemur in your dream indicates that there is something in your life that you are not seeing clearly. You are lacking understanding, knowledge or awareness of some situation. Subconscious thoughts may be trying to push to the surface.<\/p>"
    },
    {
        "title": "Lending",
        "desc": "<p>To dream that you are lending money represents your obligations to others. Alternatively, it symbolizes the value of your support system.<\/p><p>To dream that someone lends you something indicates that you need to reevaluate and better manage your resources before your deplete them. You may be on the path to dependency.<\/p>"
    },
    {
        "title": "Lens",
        "desc": "<p>To see a lens in your dream symbolize the need for you to take a closer and better look at things. You need to concentrate and focus on a situation that has long been neglected.<\/p>"
    },
    {
        "title": "Lentil",
        "desc": "<p>To see or eat lentils in your dream represent your roots and your connections to humanity. Alternatively, lentils symbolize fertility or immortality.<\/p>"
    },
    {
        "title": "Leo",
        "desc": "<p>To dream that someone is a Leo symbolizes someone who is creative, generous, playful and authoritative. Perhaps you need to incorporate these aspects into your own character. In addition, you tend to be drawn to drama and like to be the center of attention. You also have a sunny disposition and great leadership ability. Alternatively, it relates to issues of the heart. The dream may also be a pun on someone named Leo in your waking life.<\/p>"
    },
    {
        "title": "Leopard",
        "desc": "<p>To see a wild leopard in your dream suggests that you will eventually overcome your difficulties through persistence. If the leopard is in a cage, then it suggests that you will overcome any obstacles with relative ease. Alternatively, dreaming of a leopard means that you are who you are, just like a leopard can't change its spots.<\/p><p>To dream that you kill a leopard refers to success in your projects.<\/p><p>To dream that a leopard is attacking you indicates that you are overly confident in your future success. You do not realize the difficult struggles and challenges that you will have to endure.<\/p><p>Dreaming of a black leopard suggests that you are trying to either hide your intentions or conceal your true self.<\/p>"
    },
    {
        "title": "Leper",
        "desc": "<p>To see a leper in your dream indicates rejected aspect of yourself that is unclean or unaccepted by society.<\/p>"
    },
    {
        "title": "Leprechaun",
        "desc": "<p>To see a leprechaun in your dream suggests that through perseverance and dedication, you will reap the benefits and rewards of your hard work. Alternatively, the dream means that you are trying to take the quick and easy path to success.<\/p><p>To dream that you are a leprechaun refers to the mischievous aspect of your personality.<\/p>"
    },
    {
        "title": "Leprosy",
        "desc": "<p>To dream that you have leprosy suggests that you are not utilizing your full potential. You are wasting away your talents and abilities.<\/p>"
    },
    {
        "title": "Lesbian",
        "desc": "<p>If you are not a lesbian in your waking life, but dream that you are a lesbian, then it signifies a union with aspects of yourself. It is symbolic of self-love, self-acceptance, and passion. You are comfortable with your sexuality and femininity. If, in your dream you abhor the notion of lesbianism, then it represents your fears and rejection of aspects of your own sexuality.<\/p><p>If you are a lesbian in your waking life, then the dream is simply a reflection of your own self.<\/p>"
    },
    {
        "title": "Lesson",
        "desc": "<p>To dream about a lesson indicates that new understanding, knowledge or wisdom is coming to light. Alternatively, the dream may be a pun on your need to &quot;lessen&quot; something in your waking life.<\/p>"
    },
    {
        "title": "Letter",
        "desc": "<p>To dream that you receive a letter signifies a new opportunity or challenge. Alternatively, the letter represents a message from your subconscious. The contents of the letter may offer you some guidance in a current situation. Consider also how the letter may be a pun on &quot;let her&quot;.<\/p><p>If you dream that you are sending a letter, then it represents an emotional or important message that you need to get out to someone. You need to make yourself heard and get your point across.<\/p><p>To tear up a letter in you dream symbolizes past mistakes and regrets in your life.<\/p><p>To see an unopened letter in your dream means that you are intentionally ignoring some information. You are refusing to accept the facts about a situation.<\/p><p>Dreaming about writing a letter represents something you are trying to convey or express from the heart. So if you dream that you have trouble writing a letter, then it means that it is difficult for you to express your feelings.<\/p>"
    },
    {
        "title": "Letters",
        "desc": "<p>To see letters of the alphabet in your dream symbolize any object, animal, place associated with or resembling that particular letter. For example, the letter &quot;T&quot; may refer to a type intersection in a road. Alternatively, you may still be trying to understand some concept or emotion that is still in the primitive stages.<\/p><p>For significance of other letters, please refer to: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/alphabet-dream-symbols.htm\">Dream Moods' Dream Themes: Alphabet<\/a><\/p>"
    },
    {
        "title": "Lettuce",
        "desc": "<p>To see lettuce growing in your dream represents abundance. It points you back to a simpler time.<\/p><p>To dream that you are eating lettuce signifies your need for spiritual nourishment. It may also mean that you are lacking in a particular nutrient. You need to eat a more well balanced diet. The dream may also be a pun on &quot;let us&quot;. Is there some situation where you are seeking approval or permission?<\/p>"
    },
    {
        "title": "Level Crossing",
        "desc": "<p>To see a level crossing in your dream symbolizes temporary setbacks toward achieving your goals, especially if the gate is going down. If the gate is up, then it means that you have overcome certain obstacles in your life. You are not letting something or something get in your way of your goals.<\/p>"
    },
    {
        "title": "Leveler",
        "desc": "<p>To see or use a leveler in your dream symbolizes balance and harmony. Everything is in alignment. The dream may also suggest that you need to look at things from a different level in order to gain a new perspective.<\/p>"
    },
    {
        "title": "Levitation",
        "desc": "<p>To dream that you are levitating suggests that you are holding on to far-fetched and outlandish ideas. You need to be more realistic. Alternatively, the dream means that you may not be feeling grounded or safe. You are feeling helpless and disconnected with those around you.<\/p><p>To see someone levitating in your dream represents your desire to be helpful and supportive to others. Alternatively, It indicates that you admire or look up to the person being levitated.<\/p><p>To dream that you are making someone or something levitate in your dream represents your supportive nature. Alternatively, the dream indicates that you are trying to balance too many things in your life. It may literally mean that &quot;things up are up in the air&quot;. You do not have a conclusion or decision about something.<\/p>"
    },
    {
        "title": "Liar",
        "desc": "<p>To dream that someone is calling you a liar denotes that you will be irked by some deceitful person.<\/p><p>To dream that you are lying suggests that you are trying to deceive yourself into believing in something that goes against your natural instincts or long held values. Ask yourself what you are hiding from yourself or from others.<\/p><p>To dream that someone is a liar indicates your growing distrust for that person. You may have lost your faith in that individual. Alternatively, it suggests that you are no longer as confident.<\/p>"
    },
    {
        "title": "Libra",
        "desc": "<p>To dream that someone is a Libra indicates fairness harmony and cooperation. You are trying to restore order to your waking life.<\/p>"
    },
    {
        "title": "Librarian",
        "desc": "<p>To see or dream that you are a librarian indicates a creative and knowledgeable mind.<\/p>"
    },
    {
        "title": "Library",
        "desc": "<p>To dream that you are in a library signifies your search for knowledge and your hunger for ideas. You may be trying to seek out new meanings to life. You need to study and evaluate your situation before taking action. If the library is disorganized, then it suggests that too much information is coming at you at the same time. You are having difficulty sorting it all out.<\/p><p>To dream that you cannot find a book in the library or that the book you are looking for is already checked out suggests that a certain aspect of your self is lacking enrichment or is under developed.<\/p><p>To see a library in your dream symbolizes the knowledge you have accumulated over the years.<\/p>"
    },
    {
        "title": "Lice",
        "desc": "<p>To see lice in your dream signify frustrations, distress and feelings of guilt. You may be feeling emotionally or physically unclean. Alternatively, the lice represents a person, situation, or relationship that you want to distance yourself from. You may be feeling used or taken advantage of.<\/p>"
    },
    {
        "title": "License",
        "desc": "<p>To see or carry a license in your dream represents control over your life. You have been given the go ahead to pursue or proceed with a new endeavor in your life.<\/p>"
    },
    {
        "title": "License Plate",
        "desc": "<p>To see a license plate in your dream represents freedom to run your own life and to do what you want to do.<\/p>"
    },
    {
        "title": "Lick",
        "desc": "<p>To dream that you are licking something signifies your need to be more cautious before proceeding on to new situations or adventures. You need to be more careful and methodical in your endeavors. Alternatively, it may also represent satisfaction in some minor matters.<\/p><p>To dream that you are licked by an animal means that you will be called upon for advice.<\/p>"
    },
    {
        "title": "Licorice",
        "desc": "<p>To see or eat licorice in your dream suggests that you are enjoying a little sweetness in your life. You are in a relaxed state of mind. Alternatively, the dream may be a metaphor for someone who is genuinely sweet and kind-hearted.<\/p>"
    },
    {
        "title": "Lie",
        "desc": "<p>*Please see: <a href=\"#Liar\">Liar<\/a>.<\/p>"
    },
    {
        "title": "Lie Detector",
        "desc": "<p>To see a lie detector in your dream represents your lack of confidence. You are experiencing a loss of faith in others.<\/p><p>To dream that you are taking a lie detector test suggests that it is time to face the facts. Stop being in denial.<\/p>"
    },
    {
        "title": "Life Jacket",
        "desc": "<p>To see or wear a life jacket in your dream symbolizes security and reinforcement. You are in need of some support.<\/p><p>To dream that you are not wearing a life jacket indicates that you want to approach your emotions and problems head on, even though it may be painful or uncomfortable.<\/p>"
    },
    {
        "title": "Life Saver",
        "desc": "<p>To see or wear a life saver in your dream suggests that you are getting another opportunity or chance. Take advantage of the opportunity before it slips away. Alternatively, a life saver symbolizes wholeness and completeness. The dream may also be a metaphor for someone who has saved you from a jam or difficult situation.<\/p>"
    },
    {
        "title": "Life Swap",
        "desc": "<p>To dream that you are switching lives with someone else or that you are living someone else's life implies that you need to consider something from someone else's perspective. You need to be more sympathetic to others. Alternatively, dreaming of swapping lives represents an escape from your own personal issues and stresses. You wished you were someone else.<\/p>"
    },
    {
        "title": "Lifeboat",
        "desc": "<p>To see a lifeboat in your dream suggests that you need help in coping with your emotions. You want to be rescued from a current situation that you feel is beyond your control.<\/p>"
    },
    {
        "title": "Lifeguard",
        "desc": "<p>To see or dream that you are a lifeguard means that you are keeping your emotions well guarded. Perhaps you are seeking some guidance and support while you carefully explore aspects of your subconscious.<\/p>"
    },
    {
        "title": "Lifeline",
        "desc": "<p>To dream about the lifeline on your palm signifies your ambitions, your life and where you want to be headed. If your dream lifeline is short, then it implies that your goal is within close grasp. If the lifeline is long, then it means that you still have a long way to go before achieving your goals. Alternatively, to dream about your lifeline may be a reminder that you need to live life to the fullest.<\/p>"
    },
    {
        "title": "Lift",
        "desc": "<p>To dream that you are being lifted represents that you are rising above some unpleasant situation or issue.<\/p><p>*Please See Also: <a href=\"#Elevator\">Elevator<\/a>.<\/p>"
    },
    {
        "title": "Light",
        "desc": "<p>To see light in your dream represents illumination, clarity, guidance, plain understanding,and insight. Light is being shed on a once cloudy situation or problem. You have found the truth to a situation or an answer to a problem. Also consider the color of the light for additional significance.<\/p><p>If the light is particularly bright, then it indicates that you need to move toward a higher level of awareness and feeling. Bright light dreams are sometimes common for those who are near death.<\/p><p>To see soft or shadowy lighting in your dreams indicates feelings and thoughts from the primal aspects and less developed parts of your subconscious.<\/p><p>To dream that you cannot turn on the light indicates a lack of insight and perspective on a situation.<\/p><p>Dreaming of a bright light coming from an object often signifies divinity and\/or a higher consciousness. Consider the significance of the object and its role in your spirituality or spiritual journey.<\/p><p>If you see a motion sensor light in your dream, then it means that you are taking a step in the right direction.<\/p>"
    },
    {
        "title": "Light Bulb",
        "desc": "<p>To see a light bulb in your dream suggests that you are ready to accept and\/or face reality. It refers to your consciousness. The dream also symbolizes spiritual enlightenment, hope, new ideas and visions. You are approaching a situation from a new direction.<\/p><p>To see a burned out light bulb in your dream indicates that you are feeling ineffective. You feel that you are out of ideas or that you have nothing to offer.<\/p>"
    },
    {
        "title": "Lighter",
        "desc": "<p>To see or use a lighter in your dream represents a spark of some new idea.<\/p>"
    },
    {
        "title": "Lighthouse",
        "desc": "<p>To see a lighthouse in your dream indicates that you are seeking guidance during a difficult and tumultuous time.<\/p>"
    },
    {
        "title": "Lightning",
        "desc": "<p>To see lightning in your dream signifies sudden awareness, insight, spiritual revelation, truth and purification. Alternatively, lightning implies a shocking turn of events. There are many forces governing your life that may be beyond your control and even destructive.<\/p><p>To dream that you are struck by lightning symbolizes irreversible changes occurring in your life. You are undergoing a permanent transformation.<\/p>"
    },
    {
        "title": "Lightsaber",
        "desc": "<p>To see or wield a lightsaber in your dream signifies being in control. You need to channel your inner strength and find the power from within.<\/p>"
    },
    {
        "title": "Lilac",
        "desc": "<p>To see lilac in your dream indicates disappointments and rejection. You should not always rely on what you see or hear.<\/p>"
    },
    {
        "title": "Lily",
        "desc": "<p>To see lilies in your dream symbolize tranquility, spirituality, faith, peace, purity, joy and bliss. It is also connected mourning.<\/p>"
    },
    {
        "title": "Lily Pad",
        "desc": "<p>To see a lily pad in your dream indicates that you are looking for a break from your emotional journey.<\/p>"
    },
    {
        "title": "Limb",
        "desc": "<p>To see a tree limb in your dream symbolizes the relationship and communication between you and your family or relatives. Alternatively, the limb represents your developing abilities and budding talents. Consider the thickness and condition of the limb. The dream may also be a metaphor that you are &quot;going on out on a limb&quot;. The odds are working against you.<\/p><p>To dream that you have an invisible limb means that you are not realizing your own potential. You are not utilizing your full abilities. In particular, if you dream that you have an invisible arm or hand, then it means that you are not doing all that you can. If you dream that you have an invisible leg or foot, then it implies that you are not going the distance in some task. Perhaps others are underestimating your abilities.<\/p><p>*Please also refer to the specific part of the body in the Dream Moods Dictionary.<\/p>"
    },
    {
        "title": "Limbo",
        "desc": "<p>To dream that you are dancing the limbo refers to your flexibility in some situation. If you are unsuccessful at going under the stick, then it implies that you are unyielding in your beliefs or decisions. Alternatively, the dream may be a metaphor that you are &quot;in limbo&quot;. You do not know what to do with your life and feel stuck in your current relationship or circumstance.<\/p>"
    },
    {
        "title": "Lime",
        "desc": "<p>To see a lime in your dream represents temporary setbacks and delays. You need to take the good with the bad. The prosperous time will come only after you endure some of the difficult times.<\/p>"
    },
    {
        "title": "Limestone",
        "desc": "<p>To see limestone in your dream refers to your own stubbornness. You are being hard headed about some issue.<\/p>"
    },
    {
        "title": "Limousine",
        "desc": "<p>To see a limousine in your dream indicates that you have an exaggerated sense of self-worth and self-importance. You may also feel the need to show off and impress others. Furthermore, if the limousine is black, then it suggests that your are unwilling to make any changes or yield to others. Alternatively, it may symbolize prestige, wealth, and power.<\/p>"
    },
    {
        "title": "Limping",
        "desc": "<p>To dream that you are limping refers to a lack of balance in some relationship in your life. You feel that the relationship is one-sided. Perhaps you feel that you are giving more than you are getting back or vice-versa.<\/p><p>To see an animal limping in your dream indicates that you have suffered a setback to your personal freedom.<\/p>"
    },
    {
        "title": "Linden",
        "desc": "<p>To see a linden tree in your dream represents joy, happiness, friendships and beauty. The dream also suggests that there is someone watching over you.<\/p>"
    },
    {
        "title": "Line",
        "desc": "<p>To see a line in your dream symbolizes duality, limits, boundaries and rules. It also relates to movement or non-movement. To dream that you are crossing a line suggests that you are overstepping your boundaries or that you are moving beyond the limits in some area of your life.<\/p><p>To see a line of people or objects indicates that you need to be more aware of some situation or relationship.<\/p><p>To dream that you are standing in line represents your need for patience. You need to learn to wait for something and not always have it right away.<\/p>"
    },
    {
        "title": "Linen",
        "desc": "<p>To see or use linens in your dream indicate that you need to slow down and appreciate the finer things in life. It symbolizes luxury, elegance and sophistication.<\/p><p>To fold or sort linens in your dream signify domestic bliss.<\/p>"
    },
    {
        "title": "Lineup",
        "desc": "<p>To dream that you are standing in a police lineup indicates fear of being singled out or picked to perform. You are harboring some self-guilt.<\/p><p>Dreaming that you are viewing a police line up or that you are picking someone out of a lineup means that you are making an important decision that will effect the lives of others.<\/p>"
    },
    {
        "title": "Lingerie",
        "desc": "<p>To dream that you are wearing lingerie represents your sexual identity, body image and your self-esteem. You may finally be recognizing and acknowledging an aspect of yourself that was not previously expressed.<\/p><p>To dream that you are buying or shopping for lingerie indicates that you are compensating for your inner feelings of emptiness. You may be trying to fulfill some sexual\/emotional need. Alternatively, the dream means that you are looking to change your image and attitude. You may feel one way on the inside, but behave another way on the outside.<\/p><p>*Please see also: <a href=\"#Underwear\">Underwear<\/a>.<\/p>"
    },
    {
        "title": "Lingerie Store",
        "desc": "<p>To dream that you are in a lingerie store suggests that you are lacking excitement in your life. You are trying to fulfill a void in your sex life. Alternatively, the dream may mean that you are feeling exposed.<\/p>"
    },
    {
        "title": "Link",
        "desc": "<p>To see a link in your dream represents your connections and relations to others. Alternatively, the link symbolizes a small part in a larger picture. Do not overlook the role you play in the larger scheme of things, no matter how seemingly insignificant it may seem.<\/p>"
    },
    {
        "title": "Lion",
        "desc": "<p>To see a lion in your dream symbolizes great strength, courage, aggression and power. You will overcome some of your emotional difficulties. As king of the jungle, the lion also represents dignity, royalty, leadership, pride and domination. You have much influence over others. You also need to exercise some restraint in your own personal and social life. Alternatively, a lion represents your need for control over others. You have to be in charge.<\/p><p>Dreaming of a dead lion refers to your fall from power or status.<\/p><p>To dream that you are attacked by a lion suggests that a force may be driving you to self-destruction. You need to overcome these challenges and obstacles.<\/p><p>To see a black lion in your dream represents a negative force. You or someone else is using their position of power to do harm.<\/p><p>To see a white lion in your dream highlights your majestic power. A white lion may also indicate sudden awareness of the power you hold.<\/p>"
    },
    {
        "title": "Lion Tamer",
        "desc": "<p>To see or dream that you are a lion tamer suggests that you are able to keep your aggression and strength in check.<\/p>"
    },
    {
        "title": "Lioness",
        "desc": "<p>To see a lioness in your dream represents your maternal instincts. You will go to great lengths to protect your loved ones and your interests. Dreaming of an attacking lioness suggests that your personal space is being invaded; someone or something is threatening your family circle. Alternatively, a lioness symbolizes hope, victory, tenacity and stamina.<\/p>"
    },
    {
        "title": "Lip Balm",
        "desc": "<p>To dream that you are applying lip balm suggests that there is some misunderstanding in what you are trying to say. Your words are not coming out right. Alternatively, using lip balm implies that things are not going well in your personal life.<\/p>"
    },
    {
        "title": "Lip Gloss",
        "desc": "<p>To see or wear lip gloss in your dream indicates a lack of power in your words. You are being more suggestive instead of being more direct or bold.<\/p>"
    },
    {
        "title": "Lip Piercing",
        "desc": "<p>To dream of getting your lip pierced refers to regret over some stinging remarks or hurtful words that you said. If you dream that your lip ring keeps falling out, then it means that you are trying to take back what you have said.<\/p>"
    },
    {
        "title": "Lip Synching",
        "desc": "<p>To dream that you are lip synching indicates that someone else is speaking on your behalf. You need to learn to speak up for yourself and assert your opinions. Alternatively, the dream suggests that you lack your own identity. You are trying to live up to the expectations of others.<\/p>"
    },
    {
        "title": "Liposuction",
        "desc": "<p>To dream that you have liposuction represents your preoccupation with your physical shape and appearance. Alternatively, it suggests that you are taking drastic measures to rid yourself of all the responsibilities and things that are weighingyou down. The dream may also refer to your anxiety about an actual liposuction that you are having."
    },
    {
        "title": "Lips",
        "desc": "<p>To see lips in your dream signify sensuality, sex, love, and romance, especially if they were pursed. Lips are a means of communication as reflected in the familiar phrase &quot;read my lips&quot;.<\/p><p>To dream that you or someone has blue lips indicate illness or possible problems with your blood circulation.<\/p><p>To dream that you or someone has black lips suggest that you are refusing to say anything about a particular situation. You are remaining completely silent.<\/p>"
    },
    {
        "title": "Lipstick",
        "desc": "<p>To buy, see, or wear lipstick in your dream suggests that you are not entirely truthful about something. The dream seeks to draw attention to your lips. Perhaps you need to be careful about what you or someone else is saying. Alternatively, it signifies sexuality and sensuality, especially if the color is red.<\/p>"
    },
    {
        "title": "Liquid",
        "desc": "<p>To see a liquid in your dream represents some emotion that you need to confront and deal with. Consider the color of the liquid to pinpoint what emotion your dream may be highlighting.<\/p>"
    },
    {
        "title": "Liquor",
        "desc": "<p>*Please See: <a href=\"#Alcohol\">Alcohol<\/a>."
    },
    {
        "title": "Liquor Store",
        "desc": "<p>Tosee or dream that you are in a liquor store suggests that you are lacking spirit and enthusiasm in some area of your life. You need to be more positive in your thinking.<\/p>"
    },
    {
        "title": "List",
        "desc": "<p>To dream that you are making a list suggests that you are worried about a problem or situation in your waking life.<\/p>"
    },
    {
        "title": "Listen",
        "desc": "<p>To dream that you are listening to something indicates that you need to pay closer attention to what you are being told and what you are seeing. Perhaps your dream is telling you to be more receptive towards the guidance or criticism of others.<\/p><p>To dream that no one is listening to you implies that you are in denial about something.<\/p>"
    },
    {
        "title": "Litter",
        "desc": "<p>To see or dream that you litter symbolizes ideas and issues that you have discarded and have no more use for. The litter may also represent a situation or a person who may not be worth your time. Alternatively, the dream suggests that you need to prioritize and organize your ideas and aspects of your life. Your ideas may be lost in the clutter.<\/p><p>To see a litter of newborn animals in your dream is indicative of the amount of time that an idea has been developing or will take to develop. Look at the number in the litter to give you that approximate amount of time. Alternatively, the dream refers to issues of codependency.<\/p>"
    },
    {
        "title": "Litter Box",
        "desc": "<p>To see or clean a litter box in your dream represents your shameful thoughts.<\/p>"
    },
    {
        "title": "Little",
        "desc": "<p>*Please See: <a href=\"#Small\">Small<\/a>.<\/p>"
    },
    {
        "title": "Little Person",
        "desc": "<p>To see a little person in your dream suggests that you are feeling small or overlooked. You feel that others do not think you can do things for yourself.<\/p>"
    },
    {
        "title": "Liver",
        "desc": "<p>To see yours or someone else's liver in your dream suggests the possibility of a physical disorder. The dream forewarns that you need to reduce your alcohol consumption. You need to reevaluate your physical health and perhaps even go get a doctor's physical. Alternatively, it indicates that someone in your life does not have your best interest at heart. You are being belittled.<\/p>"
    },
    {
        "title": "Living Room",
        "desc": "<p>To dream that you are in the living room represents the image that you portray to others and the way which you go about your life. It is representative of your basic beliefs about yourself and who you are. Alternatively, the living room is indicative of your freedom and space. The living room is a symbolic boundary between your personal self and your public self. Objects that do not belong in the living room denote the various aspects of your life that are invading your personal space.<\/p>"
    },
    {
        "title": "Lizard",
        "desc": "<p>To see a lizard in your dream signifies your primal instincts and reactions toward sex, food, etc. and your anxieties toward these feelings. The lizard may also be representative of a person who you view as cold-blooded, fearful, or thick-skinned. On a more positive note, the lizard also symbolizes emerging creativity, renewal, and revitalization. It may suggest that you are well-grounded.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=lizarddream1\">I'm A Lizard<\/a>&quot;<\/p>"
    },
    {
        "title": "Llama",
        "desc": "<p>To see a llama in your dream represents deep trust, strength and endurance. It may also mean that you are worrying too much and carrying too many problems.<\/p>"
    },
    {
        "title": "Load",
        "desc": "<p>To see or carry a load in your dream symbolizes the huge responsibilities that you are carrying. You may be taking on too much responsibilities or are feeling overburdened. Alternatively, the dream may be a metaphor to signify someone or something is loaded.<\/p>"
    },
    {
        "title": "Loaf",
        "desc": "<p>*Please See: <a href=\"#Bread\">Bread<\/a>.<\/p>"
    },
    {
        "title": "Loan",
        "desc": "<p>To dream that you need a loan signifies your worries over money matters. Alternatively, the dream is telling you that it is okay to ask for help and lean on the support from friends and family. You may be too self-reliant and that you can do it all.<\/p>"
    },
    {
        "title": "Lobby",
        "desc": "<p>To dream that you are in a lobby indicates that you are trying to make something known.<\/p>"
    },
    {
        "title": "Lobotomy",
        "desc": "<p>To see or dream that you have a lobotomy indicates that you are either trying to get to your subconscious and access its insights or you are trying to suppress it and erase it from your consciousness. Alternatively, the dream means that you are under tremendous mental stress.<\/p>"
    },
    {
        "title": "Lobster",
        "desc": "<p>To see a lobster in your dream represents strength and persistence. You will hold your own ground and overcome minor difficulties and problems.<\/p><p>To dream that you are eating lobster indicates that you will regain your confidence.<\/p>"
    },
    {
        "title": "Loch Ness Monster",
        "desc": "<p>To see a Loch Ness Monster in your dream symbolizes disappointments or misunderstanding in some situation or relationship. You may have unrealistic goals and setting yourself up for failure.<\/p>"
    },
    {
        "title": "Lock",
        "desc": "<p>To see a lock in your dream signifies your inability to get what you want. You are being kept out of some activity or situation. Perhaps an aspect of yourself is locked up inside and it needs to be expressed.<\/p><p>To dream that a lock is accidentally shut around your wrist suggests that you are debating on whether to be more open about your feelings or keep them to yourself. You feel that you are taking a major risk in letting your feelings known.<\/p><p>Dreaming about changing locks mean that you are taking matters into your own hand. It also indicates that you are shutting out someone who you were previously close to.<\/p><p>To dream that a lock is broken is a metaphor that you are feeling insecure, either emotionally or physically.<\/p><p>To see a puzzle lock in your dream implies that you need to carefully think about how to proceed with a situation, before acting. You need to have patience and calmness or else you will risk isolating yourself.<\/p>"
    },
    {
        "title": "Lockdown",
        "desc": "<p>To dream that you are on lockdown at a school, office or public space represents a situation where you feel you have no control of or that you are physically helpless. This may point to a controlling relationship. Also consider the significance of where the lockdown is located. Specifically if you dream that a school is on lockdown, then it suggests that you are experiencing some pressure at school. More directly, it may be related to news of schools being on lockdown and the fear that it could happen at your school or office.<\/p>"
    },
    {
        "title": "Lockjaw",
        "desc": "<p>To dream that you have lockjaw may reflect the current state of your body while you are dreaming. During the REM state of sleep, your body is immobile and essentially paralyzed. Not being able to move your jaw is similar to those who report not being able to hit or run, despite how hard they try. Symbolically, dreaming of having lockjaw may also mean that you feel unable to express yourself. You feel that your opinion doesn't matter or that no one takes what you say seriously.<\/p>"
    },
    {
        "title": "Locked",
        "desc": "<p>To dream that you are locked out suggests that you are feeling alienated or unaccepted. You have difficulties getting in touch with your feelings. Consider what and where you are being locked out of.<\/p>"
    },
    {
        "title": "Locker",
        "desc": "<p>To see or use a locker in your dream signifies aspects of yourself which you have kept hidden inside. Consider what items and belongings are in the locker. In particular, to dream of a school locker denotes hidden feelings, knowledge, and attitudes that you need to learn and\/or acknowledge. To dream of a PE locker refers to physical abilities that you have yet to recognize. You are experiencing some physical limitations.<\/p><p>To dream that you cannot open a locker or that your forgot the combination suggests that you are unsure of where you stand in a particular situation. You feel you have lost some aspect of yourself. In other words, you are on shaky ground. If you cannot find your locker, then it symbolizes your insecurities about your role or position in a situation.<\/p><p>To dream that someone else is using your locker suggests that someone can see right through you and your facade. You feel that this person has access to your hidden Self.<\/p>"
    },
    {
        "title": "Locker Room",
        "desc": "<p>To dream that you are in a locker room suggests that you need time to cool off and calm down. You are involved in some tough competition or are trying to overcome. Perhaps you are trying to pursue a love interest.<\/p>"
    },
    {
        "title": "Locket",
        "desc": "<p>To see or wear a locket in your dream signifies a long lasting relationship. The dream may also be a pun on &quot;lock it&quot;. Perhaps there is something that you need to keep safe. Consider the shape of the locket and what is inside it.<\/p>"
    },
    {
        "title": "Locksmith",
        "desc": "<p>To see or dream that you are a locksmith suggests that you will play an integral role in an important upcoming project. Alternatively, the dream means that you have the power and knowledge to unlock the contents of your subconscious. You need to confront your repressed thoughts and emotions.<\/p>"
    },
    {
        "title": "Locomotive",
        "desc": "<p>To see a locomotive in your dream refers to your drive to move forward and succeed in life. Alternatively, a locomotive represents the burden that you are carrying along with you throughout your life. The dream may also be a pun for &quot;crazy motive&quot;.<\/p><p>*Please See Also: <a href=\"#Train\">Train<\/a>.<\/p>"
    },
    {
        "title": "Locusts",
        "desc": "<p>To see locusts in your dream signify greed or lack of psychological nourishment. You feel your creativity is being destroyed. Alternatively, locusts represent cycles and transformation. The dream may also mean that you are indecisive about something.<\/p>"
    },
    {
        "title": "Lodestone",
        "desc": "<p>To see a lodestone in your dream signifies your alluring and magnetic personality. Others are drawn to you.<\/p>"
    },
    {
        "title": "Lodge",
        "desc": "<p>To dream that you are at a recreational lodge indicates that you feel stuck with where you are at in life. You are not sure what you want to do and where you want to go. Alternatively being in a lodge means that you need to take time for yourself and away from the stresses of your daily life.<\/p>"
    },
    {
        "title": "Logger",
        "desc": "<p>*Please See: <a href=\"#Lumberjack\">Lumberjack<\/a>.<\/p>"
    },
    {
        "title": "Log",
        "desc": "<p>To see a log in your dream represents a significant and meaningful aspect of yourself. It may reflect some subconscious idea. Alternatively, a log signifies a transformation. You are headed toward a new direction in your life. The dream may also be metaphor that you are being a &quot;log&quot; or lazy. You need to get up and take action.<\/p><p>To dream that you are sitting on a log indicates personal satisfaction and joy in you life.<\/p><p>To see a log floating in water represents new opportunities. You may be overlooking something important.<\/p>"
    },
    {
        "title": "Loincloth",
        "desc": "<p>To wear a loincloth in your dream represents raw male sexuality.<\/p>"
    },
    {
        "title": "Lollipop",
        "desc": "<p>To see or lick a lollipop in your dream indicates surprises, new experiences and adventures. It also represents indulgence, sensuality and the pleasant aspects of your life. Alternatively, the lollipop may be a pun for &quot;sucker&quot; and thus suggests that you need to proceed with caution in some relationship or situation. Someone may be taking advantage of you.<\/p>"
    },
    {
        "title": "London",
        "desc": "<p>To dream of the city of London signifies nobility. You have an elevated sense of self.<\/p>"
    },
    {
        "title": "Loneliness",
        "desc": "<p>*Please see: <a href=\"#Alone\">Alone<\/a>.<\/p>"
    },
    {
        "title": "Long",
        "desc": "<p>To dream of anything long refers to the penis and\/or issues of power and prowess. The dream is about how your compare yourself to others or how others perceive you. Metaphorically, it may indicate that a situation or relationship has gone on too long.<\/p>"
    },
    {
        "title": "Looking Glass",
        "desc": "<p>*Please See: <a href=\"#Mirror\">Mirror<\/a>.<\/p>"
    },
    {
        "title": "Loom",
        "desc": "<p>To see or use a loom in your dream represents how you are expressing your individuality and creativity. This dream symbol may be a metaphor for weaving your destiny. You have control of your own fate and destiny.<\/p>"
    },
    {
        "title": "Loon",
        "desc": "<p>To see a loon in your dream suggests that you have the ability to dig deep and bring up subconscious wisdom. You need to get to the bottom of some situation and look within yourself for the answers. It is time for self-exploration, self-reflection and introspection. The dream may also be a metaphor for someone who is &quot;loony&quot; or crazy.<\/p>"
    },
    {
        "title": "Loop de Loop",
        "desc": "<p>To dream that you or something is moving in a loop de loop signifies the ups and downs of your life. You are not sure of the direction you are headed. Alternatively, dreaming of loop de loops implies that you are being mislead or tricked.<\/p>"
    },
    {
        "title": "Loot",
        "desc": "<p>To dream that you are looting implies that some of your basic needs are not being met. Alternatively, the dream means that you have a false sense of control and\/or power.<\/p><p>To see others looting in your dream forewarns of someone in your life who is opportunistic. Perhaps you are being taken advantage of.<\/p>"
    },
    {
        "title": "Lorry",
        "desc": "<p>*Please See: <a href=\"#Truck\">Truck<\/a>.<\/p>"
    },
    {
        "title": "Los Angeles",
        "desc": "<p>To dream of Los Angeles signifies opportunities. You need to learn to create your own success. Known as the city of angels, your dream may relate to your spiritual quest.<\/p>"
    },
    {
        "title": "Lose",
        "desc": "<p>To dream that you lose something indicates that you may really have misplaced something that you had not realized yet. It may also be a signal for you to clean out and reorganize your life. Perhaps you are overwhelmed and distracted with the hustle and bustle of day-to-day life. Alternatively, losing something often coincides with a significant life change or waking issue.<\/p><p>On a symbolic note losing things in your dream suggests lost opportunities, past relationships or forgotten aspects of yourself. Your personal associations to the thing you lose will clue you into the emotional meaning and interpretation of your dream.<\/p>"
    },
    {
        "title": "Lost",
        "desc": "<p>To dream that you are lost suggests that you have lost your direction in life or that you have lost sight of your goals. You may be feeling worried and insecure about the path you are taking in life. If you try to call for help, then it means that you are trying to reach out for support. You are looking for someone to lean on. Alternatively, being lost means that you are still adjusting to a new situation in which the rules and conditions are ever changing.<\/p><p>To dream that someone else is lost represents some unresolved issues or feelings pertaining to the person that is lost. Consider what aspect of that person you may have lost within your own self. Perhaps you need to recapture and re-acknowledge those aspects.<\/p>"
    },
    {
        "title": "Lotion",
        "desc": "<p>*Please See: <a href=\"#Cream\">Cream<\/a>.<\/p>"
    },
    {
        "title": "Lottery",
        "desc": "<p>To dream of playing the lottery suggests that you are relying too much on fate instead of taking responsibility for your own actions or decisions. You need to reconsider some issue or situation before committing to it.<\/p><p>To dream that you win the lottery represents your inner desires to live without having to worry about financial and material troubles. Alternatively, the dream may be a metaphor that your number has come up and thus imply trouble coming your way.<\/p>"
    },
    {
        "title": "Lottery Ticket",
        "desc": "<p>To see a lottery ticket in your dream indicates that you need to leave some aspect of your life to fate. Learn to let go and let fate take its course. If someone gives you a lottery ticket, then it means that fate is literally in your hands now.<\/p>"
    },
    {
        "title": "Lotus",
        "desc": "<p>To see a lotus in your dream represents enlightenment, growth, purity, beauty and expansion of the soul. The image of the lotus serves as encouragement and provides hope in dark and murky times.<\/p>"
    },
    {
        "title": "Loud",
        "desc": "<p>To hear something or someone loud in your dream indicates that there is something in your waking life that is in need of your attention. Alternatively, the loudness in your dream may be a way for you to divert attention from something else. You are hiding from something.<\/p>"
    },
    {
        "title": "Louisiana",
        "desc": "<p>If you have never been to Louisiana and have a dream that you are in Louisiana, then it points to your tendency to keep your feelings to yourself. Perhaps you are being cautious or mysterious. Alternatively, dreaming about Louisiana means that you need to add some pizzazz or spice to your life.<\/p>"
    },
    {
        "title": "Lounge",
        "desc": "<p>To dream that you are in a lounge suggests that you need to stop and take a break from some problem or issue in your waking life. You need to step back from the problem to cool off or to gain some perspective. Alternatively, the dream means that you are being lazy.<\/p>"
    },
    {
        "title": "Louse",
        "desc": "<p>*Please See: <a href=\"#Lice\">Lice<\/a>.<\/p>"
    },
    {
        "title": "Love",
        "desc": "<p>To dream of love or being in love suggests intense feelings carried over from a waking relationship. It refers to your contentment with what you already have and where you are in life. On the other hand, the dream may be compensatory and implies that you may not be getting enough love in your life. We naturally long for the sense to belong and to be accepted.<\/p><p>Dreaming of saying the words &quot;I love you&quot; implies that you are ready for love and want to give love. To hear someone say &quot;I love you&quot; signifies that you are ready to accept love into your life. If you say &quot;I love you&quot; to someone and he or she doesn't say it back, then it represents uncertainty in your relationship. Perhaps you feel that you are giving more than you are getting back.<\/p><p>To see a couple in love or expressing love to each other indicates success ahead for you.<\/p><p>To dream that your friend is in love with you may be one of wish fulfillment. Perhaps you have developed feelings for your friend and are wondering how he or she feels. Your preoccupation has found its way into your dreaming mind. On the other hand, the dream may suggests that you have accepted certain qualities of your friend and incorporated it into your own character.<\/p><p>To dream that you are making love in public or in different places relates to some overt sexual issue or need. Your dream may be telling you that you need to express yourself more openly. Alternatively, it represents your perceptions about your own sexuality in the context of social norms. You may be questioning your feelings about sex, marriage, love, and gender roles.<\/p><p>To dream of your lost love represents an idealistic relationship. You are looking for romance, excitement, and freshness that is lacking in your present relationship.<\/p><p>To dream that you are being told that you were never loved refers to your own personal feelings of being unworthy. Such feelings stem from feelings of guilt and\/or low self-esteem.<\/p><p>If you dream of forbidden love, then it implies that you feel you are being prevented from doing something that you really want. Perhaps you have to choose sides.<\/p>"
    },
    {
        "title": "Love Note",
        "desc": "<p>To receive a love note in your dream symbolizes a budding new love that is blossoming in your life. Alternatively, the dream may mean that you are seeking some reassurance or reinforcement about a new relationship. You are feeling insecure.<\/p>"
    },
    {
        "title": "Love Spell",
        "desc": "<p>To dream that you are under a love spell parallels waking feelings of love. The feeling is so strong and fresh that it has found its way into your dream. Be careful not to let your heart guide you. Perhaps, the dream forewarns that you need to exercise some control and objectiveness.<\/p>"
    },
    {
        "title": "Love Triangle",
        "desc": "<p>To dream that you are part of a love triangle where you are in love with the same person indicates that you are experiencing some form of insecurity and jealousy in your waking relationship. You feel that your attention or time is being divided. If you dream that you are in love with two different persons, then it means that you are not completely committed to your current relationship. Alternatively, the persons involved in the love triangle may all be aspects of your own self. You are experiencing some strong emotional conflict.<\/p><p>Lovebird<\/p><p>To see a lovebird in your dream indicates that you are longing or missing for your partner. If you see two lovebirds, then it symbolizes the importance of partnership. You need to remember to focus on each other.<\/p>"
    },
    {
        "title": "Lover",
        "desc": "<p>To see a lover in your dream symbolizes acceptance, self-worth, and acknowledgement of your true inner value. You are integrating aspects of the feminine and the masculine. As a result, you are feeling complete and whole. Alternatively, your dream lover may also be someone who is your ideal. The dream could be compensatory for an unsatisfactory or unfulfilling relationship in your real life.<\/p><p>To dream of an old or former lover signifies unfinished\/unresolved issues related to that specific relationship. Perhaps, your current relationship is awakening some of those same issues.<\/p>"
    },
    {
        "title": "Loveseat",
        "desc": "<p>To see or sit on a loveseat in your dream indicates your need for love and intimacy, especially if you are sitting alone. If someone else is sitting on the loveseat with you, then it suggests that you need to be more open about your feelings.<\/p><p>*Please see also: <a href=\"#Couch\">Couch<\/a>.<\/p>"
    },
    {
        "title": "Low",
        "desc": "<p>To dream that something or someone is low signifies something that is beneath you. Perhaps, you are feeling superior and are above some situation. Alternatively, the dream signifies something that you may have overlooked.<\/p>"
    },
    {
        "title": "Loyalty",
        "desc": "<p>To dream that someone is loyal to you indicates that you are looking for emotional support. You are feeling alone and want to know that someone is behind you in whatever you do.<\/p><p>If you dream about seeing the word &quot;loyal&quot;, then it is highlighting the importance of loyalty in your waking relationship. Perhaps you are questioning your own loyalty or the loyalty of others.<\/p>"
    },
    {
        "title": "Lozenges",
        "desc": "<p>*Please See: <a href=\"#Cough%20Drops\">Cough Drops<\/a>.<\/p>"
    },
    {
        "title": "LSD",
        "desc": "<p>To dream that you take LSD represents an awakening and expanded consciousness. You are looking at things from a new perspective.<\/p>"
    },
    {
        "title": "Luau",
        "desc": "<p>To dream that you are at a luau represents your emotional needs and sexual desires. It also signifies your need to relax and enjoy life. You are working too hard!<\/p>"
    },
    {
        "title": "Lubricant",
        "desc": "<p>To see or use lubricant in your dream implies that you want things to run more smoothly in some area of your life. Perhaps you need some motivation to get things moving.<\/p>"
    },
    {
        "title": "Lucite",
        "desc": "<p>To see Lucite in your dream indicates support. You may be undervaluing your support system and overlooking those who have helped you along the way. Alternatively, Lucite points to your unyielding attitude. The dream may also be a pun on &quot;new sight&quot;. Perhaps you are taking on a new perspective and a different view of things. It symbolizes clarity of mind.<\/p>"
    },
    {
        "title": "Luck",
        "desc": "<p>To dream of good luck suggests that things will look up for you.<\/p><p>To dream that you have bad luck indicates that you are feeling sorry for yourself. You are quick to blame something or someone else for your own shortcomings and problems.<\/p>"
    },
    {
        "title": "Lucky Charm",
        "desc": "<p>To dream of a lucky charm indicates that you are trying to connect with your spiritual energy. The dream may be telling you that you are putting too much faith on outside sources. You need to look within.<\/p>"
    },
    {
        "title": "Luggage",
        "desc": "<p>To see or carry luggage in your dream symbolizes the many desires, worries, responsibilities or needs that you are carrying with you and weighing you down. The size or weight of the luggage parallels the demands you are facing. You need to reduce your desires and problems in order to alleviate the pressure you are putting on yourself. Perhaps you feel that you are being held back by past emotions or issues. Alternatively, luggage symbolizes your identity and sense of security.<\/p><p>To dream that you lose your luggage represents a lost in your identity. Consider how you feel when you discovered that your luggage is lost. If it is a positive reaction, then it signifies an opportunity for you to start fresh. If your reaction is negative, then it suggest that you are feeling lost.<\/p>"
    },
    {
        "title": "Lullaby",
        "desc": "<p>To sing a lullaby in your dream signifies your ability to calm others. You bring peace and harmony to a situation.<\/p><p>To hear a lullaby in your dream represents your search for tranquility and peace.<\/p>"
    },
    {
        "title": "Lumber",
        "desc": "<p>To see lumber in your dream indicates your need for a fresh start. You need to start over and reorganize your life. It is time to rebuild. Alternatively, lumber stands for strength, creativity, and flexibility.<\/p>"
    },
    {
        "title": "Lumberjack",
        "desc": "<p>To see or dream that you are a lumberjack symbolizes strength and fortitude. You need to exhibit more of these qualities in some aspect of your life. Alternatively, the dream means that you need to attack your problems one segment at a time.<\/p>"
    },
    {
        "title": "Lump",
        "desc": "<p>To dream that you have a lump on your body means that you need to slow down and listen to your instincts or to your body. Consider the location of the lump. If the lump is in your throat, then it implies that you need to think before you speak. If you dream that the lump is in your breast, then it suggests that you are busy tending to the needs of others and ignoring your own needs.<\/p>"
    },
    {
        "title": "Lunatic",
        "desc": "<p>To see a lunatic in your dream represents an unacknowledged aspect of yourself. You may feel that your opinions and suggestions don't matter or are being ignored. You feel like an outsider. Alternatively, you may feel that you have lost a person, situation, or relationship which you frequently depended on.<\/p>"
    },
    {
        "title": "Lunch",
        "desc": "<p>To see or eat lunch in your dream indicates that you are lacking spiritual enrichment and enlightenment in some area of your life.<\/p>"
    },
    {
        "title": "Lunch Box",
        "desc": "<p>To see or carry a lunch box in your dream represents stored energy. You are preparing for some important event. Alternatively, the dream refers to your day to day support system. Consider the significance of the contents in the lunch box. If the lunch box is empty, then it means that you are lacking spiritual enrichment and enlightenment in some area of your life.<\/p>"
    },
    {
        "title": "Lungs",
        "desc": "<p>To see lungs in your dream symbolize insight, creativity, and inspiration. Alternatively, lungs may indicate a stressful situation and refer to a relationship\/situation in which you feel suffocated. You need to take a deep breath and face up to the challenge.<\/p>"
    },
    {
        "title": "Lust",
        "desc": "<p>To dream of lust or that you are lusting after someone suggests that you are feeling unfulfilled in some aspect of your life. Alternatively, lust means that you need to exercise some self-control.<\/p><p>To dream that someone is lusting after you means that you think highly of yourself. You have an elevated sense of self-worth and self-esteem.<\/p>"
    },
    {
        "title": "Lute",
        "desc": "<p>To see or play the lute in your dream symbolizes pureness and faith.<\/p>"
    },
    {
        "title": "Luxury",
        "desc": "<p>To dream that you are living in luxury represents your lavish lifestyle. The dream may be telling you that you are living beyond your means. You need to be more thrifty with your spending.<\/p>"
    },
    {
        "title": "Lying",
        "desc": "<p>*Please see: <a href=\"#Liar\">Liar<\/a>.<\/p>"
    },
    {
        "title": "Lynching",
        "desc": "<p>To see a lynching in your dream represents feelings of self-guilt.<\/p>"
    },
    {
        "title": "Lynx",
        "desc": "<p>To see a lynx in your dream symbolizes secrecy. You need to expose and examine those secrets and learn from them. There is more to be known and more to be learned about a situation, relationship, or problem.<\/p>"
    },
    {
        "title": "Lyre",
        "desc": "<p>To see a lyre in your dream represents joy, calmness and harmony. The symbol may also be a pun on &quot;liar&quot;.<\/p>"
    }
]