[
    {
        "title": "M",
        "desc": "<p>To see the letter &quot;M&quot; in your dream suggests that there is something that you are keeping silent about. Perhaps you have been sworn to secrecy. Alternatively, the dream may imply &quot;Mmmmm&quot;. Your subconscious mind is hungering for knowledge or information. As a Roman Numeral, it could represent the number 1000.<\/p>"
    },
    {
        "title": "M&amp;M's",
        "desc": "<p>To see or eat M&amp;M's in your dream symbolizes life's small, but sweet rewards. More directly, M&amp;M may represent the initials of two people in your waking life.<\/p><p>To dream that you are a giant talking M&amp;M suggests that you feel you are being mislead or taking advantaged of. Perhaps you feel that you are being someone you are not in order to please others.<\/p>"
    },
    {
        "title": "Macadamize",
        "desc": "<p>To see, walk or travel on a macadamized road in your dream suggests that you are standing on solid ground. You have laid out a solid groundwork for much success in your life."
    },
    {
        "title": "Macaroni",
        "desc": "<p>To dream that you are eating macaroni symbolizes comfort and ease. The dream may betrying to bring you back to a time where things were much simpler.<\/p>"
    },
    {
        "title": "Macaroon",
        "desc": "<p>To see or eat a macaroon in your dream represents a well-rounded experience. You are successfully balancing different aspects of your life.<\/p>"
    },
    {
        "title": "Macaw",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p.htm#Parrot\">Parrot.<\/p>"
    },
    {
        "title": "Mace",
        "desc": "<p>To see or use mace in your dream represents your quest for objectivity over subjectivity. You do not let your emotions rule your actions.<\/p>"
    },
    {
        "title": "Machete",
        "desc": "<p>To see or use a machete in your dreamrepresents extreme hostility toward some situation or someone. It is symbolic of destruction and frustrations in your life. You are not expressing your anger in a productive way. In particular, if the machete is being used to clear through brush, then it refers to your ability to tackle problems successfully. Alternatively, the machete can be seen as a phallic symbol and thus represent masculine power.<\/p>"
    },
    {
        "title": "Machine Gun",
        "desc": "<p>To see or shoot a machine gun in you dream suggests that your anger or aggression is out of control. You need to keep your temper in check.<\/p><p>To dream that someone is shooting you with a machine gun implies that a great deal of anger is being directed towards you.<\/p>"
    },
    {
        "title": "Machinery",
        "desc": "<p>To see machinery in your dream suggests that you are too mechanical - going about your way without much thought and making decisions without thinking it through. You need to get out of your boring pattern. Alternatively, the machinery symbolizes your mind or your body. Examine how the machinery is running and its condition and function. If the machinery is in need of repair, then it suggests that you may need to repair aspects of your self-image or a relationship. If the machine is rusty, then it signifies an outdated way of doing something.<\/p>"
    },
    {
        "title": "Mackerel",
        "desc": "<p>To see or eat mackerel in your dream signifies your quickness in confronting some suppressed emotions. If you do not address these emotional issues, you will feel confined and even suffocated.<\/p>"
    },
    {
        "title": "Mad Dog",
        "desc": "<p>To see a mad dog in your dream suggests that you are being verbally attacked by those you thought were your friends.<\/p><p>To dream that you kill a mad dog indicates that you will overcome the adverse opinions of others.<\/p>"
    },
    {
        "title": "Madness",
        "desc": "<p>To dream that you are diagnosed with madness or that you are mad forewarns of trouble, loss, and overwhelming grief. You are behaving in an inappropriate way in some area of your waking life. Alternatively, the dream suggests that you are feeling restricted. Or that you are unable to express yourself.<\/p><p>To see others suffering from madness signifies gloominess, despair and hopelessness.<\/p>"
    },
    {
        "title": "Madonna",
        "desc": "<p>To see the Madonna in your dream symbolizes the mystical mother and the giver of life. She represents blessings, purity and virginal love. Alternatively, this image signifies feminine power and change.<\/p><p>If you dream of the pop star Madonna, then it points to your ever changing personalities. The dream also indicates confidence, sexiness, beauty, talent and freedom of expression. She may appear in your dream to deliver some message or provide advice. Look to her songs for clues. Is the dream saying &quot;papa don't preach&quot;? Or are you &quot;like a virgin&quot;? She may even be telling you to &quot;cherish the love you have&quot;. Known as the &quot;material girl&quot;, the dream could also suggests that you are being too materialistic and superficial.<\/p>"
    },
    {
        "title": "Mafia",
        "desc": "<p>To dream that you are a member of a mafia suggests that you are allowing others to manipulate you. Or you are using your power against others.<\/p><p>To dream that you come in contact with the mafia indicates that you are experiencing some inner conflict and turmoil.<\/p>"
    },
    {
        "title": "Magazine",
        "desc": "<p>To read a magazine in your dream indicates that you are opened to various new ideas. Consider also the theme and name of the magazine and additional symbolism.<\/p><p>Dreaming about a gun magazine represents your stamina and\/or fight power. If the magazine malfunctions, then it indicates exhaustion or powerlessness.<\/p>"
    },
    {
        "title": "Maggot",
        "desc": "<p>To see maggots in your dream represent your anxieties about death. It may also be indicative of some issue or problem that you have been rejecting and it is now &quot;eating away&quot; at you. You need to confront it for it is destroying your sense of harmony and balance.<\/p><p>In particular, to dream that you are stepping on maggots indicate guilt and impurity. You are trying to repress your immoral thoughts or behavior. On a positive note, this dream symbolizes your resilience, persistence and your ability to bounce back from adversity.<\/p><p>To see black maggots in your dream mean that you are in denial about a problem. You are refusing to see the truth. If the maggots are coming out of your mouth, then it implies that you are not owning up to something you have said.<\/p>"
    },
    {
        "title": "Magic",
        "desc": "<p>To perform or dream of magic suggests that you need to look at things from a different view or approach your problems from a new angle in order to successfully move forward. Alternatively, magic symbolizes creativity and wonder. Perhaps someone or something has caused you to be in awe. The dream may also be a metaphor that you or someone is &quot;up to some trick&quot;.<\/p><p>To dream of black magic implies that you have obtained your wishes and wants through underhanded tricks. It also symbolizes deception, evil and treachery.<\/p>"
    },
    {
        "title": "Magic Carpet",
        "desc": "<p>To dream that you are riding a magic carpet indicates that you are overcoming your obstacles and physical limitations.<\/p>"
    },
    {
        "title": "Magic Mirror",
        "desc": "<p>To dream of a magic mirror suggests that you are putting too much emphasis on outward appearances. Alternatively, the dream may also mean that you are looking for reassurance or reaffirmation from others.<\/p>"
    },
    {
        "title": "Magician",
        "desc": "<p>To see or dream that you are a magician signifies that an issue or a task at hand may be trickier than you had anticipated. You are feeling disillusioned. Alternatively, the dream means that you are trying to fool yourself or someone into believing something that you know is not true.<\/p>"
    },
    {
        "title": "Magistrate",
        "desc": "<p>To see a magistrate in your dream represents an authoritarian figure in your life. You feel the need to be controlled and told what to do. How you are behaving or what you are doing is not in accordance with your belief system. You are experiencing some issues with guilt. Alternatively, the dream means that there is a disconnect between your action and your belief system.<\/p>"
    },
    {
        "title": "Magnet",
        "desc": "<p>To see a magnet in your dream symbolizes negative forces that are drawing you towards a path of dishonor and ruin. Alternatively, the dream signifies personal empowerment. Some force is bonding or uniting your relationships together. The dream may also be a metaphor for your magnetic personality.<\/p>"
    },
    {
        "title": "Magnifying Glass",
        "desc": "<p>To see or use a magnifying glass in your dream indicates that something in your life needs to be examined and looked at more closely.<\/p>"
    },
    {
        "title": "Magnolia",
        "desc": "<p>To see magnolias in your dream symbolize beauty, grace and elegance.<\/p>"
    },
    {
        "title": "Magnolia Tree",
        "desc": "<p>To see a magnolia tree in your dream indicates your need for attention and to be noticed.Perhaps you are overly confident in your abilities. Alternatively, the magnolia tree represents your need to feel protected and safe from life's problems.<\/p>"
    },
    {
        "title": "Magpie",
        "desc": "<p>To see a magpie in your dream signifies dissatisfaction and disagreements. You need to be careful with what you say and do. Alternatively, the dream could mean that you are feeling short-changed in your relationship. You feel insecure or threatened. Consider the number of magpies in the dream and the old proverb &quot;one for sorrow, two for mirth, three for a wedding and four for a birth.&quot;<\/p><p>To see a dead magpie in your dream signifies some malicious rumors.<\/p>"
    },
    {
        "title": "Mahjong",
        "desc": "<p>To see or play mahjong in your dream refers to a situation in your waking life that requires strategy, patience and composure. Consider the significance of the mahjong tile and look up the corresponding meaning, whether it be one of the wind directions or a number.<\/p>"
    },
    {
        "title": "Mahogany",
        "desc": "<p>To dream of mahogany wood refers to your stubbornness.<\/p>"
    },
    {
        "title": "Maid",
        "desc": "<p>To see or have a maid in your dream suggests that you are depending too much on others for their help. You need to be more independent and look after your own self.<\/p><p>To dream that you are a maid indicates that you need to clear up the clutter in your life. Metaphorically, the dream suggests that you need to nurture yourself and cleanse your emotions.<\/p>"
    },
    {
        "title": "Mail",
        "desc": "<p>To dream that receive mail indicates that you need to communicate or re-establish contact with someone from your present or past. It may also represent messages from your subconscious or intuition. The mail may also be a pun on a &quot;male&quot; in your life.<\/p><p>To dream that mail is lost suggests that you are feeling isolated of left out in some waking situation.<\/p><p>If you receive mail from someone you don't know, then it symbolizes a message from your subconscious.<\/p>"
    },
    {
        "title": "Mailbox",
        "desc": "<p>To see a mailbox in your dream represents important information that you are about to receive. Pay particular attention to your dream and what message it is trying to convey to you from your subconscious. If the mailbox is full, then it indicates that you have not digested or accepted these messages.<\/p>"
    },
    {
        "title": "Mailman",
        "desc": "<p>To see a mailman in your dream symbolizes your communications with others. You need to get the word out about something. If the mailman does not have any mail for you, then it signifies disappointments in some aspect of your life.<\/p><p>If you are not a mailman in real life, but dream that you are one, then it suggests that a message is being channeled to you from your subconscious. Pay close attention to the message of this dream. Alternatively, it may mean that you have been entrusted with a special message or secret.<\/p>"
    },
    {
        "title": "Maintenance",
        "desc": "<p>To dream that something is in need of maintenance or that it is under maintenance indicates that you need to take better care of some aspect of yourself or some aspect of your relationship. In particular, if you dream about car maintenance, then it suggest that you need to stop or you will burn yourself out.<p><\/p>"
    },
    {
        "title": "Majorette",
        "desc": "<p>To see majorettes in your dream signifies unity and cooperation. It also symbolizes the rhythm of life.<\/p><p>Dreaming that you are a majorette indicates that you have a handle on a situation or control on an issue.<\/p>"
    },
    {
        "title": "Makeup",
        "desc": "<p>To dream that you are applying makeup suggests that you are trying to cover up or conceal an aspect of yourself. Alternatively, it indicates that you are putting on your best face forward. You are trying to enhance your self-image and increase your sense of self-confidence.The dream may also be a metaphor that you need to &quot;make up&quot; with someone. It is time to forgive and forget.<\/p><p>To dream that you are wearing too much makeup indicates that you are putting too much emphasis on beauty and outside appearances rather than what is inside.<\/p>"
    },
    {
        "title": "Making Out",
        "desc": "<p>To dream that you are making out with someone suggests that you have an subconscious desire to pursue a relationship, but fear that it will jeopardize the friendship. If you don't like this person in this way, then the dream suggests that you need to acknowledge and incorporate aspects of this person into your own character. Consider specific traits that this person possess.<\/p>"
    },
    {
        "title": "Malachite",
        "desc": "<p>To see or wear malachite in your dream symbolizes tranquility, serenity, and relaxation.<\/p>"
    },
    {
        "title": "Male",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m.htm#Man\">Man.<\/p>"
    },
    {
        "title": "Malice",
        "desc": "<p>To dream that you have malice toward others reflects your waking feelings about a person, situation, or relationship. You are repressing some of these negative feelings.<\/p>"
    },
    {
        "title": "Mall",
        "desc": "<p>To dream that you are at the mall symbolizes the choices, decisions and options you have in your waking life. These choices will help shape who you are as a person. You are trying to establish your identity and sense of self. Alternatively, the dream suggests that you are trying to make a favorable impression on someone. The mall is also symbolic of materialism and the need to keep up with the trends, fads, and\/or the latest technology. Consider the type and name of stores that you see in your dreams.<\/p>"
    },
    {
        "title": "Mallet",
        "desc": "<p>To see a mallet in your dream symbolizes force or willpower. You may need to exert some force and power to get your way and make things happen.<\/p>"
    },
    {
        "title": "Malpractice",
        "desc": "<p>To dream that you are sued for malpractice signifies a need to change your ways and attitude.<\/p>"
    },
    {
        "title": "Malt",
        "desc": "<p>To see malted drinks in your dream represent richness.<\/p>"
    },
    {
        "title": "Mammogram",
        "desc": "<p>To dream that you are getting a mammogramsuggests that you are doubting the power of your femininity. A more direct interpretation of this dream may be that you are nervous about an upcoming mammogram.<\/p>"
    },
    {
        "title": "Mammoth",
        "desc": "<p>To see a mammoth in your dream implies that you need to let go of some past emotions. You are letting your cold hard feelings control your behavior. Perhaps you are being too frigid. Alternatively, a mammoth symbolizes power, size and\/or strength.<\/p>"
    },
    {
        "title": "Man",
        "desc": "<p>To see a man in your dream denotes the aspect of yourself that is assertive, rational, aggressive, and\/or competitive. Perhaps you need to incorporate these aspects into your own character. If the man is known to you, then the dream may reflect you feelings and concerns you have about him.<\/p><p>If you are a woman and dream that you are in the arms of a man, then it suggests that you are accepting and welcoming your stronger assertive personality. It may also highlight your desires to be in a relationship and your image of the ideal man.<\/p><p>To see an old man in your dream represents wisdom or forgiveness. The old man may be a archetypal figure who is offering guidance to some daily problem.<\/p>"
    },
    {
        "title": "Man Of War",
        "desc": "<p>Tosee a man of war ship in your dream suggests that you need shield yourself from some emotional turmoil.<\/p><p>To see a man of war creature in your dream symbolizes a stinging remark or situation. The dream may be brought about by some painful memory from your subconscious.<\/p>"
    },
    {
        "title": "Manager",
        "desc": "<p>To dream that you are a manager indicates that you need to be more organized and efficient. Also consider any real life manager and what qualities you like or dislike about her or him.<\/p>"
    },
    {
        "title": "Manatee",
        "desc": "<p>To see a manatee in your dream represents your passiveness in a situation. You are lacking ambition and drive. Alternatively, it represents someone in your life who is lazy, slow or gentle.<\/p>"
    },
    {
        "title": "Mandala",
        "desc": "<p>To see a mandala in your dream signifies that you will experience some positive changes in your waking life. It also symbolizes wholeness, unity, healing, inner peace, spirituality, and harmony.<\/p>"
    },
    {
        "title": "Mane",
        "desc": "<p>To notice the mane of an animal in your dream refers to some animalistic desire. Also consider the significance of the animal itself. Alternatively, the dream may be a pun on &quot;main&quot;. Perhaps it is directing you to Main Street or that you need to be more mainstream. Or it may signify the state of Maine.<\/p>"
    },
    {
        "title": "Mango",
        "desc": "<p>To see or eat a mango in your dream symbolizes fertility, sexual desires, and lust. Alternatively, the mango may also be a pun to mean &quot;man go&quot; in reference to a relationship in which you should let go and move on.<\/p>"
    },
    {
        "title": "Manhole Cover",
        "desc": "<p>To see a manhole cover in your dream means that your unconscious thoughts are being suppressed. You are preventing certain negative emotions from surfacing.<\/p>"
    },
    {
        "title": "Maniac",
        "desc": "<p>To dream that you are a maniac indicates that you need to control your temper and not let your emotions get the best of you. You need to show more restraint and composure in some situation.<\/p>"
    },
    {
        "title": "Manicure",
        "desc": "<p>To dream that you are getting a manicure represents glamour and beauty. You are seeking attention for the work you have done. You may also be expressing something beautiful and positive through your work.<\/p>"
    },
    {
        "title": "Manna",
        "desc": "<p>Tosee or eat manna in you dream suggests that you need some spiritual nourishment.<\/p>"
    },
    {
        "title": "Mannequin",
        "desc": "<p>To see a mannequin in your dream represents an extension of your own self that you are projecting. You may feel that you are not playing an active enough role in some situation. Consider how the mannequin is dressed for clues as to what you may wish to act out, but have not done so.<\/p>"
    },
    {
        "title": "Manners",
        "desc": "<p>Todream that you have good manners indicates restraint. You need to model this behavior in your waking life.<\/p><p>To dream that you have bad manners symbolizes your lack of respect for someone or some matter in your waking life.<\/p>"
    },
    {
        "title": "Mansion",
        "desc": "<p>Tosee a mansion in your dream symbolizes your greatest potential and growth. You may feel that your current situation or relationship is in a rut.<\/p><p>Dreaming of a mansion in the sky signifies your lofty goals. The dream may also mean that you feel you are above everyone else to the point where you want to isolate yourself.<\/p>"
    },
    {
        "title": "Manslaughter",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m4.htm#Murder\">Murder.<\/p>"
    },
    {
        "title": "Manta Ray",
        "desc": "<p>To see a manta ray in your dream signifies emotional freedom. You are navigating through your emotions with ease.<\/p><p>To dream that you or someone is attacked by a school of manta rays indicates that emotions that have been suppressed into your subconscious are becoming too overwhelming to keep inside any longer.<\/p>"
    },
    {
        "title": "Mantis",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p4.htm#PrayingMantis\">Praying Mantis.<\/p>"
    },
    {
        "title": "Mantilla",
        "desc": "<p>Tosee or wear a mantilla veil in your dream represents an expression of your femininity. Alternatively, the dream suggests that there is something that you are hiding.<\/p>"
    },
    {
        "title": "Mantle",
        "desc": "<p>To see a mantle in your dream symbolizes warmth, family and togetherness. It represents the things and aspects of yourself that you share and display to others. Consider what is on the mantle and its significance.<\/p>"
    },
    {
        "title": "Manure",
        "desc": "<p>Tosee manure in your dream suggests that you are learning from past experiences. You are drawing from those experiences and putting it to use in your current situation. Alternatively, the dream may symbolize fertility.<\/p>"
    },
    {
        "title": "Manuscript",
        "desc": "<p>Todream that you are writing a manuscript represents your hopes, dreams, goals and desires. You may be harboring some fear that you are not able to accomplish your goals.<\/p><p>To dream that your manuscript is rejected by a publisher refers to some temporary setbacks.<\/p>"
    },
    {
        "title": "Map",
        "desc": "<p>Tosee or study a map in your dream suggests that your current life path will lead to fulfillment of your needs and realization of your goals. It also indicates that you are set on the path to self knowledge and self discovery. If you have difficulties understanding or reading the map, then it means that you are feeling lost. You are literally still trying to find yourself and figure out where you want to go in life.<\/p>"
    },
    {
        "title": "Maple",
        "desc": "<p>To see a maple in your dream symbolizes humility, warmth, and openness. It also indicates positive gains, happiness and fullness of life.<\/p><p>To see a falling maple tree in your dream indicates family disharmony and broken ties.<\/p><p>To see a maple leaf in your dream represents each of the five senses and what it has to offer. Perhaps you need to perk up one of your five senses. It also symbolizes a helping or protective hand.<\/p>"
    },
    {
        "title": "Marathon",
        "desc": "<p>To dream that you are running in a marathon represents life's journey and how you are performing or feeling. It is symbolic of your endurance and willpower. Consider how you feel about the marathon and how you are approaching it.<\/p>"
    },
    {
        "title": "Marble",
        "desc": "<p>To see or play with marbles in your dream symbolize your perceptiveness, insightfulness and observation. If you are polishing a marble, then it represents your enduring efforts and perseverance.<\/p><p>To see something made of marble in your dream refers to your solid stance on an argument. Alternatively, maybe represents opulence and luxury.<\/p>"
    },
    {
        "title": "March",
        "desc": "<p>To dream of the month of March signifies disappointments. It also heralds the coming of spring and thus indicates new beginnings. The dream may also be a metaphor to &quot;march&quot; on, especially during difficult times.<\/p>"
    },
    {
        "title": "Marching",
        "desc": "<p>To dream that you are marching to the beat of music signifies teamwork, conformity, and structure. Perhaps the dream serves as a calling as a soldier or as a public officer.<\/p><p>To see people marching in your dream denotes your desires in wanting to associate with people in public positions.<\/p>"
    },
    {
        "title": "Marching Band",
        "desc": "<p>To see or be in a marching band indicates that you are a team player and able to work in harmony for a common cause. You show great discipline.<\/p>"
    },
    {
        "title": "Mardi Gras",
        "desc": "<p>To dream of Mardi Gras indicates your need to release your inhibitions and let yourself go.<\/p>"
    },
    {
        "title": "Mare",
        "desc": "<p>To see a mare in your dream represents your intuition. Alternatively, it signifies sexual fulfillment. If the mare is white, then it symbolizes spirit and creativity.<\/p>"
    },
    {
        "title": "Mariachi",
        "desc": "<p>To see a Mariachi band in your dream represents the Mexican culture and tradition. Perhaps it reflects an aspect of your own heritage.<\/p><p>If you dream that you are singing in a Mariachi, then it means that you are communicating a passionate message.<\/p>"
    },
    {
        "title": "Marigold",
        "desc": "<p>To see marigolds in your dream denote health and longevity.<\/p>"
    },
    {
        "title": "Marijuana",
        "desc": "<p>To dream that you are using marijuana implies that you are trying to escape reality. Perhaps you are trying to numb some emotional or psychological pain. If someone else is using marijuana or trying to get your to use it, then it indicates a negative influence in your life. You are on the verge of losing control. Perhaps you feel that your identity and sense of self is being compromised or disrespected.<\/p><p>To see or smell marijuana in your dream suggests that you are experiencing an expanded sense of awareness and consciousness. You need to take advantage and draw insight from this new consciousness. The dream may also mean that you need to look on your inner strength for stimulation instead of relying on outside forces.<\/p>"
    },
    {
        "title": "Marilyn Monroe",
        "desc": "<p>To see Marilyn Monroe in your dream indicates that you need to be more open and expressive with your sexuality. In particular, if you are wearing Marilyn Monroe's clothes, then it means that you need to be more in touch with your femininity.<\/p>"
    },
    {
        "title": "Marina",
        "desc": "<p>To dream that you are in a marina means emotional stability and calmness. You are finally at peace in a relationship that had been strained or giving you stress.<\/p>"
    },
    {
        "title": "Mariner",
        "desc": "<p>To dream that you are a mariner signifies a long and pleasant journey.<\/p>"
    },
    {
        "title": "Marionette",
        "desc": "<p>To see a marionette in your dream suggests that you are allowing others to control you. You are easily swayed by others and have difficulties standing up for yourself.<\/p>"
    },
    {
        "title": "Markers",
        "desc": "<p>To see or use markers in you dream represent your creativity. Perhaps you need to introduce some liveliness in your life. Consider the significance of the marker color. Alternatively, the dream may be telling you that there is something you need to &quot;mark&quot; down or remember.<\/p>"
    },
    {
        "title": "Market",
        "desc": "<p>To dream that you are in a market represents some emotional or physical need that you are currently lacking in your life. You may be in need of nurturance and some fulfillment. Consider the specific items that you are shopping for. Alternatively, the market signifies frugality.<\/p><p>To see an barren market in your dream signifies depression and gloominess. There is a void in your life. If the market is large or well-stocked, then it means possibilities and choices.<\/p><p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s4.htm#Store\">Store<\/p>"
    },
    {
        "title": "Marlin",
        "desc": "<p>To see or catch a marlin in your dream means that you need to be more decisive and forge forward with your plans. Alternatively, seeing a marlin in your dream suggests that you need to be more direct about your feelings.<\/p>"
    },
    {
        "title": "Marmalade",
        "desc": "<p>To make or eat marmalade in your dream indicates that you need to incorporate some zest in your life<\/p>"
    },
    {
        "title": "Marmot",
        "desc": "<p>To see a marmot in your dream suggests deceit and falsehood. You are being mislead in some aspect of your relationship.<\/p>"
    },
    {
        "title": "Marriage",
        "desc": "<p>To dream of a marriage signifies commitment, harmony or transitions. You are undergoing an important developmental phase in your life. The dream may also represent the unification of formerly separate or opposite aspects of yourself. In particular, it is the union of masculine or feminine aspects of yourself.Consider the qualities and characteristics of the person that you are marrying. These are the qualities that you need to look at incorporating within yourself.<\/p><p>To dream of a proposal of marriage suggests that some situation will take a turn for the worse.<\/p><p>To dream that you are getting married to your ex, suggests that you have accepted aspects of that relationship and learned from those past mistakes. Alternatively, it means that a current relationship shares some commonality with your previous relationship with your ex. However, since you are aware of the similarities, you know not make those same mistakes.<\/p><p>To dream that you are in an arranged marriage suggests that you are feeling forced to do something you do not want to do. You feel that you have no voice or no choice in a situation. Consider how a waking situation may be making you feel voiceless.<\/p><p>To dream that you marry someone in order save their soul refers to the sacrifices you are making in that situation or relationship. You always play the role of the protector in the relationship and try to shield others from being hurt.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/w.htm#Wedding\">Wedding.<\/p>"
    },
    {
        "title": "Mars",
        "desc": "<p>To see Mars in your dream symbolizes energy, drive, passion, fearlessness and ambition. It also represents war, violence and masculine power.<\/p>"
    },
    {
        "title": "Marsh",
        "desc": "<p>To see or dream that you are at a marsh suggests instability in your emotional realm. You are feeling bogged down, insecure or unsure about the future or how to go about with achieving your goals.<\/p><p>To dream that a marsh is being drained indicates that you are feeling weary and emotionally drained. Alternatively, you feel lost.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s5.htm#Swamp\">Swamp.<\/p>"
    },
    {
        "title": "Marshmallows",
        "desc": "<p>To see or eat marshmallows in your dream represent timidity and lack of self-confidence. You need to learn to be more assertive and stand up for yourself.<\/p><p>To dream that you are roasting marshmallows indicate growth and motivation.<\/p>"
    },
    {
        "title": "Marsupial",
        "desc": "<p>To see marsupials in your dream signify the importance of a maternal bond and connection. Perhaps it is a reminder for you to reconnect with your mother. Alternatively, dreaming of marsupials represents warmth and your need for a better sense of security. You want to feel protected.<\/p>"
    },
    {
        "title": "Martial Arts",
        "desc": "<p>To dream that you are practicing martial arts suggest that you need to better focus your energies and direct them on your goals.<\/p>"
    },
    {
        "title": "Martyr",
        "desc": "<p>To dream that you are a martyr forewarns that you are focusing too much attention on the needs of others at the risk of neglecting your own needs. The dream also indicates a lack of self-love. You are unable to forgive yourself for some past sin or decision.<\/p>"
    },
    {
        "title": "Mascara",
        "desc": "<p>To dream that you are wearing mascara suggests that you need to open your eyes and be more attentive to a situation or relationship.<\/p><p>To dream that your mascara is smeared indicates that your reputation is being called into question by rumors.<\/p>"
    },
    {
        "title": "Mascot",
        "desc": "<p>To see a mascot in your dream refers to an aspect of your personality that you want to work. If the mascot is a bird, then it implies that you desire to be more open minded and\/or free. If the mascot is a dog, then you want to work on your social skills.<\/p><p>To dream that you are dressed as a mascot means that you are hiding behind some persona. You are afraid to be your true self.<\/p>"
    },
    {
        "title": "Mask",
        "desc": "<p>To dream that you are wearing a mask suggests that you are trying to be someone you are not. You are trying to hide your true feelings and only reveal half truths. If you have trouble taking off your mask, then it suggests that your true self is lost or blurred. Alternatively, wearing a mask signifies temporary trouble due to some misunderstanding of your action and conduct.<\/p><p>To see someone wearing a mask in your dream denotes that you are struggling against deceit, falsehood, and jealousy. If someone removes their mask, then itsymbolizes failure in gaining the admiration and\/or respect of someone sought for."
    },
    {
        "title": "Masochism",
        "desc": "<p>To dream about masochism suggests your need to experience and feel things at an extreme level. Alternatively, the dream indicates that you are sacrificing yourself. You feel that you have to suffer for your past mistakes.<\/p>"
    },
    {
        "title": "Mason",
        "desc": "<p>To dream that you are a mason signifies a rise in your current circumstances. You will experience a more satisfying social surrounding.<\/p>"
    },
    {
        "title": "Masquerade",
        "desc": "<p>To dream that you are at a masquerade ball suggests that you are trying to escape from the demands of real life. You may be overindulging in sinful or foolish pursuits. It is time to acknowledge your responsibilities.<\/p>"
    },
    {
        "title": "Mass",
        "desc": "<p>To dream that you are at mass represents your sense of community. You approach life with the consideration of those around you in mind.<\/p>"
    },
    {
        "title": "Massacre",
        "desc": "<p>To witness a massacre in your dream suggests that you are a follower. You tend to go along with the ideas of others without question and hesitation.<\/p>"
    },
    {
        "title": "Massage",
        "desc": "<p>To dream that you are getting a massage suggests that you are lacking sensual or sexual stimulation in your waking life.You need to be more in touch with your sensuality. Perhaps you need to take better care of your body. The dream also represents nurturance ease and comfort. Alternatively, getting a massage suggests that you need to let go and stop being so defensive.<\/p><p>To dream that you are giving a massage to someone means that you are trying to persuade someone toward your side or your point of view.<\/p>"
    },
    {
        "title": "Mast",
        "desc": "<p>To see the mast of a ship in your dream signifies a long and pleasant journey. Alternatively, it represents hope and salvation. If the mast is from a wrecked ship, then it denotes sudden changes in a situation.<\/p>"
    },
    {
        "title": "Mastectomy",
        "desc": "<p>To dream that you have a mastectomy indicates your lack of sensitivity. You are feeling disconnected from those around you. From a positive perspective, this dream signifies your independence and autonomy. If you have been diagnosed with breast cancer, then this dream represents fear and worry. You feel you are loosing your femininity.<\/p>"
    },
    {
        "title": "Master",
        "desc": "<p>To dream that you have a master denotes feelings of inadequacy and a lack of discipline in your life. You need a strong-willed leader to guide you.<\/p><p>To dream that you are a master suggests that there is some situation or problem that you need to &quot;master&quot; and get a handle on. Alternatively, it means you need to take on a leadership role.<\/p>"
    },
    {
        "title": "Masturbation",
        "desc": "<p>To dream that you are masturbating represents your unacknowledged and unexpressed sexual needs\/desires. It may also indicate you need to take care of yourself in sensual or emotional ways which are not necessarily sexual. Or perhaps, you may need to put forth a little more effort toward some relationship.<\/p><p>To see someone masturbating in your dreams denotes your anxieties and concerns about your own inhibitions. Perhaps something in your waking life is not as satisfying as it could be. Keep in mind that this dream may not necessarily represent sexual inhibitions or satisfaction, but may be analogous to some situation or relationship.<\/p>"
    },
    {
        "title": "Mat",
        "desc": "<p>To see a mat in your dream suggests that you feel others are walking all over you. You feel being taken advantage of. Alternatively, the dream may be a pun on someone who is named Matt in your life.<\/p>"
    },
    {
        "title": "Matador",
        "desc": "<p>To see or dream that you are a matador suggests that you need to challenge yourself and prepare for the obstacles ahead. Work on your bravery.<\/p>"
    },
    {
        "title": "Matches",
        "desc": "<p>To see or strike a match in your dream suggests that there is something that you need to ignite and rekindle in your life. The dream maybe a pun on something or someone who is your match.<\/p>"
    },
    {
        "title": "Matchmaker",
        "desc": "<p>To see or use a matchmaker in your dream indicates your openness to new experiences. More directly, the dream is about your love life and the pressure to find someone to spend your life with.<\/p><p>To dream that you are a matchmaker suggests that you need to stop meddling in other people's personal lives.<\/p>"
    },
    {
        "title": "Mathematics",
        "desc": "<p>To dream about mathematics indicate that you are evaluating a situation in your waking life where you need to be more rational in your thinking. Try not to act on your emotions.<\/p><p>To dream that you are unable to solve a mathematical problem or equation parallels a waking problem where you may be confused about. The dream may offer a hint toward a new approach to this waking problem.Something does not add up in your life.<\/p>"
    },
    {
        "title": "Matryoshka Doll",
        "desc": "<p>To see a Matryoshka Doll in your dream refers to the many inner components of your persona. There are many layers to your personality that you need to get through in order to unveil what is truly underneath. Perhaps you feel that no one knows the real you or that no one has taken the time to discover all the different sides of you. Alternatively, the dream may be a metaphor for some revelation.<\/p>"
    },
    {
        "title": "Mattress",
        "desc": "<p>To see a mattress in your dream represents your support system. Alternatively, the dream means that you have new responsibilities and duties that will require your time and attention.<\/p><p>To dream that you are sleeping on a new mattress refers to your present stage of life.<\/p>"
    },
    {
        "title": "Mausoleum",
        "desc": "<p>To see or dream that you are in a mausoleum represents calmness. You are finally at peace about something.<\/p>"
    },
    {
        "title": "Maxi Pad",
        "desc": "<p>To see a maxi pad in your dream indicates that you need to release some pent up anger or tension. It may also mean that some creative energy is being released or recognized. If you see Always Maxi Pads in your dream, then the dream may be telling you &quot;always&quot; is the answer to some question or comment.<\/p>"
    },
    {
        "title": "May",
        "desc": "<p>To dream of the month of May signifies prosperity and times of pleasure. The dream may also be a metaphor for &quot;may I?&quot; Perhaps you are seeking permission for something.<\/p>"
    },
    {
        "title": "Mayor",
        "desc": "<p>To see a mayor in your dream indicates your need for guidance, especially from a higher source.<\/p>"
    },
    {
        "title": "Mayonnaise",
        "desc": "<p>To see or eat mayonnaise in your dream represents disappointment in your waking life. It also suggests that you are being insulted or disrespected.<\/p>"
    },
    {
        "title": "Maypole Dance",
        "desc": "<p>To see or participate in a maypole dance indicates that you are celebrating an end to your old ways and welcoming in a new beginning. Alternatively, it signifies male sexuality and fertility. The dream could indicate your easy going attitude toward sex.<\/p>"
    },
    {
        "title": "Maze",
        "desc": "<p>To dream that you are in a maze denotes that you need to deal with a waking task on a more direct level. You are making the situation harder than it really is. Alternatively, the maze symbolizes life's twists and turns. It represents indecision, confusion, missteps, feeling lost or being misled.<\/p>"
    },
    {
        "title": "McDonalds",
        "desc": "<p>To see or dream that you are at McDonalds signifies happiness and a worry-free attitude. The dream also suggests that you are living large. Perhaps the dream is telling you to expand your thinking or horizons. Supersize it!Alternatively, if you do not like McDonalds, then the dream may be indicative of something in your life that is unhealthy. More directly, the dream may just mean you are hungry.<\/p>"
    },
    {
        "title": "Meadow",
        "desc": "<p>To see a meadow in your dream represents openness and security. You are taking time out to appreciate your accomplishments.<\/p>"
    },
    {
        "title": "Meadowlark",
        "desc": "<p>To see meadowlark in your dream indicates your cheerful disposition and outlook on life. You make the best out of every situation.<\/p>"
    },
    {
        "title": "Meals",
        "desc": "<p>To see meals in your dream suggest that you are dwelling too much on trivial matters, causing your attention to be diverted from important issues. Alternatively, you may be lacking spiritual enrichment and sensual expression.<\/p><p>*See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/e.htm#eating\">Eating.<\/p>"
    },
    {
        "title": "Mealworms",
        "desc": "<p>To see mealworms in your dream indicates that you are hungering for a new experience.<\/p>"
    },
    {
        "title": "Mean",
        "desc": "<p>To dream that someone is being mean to you suggests that you are being too hard on yourself. You need to give yourself a break. Alternatively, the dream may be a metaphor that you are looking for &quot;meaning&quot; or significance to some life issue.<\/p><p>To dream that you are uncharacteristically mean to someone represents some negative feelings that you are not expressing in your waking life. Instead they are manifesting in your dream where you are more comfortable in expressing how you really feel. Dreams provide a safe outlet.<\/p>"
    },
    {
        "title": "Measles",
        "desc": "<p>To dream that you have measles indicate that your problems and worrying are affecting your educational or professional pursuits.<\/p><p>To see others with measles in your dream denotes that the problems of others are becoming your own problems. It is giving you much stress and worry.<\/p>"
    },
    {
        "title": "Measurement",
        "desc": "<p>To see or dream about your measurements indicate that you are setting standards for yourself or of what you think others expect of you. How are you measuring up? Perhaps you need to stop comparing yourself to others.<\/p>"
    },
    {
        "title": "Measuring Tape",
        "desc": "<p>To see or use a measuring tape in your dream suggests that you are comparing yourself to others. The dream may be a metaphor on how you &quot;measure up&quot; to others. Or you are taking certain measures in order to accomplish something. Perhaps you are experiencing some self-doubt or that you are not good enough.<\/p>"
    },
    {
        "title": "Meat",
        "desc": "<p>To see raw meat in your dream represents obstacles and discouragements that you will come across as you move toward achieving your goals. Alternatively, it may reflect your untamed, animalistic nature and raw emotions.<\/p><p>To eat or cook meat in your dream suggests that you are getting to the heart of the matter. You are recognizing and utilizing your instinctual energies. Alternatively, you are seeing others achieve what you are still striving for.<\/p><p>To see rotten meat in your dream refers to a degradation of your physical and psychological being. The dream may be a metaphor for some health problems.<\/p><p>If eating horsemeat is not accepted in your culture, then the dream refers to a situation where you do not want to know details about. If you enjoy eating horsemeat, then it implies that you are open to difference experiences. If eating horsemeat is culturally accepted for you, then the dream has the same significance as eating meat.<\/p>"
    },
    {
        "title": "Meatballs",
        "desc": "<p>To make meatballs in your dream indicate that a new idea is forming or a new project is taking shape.<\/p><p>To see or eat meatballs in your dream represent familiarity, ease, and comfort. Alternatively, the dream may be a pun on an awkward, dull or socially inept person.<\/p>"
    },
    {
        "title": "Mechanic",
        "desc": "<p>To see a mechanic in your dream suggests that you need to work on healing your past hurts and trauma.<\/p>"
    },
    {
        "title": "Mechanical Bull",
        "desc": "<p>To see or ride a mechanical bull in your dream is analogous to your sex life. Perhaps it has become routine or devoid of emotion and passion.<\/p>"
    },
    {
        "title": "Medal",
        "desc": "<p>To see a medal in your dream signifies a reward or an acknowledgement of your hard work. You are being recognized for your abilities and talents.<\/p>"
    },
    {
        "title": "Media",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p5.htm#Press\">Press.<\/p>"
    },
    {
        "title": "Medicine",
        "desc": "<p>To dream that you are taking medicine represents a period of emotional and\/or spiritual healing. It also indicates that the troubles you are experiencing are only temporary. Things will work out in the long run.<\/p><p>To dream that you are giving medicine to someone indicates that you are trying to take advantage of a situation or of someone. If you are given the wrong medication, then you are being manipulated. Someone is trying to take advantage of you.<\/p>"
    },
    {
        "title": "Medicine Cabinet",
        "desc": "<p>To see your medicine cabinet in your dream represents a period of healing.<\/p><p>To dream that the medicine cabinet is empty suggests concerns over your well-being. You are neglecting your emotional, mental and\/or spiritual health.<\/p>"
    },
    {
        "title": "Medicine Man",
        "desc": "<p>To see a traditional medicine man in your dream refers to your strong support system. You have friends and family who will help you to achieve to highest goals.<\/p>"
    },
    {
        "title": "Medieval",
        "desc": "<p>To dream of Medieval times represents old habits\/attitudes and old ways of thinking. It is important to analyze the activities that occur in the dream, so that you can figure out what aspect of yourself or your life needs updating. For example, jousting refers to your need to spice up your sex life.<\/p>"
    },
    {
        "title": "Meditate",
        "desc": "<p>To dream that you are meditating represents self-acceptance and enlightenment. It also suggests that you need to be less judgmental on others and not be so hard on yourself.<\/p>"
    },
    {
        "title": "Medium",
        "desc": "<p>To dream that you are a medium indicates that you are getting in touch with your intuitive side. You are more sensitive to your instincts and in how your perceive things. It also suggests increased knowledge of your subconscious. Alternatively, the dream may mean that you are standing in middle ground. You are non-committal about a situation. Perhaps you are being too indecisive.<\/p>"
    },
    {
        "title": "Medusa",
        "desc": "<p>To see Medusa in your dream signifies cunningness and terror.Alternatively, the dream may imply that you are draining all the energy out of others. You are burdening others with your problems and putting a strain on the relationship.<\/p>"
    },
    {
        "title": "Meerkat",
        "desc": "<p>To see a meerkat in your dream suggests that you are protected against some negativity in your life.<\/p>"
    },
    {
        "title": "Meeting",
        "desc": "<p>To dream that you are in a meeting suggests that you need to redirect your energies toward a more productive endeavor. Alternatively, the dream means that you are learning to accept various aspects of yourself and integrating them into your personality.<\/p><p>To dream that you are late or miss a meeting signifies anxieties that you are not measuring when it comes to achieving your goals. You may unprepared in some situation or challenge in your waking life.<\/p>"
    },
    {
        "title": "Megaphone",
        "desc": "<p>To dream that you are using a megaphone indicates that you need to be more vocal and expressive about your feelings. Speak up and express yourself. Perhaps you feel that you arebeing overlooked and feel that your voice is not being heard.<\/p>"
    },
    {
        "title": "Melancholy",
        "desc": "<p>To dream that you are feeling melancholy signifies disappointments. You have to remember that you cannot always win at everything. All you can do is learn from past disappointments.The dream may be a reflection of how you are feeling in your waking life.<\/p><p>To see someone who is melancholy in your dream represents your inability to connect with others. You are feeling withdrawn and distant.<\/p>"
    },
    {
        "title": "Melon",
        "desc": "<p>To see or eat a melon in your dream indicates that you need to relax and take it easy. Alternatively, the dream signifies fertility, sensuality, gluttony or vitality. Melons may also be a metaphor for breasts.<\/p>"
    },
    {
        "title": "Melting",
        "desc": "<p>To see melting ice or snow signifies that you are letting go or releasing negative and cold emotions that you have been holding onto. You are warming up to a situation.<\/p>"
    },
    {
        "title": "Memorandum",
        "desc": "<p>To dream that you are reading or making a memoranda suggests that there is an important message that you need to convey. There is something that you need to let others know.<\/p><p>To see someone make a memorandum in your dream indicates that you will be called upon to for some assistance in a matter.<\/p>"
    },
    {
        "title": "Memorial",
        "desc": "<p>To see a memorial in your dream indicates the need for kindness and compassion. The dream may also suggests that you need to confront the past in order to move forward.<\/p>"
    },
    {
        "title": "Memory",
        "desc": "<p>To dream about a memory suggests that you are ready to rid yourself of your old ways and undergo a transformation. You are ready for a new outlook in life. Recalling a memory in your dream may also be less of a shock then if you had recalled the memory in your waken state. Alternatively, the dream indicates that you have learned from your past experiences.<\/p><p>To dream that your memory is getting or has been erased means that you must let go of the past in order to move forward with your life. You are stuck in an unhealthy cycle.<\/p>"
    },
    {
        "title": "Memory Stick",
        "desc": "<p>To see a memory stick in your dream refers to ideas and advice that you need to look at incorporating into a waking situation or some aspect of your life. The dream also indicates your ability to easily convey your feelings, beliefs or ideas to others. Consider what kind of files are on the memory stick.<\/p>"
    },
    {
        "title": "Men",
        "desc": "<p>To see men in your dream represent an authoritative figure or a father figure. If you are a woman and dream that you are in a room full of men, then it highlights the masculine aspect of yourself. The dream forces you to acknowledge your authoritative and aggressive side. Consider also how the men are dressed as this will provide a clue as to what area in your life you need to assert more power.<\/p><p>If you are a man and dream that there are only men at a party suggests that you are questioning your abilities. You fear that you are being overlooked or not measuring up to others. Or perhaps you are also expressing desires of blending in and not standing out.<\/p><p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m.htm#Man\">Man.<\/p>"
    },
    {
        "title": "Menagerie",
        "desc": "<p>To dream that you are at a menagerie symbolizes problems that need to be dealt with more directly. Otherwise, your problems will multiply exponentially.<\/p>"
    },
    {
        "title": "Mendicant",
        "desc": "<p>To see mendicants in your dream signify interruptions in your plans.<\/p>"
    },
    {
        "title": "Mending",
        "desc": "<p>Todream that you are mending a garment symbolizes your attempts and efforts at fixing a problem.<\/p>"
    },
    {
        "title": "Menopause",
        "desc": "<p>To dream about menopause suggests that you are smothering the people around you. You need to be less codependent.<\/p>"
    },
    {
        "title": "Menorah",
        "desc": "<p>To see a Menorah in your dream represents the seven days of the week. It is also symbolic of the sun, the moon, and the five main planets. Alternatively, it symbolizes beauty, strength, and wisdom. This dream imagery may also be a reflection of your religious faith.<\/p>"
    },
    {
        "title": "Menstruation",
        "desc": "<p>To dream of menstruation indicates that you are releasing your pent-up tension and worry. It signals an end to the difficult times and the beginning of relaxation. Some creative energy is being released or recognized. Alternatively, the dream means that you are denying your feminine side.<\/p><p>If you are in menopause and dream that you are menstruating, then the dream signifies renewed vitality.<\/p><p>In particular, dreaming of their menstrual cycle when it is not time yet may indicate your anxiety about your cycle. It may sometimes signal an early or unexpected period.Studies have also shown that more vivid dreams seem to coincide with a woman's menstrual cycle. Dreams about being pregnant, giving birth, or motherhood occur more often while a woman is ovulating.If you are pregnant and dream that you have your period, then it is a reminder that you need to take things slow.<\/p><p>To dream that you are consuming menstrual blood suggests that you are stuck in a cycle. You are holding on to the past and refusing to move onto something productive.<\/p><p>Dreaming that you are pretending to be on your period suggests that you are pretending that everything is okay when it is not. You are trying to put up a happy facade in order to avoid confrontation.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=blooddream1\">Menstruation&quot;<\/p>"
    },
    {
        "title": "Mental Institution",
        "desc": "<p>To dream that you are in a mental institution indicates a need for rest and a need to reset your mind. Don't be afraid to ask for help\/assistance when you need it.<\/p><p>To dream that you are outside a mental institution suggests that you are feeling ostracized or shunned. You may be close to a mental breakdown. Or you are feeling left out, excluded, and ignored.<\/p>"
    },
    {
        "title": "Mentally Challenged",
        "desc": "<p>To dream that you are mentally challenged indicates that you are experiencing feelings of self-doubt. You are afraid of being left out or left behind.<\/p><p>To see a mentally challenged person in your dream suggests that someone around you is feeling ignored or overlooked. Perhaps you have failed to listen to what they have to say and as a result are alienating them.<\/p>"
    },
    {
        "title": "Mentor",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/t.htm#teacher\">Teacher.<\/p>"
    },
    {
        "title": "Meow",
        "desc": "<p>To hear meowing in your dream signifies neediness. You are seeking attention.<\/p>"
    },
    {
        "title": "Menu",
        "desc": "<p>To see a menu in your dream indicates that you are seeking some spiritual or emotional nourishment. Consider the type of items that were on the menu and the costs to determine how much value you are placing on each item.<\/p>"
    },
    {
        "title": "Mercedes Benz",
        "desc": "<p>To see Mercedes Benz in your dream symbolizes status, wealth, luxury and prestige. The dream could also be a metaphor for someone who is named Mercedes.<\/p>"
    },
    {
        "title": "Mercury",
        "desc": "<p>Tosee mercury in your dream represents quick movement. You need to speak up first and think it through later. Trust your intuition.<\/p><p>To see the planet Mercury in your dream symbolizes alertness, awareness, open communication, reason, and versatility.The dream may indicate your need to exhibit some of these qualities in your waking life. You are exhibiting efficiency in your work.<\/p>"
    },
    {
        "title": "Meringue",
        "desc": "<p>Toeat or make a meringue in your dream indicates that a relationship is lacking substance. It is all for show. Alternatively, dreaming about a meringue dessert is a symbol of your tenacity and work ethic.<\/p>"
    },
    {
        "title": "Mermaid",
        "desc": "<p>To see a mermaid in your dream signifies the female aspect of yourself that is mysterious, vulnerable and secretive. It may also show a fear of sex. In particular, for a man to dream of a mermaid indicates that he is having fears of being drowned by the feminine aspect of his psyche. For a woman, it suggests doubts over her femininity.<\/p><p>To dream about a shelled necklace with the word &quot;mermaid&quot; etched on it indicates that you are not letting your vulnerabilities show through. You are putting on a tough facade. Alternatively, the mermaid may symbolize something very personal to you.<\/p>"
    },
    {
        "title": "Merman",
        "desc": "<p>To see a merman in your dream indicates a need to belong and to be part of something. Alternatively, a merman represents some message from your subconscious.<\/p>"
    },
    {
        "title": "Merry",
        "desc": "<p>To dream that you are merry reflects your waking happiness. Alternatively, the dream may be a compensatory dream and is often a dream of the contrary. You may be trying to compensate for the sadness or stress in your waking life.Being merry may also be a pun on &quot;marriage&quot;. by DreamMoods.com<\/p>"
    },
    {
        "title": "Merry-Go-Round",
        "desc": "<p>To dream that you are on a merry-go-round indicates a fear of reliving your childhood. You feel that you are going nowhere or in a state of stagnation. Or you may be expressing some anxiety about your transition into adulthood. Alternatively, it suggests that you are in the beginning stages of romantic love.<\/p><p>To see a merry-go-round in your dream represents childish joy.<\/p>"
    },
    {
        "title": "Meshes",
        "desc": "<p>Tosee something made of mesh in your dream suggests that you are feeling trapped. It is synonymous with a web. Alternatively, the dream may be a pun and your ability to &quot;mesh&quot; various aspects of your life together.<\/p>"
    },
    {
        "title": "Mess",
        "desc": "<p>To see a mess in your dream symbolizes the state of your waking life. You need to get your life in order.<\/p>"
    },
    {
        "title": "Mess Hall",
        "desc": "<p>To dream that you are in a mess hall suggests that have a disciplined view toward food. Perhaps you are on a diet. Alternatively, there are some issues or feelings that are eating up inside you.<\/p>"
    },
    {
        "title": "Message",
        "desc": "<p>To dream that you are sending a message suggests that there is an important message that you need to convey and let others know.<\/p><p>To dream that you are receiving a message represents a message from your subconscious.<\/p><p>Dreaming that you write a message and then delete it before sending it means that there is something you want to get off your chest but are afraid of what others think or how you will be perceived. You tend to over think things.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/l2.htm#Letter\">Letter.<\/p>"
    },
    {
        "title": "Metal",
        "desc": "<p>To see metal in your dream signifies strength and character. It may also symbolize the inhumane side of society. Consider the exact type and shape of metal and what you are doing with it. In particular, if the metal is solid, then it represents your libido and sexual desire.<\/p>"
    },
    {
        "title": "Metal Detector",
        "desc": "<p>To see or use a metal detector in your dream indicates that you are in search of your inner strength or are trying to connect with your subconscious. Alternatively, the dream suggests that you are looking for that hidden talent and potential within yourself. You want to recapture something that you have lost, but once valued or cherished.<\/p>"
    },
    {
        "title": "Metalhead",
        "desc": "<p>To see or dream that you are a metalhead refers to your defiant and non-conformist attitude. You are feeling out of touch with society. Alternatively, the dream may be a metaphor that you are being &quot;hard headed&quot; or stubborn.<\/p>"
    },
    {
        "title": "Metallica",
        "desc": "<p>To see or listen to Metallica in your dream represents your independent nature and your tendency to reflect on your thoughts alone. Alternatively, the dream may be trying to convey a message or some advice from one of their songs.<\/p>"
    },
    {
        "title": "Metamorphosis",
        "desc": "<p>Tosee a metamorphosis take place in your dream denotes sudden and rapid changes in your personal life. The metamorphosis helps to draw attention to two different aspects of your life. If the metamorphosis is a smooth one, then it indicates some changes are necessary for you to adapt to a new situation. However, if the metamorphosis is a complicated and unpleasant one, then it suggests that you are ill prepared for the changes in your life.<\/p>"
    },
    {
        "title": "Meteor",
        "desc": "<p>To see a meteor in your dream suggests that you will experience success in a project. You are on your way toward realizing your goals and desires. Alternatively, the meteor refers to wishful thinking and idealistic thoughts.<\/p><p>To see a meteor shower in your dream signifies romantic thoughts and idealistic notions.<\/p>"
    },
    {
        "title": "Mexico",
        "desc": "<p>To dream of Mexico or of a Mexican person represents the preservation of tradition, family, faith and culture. It also refers to a hard-working mindset. If you are from Mexico or have been to Mexico, then the dream may have a more personal symbolism for you. Consider your own feelings about the country.<\/p>"
    },
    {
        "title": "Mezzanine",
        "desc": "<p>To dream that you are on the mezzanine represents your middle class status. You have your sights on the upper echelon of society and are yearning to move ahead.<\/p>"
    },
    {
        "title": "Mice",
        "desc": "<p>To see mice in your dream indicates that you are spending too much time dwelling on minor problems and insignificant matters.<\/p><p>To see mice feeding or eating in your dream suggests that someone is trying to bring down your self-confidence. Someone may be nipping away at your resources.<\/p><p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m3.htm#mouse\">Mouse.<\/p>"
    },
    {
        "title": "Mickey Mouse",
        "desc": "<p>Tosee Mickey Mouse in your dream signifies the magic and joy of childhood. It is time to go back to a period where you can be more carefree.<\/p>"
    },
    {
        "title": "Microchip",
        "desc": "<p>To see a microchip in your dream symbolizes your identity or someone else's identity.<\/p><p>Dreaming that you are being implanted with a microchip means that your every move is being scrutinized.<\/p>"
    },
    {
        "title": "Microphone",
        "desc": "<p>To see a microphone in your dream suggests that you need to be more assertive and forceful.You need to voice your opinions more strongly and make your views known. The microphone may also be a pun on someone in your life who is named &quot;Mike&quot;.<\/p>"
    },
    {
        "title": "Microscope Tosee a microscope in your dream suggests that you need to take a closer look at some situation. Something that may seemingly be insignificant may actually be causing much troubles or hindrances. Microwave",
        "desc": "<p>To see a microwave in your dream represents your quick thinking and quick-action. You need to consider new and better way of doing things.<\/p><p>To dream that you are cleaning the microwave suggests that you need to clear your mind and free yourself of certain emotions that are weighing you down. Alternatively, the dream may mean that it is time to make some dietary changes in your waking life.<\/p>"
    },
    {
        "title": "Midget",
        "desc": "<p>** Please refer to<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/l3.htm#LittlePerson\">Little Person.<\/p>"
    },
    {
        "title": "Midnight",
        "desc": "<p>To dream that it is midnight indicates that you need to face reality.<\/p>"
    },
    {
        "title": "Midwife",
        "desc": "<p>Tosee or dream that you are a midwife represents your role in the birth of some new project. You are playing an important part in this project.<\/p>"
    },
    {
        "title": "Mildew",
        "desc": "<p>Tosee mildew in your dream symbolizes neglected feelings and emotions that you are unwilling to confront. It is time to bring those feelings to the surface and work through them.<\/p>"
    },
    {
        "title": "Military",
        "desc": "<p>To see the military in your dream signifies rigid authority and emotional repression. Perhaps you need to be more disciplined<\/p><p>If you have served with the military, then this dream may represent your actual life experiences and memories.<\/p>"
    },
    {
        "title": "Military Base",
        "desc": "<p>To dream that you are on a military base represents a situation where you are feeling restricted or repressed. You are so focused on your responsibilities that you are neglecting your own feelings and needs.<\/p>"
    },
    {
        "title": "Military Camp",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b4.htm#BootCamp\">Boot Camp.<\/p>"
    },
    {
        "title": "Milk",
        "desc": "<p>To see milk in your dream symbolizes maternal instincts and motherly love.It also denotes human kindness, wholesomeness, and compassion. Alternatively, the dream may be a metaphor that someone is &quot;milking&quot; you, either emotionally or financially.<\/p><p>To dream that you are drinking milk signifies domestic bliss and inner nourishment. It may also imply that you need to strengthen your ties and relationships with others.If the milk is spoiled, sour, impure or bad tasting, then it suggests that you need to hold back your support. You may be too trusting and need to question the motives of others. If the milk is hot, then it represents comfort and calmness.<\/p><p>To spill milk in your dream symbolizes a loss of faith, opportunity, and trust.<\/p><p>To dream that you are bathing in milk indicates that you are surrounded by strong relationships and solid friendships. Alternatively, the dream suggests that you are in need of some relaxation.<\/p><p>To dream that you are choking onmilk indicates that you are being overprotected. You may be feeling smothered in some relationship.<\/p>"
    },
    {
        "title": "Milking",
        "desc": "<p>Todream that you are milking a cow signifies that great opportunities are being put before you, but still out of your reach. Through perseverance, you will win out in the end. Alternatively, the dream could also be a metaphor for &quot;being milked&quot; or used.<\/p>"
    },
    {
        "title": "Milkshake",
        "desc": "<p>Todrink a milkshake in your dream indicates satisfaction with how your life is going. It is also symbolic of togetherness, social bonding, and simplistic fun. Alternatively, a milkshake signifies a memory for your childhood.<\/p>"
    },
    {
        "title": "Mill",
        "desc": "<p>Tosee a mill in your dream suggests that you are able to learning from your past experiences and applying them to your current problems and situations. Alternatively, it symbolizes a transformation.<\/p>"
    },
    {
        "title": "Miller",
        "desc": "<p>Tosee a miller in your dream represents a spiritual force in your life.<\/p>"
    },
    {
        "title": "Millipede",
        "desc": "<p>To see a millipede in your dream indicates that you are letting fears prevent you from achieving your goals. You are experiencing a major setback in life. Alternatively, the dream is symbolic of harmony and cooperation. You are a team player and work well with others.<\/p>"
    },
    {
        "title": "Millstone",
        "desc": "<p>Tosee or use a millstone in your dream represents some burden in your waking life. You are feeling worn out.<\/p>"
    },
    {
        "title": "Mime",
        "desc": "<p>To see or dream that you are a mime suggests that you are having difficulties verbally communicating your thoughts and feelings across. Others around you may not understand your erratic behavior. You are trying to make light of how you really feel. Alternatively, the dream indicates that you need to think carefully before speaking. The dream may be depicting how you saying one thing, but you actually mean something else. Your actions are speaking louder than your words.<\/p>"
    },
    {
        "title": "Mimic",
        "desc": "<p>To dream that you are mimicking someone indicates that you are lacking your own identity. Alternatively, the dream means that you are trying too hard to live up to the expectations of others. You are being someone who you are not.<\/p>"
    },
    {
        "title": "Minaret",
        "desc": "<p>To see a minaret in your dream symbolizes devotion, obedience, and spiritual enlightenment.<\/p>"
    },
    {
        "title": "Mine",
        "desc": "<p>Todream that you are in a mine suggests that you are getting to the core of an issue or condition. Alternatively, it indicates that something from your subconscious is coming to the surface. The dream may also be a metaphor to claim what is &quot;mine&quot;.<\/p>"
    },
    {
        "title": "Mine Shaft",
        "desc": "<p>To see or dream that you are in a mine shaft symbolizes the depth of your subconscious. It is time to address all the feelings you have suppressed.<\/p>"
    },
    {
        "title": "Minefield",
        "desc": "<p>To dream that you are in a minefield represents the many difficulties that you are facing in your waking life.You are worried about how to tackle and resolve your problems. Don't be afraid to reach out for advice and for help.<\/p>"
    },
    {
        "title": "Mineral",
        "desc": "<p>Tosee minerals in your dream signify a bright outlook. Things may look bleak or dark now, but things will look up.<\/p>"
    },
    {
        "title": "Mineral Water",
        "desc": "<p>Todream that you are drinking mineral water means that you will have a solid foundation needed to enjoy your taste for the finer things in life.<\/p>"
    },
    {
        "title": "Miniatures",
        "desc": "<p>To see miniatures in your dream indicate that you are feeling larger than life. You are experiencing new found confidence and self esteem. Consider what is being miniaturized. If it is someone you know who is miniaturized, then it means that you lack respect for them. You do not think much of this person. If you are the one that appears as a miniature, then it suggests that you are feeling unworthy, helpless, insignificant or overshadowed.<\/p>"
    },
    {
        "title": "Minister",
        "desc": "<p>Tosee or dream that you are a minister suggest that you need to be more compassionate and understanding in some situation or relationship. Alternatively, the dream indicates that you have overstep your boundaries and into another's rights. If the dream has negative overtones, then the minister may be a symbol of repressed thoughts and feelings.<\/p>"
    },
    {
        "title": "Minivan",
        "desc": "<p>Tosee or drive a minivan in your dream symbolizes family gatherings and family values. You may be experiencing the burdens and responsibilities involved with taking care and providing for a family. Alternatively, the minivan represents conservatism. You are settled down.<\/p>"
    },
    {
        "title": "Mink",
        "desc": "<p>To see a mink in your dream symbolizes value, warmth, riches, or luxury. It also represents your understanding of your subconscious and its motivation.<\/p>"
    },
    {
        "title": "Minotaur",
        "desc": "<p>To see a minotaur in your dream denotes a union between your intelligence and your instincts. Alternatively, the dream refers to a situation in your waking life which may be larger than you can handle. You are feeling overwhelmed.<\/p>"
    },
    {
        "title": "Minstrel",
        "desc": "<p>Tosee a minstrel in your dream indicates the start of some new journey or life path.<\/p>"
    },
    {
        "title": "Mint",
        "desc": "<p>Tosmell or taste mint in you dream suggests that there is a calming influence in your life. You may be too overexcited or hyperactive and need to relax. Alternatively, the dream refers to a situation or relationship that you need to soothe over. Perhaps it is time to make amends.<\/p><p>To eat a breath mint in your dream indicates that you are trying to phrase your thoughts in a way that is going to be presentable or more palatable. Alternatively, a breath mint may mean that you have said something that has offended someone.<\/p>"
    },
    {
        "title": "Minuet",
        "desc": "<p>Tosee a minuet in your dream signifies pleasant surroundings and joyous friendships.<\/p><p>To dream that you are dancing in a minuet indicates domestic bliss and prosperity.<\/p>"
    },
    {
        "title": "Miracle",
        "desc": "<p>To see a miracle in your dream suggests that you are goal-oriented and plan for the future.You have a lot of confidence in your accomplishments.<\/p>"
    },
    {
        "title": "Mirage",
        "desc": "<p>To see a mirage in your dream represents your disillusionment. What you think is true about others may turn out to be the contrary.<\/p>"
    },
    {
        "title": "Mire",
        "desc": "<p>Todream that you are going through a mire signifies a minor interruption in your plans.<\/p>"
    },
    {
        "title": "Mirror",
        "desc": "<p>To dream of your own reflection in the mirror suggests that you are pondering thoughts about your inner self. The reflection in the mirror is how you perceive yourself or how you want others to see you. You may be contemplating on strengthening and changing aspects of your character.<\/p><p>To dream that you do not see your reflection in a mirror implies that you have lost your self-identity. Perhaps you have changed for the benefit of others that you don't know who you are anymore.<\/p><p>To dream that you are looking through a two-way mirror indicates that you are coming face to face with some inner or worldly issue. What you see is related to your persona and subconscious. Seeing images through the mirror may be a safe way for you to consider and\/or confront material from your subconscious. Mirrors symbolize the imagination and the link between the conscious and subconscious.<\/p><p>If you are being watched through a two-way mirror, then it suggests that you feel you are being scrutinized and criticized. Alternatively, the dream means that you are unwilling to acknowledge your subconscious emotions.<\/p><p>To see a mirror in your dream symbolizes a loved one or good friend. Dreaming about a mirror is also symbolic of the truth.<\/p><p>To break a mirror in your dream suggests that you are breaking an old image of yourself. You may be putting an end to an old habit. Breaking a mirror is also an old symbol for seven years of bad luck.<\/p><p>To see a cracked or broken mirror in your dream. represents a poor or distorted self-image. Alternatively, it means that you have put an end to your old habits and ways.<\/p><p>To see a fogged mirror in your dream signifies a hazy concept of who you are and confusion in your life goals. You are lacking clarity and purpose and questioning your self-identity.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/r.htm#Reflection\">Reflection.<\/p>"
    },
    {
        "title": "Mirror Room",
        "desc": "<p>To dream that you are in a mirror room suggests that you are losing your sense of self and identity. You are feeling lost and do not know which way you are going.<\/p>"
    },
    {
        "title": "Miscarriage",
        "desc": "<p>Todream that you have a miscarriage suggests that some idea or plan did not go as expected. The dream may also serve as a warning against your continued course of action. You need to alter your path or risk losing something of significance and value to you. Alternatively, the dream indicates that you have been wronged in some way.<\/p><p>If you are currently pregnant, then dreams of miscarriages are common in the second trimester of pregnancy.<\/p>"
    },
    {
        "title": "Miscommunication",
        "desc": "<p>Todream about a miscommunication indicates waking difficulties in expressing yourself and in getting your point across. You are suffering from feelings of inadequacy.<\/p>"
    },
    {
        "title": "Miser",
        "desc": "<p>Tosee or dream that you are a miser indicates a low sense of self-worth. You may be limiting yourself and not recognizing your full potential and the resources that are available to you.<\/p>"
    },
    {
        "title": "Mispronounce",
        "desc": "<p>To dream that you are mispronouncing words indicates that you are experiencing some nervousness or excitement about a situation.<\/p><p>To hear words being mispronounced in you dream suggests that you heard something that you wished you didn't hear in the first place. It also points to denial or some misunderstanding. Also onsider the significance of the word being mispronounced.<\/p>"
    },
    {
        "title": "Misshapen",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d.htm#Deformed\">Deformed.<\/p>"
    },
    {
        "title": "Missile",
        "desc": "<p>To see or be attacked by a missile in your dream represents feelings of helplessness and forces beyond your control. Alternatively, a missile may indicate insecurities about sex.<\/p>"
    },
    {
        "title": "Missing",
        "desc": "<p>To dream that you are missing something denotes a sense of being out of control and being disorganized.<\/p><p>Dreaming that someone is missing represents some unresolved issues or feelings pertaining to the missing person. Consider what aspect of that person you are missing within your own self. Alternatively, the dream may be on pun that you are missing her or him.<\/p>"
    },
    {
        "title": "Missionary",
        "desc": "<p>Todream that you are doing missionary work implies that it is time for you to define and set your own goals. Alternatively, the dream may be about your desire to help others or give back.<\/p>"
    },
    {
        "title": "Mist",
        "desc": "<p>Todream that you are caught in a mist indicates that there is some confusion and uncertainty in your waking life. You need some clarity in a situation.<\/p>"
    },
    {
        "title": "Mistake",
        "desc": "<p>To dream that you make a mistake indicates that you are doubting yourself in the choices and decisions you are making.<\/p>"
    },
    {
        "title": "Mistletoe",
        "desc": "<p>Tosee mistletoe in your dream symbolizes joyous occasions and happiness. Alternatively, the dream suggests that you need to let go of your inhibitions. Perhaps you are attracted to someone around you and it is time to act on it.<\/p>"
    },
    {
        "title": "Mistress",
        "desc": "<p>To dream that you (or your mate) have a mistress refers to your subconscious desire to end your current relationship. You are trying to sabotage your relationship in some way. Alternatively, the dream indicates that you are feeling neglected in the relationship. Perhaps you feel that you are not measuring up to the expectations of others, especially to your mate.<\/p><p>To dream that you are a mistress indicates your desires for the finer things in life.<\/p><p>To see a mistress in your dream suggests that you or someone is being lured or tempted into some negative activity.<\/p>"
    },
    {
        "title": "Misunderstanding",
        "desc": "<p>Todream that you are being misunderstood reflects a waking situation where you feel powerless and frustrated. You are having difficulties expressing your thoughts and ideas.<\/p>"
    },
    {
        "title": "Mittens",
        "desc": "<p>To see or dream that you are wearing mittens suggest that you are handling things in a childish manner.<\/p>"
    },
    {
        "title": "Mixer",
        "desc": "<p>Tosee or use a mixer in your dream suggests that you are getting &quot;mixed&quot; up about something. Perhaps you are experiencing mixed feelings about something or someone.<\/p>"
    },
    {
        "title": "Mixing",
        "desc": "<p>To dream that you are mixing something signifies a blending of opposite ends of your personality. You are trying to be more yielding and more flexible. Alternatively, the dream indicates that you are trying to combine different aspects of your life while keeping everyone happy at the same time.<\/p>"
    },
    {
        "title": "Moaning",
        "desc": "<p>Tohear moaning or dream that you are moaning suggests that you need to be more vocal about your feelings, particularly what makes your happy and what makes unhappy. The moaning in your dream may be a way for your subconscious to draw your attention to a particular situation or issue that is not going well.<\/p>"
    },
    {
        "title": "Moat",
        "desc": "<p>To see a moat in your dream suggests that you have put up an emotional wall around you. You are shutting others out and blocking out some hurt.<\/p>"
    },
    {
        "title": "Mob",
        "desc": "<p>To see a mob in your dream represents chaos and disorganization. Your are experiencing a conflict in ideas and interest. It is time to be more assertive and take control of your life.<\/p>"
    },
    {
        "title": "Moccasins",
        "desc": "<p>Tosee or wear moccasins in your dream signify your respect for nature and its beings. It also suggests that you walking peacefully or treading lightly on some situation.<\/p>"
    },
    {
        "title": "Mocking",
        "desc": "<p>To dream that you are mocking someone indicates an aspect of yourself that you are ashamed of. Consider what aspects of yourself that you see in this person.<\/p><p>To dream that someone is mocking you or making fun on you indicates that you are suffering from low self-esteem. Perhaps you are too overly worried with what people say about you.<\/p>"
    },
    {
        "title": "Mockingbird",
        "desc": "<p>Tosee or hear a mockingbird in your dream represents cockiness, cleverness, or independence. Alternatively, the dream indicates that you are taking credit for the work of others. You also have a tendency to get what you want.<\/p>"
    },
    {
        "title": "Model",
        "desc": "<p>Tosee or dream that you are a fashion model represents an image that you want to portray. You are trying to be someone or something that you are not. Alternatively, it symbolizes your idea of beauty. You are striving for something that you cannot attain.<\/p><p>To see or build a model vehicle in your dream indicates that you are going through a new developmental phase in your life. You are laying out a plan.<\/p><p>To see a cardboard or clay model in your dream means that you will achieve great success. You proceed toward your goals in a careful and deliberate manner.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c3.htm#Catwalk\">Catwalk.<\/p>"
    },
    {
        "title": "Modem",
        "desc": "<p>To see or use a modem in your dream represents communication. You need to better convey your feelings to others.<\/p>"
    },
    {
        "title": "Modest",
        "desc": "<p>To dream that you are being modest indicates that you need to be less arrogant and\/or assertive in your real-life situations. You need to show more humility and be more even-tempered. Alternatively, the dream suggests that you have some minor concerns about a situation.<\/p>"
    },
    {
        "title": "Moisturizer",
        "desc": "<p>To use or apply moisturizer in your dream represents renewal. You have a fresh outlook in life.<\/p>"
    },
    {
        "title": "Mohawk",
        "desc": "<p>If you don't have a Mohawk in real life, but dream that you or someone has a Mohawk, then it represents non-conventional thinking. You need to start thinking outside the box and reshape the way you see things. Note that your personal associations with Mohawks will play dominantly in the meaning of this dream.<\/p>"
    },
    {
        "title": "Molasses",
        "desc": "<p>Tosee or eat molasses in your dreamsignifies a happy home life and good hospitality. Alternatively, the dream may be a metaphor for some situation or something that is moving slowly.<\/p>"
    },
    {
        "title": "Mold",
        "desc": "<p>Tosee mold in your dream indicates that something in your life has been ignored or is no longer of any use. It may also refer to the negative emotions that are expanding and growing in your subconscious. You need to find a productive way to express them before it grows out of control. Alternatively, the mold may also represent transformation. If you dream that you are scrubbing mold, then it means that you need to rid yourself of the negative and pessimistic attitude.<\/p><p>If there is mold growing on your food, then it implies that you are too easily susceptible to some negative energy around you.<\/p><p>To see a clay or plastic mold in your dream implies that you are lacking creativity. Perhaps you are too rigid in your thinking. If the mold is broken, then it suggests that you need to break away from your old habits and explore new ideas. In particular, dreaming of a mold of a key means a lack of privacy in some area of your life. You feel exposed.<\/p>"
    },
    {
        "title": "Mole",
        "desc": "<p>Tosee a mole in your dream represents destruction and unforeseen danger. You are secretly plotting against others or someone else is working against you. Someone around you has their own hidden agenda. Alternatively, a mole is symbolic of your subconscious drives. You need to delve deeper and uncover what is going on.<\/p><p>To dream that you have a mole on your face or body suggests that something is interfering with your personal esteem. You are unable to gain the esteem of others. In particular, dreaming that there are moles on your arms mean that you are lacking confidence in what you are doing.<\/p>"
    },
    {
        "title": "Molestation",
        "desc": "<p>To dream that you are being molested suggests that are being taken advantage of or feeling violated in some way. Dreams of being molested is often a symptom of post traumatic stress. If you have been molested in real life, then you need to seek professional help to deal with the issue.<\/p>"
    },
    {
        "title": "Molt",
        "desc": "<p>To dream that a snake is molting or shedding means that a person cannot change who they are no matter how hard they may try.<\/p><p>Dreaming that an insect is molting implies pressures about your weight and body issues. Perhaps there is an article of clothing that you are trying to fit into.<\/p>"
    },
    {
        "title": "Mona Lisa",
        "desc": "<p>To see the Mona Lisa in your dream indicates that you are feeling indifferent about a situation. You are trying to separate your emotions from some circumstance. Alternatively, the dream may just indicate your fascination with art and the desire to understand the Mona Lisa.<\/p><p>To dream that the Mona Lisa painting has been defaced suggests that you are feeling frustrated in some relationship. You are experiencing mixed feelings.<\/p>"
    },
    {
        "title": "Monastery",
        "desc": "<p>To dream that you are at a monastery indicates that you need to learn and explore more about yourself, especially the masculine side. It is a time for self-reflection and self-exploration. Perhaps you need to address some pent up aggression or you need to show more sensitivity. Alternatively, a monastery is symbolic of lacking sexuality. You are missing your other, better half.<\/p>"
    },
    {
        "title": "Monday",
        "desc": "<p>To dream of Monday signifies the start of some project or task. You are ready to face your problems head on.<\/p>"
    },
    {
        "title": "Money",
        "desc": "<p>To see or win money in your dream indicates that success and prosperity is within your reach. Money represents confidence, self-worth, success, or values. You have much belief in yourself.Alternatively, dreaming about money refers to your attitudes about love and matters of the heart. It is a common symbol for sexuality and power. In particular, finding money indicates your quest for love or for power.<\/p><p>To dream that you lose money suggests that you are lacking ambition, power and self-esteem. You are experiencing unhappiness and setbacks in your waking life. You may also be feeling weak, vulnerable, and out of control in your waking life.<\/p><p>To give or spend money in your dream is analogous to giving love. You are looking for love. To see others giving money away suggests that you are feeling ignored, overlooked or neglected. Someone is not paying enough attention and showing enough affection toward you.If you are hogging or hoarding money, then it denotes insecurity or selfishness.<\/p><p>To dream that you have no money indicates a fear of losing your place in the world. You are lacking the abilities needed to achieve some desired goal. If you are borrowing money in your dream, then it suggests that you are overextending your resources. You are spreading yourself too thin.<\/p><p>To dream that you steal money forewarns that you are in danger. You need to be more cautious. On a positive note, the dream indicates that you are finally going after what you want in life. Alternatively, stealing money means that you are lacking love. You are desperate to be accepted.<\/p><p>To dream that you receive the wrong amount of change depends on whether you were shortchanged or not. If you were shortchanged, then it is analogous to low self-esteem issues. You feel unworthy. If you receive more change than you were due, then it signifies your inflated ego. You feel entitled to certain things.<\/p><p>Dreaming of money with blood on it means that you are achieving certain gains at the expense of someone else's livelihood. Your dream may indicate your guilt about accepting something that you know was wrong.<\/p>"
    },
    {
        "title": "Mongoose",
        "desc": "<p>To see a mongoose in your dream suggests that you putting up a defensive wall in an effort to hide your anxieties or shortcomings. You may also be struggling through issues with your sexuality.<\/p>"
    },
    {
        "title": "Monitor",
        "desc": "<p>To see a computer monitor in your dream refers to your thought process and rational thinking. If the monitor flickers or blacks out, then it suggests that you are looking at a problem all wrong. You need to re-evaluate the issue.Alternatively, the dream may be a pun on your need to &quot;monitor&quot; or keep track of a situation, issue or problem.<\/p><p>To see a monitor lizard in your dream represents change and agility. It also indicates your objectivity in a situation.<\/p>"
    },
    {
        "title": "Monk",
        "desc": "<p>Tosee a monk in your dream signifies devotion, faith, and spiritual enlightenment.<\/p><p>To dream that you are a monk symbolizes the introspective aspect of yourself. You need to emotionally withdraw yourself from a situation in order to regain some control, structure, and order.<\/p>"
    },
    {
        "title": "Monkey",
        "desc": "<p>To see a monkey in your dream symbolizes deceit, insight and intuition. Those around you are working to advance their own interest. Alternatively, monkeys indicate an immature attitude, a playful nature and the mischievous side of your personality.<\/p><p>To see a monkey hanging or swinging from a tree suggests that you are feeling troubled by some issue.<\/p><p>Dreaming that you are attacked by a monkey indicates conflict between your serious and playful side. Perhaps you are procrastinating too much. Alternatively, the dream may mean that you are struggling with keeping your animalistic desires in check.<\/p><p>To dream of a dead monkey implies that it is time to get serious. You need to focus on some important or urgent issue.<\/p><p>To dream that you are feeding a monkey means betrayal by someone whom you thought cared about your interests.<\/p><p>Also consider the significance of the Three Mystic Monkeys who cover their eyes, ears and mouth to mean that they see no evil, hear no evil and speak no evil.<\/p>"
    },
    {
        "title": "Monkey Bars",
        "desc": "<p>To see or play on the monkey bars in your dream denotes the carefree nature of childhood. Alternatively, it represents your strength, competence, determination and ability to achieve your goals. Don't give up.<\/p>"
    },
    {
        "title": "Monopoly",
        "desc": "<p>Toplay monopoly in your dream signifies your business dealings and your aspirations for success. Perhaps you are undertaking some business endeavor or venture where a lot of money is at stake. The dream may also be a pun on how you or someone is monopolizing your time, a discussion or your finances.<\/p>"
    },
    {
        "title": "Monster",
        "desc": "<p>Todream that you are chased or followed by a monster represents aspects of yourself that you find repulsive and ugly. You may possess some fears or some repressed emotions. Try to confront the monster in your dream and figure out who or what aspect of yourself the monster represents.<\/p><p>To dream that you kill a monster means that you will successfully overcome your rivals and advance to a higher position.<\/p><p>To turn into a monster in your dream suggests that you are becoming someone who you are ashamed of or someone who you longer recognized. Or the dream may also be showing your true character. Perhaps you need to change your attitude or ways.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/chasedreams.pl?method=exact&amp;header=dreamid&amp;search=chasedream6\">Monsters On Bikes&quot;<\/p>"
    },
    {
        "title": "Monument",
        "desc": "<p>Tosee a monument in your dream signifies your legacy and how you want to be remembered. It also symbolizes your self-worth and the qualities you value in yourself.<\/p>"
    },
    {
        "title": "Mood Ring",
        "desc": "<p>To see or wear a mood ring in your dream indicates that your feelings are being dictated by some outside forces. You are too moody. Or it may mean that you need to express your emotions more freely and openly, instead of keeping it all inside. Consider the color of the mood ring and how it reflects your waking mood. Blue means that you are feeling calm and relaxed. Red or purple signifies joy and love. Green represents balance and harmony. Yellow or orange suggests tension or excitability. Brown denotes your nervousness or irritability about something. And black means you are feeling sad, indifferent or cold.<\/p>"
    },
    {
        "title": "Moon",
        "desc": "<p>Tosee the moon in your dream represents some hidden, mysterious aspect of yourself. It is often associated with the feminine mystique and intuition. Alternatively, the moon signifies your changing moods.If you see two moons in your dream, then it indicates that you are being pulled in two different directions. It also represents the extremes of two things. If you see five moons in your dream, then it points to mass chaos or confusion occurring in your life. It is also an indication that your intuition or instinct is very strong and that you need to follow it.<\/p><p>To see the eclipse of the moon in your dream signifies that your feminine side is being overshadowed.Or it may mean that some hidden aspect of yourself is coming to the surface.<\/p><p>To see the crescent moon in your dream indicates cyclic changes, renewal, and movement. You are progressing smoothly toward your life path. A full moon signifiescompletion and wholeness, while a new moon symbolizes new beginnings.<p>To dream that you jump and touch the moon refers to your ambition. When it comes to your goals and aspirations, you aim high. You can do anything if you set your mind to it.<p>Dreaming that an asteroid hits the moon and causes it to explode implies that the craziness in your life is getting out of control. You are giving in too much into your impulses.<p>If you see a blood moon in your dream, then it points to some difficulty or some sort of hardship headed your way. Alternatively, dreaming about a blood moon represents the end of a relationship, a situation or some issue."
    },
    {
        "title": "bow",
        "desc": "<p>To see a moonbow in your dream is symbolic of a spiritual or emotional connection within your personal relationship or religious beliefs.<\/p><p>Dreaming of an all white rainbow signifies heightened spirituality and purity.<\/p>"
    },
    {
        "title": "Moonlight",
        "desc": "<p>To dream of the moonlight symbolizes an emotional breakthrough. The dream is offering you reassurance that you are headed on the right track in your dark times.<\/p>"
    },
    {
        "title": "Moonstone",
        "desc": "<p>To see or wear moonstone in your dream symbolizes wealth, prosperity and luck.<\/p>"
    },
    {
        "title": "Moonwalk",
        "desc": "<p>To dream that you are moonwalking indicates that something or someone is holding you back, but you have yet to realize it. You are being prevented from moving forward and pursuing your goals. Alternatively, dreaming that you are doing the moonwalk suggests that you need to back off of a fight or situation.<\/p>"
    },
    {
        "title": "Moor",
        "desc": "<p>To dream that you are in a moor indicates that you are feeling overwhelmed by the negativity around you. Others are dragging you down. Alternatively, the dream may be a pun on &quot;more&quot;. Is there something in your life where you are in need of more?<\/p>"
    },
    {
        "title": "Moose",
        "desc": "<p>To see a moose in your dream represents long life and longevity. It may refer to the elders around you. Alternatively, a moose indicates that you can be both powerful and gentle. You exert your power only when it is necessary.<\/p>"
    },
    {
        "title": "Mop",
        "desc": "<p>Todream that you are mopping suggests that you are ready to let go something. It is time to release your emotions and express it in a productive way.<\/p><p>To see a mop in your dream symbolizes domesticity and the monotony of your daily routine. Perhaps you are searching for a little more variety or excitement. Alternatively, the dream expresses your desires to want things to be neat and clean. You realize that it takes work to maintain and keep a household together.<\/p>"
    },
    {
        "title": "Morgue",
        "desc": "<p>Todream that you are in a morgue refers to some shocking and dreadful news that you are about to receive. Alternatively, the dream means that you are ready to put the past to rest.<\/p>"
    },
    {
        "title": "Morning",
        "desc": "<p>To dream that it is morning suggests that fortune and pleasure are within near reach. It also denotes new beginnings, renewal, an awakening or starting over. Alternatively, the dream may also be a pun on &quot;mourning&quot;. Are you grieving over something or someone? In particular, if the morning is cloudy, then it signifies an important situation that will burden you for a while.<\/p>"
    },
    {
        "title": "Morning Glory",
        "desc": "<p>To see a morning glory in your dream symbolizes a bright, fresh start to your day. It is a new day and a new beginning.<\/p>"
    },
    {
        "title": "Morocco",
        "desc": "<p>Tosee morocco in your dream suggests that help will come from someone whom you least expect.<\/p>"
    },
    {
        "title": "Morose",
        "desc": "<p>Todream that you or someone is morose refers to your pessimistic view of the world around you. You constantly find things going wrong. Alternatively, the dream indicates unpleasant situations and disagreeable companions.<\/p>"
    },
    {
        "title": "Morph",
        "desc": "<p>Todream that you or someone is morphing into another person suggests that you need to incorporate aspects of this other person into your own character. You are in need of a major change in your life. Alternatively, you need to learn to see things from someone else's perspective and expand your awareness.<\/p><p>To dream that you are morphing into an animal suggests that you need to express yourself more freely and without restraint.<\/p><p>To dream that something is morphing into something else that morphs into something else represents your indecision or your ever changing attitudes toward some situation or issue. It also means that you are looking at something from a new angle or different perspective. Consider the significance of each morphed object.<\/p>"
    },
    {
        "title": "rphine",
        "desc": "<p>Todream that you are taking morphine represents your disconnection from reality. You are experiencing some painful issues that you refuse to confront.<\/p>"
    },
    {
        "title": "Morse Code",
        "desc": "<p>To use or hear Morse code in your dream suggests that you are lacking communication skills. You need to express your feelings and emote. Alternatively, the dream indicates that you need to be more direct some matter.Get to the point.<\/p>"
    },
    {
        "title": "Mortarboard",
        "desc": "<p>Tosee or wear a mortarboard in your dream represents education and learning. It also refers to your achievements. Perhaps there is a lesson that you need to learn.<\/p>"
    },
    {
        "title": "Mortgage",
        "desc": "<p>Todream that you hold a mortgage indicates that you are maximizing your energies and putting it toward worthwhile pursuits. If you are worried about your mortgage in waking, then the dream may highlight your financial concerns.<\/p>"
    },
    {
        "title": "Mortify",
        "desc": "<p>Todream that you are feeling mortified suggests that you are feeling anxious about some event or task in your waking life. Such dreams are often blown out of proportion.<\/p>"
    },
    {
        "title": "Mortuary",
        "desc": "<p>To see or dream that you are in a mortuary suggests that you are hindering your own self-growth by not utilizing your abilities and talents. Alternatively, it represents aspects of yourself that you need to discard and get rid of.<\/p>"
    },
    {
        "title": "Mosaic",
        "desc": "<p>To see a mosaic in your dream represents the various aspects and components that make up life as a whole. You need to consider things from a wider perspective. Things may look insignificant and meaningless up close, but you need to stand back and consider the overall picture.<\/p>"
    },
    {
        "title": "Moses",
        "desc": "<p>To see Moses in your dream signifies personal gains and self gratification.The difficult times will soon be over.<\/p>"
    },
    {
        "title": "Mosh Pit",
        "desc": "<p>To dream that you are moshing or in a mosh pit implies that you are being slammed with responsibilities, deadlines or problems. Areas of your life are out of control.<\/p><p>To see a mosh pit in your dream refers to some uncontrollable energy.<\/p>"
    },
    {
        "title": "Mosque",
        "desc": "<p>To dream that you are in a mosque symbolizes your faith, personal religious beliefs and the divine. It also denotes a sense of community. If you are praying in a mosque, then it implies doubt in the choices that you are making. You are looking for guidance and reassurance.<\/p>"
    },
    {
        "title": "Mosquito",
        "desc": "<p>Tosee mosquitoes in your dream suggest that some situation or someone has been draining you of your energy and resources. Alternatively, mosquitoes indicate that your resistance to attacks will be in vain.<\/p><p>To dream that you are killing mosquitoes denote that you will eventually overcome your obstacles. Happiness and fortune will be in your grasp.<\/p>"
    },
    {
        "title": "Moss",
        "desc": "<p>Tosee moss growing in your dream indicates an extremely slow progress in some project or relationship. You need to be more patient.<\/p>"
    },
    {
        "title": "Motel",
        "desc": "<p>To see or live in a motel in your dream represents your potential to achieve your goals. You are going through a transitional phase.<\/p>"
    },
    {
        "title": "Moth",
        "desc": "<p>Tosee a moth in your dream indicates that some unseen irritation may not surface until it is too late. It is important to pay attention to the minor details and not to overlook certain things. Alternatively, the moth symbolizes your weaknesses, character flaws or fragileness.<\/p>"
    },
    {
        "title": "Mothball",
        "desc": "<p>To see mothballs in your dream indicate that you are trying to repel some destructive forces or rid yourself of harmful behaviors. Alternatively, the dream refers to some hidden ability or latent knowledge that you need to acknowledge or bring to the surface.<\/p>"
    },
    {
        "title": "Mother",
        "desc": "<p>Tosee your mother in your dream represents the nurturing aspect of your own character. Mothers offer shelter, comfort, life, guidance and protection. Some people may have problems freeing themselves from their mothers and are thus seeking their own individuality and development.<\/p><p>To dream that you are having sex with your mother implies that you are becoming like your mother. No matter how hard you try to deny it, you feel her influence. The dream may also be a graphic way of how you need to incorporate some of her qualities within your own self.<\/p><p>To dream that you are having a conversation with your mother denotes a matter that has preoccupied your mind and you are not sure how to deal with it in your waking life. It indicates unresolved problems that need to be worked out with your mother.<\/p><p>To hear your mother call you in your dream suggests that you have been negligent in your duties and responsibilities. You are pursuing down the wrong path.<\/p><p>To dream that you are being told that your mother is dead means that you are feeling neglected. You feel that your mother or some motherly figure in your waking life is not being responsive to your needs. She is not showing enough compassion or other emotions.<\/p><p>If you are not a mother in your waking life, but dream that you are a mother, then the dream is a metaphor that you need to show more of your nurturing and caring nature. You need to be more compassionate. Perhaps you are coming across as too indifferent.<\/p><p>Dreaming about your friend's mother symbolizes your idealistic notions of what a mother should be. More directly, your friend's mother may be a motherly figure for you. Perhaps she offered you advice or comfort in your time of need.<\/p>"
    },
    {
        "title": "herboard",
        "desc": "<p>To see a motherboard in your dream refers to the steps and processes that need to be completed in order to produce a desired outcome. Some project that you are working on requires cohesive action. Alternatively, a motherboard is symbolic of something in your life that is keeping everything or everyone together.<\/p>"
    },
    {
        "title": "Mother-In-Law",
        "desc": "<p>Tosee your mother-in-law in your dream implies that there is some unresolved issue or inner turmoil that you need to work through. Your waking relationship with your mother-in-law will prevail in this interpretation.<\/p>"
    },
    {
        "title": "Mother Of Pearl",
        "desc": "<p>To see or wear mother of pearl in your dream symbolizes renewal, birth and fertility.Alternatively, the dream is telling you to be more focused on your tasks or goals.<\/p>"
    },
    {
        "title": "Mother Teresa",
        "desc": "<p>To see Mother Teresa in your dream suggests that you need to show more sympathy, compassion and kindness.<\/p>"
    },
    {
        "title": "Motor Home",
        "desc": "<p>To dream that you live in a motor home suggests that you need to move on with regards to some aspect of your life. You are dwelling too much on a situation; it is time to move forward. Alternatively, the motor home expresses your desire to be more independent and self-sufficient.<\/p>"
    },
    {
        "title": "torboat",
        "desc": "<p>To see or dream that you are in a motorboat or speedboat suggests that you do not like to dwell on your emotions. You move quickly from one situation or relationship to another.<\/p><p>Dreaming that you are being pulled by a motorboat means that your are not holding yourself accountable for how you are acting or feeling. You are letting circumstances dictate your emotions. You need to think through your actions before you act.<\/p>"
    },
    {
        "title": "torcade",
        "desc": "<p>To see a motorcade go by in your dream indicates that you are distracted from going after your own goals. You are too overly concerned about what others are thinking and doing.<\/p><p>Dreaming that you are part of a motorcade highlights your importance in some decision. You are part of a team. Alternatively, being in a motorcade suggests that you are going with the masses and doing what everybody else wants you to do.<\/p>"
    },
    {
        "title": "Motorcycle",
        "desc": "<p>To see or ride a motorcycle in your dream symbolizes your desire for freedom and need for adventure. You may be trying to escape from some situation or some other responsibility in your waking life. Alternatively, a motorcycle is symbolic of raw sexuality. Perhaps you are moving too fast.<\/p><p>To see or be in a motorcycle chase in your dream implies that you are avoiding your responsibilities.<\/p>"
    },
    {
        "title": "orcycle Club",
        "desc": "<p>To see a motorcycle club in your dream points to a situation where you feel outnumbered or a situation that is playing on your fears.<\/p><p>Dreaming that you are in a motorcycle club suggests that you have the mindset of being above the law.The dream highlights the primitive, unruly aspect of yourself.<\/p>"
    },
    {
        "title": "Mount Fuji",
        "desc": "<p>To see Mount Fuji in your dream represents an aspect of your life that may be deceivingly calm. It is a place where heaven and earth and fire comes together. Consider an aspect of your life where you are struggling with your spirituality, your practicality and your passions.<\/p>"
    },
    {
        "title": "Mount Olympus",
        "desc": "<p>To see Mount Olympus in your dream indicates that you will overcome your current struggles. Alternatively, the dream refers to your spiritual connection.<\/p>"
    },
    {
        "title": "Mountain Lion",
        "desc": "<p>Tosee a mountain lion in your dream represents lurking danger, aggression and raw emotions. You need to keep your attitude and emotions in check. Alternatively, the mountain lion symbolizes pride and grace.<\/p>"
    },
    {
        "title": "Mountains",
        "desc": "<p>To see mountains in your dream signify many major obstacles and challenges that you have to overcome. If you are on top of the mountain, then it indicates that you have achieved and realized your goals. You have recognized your full potential. Alternatively, mountains denote a higher realm of consciousness, knowledge, and spiritual truth.<\/p><p>To dream that you are climbing a mountain signifies your determination and ambition.<\/p><p>To dream that you fall off a mountain refers to your rush to succeed without thoroughly thinking about your path to success. Perhaps you are being pushed upward into a direction that you do not want to go or that you are not ready for. Falling off a mountain also means that you have a tendency to give up too easily or escape from demanding situations. You take the easy way out.<\/p><p>To dream that you are going around a mountain implies that you are tackling some obstacle in a roundabout manner. You are taking an indirect approach. Alternatively, dreaming of going around the mountain means that you are pacing yourself. You know your limitations.<\/p>"
    },
    {
        "title": "Mourning",
        "desc": "<p>To dream that you are in mourning refers to your inability to let go of the past. You need to clear those old experiences and make way for the new. Alternatively, the dream may mean the contrary and shows how you are able to let go of the past and accept the loss.<\/p><p>Tosee others or dream that you are wearing mourning symbolizes grief, bad luck, and unhappiness. Alternatively, the dream signifies a disturbing influence or some misunderstanding within your social circle.<\/p>"
    },
    {
        "title": "Mouse",
        "desc": "<p>Tosee a mouse in your dream indicates fear, meekness, insignificance and a lack of assertiveness. You are experiencing feelings of inadequacy and fears that you are not measuring up. The dream may be telling you that you are spending too much time hiding in the shadows of someone else. Alternatively, a mouse symbolizes minor irritations and annoyances. Perhaps you are letting petty problems or insignificant issues eat away at you. The dream may also be a pun on a computer mouse and your connection to work or to the virtual world.<\/p><p>To see a dead mouse in your dream implies that you are not letting minor issues bother you. You are not letting your own fears get in the way of what you want. Alternatively, a dead mouse indicates that there is something that you have ignored or neglected for too long.<\/p><p>To dream that you kill or trap a mouse suggests that others are making a big deal out of certain minor issues in your life.<\/p><p>To dream that you or someone is eating a mouse indicates that there is something nagging at your conscience. You need to get it off your chest.<\/p><p>To dream that a mouse is being chased suggests that you are not standing up for yourself. You are letting others push you around.<\/p><p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m2.htm#mice\">Mice.<\/p>"
    },
    {
        "title": "Mouse Hole",
        "desc": "<p>To see a mouse hole in your dream represents a hidden aspect of yourself that you are unwilling to acknowledge or confront. Even though you know that it is unhealthy to avoid this issue, you continue to do so. The issue will only get out of hand if you do not address it.<\/p>"
    },
    {
        "title": "Mouse Trap",
        "desc": "<p>Tosee a mouse trap in your dream suggests that you need to be more cautious. Be leery of people who want to help you. Alternatively, a mouse trap symbolizes ingenuity, insight, and creativity. You need to look at a better way of doing something.<\/p><p>To dream that you are setting a mouse trap indicates that you will outwit your opponents.<\/p><p>To dream that you catch a mouse in a mouse trap suggests that you are being taken advantage of.<\/p>"
    },
    {
        "title": "Mouth",
        "desc": "<p>To see a mouth in your dream signifies your need to express yourself or talk about an issue that's bothering you.Alternatively, the dream suggests that you have said too much and you need to keep your mouth shut.<\/p><p>In particular, to dream that you have dry mouth implies that you are at a lost for words. You are having a problem expressing your feelings. Alternatively, the dream may be a physical reality that you are really thirsty.<\/p><p>To dream that you or someone is covering your mouth means that you are being prevented from fully expressing yourself. It also indicates that you talk too much and need to know when to keep quiet. If you are covering someone's mouth, then it implies fear of being exposed. Or perhaps you are afraid of hearing some truth.<\/p><p>To dream that you are talking with your mouth full implies that you are unable to express yourself effectively. What is inside your mouth is a metaphor for something that you are trying to process or digest.<\/p><p>To dream that you cannot open your mouth suggests that you are speechless over some news. Alternatively, the dream refers to a secret that you must keep. Your inability to open your mouth in your dream is also a variation of REM paralysis and may point to feeling helpless in a situation. No matter how hard you try, you just can't. If you dream that you cannot close your mouth, then it means that there is something that you can no longer keep inside and have to express.<\/p><p>To dream that someone hits you on the mouth indicates that you are prevented from expressing your anger and other negative emotions. Someone is also forcing their views and beliefs on you. If you actually feel pain in your mouth when you wake up, then the &quot;pain&quot; may be as a result of your jaw tensing up during your dream.<\/p><p>To dream that there is blood around your mouth represents the consequences of your words. You may also be feeling guilt over something you said.<\/p>"
    },
    {
        "title": "Mouthwash",
        "desc": "<p>To see or use mouthwash in your dream indicates that you need to literally wash your mouth as a result of something you said. You need to think first before saying something you might regret.<\/p>"
    },
    {
        "title": "Movement",
        "desc": "<p>To see normal movement in your dream represents your ability to cope with various situations. You are able to adapt to the changing environments that you find yourself in.<\/p><p>To see quick, smooth movement in your dream represents self-acceptance or your quick wit. You are able to express your feelings with ease. Alternatively, the dream may be a metaphor telling you that you need to get a move on things.<\/p><p>To see slow, difficult movement in your dream indicates a fear of failure. Something is holding you back and preventing you to take chances.<\/p>"
    },
    {
        "title": "vers",
        "desc": "<p>To see movers in your dream implies that it is time for your to move on from a situation. You need to learn to let go and look toward what is ahead for you.<\/p>"
    },
    {
        "title": "Movie",
        "desc": "<p>To dream that you are watching a movie suggests that you are watching life pass you by. Perhaps you are living vicariously through the actions of others. Consider also how the movie parallels to situations in your waking life. Observe how the characters relate to you and how they may represent an aspect of yourself.<\/p><p>To dream that you are playing a role in the movie foretells that something from your subconscious is about to emerge or be revealed. It may also represent memories of images from your past. Alternatively, the dream may be pointing you toward a new role that you might be undertaking. Your subconscious is psychologically preparing you for this new role.<\/p><p>To dream that the movie screen is blank suggests that you are trying to distance yourself from some issue or emotion. Or you are feeling excluded from some situation. Alternatively, the blank screen symbolizes a lack of accomplishments. You fee that you have nothing to look back on.<\/p><p>If you have a dream where you are part of an existing movie scene, then it implies that a life situation is playing out similarly to the movie scene. You feel connected to the scene. Consider what you are feeling when you watch the scene; it is this feeling that you are lacking or trying to recreate in your waking life. More directly, the dream may just mean that the movie is on your mind a lot or that you have watching too many times.<\/p>"
    },
    {
        "title": "Movie Clapper",
        "desc": "<p>To see or use a movie clapper in your dream symbolizes your quest for fame and glamour. Alternatively, the dream refers to the many chances and opportunities that you come across in life.<\/p>"
    },
    {
        "title": "Movie Set",
        "desc": "<p>To dream that you are on a movie set implies that a situation in your waking life is not what it appears to be. Perhaps you are being mislead. Alternatively, the dream suggests that you or someone is trying to manipulate reality.<\/p>"
    },
    {
        "title": "Movie Theater",
        "desc": "<p>To dream that you are in a movie theater indicates that you are attempting to protect yourself from your emotions and\/or actions. Viewing them on a movie screen projects them onto another person and thus makes those feelings and actions seem more distant. Your subconscious is trying to protect you from experiencing them directly.<\/p>"
    },
    {
        "title": "Moving",
        "desc": "<p>To dream that you are moving away signifies your desire or need for change. It may also mean an end to a situation or relationship; you are moving on. Alternatively, it indicates your determination and issues regarding dependence\/independence.<\/p><p>To dream that you are helping someone move indicates that you are afraid of change. You are not quite ready to confront some new situation by yourself. Alternatively, to help someone move implies acceptance of some new change, even though you may not agree with it.<\/p><p>To dream that your ex is moving in with you indicates that you are still holding onto some aspect of the relationship. You have not fully let go.<\/p>"
    },
    {
        "title": "Mow",
        "desc": "<p>To dream that you are mowing the lawn suggests that you to need make some major reevaluations of your goals and life path.<\/p>"
    },
    {
        "title": "MTV",
        "desc": "<p>To dream that you are watching MTV suggests that you are watching too much MTV. It is effecting your thinking and clouding your judgment. Consider what show you are watching and how it parallels a certain aspect of your waking life.<\/p>"
    },
    {
        "title": "Mucus",
        "desc": "<p>To see or cough mucus in your dream represents cleansing and releasing of suppressed thoughts. You feel you are able to express yourself. Alternatively, the dream implies that something or someone is trying to hold you back.<\/p>"
    },
    {
        "title": "Mud",
        "desc": "<p>Tosee mud in your dream suggests that you are involved in a messy and sticky situation. It also suggests that some spiritual cleansing is needed.<\/p><p>To dream that you are walking in mud suggests that you are feeling weighed down by a situation, problem, or relationship. You are feeling frustrated.<\/p><p>To dream that mud has gotten on your clothing means that your reputation is being attacked and called into question. Consider the term &quot;mud-slinging&quot; to refer to some politicians.<\/p>"
    },
    {
        "title": "Mud Flaps",
        "desc": "<p>To see mud flaps in your dream means that you need to shield others from your drive and ambition. Your ambition tends to draw people away from you.<\/p>"
    },
    {
        "title": "Muff",
        "desc": "<p>Todream that you are wearing a muff signifies a solid foundation of fortune. Alternatively, it reflects your tendency to do things at the spur of the moment without thinking it through.<\/p>"
    },
    {
        "title": "Muffin",
        "desc": "<p>To dream that you are baking muffins represent your hard work and your devotion to your work. You will reap the fruits of your labor.<\/p><p>To see or eat a muffin in your dream signifies your taste for exquisite and expensive things in life. As a term of endearment, the dream may also refer to your loved one.<\/p>"
    },
    {
        "title": "Mug",
        "desc": "<p>To see or use a mug in your dream represents love nurturance and the womb. The mug also signifies rejuvenation and healing.Alternatively, it indicates a transcendence into a realm of higher consciousness. The mug may also be a pun on your face or that you are &quot;mugging&quot; for attention.<\/p><p>To see or use an insulated mug in your dream suggests that you are trying to keep a certain feeling or hope alive. You want to keep an idea &quot;hot&quot; or a project on track. Negatively, the dream means that you may be trying to hold onto something too long and it may be time to let go.<\/p>"
    },
    {
        "title": "Mugging",
        "desc": "<p>To dream that you have been mugged suggests that you are suffering from an identity crisis. Perhaps you have done something or being asked to do something that is out of character. Alternatively, the dream represents your fears of losing something that is important to you. The mug may also be a pun on your face or that you are &quot;mugging&quot; for attention.<\/p>"
    },
    {
        "title": "Mugshot",
        "desc": "<p>Tosee or dream that you are taking a mugshot indicates that you need to face up to your responsibilities and acknowledge the mistakes you have made.<\/p>"
    },
    {
        "title": "Mulberry",
        "desc": "<p>Tosee or eat mulberries in your dream indicate that an unexpected obstacle is causing a major setback toward your goals.<\/p><p>To see a mulberry tree in your dream represents protection from some negative force in your waking life. It also signifies sensuality.<\/p>"
    },
    {
        "title": "Mulch",
        "desc": "<p>To see or lay out mulch in your dream indicates that you are putting up some sort of protective layer or emotional barrier.<\/p>"
    },
    {
        "title": "Mule",
        "desc": "<p>Tosee a mule in your dream represents your stubbornness and unyielding personality. You are overbearing, rebellious and unwilling to cooperate with others. Alternatively, the mule also symbolizes menial work and suffering. You may be feeling overburdened or stressed. If the mule is dead, then it denotes that your party hearty attitude will lead to unrestrained immorality.<\/p><p>To dream that you are riding a mule denotes that you are undertaking responsibilities that will give you a lot of anxiety.<\/p><p>To dream that you are kicked by a mule refers to the anxiety and fear that you are experiencing, as a result of some guilt or wrongdoing.<\/p>"
    },
    {
        "title": "Mummy",
        "desc": "<p>Tosee a mummy in your dream suggests that you are feeling trapped in a situation. You feel that you are not being heard.<\/p>"
    },
    {
        "title": "Mumps",
        "desc": "<p>To dream that you have the mumps suggest that you are unable to communicate your point across. Your voice is not being heard. Alternatively, it indicates pent up frustration and anger.<\/p>"
    },
    {
        "title": "Murder",
        "desc": "<p>To dream that you have committed a murder indicates that you are putting an end to an old habit and a former way of thinking. This could also refer to an end to an addiction. Alternatively,the dream indicates that you have some repressed aggression or rage at yourself or at someone. Note also that dreams of murder occur frequently during periods of depression.<\/p><p>To dream that you witness a murder indicates deep-seated anger towards somebody. Consider how the victim represents aspects of yourself that you want to destroy or eliminate.<\/p><p>To dream that you are murdered suggests that some important and significant relationship has been severed. You are trying to disconnect yourself from your emotions. The dream may also be about your unused talents.<\/p><p>*Please also see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/k.htm#killing\">Killing See the Meaning In Action:<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=murderdream1\">&quot;Premonition of Murder&quot;<\/p>"
    },
    {
        "title": "Muscle",
        "desc": "<p>To see muscles in your dream symbolize power, strength, and flexibility. You need to develop these qualities within yourself in order to become a more stronger and confident person.<\/p>"
    },
    {
        "title": "Museum",
        "desc": "<p>Tosee a museum in your dream indicates that your non-traditional path to success will make you stand out from the rest. Sometimes you need to take a risk. Alternatively, the museum represents your own personal history. You can learn a lot from your past and your heritage. Consider what you have gained from these experiences and apply them to your current circumstances.<\/p><p>To dream that you are in a museumrepresents the things you value in life.Objects in the museum symbolizes memories and talents. If you dream of being lost in a museum indicates that you are trapped in the past.<\/p>"
    },
    {
        "title": "Mushroom",
        "desc": "<p>To see mushrooms in your dream signify unhealthy pleasures and unwise decisions in your waking life. Things that come too quickly have a tendency to disappear just as quick. Learn to appreciate the things you have. Alternatively, mushrooms symbolize growth despite going through some hardship and difficult period.<\/p><p>To dream that you are eating mushrooms represent your leadership ability. You hold a lot of strength and power.<\/p><p>To dream that you are picking or collecting wild mushroomsrefers to a potentially harmful situation or relationship. You may be expressing doubt in some new endeavor, relationship or situation.<\/p><p>To dream that mushrooms are growing and multiplying in your mouth refers to negative emotions that are literally growing and expanding in your subconscious. You tend to keep your feelings inside and need to find a productive way to express them before it grows out of control.<\/p>"
    },
    {
        "title": "Music",
        "desc": "<p>To hear harmonious and soothing music in your dream signifies prosperity and pleasure. You are expressing your emotions in a positive way. Music serves to heal the soul.<\/p><p>To hear discordant or out of tune music in your dream signifies unhappiness, lack of harmony, and troubles in your relationship or domestic life.<\/p><p>Specific genres of music are personal to every dreamer. For someone who loves country music and hears country music in their dream, the interpretation will be different for someone who hates country music. If the genre of music is something you like, then the music is offering you some advice. If the genre of music you hear in your dream is something you hate, then it means that you are refusing or rejecting some advice.<\/p>"
    },
    {
        "title": "Music Box",
        "desc": "<p>To see or open a music box in your dream represents the things that you treasure and hold dear to your heart. Consider the melody of the music box and what is inside the music box. If the music box is broken, then it means that you are experiencing some heartache.<\/p><p>To hear a music box in your dream indicates a past memory.<\/p>"
    },
    {
        "title": "Music Notes",
        "desc": "<p>To see musical notes in your dream represent harmony or disharmony in your waking life, depending on whether the musical note was a sharp note or flat note. The dream may also be a pun on a note or message from your subconscious.<\/p>"
    },
    {
        "title": "Music Video",
        "desc": "<p>To watch a music video in your dream suggests that you need to interject more excitement and thrill into your life. The dream may serve as a soundtrack of your waking life. Consider the music and imagery of the video and how it parallels your waking life.<\/p><p>To dream that you are making or you are in a music video suggests that you need to be more expressive and imaginative. Consider the type of video you are in.<\/p>"
    },
    {
        "title": "Musical",
        "desc": "<p>To dream that you are watching a musical indicates that you need to be careful not to get carried away by your emotions.<\/p>"
    },
    {
        "title": "Musical Chairs",
        "desc": "<p>To dream that you are playing musical chairs signifies instability in some area of your life. You are feeling uneasy about your position or about some decision you made.<\/p>"
    },
    {
        "title": "Musical Instruments",
        "desc": "<p>To see musical instruments in your dream indicate the expectation of fun and pleasures. You are focused on enjoying life and all that it has to offer. The dream also represents your talents and your ability to communicate with others. Certain musical instruments are symbolic of sexual organs and thus point to your sexuality.If you play a musical instrument in your waking life, then the dream may serve as a rehearsal to improve your technique.<\/p>"
    },
    {
        "title": "ician",
        "desc": "<p>If you are not a musician in your waking life, but dream that you are one, then it implies that you need to be more expressive about your feelings.<\/p><p>To see a dead musician in your dream suggests that you are no longer able to express yourself in the same way as you did in the past.<\/p>"
    },
    {
        "title": "Musk",
        "desc": "<p>To smell musk in your dream denotes that you will find joy in situations where you least expect it.<\/p>"
    },
    {
        "title": "Muskox",
        "desc": "<p>To see a muskox in your dream refers to a relaxed attitude. You don't let trivial things bother you and tend to go with the flow. You are able to handle whatever issues or problems that come your way.<\/p>"
    },
    {
        "title": "Mussels",
        "desc": "<p>To see mussels in your dream indicate that you are closing yourself off and isolating yourself from others. Ask yourself why you are shutting others out. The dream may also be a pun on &quot;muscles&quot;.<\/p>"
    },
    {
        "title": "Mustache",
        "desc": "<p>To dream that you have a mustache when you don't really have one signifies that you are hiding an aspect of yourself. You are putting on a disguise or showing a different aspect of your personality. If you are a woman and dream that you have a mustache, then it indicates that you are expressing your power through your words and your verbal expression.If you dream that you or someone is wearing a fake mustache, then it indicates that you are trying to draw attention away from a minor issue or problem.<\/p><p>To dream that you shave off your mustache denotes that you are revealing your true self. You no longer have to hide under some disguise or some shield. Alternatively, the dream means that you are trying to reestablish your reputation, by renouncing your previous activities.<\/p><p>Dreaming that everyone has a mustache indicates that you are suspicious or untrusting of others.<\/p>"
    },
    {
        "title": "Mustang",
        "desc": "<p>To see a mustang in your dream represents aggression, wildness, lust and untamed sexuality.<\/p>"
    },
    {
        "title": "utant",
        "desc": "<p>Todream that you are a mutant represents undeveloped aspects of yourself that you are ignoring or refusing to confront. Alternatively, to dream that you are mutant means that you need to look at things from a different perspective. There is something in your life that you need to drastically change.<\/p><p>To see a mutant in your dream indicates your fears of things that are different. The dream is trying to teach you to be more open and tolerant of things that you may not be used to.<\/p>"
    },
    {
        "title": "Mustard",
        "desc": "<p>To see mustard growing in your dream signifies success and wealth.<\/p><p>To dream that you are eating mustard seeds indicates regret over your hasty decisions.<\/p>"
    },
    {
        "title": "Mute",
        "desc": "<p>To dream that you are mute indicates that you are afraid to say something for fear of being criticized or judged. There may also be a situation in your waking life that has left you speechless.<\/p>"
    },
    {
        "title": "Mutilate",
        "desc": "<p>To dream that you are being mutilated indicates that there is a waking situation that you need to be careful about. You may be putting yourself in some sort of danger, either physical or mental. If you are mutilating yourself, then it means that you are seeking attention. You are expressing a desperate cry for help. Or you are trying to disconnect yourself from the unbearable pain you are experiencing in an aspect of your life.<\/p><p>To dream that someone or something is mutilated indicates that your integrity is put into question.<\/p>"
    },
    {
        "title": "Muzzle",
        "desc": "<p>To see or use a muzzle in your dream suggests that you need to show better restraint in holding back your anger. Alternatively, the dream indicates that you feel you are unable to fully express yourself.<\/p>"
    },
    {
        "title": "Myrrh",
        "desc": "<p>Tosee myrrh in your dream signifies punishment or suffering. You are undergoing a difficult and tumultuous time.<\/p>"
    },
    {
        "title": "Myrtle",
        "desc": "<p>Tosee a myrtle in your dream symbolizes happiness, peace, prosperity or domestic bliss.<\/p>"
    },
    {
        "title": "Mystery",
        "desc": "<p>Toread or watch a mystery in your dream indicates that you need to be on the lookout for something that is out of place or out of the ordinary. Something is not what it appears to be. Be careful in your dealings.<\/p>"
    }
]