[
    {
        "title": "N",
        "desc": "<p>To see the letter &quot;N&quot; in your dream implies the end of some habit, journey, relationship or condition.<\/p>"
    },
    {
        "title": "Nachos",
        "desc": "<p>To make or eat nachos in your dream signifiesyour need for more leisurely pursuits. You need to take some time out.<\/p>"
    },
    {
        "title": "Nag",
        "desc": "<p>To dream that someone is nagging you suggests that you need to change your attitudes about your preconceived notions. It is time to make some changes in your life.You need to look at things from a different perspective.<p>To dream that you are nagging someone indicates that you need to confront some repressed resentment or unexpressed anger.<\/p>"
    },
    {
        "title": "Nail Clipper",
        "desc": "<p>To see or use a nail clipper in your dream implies that you need to rid something that is holding you back. It is time to move forward and grow.<\/p>"
    },
    {
        "title": "Nail File",
        "desc": "<p>To see a nail file in your dream suggests that you need to smooth out the rough edges of your personality or your relationship with others. You may be a little too harsh and too abrasive toward others.<\/p>"
    },
    {
        "title": "Nail Polish",
        "desc": "<p>To polish your nails in your dream suggests that you need to put more focus onto what you are doing and what you are trying to accomplish.<\/p><p>To dream that you are changing your nail polish color represents your creativeness or emotional nature.<\/p><p>Dreaming that your nail polish is chipped means that your strive for perfection will only leave you disappointed. If you dream that you nail polish is smeared, then it indicates that you are rushing into something.<\/p><p>To notice someone's nail polish in your dream highlights their actions. Perhaps this person is doing something suspicious or doing something exceptionally well. If you do not like wearing nail polish and dream that someone is wearing nail polish, then it indicates that you are bothered or annoyed by their actions. This person may be doing something that you disapprove of.<\/p><p>Look up the color of the nail polish for additional significance. In particular, if you are wearing black nail polish, then it indicates your &quot;don't care&quot; attitude; you are in control. If you are wearing orange colored nail polish, then it means that you are feeling inspired; you are ready to create. If you see clear nail polish in your dream, then it signifies your objectiveness in a situation.<\/p>"
    },
    {
        "title": "Nail",
        "desc": "<p>To hammer nails in your dream represent your tenacity, persistence and ability to drive a hard bargain. Also consider the pun, &quot;getting nailed&quot; which refers to a sexual innuendo or which means getting caught with something. Alternatively, the dream may also point to another popular phrase &quot;hitting the nail on the head&quot;, which suggests that you have fully resolved a situation.<\/p><p>To see nails in your dream symbolize long and hard work for little compensation and pay. It may also be analogous to some rugged or tough force.<\/p><p>To dream that you hurt yourself with a nail suggests that you need to be careful with what you say.<\/p><p>To dream that you are pulling nails out implies that you are not ready to commit to a situation or relationship. If you dream of pulling nails out of a tree, then it highlights some environmental issue that you are concerned about or involved with.<\/p><p>*Please see also: <a href=\"#Fingernails\">Fingernails<\/a>.<\/p>"
    },
    {
        "title": "Naive",
        "desc": "<p>To dream that you are being naive indicates that you may be too trusting. The dream is a wake up call.<\/p>"
    },
    {
        "title": "Naked",
        "desc": "<p>To dream that you are naked denotes fear of being found out and exposed over your activities. You feel that you are being misjudged.<\/p><p>To dream that you suddenly discover your nudity and are trying to cover up signifies your vulnerability to a situation.<\/p><p>To see a naked person in your dream and you are disgusted by it represents some anxiety about discovering the naked truth about that person or situation. It may also foretell of an illicit love affair, a loss of prestige or some scandalous activity. On the other hand, if you are accepting of someone else's nudity, then it implies that you can see right through them and their intentions. Or perhaps, you are completely accepting them for who they are. If you do not care about someone else's nudity, then it suggests that you need to learn not to be afraid of rejection.<\/p><p>To dream that everyone is naked except for you implies that there is something you are hiding from others. It may also mean that you are nervous about something. Alternatively, the dream indicates that you are being overly critical of others. Instead of being accepting, you tend to find flaws in others.<\/p><p>*For an in depth analysis, click on Dream Moods's: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/naked-dreams.html\">Common Dreams: Naked<\/a>.<\/p>"
    },
    {
        "title": "Name",
        "desc": "<p>To dream that you forget your name or someone else's name suggests that you are feeling overwhelmed and burdened. It may also indicate that you have forgotten your true self or your family roots.<\/p><p>To hear your name being called in your dream indicates that you are in touch and in tune with your spirituality. You need to be more aware of your own uniqueness and your individuality. Alternatively, your subconscious may be trying to get your attention about an important message that you are refusing to acknowledge in your waking life.<\/p><p>To see a familiar name written in your dream symbolizes the way you feel about that person. Your intuition about them may turn out to be true.<\/p><p>To dream that you changed your name or are referred to by a different name suggests that you are undergoing some major transformation or metamorphosis in your waking life. You are experiencing a reawakening.<\/p>"
    },
    {
        "title": "Name Badge",
        "desc": "<p>To see or wear a name badge in your dream symbolizes your identity. The dream signifies your desires to reach out to others. Alternatively, the dream represents an unfamiliar situation.<\/p><p>If the name on the badge is not your name, then it means that you are experiencing an identity crisis. Perhaps you are doing something that is out of character. You have lost a little bit of yourself.<\/p>"
    },
    {
        "title": "Nanny",
        "desc": "<p>To see or dream that you have a nanny implies that you are feeling overwhelmed. You feel that certain aspects of yourself are being neglected.<\/p>"
    },
    {
        "title": "Nap",
        "desc": "<p>To dream that you are taking a nap suggests that you need to take a little time off to relax and take it easy. Give yourself a break.<\/p>"
    },
    {
        "title": "Napkin",
        "desc": "<p>To see a napkin in your dream signifies neatness and cleanliness. Alternatively, the dream may be preparing you for some good news.<\/p><p>To see soiled napkins in your dream symbolize some major marital or relationship problem.<\/p>"
    },
    {
        "title": "Narcissus",
        "desc": "<p>To see a narcissus in your dream represents vanity. This dream symbol may be a metaphor for someone in your life who is narcissistic. Alternatively, it symbolizes divine love.<\/p>"
    },
    {
        "title": "Narcoleptic",
        "desc": "<p>To dream that you are narcoleptic suggests that you are oblivious to some situation. Perhaps it is something that you are refusing to see and acknowledge.<\/p><p>Dreaming that someone has narcolepsy implies that you feel he or she is not responding to your needs or that you are not being heard.<\/p>"
    },
    {
        "title": "Narcosis",
        "desc": "<p>To dream that you are under narcosis is an indication that you are trying to suppress your emotions instead of confronting them. You may be trying desperately to avoid a problem or situation in your waking life. Or you may be trying to refuse to take responsibility for your actions.<\/p>"
    },
    {
        "title": "Narcotics",
        "desc": "<p>*Please see: <a href=\"#Drugs\">Drugs<\/a>.<\/p>"
    },
    {
        "title": "Narrow",
        "desc": "<p>To dream about narrow spaces indicate that you are experiencing some struggle in your life journey. You are feeling restricted and confined. Alternatively, the dream may be a metaphor for your narrow-mindedness. Something narrow is also symbolic of female sexuality.<\/p>"
    },
    {
        "title": "NASA",
        "desc": "<p>To dream that you are working at NASA represents possibilities and your desire to explore new things. You do not let boundaries stop you from doing what you want.<\/p>"
    },
    {
        "title": "Nasturtiums",
        "desc": "<p>To see nasturtiums in your dream symbolize patriotism and love of country.<\/p>"
    },
    {
        "title": "National Anthem",
        "desc": "<p>To hear or sing the national anthem of your own country in your dream signifies pride and love of country. It also represents your winning spirit.<\/p>"
    },
    {
        "title": "Native American",
        "desc": "<p>To see a Native American in your dream represents the instinctual and uninhibited aspect of your character. You desire more freedom from cultural and society restraints.<\/p>"
    },
    {
        "title": "Native Country",
        "desc": "<p>To dream about your native country means that you are recognizing your roots and where you came from. You are also reflecting on the decisions you have made along the way and what you have accomplished.<\/p>"
    },
    {
        "title": "Nativity",
        "desc": "<p>To see the nativity in your dream indicates that you have made a startling new discovery about yourself and your capabilities. It also points to the importance of spiritual enlightenment and inner strength as opposed to material richness.<\/p>"
    },
    {
        "title": "Nature",
        "desc": "<p>To dream of nature denotes freedom, tranquility, restoration, and renewal. You are utilizing your instinctual nature.<\/p>"
    },
    {
        "title": "Nausea",
        "desc": "<p>To dream that you have nausea suggests that you are suffering from a situation or condition in which you are trying to escape from.<\/p>"
    },
    {
        "title": "Nautilus",
        "desc": "<p>To see a nautilus in your dream reflects your tenacity.You don't let go of what's yours and don't give up. Alternatively, dreaming of a nautilus indicates that you have a good handle of a situation.<\/p><p>If you dream of a nautilus in your mouth, then it means that you need to keep your mouth shut about something.<\/p>"
    },
    {
        "title": "Navel",
        "desc": "<p>To see your navel in your dream represents your being and self. The dream may indicate that you need to find your center and middle ground. Alternatively, to dream of your navel signifies the bonding to their mother.<\/p><p>To dream that you or someone has a navel piercing denotes your deep connection with your mother. Perhaps the dream is telling you to reconnect with your mother or that you need to be in touch with your maternal instincts.<\/p>"
    },
    {
        "title": "Navy",
        "desc": "<p>To dream that you are in the Navy symbolizes your need for organization, discipline and structure in your life.<\/p><p>Navy blue color represents a lack of individuality and creativity.<\/p>"
    },
    {
        "title": "Nazi",
        "desc": "<p>To see a Nazi in your dream represents an evil and merciless force that cannot be reasoned with. You feel that others are putting you down. If you are a Nazi sympathizer, then the dream has the opposite significance.<\/p>"
    },
    {
        "title": "Near Death Experience",
        "desc": "<p>To have a near death experience in your dream implies that you are experience a relapse of sorts. You are reverting back to your old habits and ways. Alternatively, the dream indicates that you are being given a second chance or second try at something.<\/p>"
    },
    {
        "title": "Nearsighted",
        "desc": "<p>To dream that you are nearsighted indicates that your efforts and energies are too focused on short term goals and not on preparing for the long term of the future.<\/p>"
    },
    {
        "title": "Neat",
        "desc": "<p>To dream that something is neat and tidy indicates that you need to get organized. You need to clear your mind and let go of the past.<\/p>"
    },
    {
        "title": "Nebula",
        "desc": "<p>To see a nebula in your dream symbolizes an outburst of creative energy and possibilities.<\/p>"
    },
    {
        "title": "Neck",
        "desc": "<p>To see your neck in your dream signifies the relationship between the mind\/mental and the body\/physical. It represents willpower, self-restriction and your need to control your feelings and keep them in check. Consider the familiar phrase, &quot;don't stick your neck out&quot; which serves as a warning against a situation.<\/p><p>To dream that your neck is injured or sore indicates a separation between your heart and mind. There is a literal disconnect between how you feel and what you think. You are feeling conflicted. Alternatively, the dream represents something or someone, who is literally a pain in the neck.<\/p><p>If you dream that your neck is thick or swollen, then it represents your quick temperedness.<\/p>"
    },
    {
        "title": "Neck Brace",
        "desc": "<p>To see or wear a neck brace in your dream implies that you are trying to reconnect your heart and mind. You are trying to rationalize your emotions.<\/p><p>To dream that someone is wearing a neck brace refers to your support system.<\/p>"
    },
    {
        "title": "Necklace",
        "desc": "<p>To see or wear a necklace in your dream represents unsatisfied desires. It also highlights your intellect and your desire to have more influence and power over others.If the necklace is broken or lost, then it indicates that your rational thinking is in accordance with your emotional thinking. You need to act on your gut instinct about some situation or relationship.<\/p>"
    },
    {
        "title": "Necktie",
        "desc": "<p>To see or wear a tie in your dream represents your obligations and relational bonds. The dream may also be a pun on feeling tied down to a situation or relationship. If the tie is loose around your neck, then it suggests that you have some unfinished business to tend to. If the tie is too tight, then it denotes that you feel trapped in a situation or condition.<\/p>"
    },
    {
        "title": "Necromancer",
        "desc": "<p>*Please See: <a href=\"#Hypnotist\">Hypnotist<\/a><\/p>"
    },
    {
        "title": "Nectar",
        "desc": "<p>To see or make nectar in your dream symbolizes sweetness and joy. Things are going very well for you in your life.<\/p>"
    },
    {
        "title": "Nectarine",
        "desc": "<p>To dream that you are eating a nectarine indicates that you are at ease. You are content with the simple things in life.<\/p>"
    },
    {
        "title": "Need",
        "desc": "<p>To dream that you are in need suggests that you are lacking something important in your waking life. The needs in your dream often reflect waking needs.<\/p><p>To dream that someone is in need indicates that you need to be more compassionate and sympathetic to her or him. Learn to appreciate the things you have.<\/p>"
    },
    {
        "title": "Needle",
        "desc": "<p>To see or use a needle in your dream indicates that you need to mend some relationship or situation that has gotten out of hand. A needle is also symbolic of some emotional or physical pain.Alternatively, the dream is a metaphor for male sexuality or a sexual act. In particular, to see knitting needles in your dream suggest that you are manipulating a situation in order to get a desired outcome.<\/p><p>To dream that someone is using a needle suggests that you need to incorporate and join together various aspects of your consciousness.<\/p><p>To look for a needle in your dream symbolizes useless worries over small, trivial matters. Consider the phrase of looking for a needle in a haystack to represent our fruitless pursuits.<\/p><p>To dream that you are threading a needle represents unfinished issues that you need to tend to and perhaps even repair. Alternatively, the dream may have sexual connotations.<\/p><p>Dreaming of a needle stuck in your finger indicates that you are feeling unappreciated. You are not being recognized for your contribution or hard work.<\/p>"
    },
    {
        "title": "Needlepoint",
        "desc": "<p>*Please see: <a href=\"#Knitting\">Knitting<\/a> or: <a href=\"#Sewing\">Sewing<\/a>.<\/p>"
    },
    {
        "title": "Negatives",
        "desc": "<p>To see picture negatives in your dream represent a relationship or situation that is developing. The dream may be a pun on some &quot;negative&quot; person or force in your life. Consider also what is being depicted in the negative.<\/p><p>To have a dream in negative images implies that you are lacking an emotional component to your dreams. Alternatively, such dreams reflect memories and past experiences.<\/p>"
    },
    {
        "title": "Neglect",
        "desc": "<p>To feel neglected in your dream represents some aspect of yourself which you are not paying enough attention to. Perhaps you are overlooking something. Alternatively, it may reflect your real waking experiences of being neglected.<\/p><p>If you dream of a neglected child, then it suggests that you are ignoring the desires of the inner child within. You are so focused on the responsibilities of your daily life that you forget to stop and enjoy the smaller things.<\/p><p>To dream that a dog is neglected indicates that you are taking some of your friends for granted.<\/p>"
    },
    {
        "title": "Negligee",
        "desc": "<p>To see or wear a negligee in your dream indicates your suggestiveness. Perhaps you feel that people can see right through to who you are and your intentions. Do you have a secret that you are afraid will be revealed? The symbol may also be a pun on your negligence of some situation.<\/p>"
    },
    {
        "title": "Neighbor",
        "desc": "<p>To dream of having a good neighbor signifies enjoyment and tranquility at home. If you dream of an angry or unfriendly neighbor, then it signifies dissension and disappointment. There is a waking issue that you need to address with your neighbor. Alternatively, the dream could mean relocation from your home. Perhaps you are in need of a change of scenery.<\/p>"
    },
    {
        "title": "Neighborhood",
        "desc": "<p>To dream about your neighborhood represents a sense of community. You need to develop new friends and new ties. Consider your waking feelings toward your neighbors.<\/p><p>To dream that you are in an unknown neighborhood signifies aspects of your subconscious. The dream may also parallel a waking situation which is new or unfamiliar to you. You are venturing into a brand new territory and it is making you slightly anxious and uneasy.<\/p><p>To see a poor neighborhood in your dream indicates that you are feeling drained or emotionally impoverished. You are lacking support or love. Alternatively, the dream may be trying to get you to be more compassionate to those who are less fortunate. Perhaps you need to extend a helping hand to someone who is in need. The poor neighborhood may also just be a reflection of your actual living situation.<\/p>"
    },
    {
        "title": "Neon Light",
        "desc": "<p>To see neon lights in your dream symbolize your aspirations and desires for recognition or fame, particularly if it is your name in neon. Also consider what is written in neon. There is an important message that your subconscious is trying to convey.<\/p>"
    },
    {
        "title": "Nephew",
        "desc": "<p>To dream of your nephew represents some aspect of yourself that you need to acknowledge or recognize within yourself.<\/p>"
    },
    {
        "title": "Neptune",
        "desc": "<p>To see the planet Neptune in your dream represents inspiration, imagination, and devotion. You may need to show some more compassion and understanding.<\/p><p>To see the Neptune god in your dream indicates some supercharged emotion that you need to address in your waking life. You need to control your temper.<\/p>"
    },
    {
        "title": "Nerd",
        "desc": "<p>To see or dream that you are a nerd indicates feelings of inferiority and\/or ineffectiveness. You feel that you have been overlooked.<\/p>"
    },
    {
        "title": "Nervous",
        "desc": "<p>To dream that you are nervous about something indicates that you are experiencing self-doubt and feelings of insecurity.<\/p>"
    },
    {
        "title": "Nervous Breakdown",
        "desc": "<p>To dream that you or someone has a nervous breakdown suggests that you have lost your frame of reference in a relationship or situation. You are seeking more clarity and insight. The dream also indicates that you are having difficulties trusting your own judgment and decisions. You are feeling insecure.<\/p>"
    },
    {
        "title": "Nest",
        "desc": "<p>To see a nest in your dream signifies comfort, safety, homeliness, protection, or new opportunities. Consider the condition of the nest and how it parallels your waking home situation and home life. Alternatively, the nest also means emotional dependency.<\/p><p>If the nest is full of eggs, then it symbolizes your financial future and financial security. The dream could thus be a pun on &quot;nest egg&quot;. If the eggs in the nest are broken or bad, then it symbolizes disappointments and failures. You are being pulled into someone else's problems or arguments.<\/p>"
    },
    {
        "title": "Nesting Doll",
        "desc": "<p>**Please See: <a href=\"#Matryoshka\">Matryoshka Doll<\/a>.<\/p>"
    },
    {
        "title": "Net",
        "desc": "<p>To see a net in your dream suggests that you are caught in a complicated life situation. You feel trapped. Alternatively, the dream means that you need to expand your reach. it is time to &quot;cast those nets&quot; and see what comes back. The net may thus be a metaphor for your network of connections or the internet.<\/p>"
    },
    {
        "title": "Netflix",
        "desc": "<p>To dream that you are looking for something to watch on Netflix represents a recap of what is happening in your life. Pay attention to the show titles that you see on the screen. Watching Netflix in your dream also indicates that you are taking control some area of your life.<\/p>"
    },
    {
        "title": "Nettles",
        "desc": "<p>To see nettles in your dream represents a difficult situation that you need to avoid. You may be experiencing difficulty in expressing yourself. Perhaps you are in the middle of a &quot;stingy&quot; situation.<\/p>"
    },
    {
        "title": "New",
        "desc": "<p>To see a new house in your dream indicates that you are taking on a new identity and developing new strengths. You are becoming more emotionally mature.<\/p><p>To see new shoes in your dream suggest that you are overconfident in your success. Alternatively, you may be on a life path that is unfamiliar to you.<\/p><p>To dream that you are at a new school means that you are feeling out of place in some situation. Or perhaps there is a new lesson that you need to learn.<\/p><p>In general, dream of new things and new places correspond to what is new in your waking life. It refers to something that is different or unfamiliar.<\/p>"
    },
    {
        "title": "New Year",
        "desc": "<p>To dream of the New Year signifies prosperity, hope, new beginnings and an opportunity to make a fresh start. It also represents the start of some new project or a fresh outlook in life.On a spiritual level, the New Year represents enlightenment or new found understanding.<\/p>"
    },
    {
        "title": "New York",
        "desc": "<p>If you do not live in New York, but dream that you are in New York, then it symbolizes your fast paced lifestyle. Perhaps things are moving too fast and you are unable to keep up with the demands of everyday life. Alternatively, the dream represents your desires for more excitement in your life. Or you are striving for success in your professional career. Known as &quot;the big apple, dreaming of New York City could mean that you need to eat a more healthy diet.<\/p>"
    },
    {
        "title": "Newborn",
        "desc": "<p>*Please See: <a href=\"#baby\">Baby<\/a>.<\/p>"
    },
    {
        "title": "News",
        "desc": "<p>To watch or listen to the news in your dream signifies an important message from your subconscious. Alternatively, the dream may mean that you need to be more objective in a situation.<\/p><p>To hear good news in your dream is a dream of the contrary and represents a negative turn in events. If you hear bad news in your dream, then a situation is not as bad as you had anticipated.<\/p>"
    },
    {
        "title": "Newspaper",
        "desc": "<p>To see or read a newspaper in your dream signifies that new light and insight is being shed on a waking problem that is nagging on your mind. You are seeking knowledge and answers to a problem. Pay attention to the dream as it may offer a solution. Alternatively, reading the newspaper implies that you need to be more vocal. You need to express yourself. It is time to make the headlines.<\/p><p>To dream that you are unable to read the newspaper indicates that your reputation is being called into question. There is some uncertainty in a situation that you are pursuing.<p>To dream that you are selling newspapers suggest that you are trying to inform and alert others to some important information. Perhaps you have a significant announcement to make.<\/p>"
    },
    {
        "title": "Newspaper Reporter",
        "desc": "<p>To dream that you are a newspaper reporter indicates that you are making a conscious and objective observation of your life.<\/p>"
    },
    {
        "title": "Newt",
        "desc": "<p>To see a newt in your dream represents misfortune, evil and harm.<\/p>"
    },
    {
        "title": "Newton's Cradle",
        "desc": "<p>To see or play with Newton's Cradle in your dream implies that you are expending your energy on fruitless endeavors.<\/p>"
    },
    {
        "title": "Niche",
        "desc": "<p>To dream that you are in a niche represents your need to belong and your need to feel protected. The dream may be guiding you toward a place of security.<\/p>"
    },
    {
        "title": "Nickel",
        "desc": "<p>To see a nickel in your dream symbolizes the number 5 and thus means a change in your path or course of action. Or it may also indicate your persuasiveness and spontaneity. Alternatively, the dream refers to money issues. You need to do some serious saving! Also consider the phrase to &quot;nickel and dime&quot;, which implies that you are being too petty over minor issues. At the same time, little things can add up to be a major issue later if not addressed immediately.<\/p>"
    },
    {
        "title": "Nickname",
        "desc": "<p>To hear a nickname in your dream represents the feelings and memories your associate with the person who is referred to by that nickname. If the nickname is not familiar, then it may be a metaphor or pun on something.<\/p><p>To dream that someone is calling you by a nickname suggests that you are trying to change how you see yourself and how others see you.<\/p>"
    },
    {
        "title": "Niece",
        "desc": "<p>To see your niece in your dream represents some aspect of yourself that you need to acknowledge or recognize within yourself.<\/p>"
    },
    {
        "title": "Night",
        "desc": "<p>To have a dream that takes place at night represents some major setbacks and obstacles in achieving your goals. You are being faced with an issue that is not so clear cut. Perhaps, you should put the issues aside so you can clear your head and come back to it later. Alternatively, night may be synonymous with death, rebirth, reflection, and new beginnings.<\/p><p>To dream that it is night time, but it is still as bright as day, indicates that you now have clarity and insight into a once unclear situation. Something that was previously hidden is now being revealed to you.<\/p><p>*Please also see: <a href=\"#darkness\">Darkness<\/a><\/p>"
    },
    {
        "title": "Nightlight",
        "desc": "<p>To see or switch on a nightlight in your dream indicates that you are looking for some guiding light or advice in some unknown situation or issue. Alternatively, a nightlight may be similar to a light bulb and thus symbolizes new ideas, hope or spiritual enlightenment. You have gained some insight and knowledge into an issue or situation.<\/p>"
    },
    {
        "title": "Nightclub",
        "desc": "<p>To dream that you are in a nightclub represents the social aspects of your life and your sense of belonging. The dream may be a commentary on your lifestyle. Perhaps you need to settle down a little.<\/p>"
    },
    {
        "title": "Nightgown",
        "desc": "<p>To dream that you are wearing a nightgown suggests that you are acknowledging and expressing aspects of yourself that you were previously uncomfortable about.<\/p>"
    },
    {
        "title": "Nightmare",
        "desc": "<p>To dream that you are having a nightmare suggests that you are being overly indulgent and living a life of excess. You need to tone it down and allow the mind and body to rest and heal. Alternatively, the dream may mean that you are experiencing a setback toward your goals. You need to learn to take a negative and turn it into a positive.<\/p>"
    },
    {
        "title": "Nightingale",
        "desc": "<p>To see a nightingale in your dream indicates unrequited love, longing and pain.<\/p><p>To hear a nightingale in your dream denotes new beginning and spiritual enlightenment.<\/p>"
    },
    {
        "title": "Nightstand",
        "desc": "<p>To see a nightstand in your dream represents the things in your life that you need to put to rest and let go of.<\/p>"
    },
    {
        "title": "Nike",
        "desc": "<p>To see the Nike logo in your dream is telling you to &quot;just do it&quot;. You need to stop sitting around and start moving more quickly. Alternatively, the dream symbolizes speed, agility and athleticism.<\/p>"
    },
    {
        "title": "Nimbus",
        "desc": "<p>To see a nimbus around you or someone else refers to your deep spiritual growth and progress.<\/p>"
    },
    {
        "title": "Ninepins",
        "desc": "<p>To dream that you play ninepins indicate that you are foolishly wasting your energy and letting opportunities slip away. Alternatively, the dream means that you need to select your companions carefully. Be careful of who you put your trust in.<\/p>"
    },
    {
        "title": "Ninja",
        "desc": "<p>To<span>see a ninja in your dream symbolizes a someone in your life whose intentions are unclear. You may feel threatened by this person's abilities or suspicious of their motivations.<\/p><p><span>To dream that you are a ninja indicates passive aggressive behavior. You are trying to be defiant without appearing confrontational.<\/p>"
    },
    {
        "title": "Nipples",
        "desc": "<p>To see nipples in your dream relate to some infantile need. You are regressing into a state of dependency.<\/p><p>To dream that you are squeezing pus out of your nipples refers to your negative feelings about relationships. You are feeling sexually inadequate.<\/p><p>To dream that you have no nipples or that they have disappeared refer to your lack of sexual desire.<\/p><p>To dream that your nipples are scabbed or scarred indicate that you are feeling undesirable or unwomanly.<\/p><p>Dreaming that your nipples are stretched out and hanging implies that you are offering or giving too much to others. You tend to put the needs of others ahead of your own.<\/p><p>*Please see also: <a href=\"#breasts\">Breasts<\/a>.<\/p>"
    },
    {
        "title": "Nirvana",
        "desc": "<p>To dream of nirvana symbolizes knowledge, perfection and peace. Alternatively, the dream serves as an escape from the unhappiness or the demands of your waking life.<\/p>"
    },
    {
        "title": "No",
        "desc": "<p>To dream that you are saying no suggests that you are standing up for what believe even though you are going against the majority. You are putting yourself first and making decisions for yourself, not for others.<\/p>"
    },
    {
        "title": "Noah's Ark",
        "desc": "<p>*Please See: <a href=\"#Ark\">Ark<\/a>.<\/p>"
    },
    {
        "title": "Nobility",
        "desc": "<p>To dream that you are associated with nobility, indicates that you are all show. You are too concerned with what is on the outside and neglecting the inside. You need to work on cultivating your mind.<\/p>"
    },
    {
        "title": "Noise",
        "desc": "<p>To hear or make a strange noise in your dream signifies the unexpected and the unknown.You may be expressing some fear or confusion about a situation in your waking life. The noise in your dream may serve as a way to attract your attention to that issue. Alternatively, a noise represents a breakthrough into your personal struggles. Perhaps you need to be more vocal and be heard. Or perhaps you need to break through a barrier that has been holding you back.<\/p>"
    },
    {
        "title": "Nomad",
        "desc": "<p>To dream that you are a nomad suggests that you are searching for some direction in your life. You are lacking motivation. Alternatively, a nomad represents a transformation or some change in your life.<\/p>"
    },
    {
        "title": "Noon",
        "desc": "<p>*Please See: <a href=\"#Afternoon\">Afternoon<\/a>.<\/p>"
    },
    {
        "title": "Noodles",
        "desc": "<p>To see noodles in your dream symbolize longevity and abundance. Alternatively, the dream indicates that you are looking for some sort of nourishment. The dream may also be a pun that you need to &quot;use your noodle&quot;. In other words, there is something that you need to think long and hard about.<\/p>"
    },
    {
        "title": "Noose",
        "desc": "<p>To see a noose in your dream represents your lack of independence. You feel restricted and restrained from being able to express yourself.<\/p><p>To dream that a noose is around someone's neck signifies repressed anger and rage at that person or towards a particular condition.<\/p>"
    },
    {
        "title": "North",
        "desc": "<p>To dream of the direction north symbolizes reality. It also indicates that you are making progress and moving forward in life.<\/p>"
    },
    {
        "title": "North Pole",
        "desc": "<p>To dream that you are at the north pole signifies completion and an ending to some journey, situation, or relationship. You have successfully completed your transformation.<\/p>"
    },
    {
        "title": "North Star",
        "desc": "<p>To see the north star in your dream symbolizes a guiding light or a guardian angel that will point you toward your direction in life. You will experience clarity in a situation.<\/p>"
    },
    {
        "title": "Northern Lights",
        "desc": "<p>To see the northern lights in your dream represent renewed energy, vitality, awe, insight and youth. A situation or relationship will be made clear to you or a positive spiritual experience will fill you with warmth and love. You will gain some amazing new wisdom and knowledge. Alternatively, the dream indicates that you know what you need to do, but may be too lazy or too afraid to jump into action.<\/p>"
    },
    {
        "title": "Nose",
        "desc": "<p>To see your own nose in your dream signifies a conscious effort to achieve whatever endeavor you chose to undertake. The nose represents energy, intuition, and wisdom. The dream may suggest your need to learn more about a situation at hand. Alternatively, the nose symbolizes curiosity, as in being nosy. Perhaps you are interfering into situations and things that are none of your business. If you dream that your nose is growing, then it suggests that you or someone is lying and being dishonest.<\/p><p>To dream that hair is growing on your nose signifies your strong will and solid character.<\/p><p>To dream that a bug or insect is coming out of your nose indicates that you are being nosy to the point where it is &quot;bugging&quot; and bothering others. You need to learn to when to get out of people's business and respect their privacy.<\/p><p>To dream that you have a bloody nose means that your character is under attack. If your nose is stuffed up, then it suggests that you unable to freely and fully express yourself.<\/p>"
    },
    {
        "title": "Notary",
        "desc": "<p>To see a notary in your dream indicates that you are looking for approval or validation from someone.<\/p>"
    },
    {
        "title": "Notes",
        "desc": "<p>To read or write a note in your dream suggests that there is an important message that you need to convey. There is something that you need to let others know.<\/p><p>To dream that you are passing notes symbolize your pursuit for knowledge and information.<\/p><p>To see musical notes in your dream represent harmony or disharmony in your waking life, depending on whether the musical note was a sharp note or flat note.<\/p>"
    },
    {
        "title": "Notebook",
        "desc": "<p>To see a notebook or notepad in your dream represents things that you need to keep track of and stay on top of. It may indicate emotions and issues that you have overlooked in your waking hours. Consider the contents of the notebook.<\/p>"
    },
    {
        "title": "Nothingness",
        "desc": "<p>To dream of nothing suggests that there is something missing or lacking in your life. It symbolizes fruitless labor, an emotional void, or loneliness. Alternatively, dreaming about nothingness may mean that you are experiencing some sort of blackout. You are zoning out.<\/p>"
    },
    {
        "title": "Novel",
        "desc": "<p>To see or read a novel in your dream suggests that you need to look at things from a different point of view or angle. Determine what type of novel for further significance. The dream may also be a pun on something &quot;novel&quot; or new in your life.<\/p>"
    },
    {
        "title": "November",
        "desc": "<p>To dream of the month of November indicates your indifference to a situation or problem.<\/p>"
    },
    {
        "title": "Novocain",
        "desc": "<p>To dream that you are under Novocain indicates that you are feeling numb in some area of your life. You are emotionless or speechless and are not sure how to react or respond.<\/p>"
    },
    {
        "title": "Nude",
        "desc": "<p>*Please See: <a href=\"#Naked\">Naked<\/a>.<\/p>"
    },
    {
        "title": "Nuclear Bomb",
        "desc": "<p>To dream of a nuclear bomb suggests feelings of helplessness and loss of control. You are experiencing some strong hostility and rage, where it is nearly destructive. Important changes are about to occur.You may also be expressing a desire to wipe out some aspect of yourself. Alternatively, the nuclear bomb serves as an indication that something crucial and precious to you has ended.<\/p>"
    },
    {
        "title": "Nugget",
        "desc": "<p>To see a gold nugget in your dream symbolizes a small piece of valuable information that you had overlooked or did not know about. It is the core to some idea or piece of knowledge.<\/p><p>To dream that you are picking up several gold nuggets means that you are acknowledging something that you have previously overlooked. Alternatively, picking up gold nuggets represent ideas that you are finally putting to use.<\/p>"
    },
    {
        "title": "Numbers",
        "desc": "<p>To see numbers in your dream symbolize material gains and possessions. You are keeping close track of things. Alternatively, numbers indicate that you are being over analytical or rational. Or that you need to evaluate a situation more thoroughly. Numbers also carry much personal significance. They may represent a special date, address, age, lucky number or something meaningful and significant to only you.<\/p><p>To hear numbers in your dream mean that you need to pace yourself in some situation. Or perhaps you need to calm down and take things a little slowly.<\/p><p>To see repeating numbers in your dream refers to some urgent matter or important them in your life that you are missing or overlooking.<\/p><p>For a specific number, please see: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/numbers-dream-symbols.htm\">Dream Moods Dream Themes: Numbers<\/a>.<\/p>"
    },
    {
        "title": "Numbness",
        "desc": "<p>To dream that you feel numbness indicates that you are letting fear take over and run your life. You fear failure and as a result, you are afraid of taking risks or chances.<\/p>"
    },
    {
        "title": "Nun",
        "desc": "<p>To see a nun in your dream signifies purity, chastity and obedience. It also indicates that you need to live up to the vows and promises you have made. Alternatively, material fortune and gain may be interfering with your spirituality. Consider also the pun of being &quot;none&quot; or &quot;nothing&quot;. A nun may also symbolize your sister or a female figure in your waking life.<\/p><p>If you are a woman and dream that you are a nun, then it indicates unhappiness with your current situation and environment. You are looking for an escape. Alternatively, the dream suggests that you are looking for a sense of security or calmness in your life.<\/p>"
    },
    {
        "title": "Nunchucks",
        "desc": "<p>To see or use nunchucks in your dream refers to your defensive stance about some situation.<\/p>"
    },
    {
        "title": "Nuptial",
        "desc": "<p>To dream of your nuptials indicate a reaffirmation of your commitments. It is also symbolic of a transitional stage occurring in your life.<\/p><p>*Please also see: <a href=\"#marriage\">Marriage<\/a>.<\/p>"
    },
    {
        "title": "Nurse",
        "desc": "<p>To dream that you are a nurse suggests that you need to show more compassion in a situation.<\/p><p>To see a nurse in your dream means that you need to take time out in order to heal, mentally, physically and spiritually.<\/p>"
    },
    {
        "title": "Nursery",
        "desc": "<p>To see a baby's nursery in your dream symbolizes your maternal instinct. The dream may suggest that you are expecting a new addition to your family. Alternatively, a nursery indicates that you are regressing back to your childhood. Perhaps you are wanting to go back to a simpler time where you were cared for and did not have to worry about anything.<\/p><p>To dream that you are in a plant nursery represents spiritual development, potential, growth and transformation. You need to nurture the changes in your life.<\/p>"
    },
    {
        "title": "Nursing",
        "desc": "<p>*Please See: <a href=\"Breast%20Feeding\">Breast Feeding<\/a>.<\/p>"
    },
    {
        "title": "Nursing Home",
        "desc": "<p>*Please See: <a href=\"#Senior%20Home\">Senior Home<\/a>.<\/p>"
    },
    {
        "title": "Nutcracker",
        "desc": "<p>To see a nutcracker in your dream represents power strength and stamina. You can achieve anything you want if you set your mind to it. Alternatively, the dream may be a pun on a powerful or tough woman.<\/p>"
    },
    {
        "title": "Nutmeg",
        "desc": "<p>To see nutmeg in your dream symbolizes a warm and loving home life.<\/p>"
    },
    {
        "title": "Nuts",
        "desc": "<p>To see nuts in your dream represent craziness or confusion. It may also refer to someone who is &quot;nuts&quot; or someone who is driving you crazy. Alternatively, the dream is telling you that you are approaching a waking situation all wrong and need to look at it from a different perspective. Also consider nuts as a pun on &quot;testicles&quot; and thus allude to some sexual innuendo.<\/p><p>To dream that you are eating nuts signify prosperity and attainment of your desires. You are trying to get to the core of a matter or situation.<\/p>"
    },
    {
        "title": "Nylons",
        "desc": "<p>*Please See: <a href=\"#Pantyhose\">Pantyhose<\/a>.<\/p>"
    },
    {
        "title": "Nymph",
        "desc": "<p>To see a nymph in your dream represents the feminine mystique. It also symbolizes innocence, grace and purity.<\/p>"
    }
]