[
    {
        "title": "O",
        "desc": "<p>To see the letter &quot;O&quot; in your dream signifies an exclamation of surprise as in &quot;oh!&quot;. Alternatively, the letter O implies that you need to open wide. Perhaps there is something that you need to open up about and vocalize. It may refer to a sexual innuendo as in &quot;the big O&quot; or orgasm. This letter may also share the same significance as the number<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/z.htm#Zero\">zero or a<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c2.htm#Circle\">circle.<\/p>"
    },
    {
        "title": "Oak Tree",
        "desc": "<p>To see an oak tree in your dream symbolizes longevity, stability, strength, tolerance, wisdom, and prosperity. You have built a solid foundation for success in some endeavor. If there are acorns on the tree, then the symbol refers to your climb up the social ladder and rise in status."
    },
    {
        "title": "Oars",
        "desc": "<p>To see or use oars in your dream signify control over your emotions. You are able to navigate through life based on the lessons and skills you have learned. If you are rowing energetically, then it suggests that you need to approach some situation with more aggression and determination.<\/p><p>To dream that you are paddling with one oar indicates that you are going around in circles and headed nowhere. You need help in some situation or matter. Alternatively, it suggests that you are missing a partner in life. If you lose an oar, then it suggests that you have lost your groove or have taken something for granted.<\/p>"
    },
    {
        "title": "Oasis",
        "desc": "<p>To see an oasis in your dream refers to your need for a vacation. You need to allocate time for pleasure leisurely pursuits.<\/p><p>To dream that you are searching for an oasis symbolizes inner fears, insecurities, and overwhelming circumstances. You are looking for emotional support.<\/p>"
    },
    {
        "title": "Oath",
        "desc": "<p>To dream that you are taking an oath represents your need for the truth. It also symbolizes your commitment and dedication.<\/p><p>To dream that you refuse to take an oath suggests that you are trying to hide something.<\/p>"
    },
    {
        "title": "Oatmeal",
        "desc": "<p>To dream that you are eating oatmeal suggests that you are well-grounded.<\/p><p>To dream that you are making oatmeal represents control over the destiny of someone close to you.<\/p><p>To dream that you are eating an oatmeal cookie suggests that it is okay to indulge once in a while.<\/p>"
    },
    {
        "title": "Oats",
        "desc": "<p>To see or eat oats in your dream symbolize simplicity, comfort and solace. It represents the basic necessities of life.<\/p>"
    },
    {
        "title": "Obedience",
        "desc": "<p>To dream that you are obedient represents acknowledgement of a higher power. You are experiencing some new spiritual enlightenment. Alternatively, the dream suggests that you are not voicing your opinions or beliefs loud enough. If someone is being obedient toward you, then it refers to the influence, power and authority you have over others.<\/p><p>To dream that you are not obedient represents a rebellious attitude. Perhaps you are feeling insecure about a situation.<\/p>"
    },
    {
        "title": "Obelisk",
        "desc": "<p>To see an obelisk in your dream signifies your cold and harden nature. You need to need to warm up to others and soften your nature.A obelisk may also have phallic connotations.<\/p>"
    },
    {
        "title": "Obese",
        "desc": "<p>To dream that you are obese denotes overindulgence. You feel helplessness in expressing your power and authority. By dreaming that you are obese, you are trying to insulate yourself from your surroundings and protect yourself from involvement in the situation. Alternatively, the dream may just be a reflection of your waking weight or dieting issues. You have an skewed perception of your own image which may stem from low self-esteem.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/f.htm#Fat\">Fat.<\/p>"
    },
    {
        "title": "Obituary",
        "desc": "<p>To see or read an obituary in your dream represents the end to your old attitudes and outdated beliefs. Alternatively, reading your own obituary means that you are underestimating your own abilities.<\/p>"
    },
    {
        "title": "Obligation",
        "desc": "<p>To dream that someone is obligated to you indicates that you are ready to achieve a new level of success.<\/p><p>To dream that you are obligated to someone refers to your sense of responsibility and duty.<\/p>"
    },
    {
        "title": "Oblivious",
        "desc": "<p>To dream that you are oblivious suggests that you are too focused on one thing that you are missing out on something. Such a dream may be a wake up call!<\/p>"
    },
    {
        "title": "Obscene",
        "desc": "<p>To see or hear something obscene in your dreams represents aspects of your sex life. Perhaps you feel limited or restricted. Or it refers to aspects of yourself that you have rejected or refuse to acknowledge. Consider your feelings and reactions toward the obscenity. If you were repulsed or disturbed by it, then the dream may indicate regret of what you have done in your waking life.<\/p>"
    },
    {
        "title": "Observatory",
        "desc": "<p>To see an observatory in your dream signifies your high goals and aspirations. The dream may be telling you that you need to acknowledge your spirituality.<\/p>"
    },
    {
        "title": "Observe",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/w.htm#Watching\">Watching.<\/p>"
    },
    {
        "title": "Obsession",
        "desc": "<p>To dream of an obsession suggests that you need to take some time to work through some difficulty. There is a situation that may potentially take over your daily life and prevent you from functioning efficiently.<\/p>"
    },
    {
        "title": "Obsidian",
        "desc": "<p>To see obsidian in your dream suggests that you are well-grounded or that you need to be more grounded. Alternatively, obsidian is symbolic of grief and mourning.<\/p>"
    },
    {
        "title": "Obstacle",
        "desc": "<p>To see or experience obstacles in your dream represent things in your life that you need to overcome. The dream is offering you a solution on how to approach and tackle a problem in your waking life. You may have some self-doubt in your abilities and in coming to a decision.<\/p>"
    },
    {
        "title": "Obstacle Courses",
        "desc": "<p>To dream that you are going through an obstacle course symbolizes the hardships and difficulties that you are experiencing in your waking life. It represents the things that you must overcome in order to reach your goals. The elements in the obstacle course is analogous to the barriers and problems in your life.<\/p>"
    },
    {
        "title": "Occultist",
        "desc": "<p>To dream of the occult indicates that there is something just under the surface that you need to acknowledge.There is some wisdom hat you need to apply to your waking life.<\/p>"
    },
    {
        "title": "Ocean",
        "desc": "<p>To see an ocean in your dream represents the state of your emotions and feelings. It is indicative of spiritual refreshment, tranquility and renewal. Alternatively, the dream means that you are feeling empowered and unhindered. You have a positive outlook in life and are not limited by anything. If you are sailing across the ocean, then it signifies new found freedom and independence. You are showing great courage. If the ocean is rough, then the dream represents some emotional turmoil. You are doing your best to handle life's ups and downs.<\/p><p>To dream that you are kissing the ocean floor implies that you are coming to terms with your emotions.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/w.htm#Water\">Water.<\/p>"
    },
    {
        "title": "Octagon",
        "desc": "<p>To see an octagon in your dream indicates a spiritual reawakening, eternal life or resurrection.<\/p>"
    },
    {
        "title": "October",
        "desc": "<p>To dream of the month of October signifies gratifying success in your endeavors.<\/p>"
    },
    {
        "title": "Octopus",
        "desc": "<p>To see an octopus in your dream means that you are entangled in some difficult matter. Your judgment is being clouded. Alternatively, the octopus indicates that you are overly possessive and maybe too clingy in a relationship.<\/p><p>To see two octopuses in your dream represents a codependent relationship.<\/p>"
    },
    {
        "title": "Odd Numbers",
        "desc": "<p>To see odd numbers in your dream indicates unresolved issues and aggressive behavior in your life. You are feeling off balance.<\/p>"
    },
    {
        "title": "Odometer",
        "desc": "<p>To see an odometer in your dream refers to how far or how little you have advanced in your life. Perhaps the dream is telling you to set milestones and work on achieving smaller goals. Also consider the numbers on the odometer for additional significance.<\/p>"
    },
    {
        "title": "Odor",
        "desc": "<p>To smell an odor in your dream indicates a memory or past experience. Consider the type of smell and whether it is pleasant or foul smelling to determine if the dream is a positive or negative one.<\/p>"
    },
    {
        "title": "Offal",
        "desc": "<p>To see or eat offal in your dream represents something that disgusts you, especially if it is raw. The dream may be a pun for something &quot;awful&quot;. Alternatively, eating offal in your dream means that you are receptive to new experiences. Consider the kind of offal for additional significance as it may be drawing attention to your corresponding organ.<\/p>"
    },
    {
        "title": "Offense",
        "desc": "<p>To be offended in your dream represents your sensitivities to a situation which has not been properly expressed. You are trying not to let certain things bother you, but it is eating away at your subconscious. Consider who is offending you.<\/p><p>To dream that you are offending others suggests that you need to be more aware of other people's feelings. Alternatively, you are feeling spiritually conflicted.<\/p>"
    },
    {
        "title": "Offering",
        "desc": "<p>To dream that you are bringing or making an offering suggests that you are trying to make amends over a past mistake. Consider what is being offered for additional clues. Alternatively, the dream symbolizes surrender. You are giving up some of your power.<\/p>"
    },
    {
        "title": "Office",
        "desc": "<p>To dream of your work office indicates that you cannot seem to leave your work at the office. You are overworked or have too much on your mind. Alternatively, an office symbolizes practicality, status, accomplishments and your place in the world. If the office in your dream is unfamiliar or strange, then it suggests that you are comparing yourself to someone else. You are measuring yourself against other's standards.<\/p><p>To dream that you hold public office represents your acceptance for the consequences of your actions. You are taking responsibility for what you do.<\/p>"
    },
    {
        "title": "Office Chair",
        "desc": "<p>To see or sit on an office chair in your dream signifies your professional mobility. Perhaps you are assessing your career path and how you can move up in the workforce. Alternatively, an office chair refers to your ability to adapt to different situations at work.<\/p>"
    },
    {
        "title": "Officer",
        "desc": "<p>To see an officer in your dream represents your need to belong and to fit in to a larger group. Alternatively, the officer indicates your need for discipline and direction in your life. You may be seeking a higher plane for guidance.<\/p><p>To dream that you are an officer represents your leadership skills and your authoritative presence.<\/p>"
    },
    {
        "title": "Offspring",
        "desc": "<p>To see your offspring in your dream symbolizes an aspect of yourself that you are trying to nurture. The dream is telling you to take some time off so you can cater to the inner child within.<\/p><p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c3.htm#Children\">Children.<\/p>"
    },
    {
        "title": "Ogre",
        "desc": "<p>To see an ogre in your dream signifies self-criticism and discipline.<\/p>"
    },
    {
        "title": "Oil",
        "desc": "<p>To see oil in your dream represents your desires to have things run more smoothly. Perhaps you need to put a little oil in something to get things moving. Alternatively, you may need to show more love and compassion in your life. Metaphorically, dreaming of oil may refer to someone who is slick or smooth.<\/p><p>To see baby oil in your dream indicates that you need to soothe the child within you. It is okay to let loose once in a while.<\/p><p>To see crude oil in your dream signifies great wealth and riches. Alternatively, the dream refers to over- consumption. You need to conserve and be more environmentally conscious.<\/p><p>To see massaging oils in your dream symbolize your sensual side. Perhaps you need to express your sensuality more.<\/p>"
    },
    {
        "title": "Oil Lamp",
        "desc": "<p>To see a lit oil lamp in your dream symbolizes knowledge, spiritual enlightenment and new awareness. An oil lamp may also mean that you are looking for guidance or reassurance.<\/p><p>Dreaming that oil spilled out of an oil lamp indicates that you are feeling overwhelmed. You are experiencing a lack of energy or power in some area of your life.<\/p>"
    },
    {
        "title": "Oil Spill",
        "desc": "<p>To see an oil spill in your dream suggests that you are in emotional turmoil. You are experiencing problems and distress in your personal relationships.<\/p>"
    },
    {
        "title": "Ointment",
        "desc": "<p>To see ointment in your dream indicates that you are undergoing a period of healing.<\/p>"
    },
    {
        "title": "Old",
        "desc": "<p>To see something old in your dream suggests that there is something in your life that you need to replace or get rid of. Alternatively, the dream means that there may be something in the past that you need to incorporate into your current life.<\/p><p>To see or dream that you are an old man or woman refers to your wise decisions. Negatively, it may mean your unyielding ways and rigid thinking. Perhaps you have concerns about aging and growing old.<\/p>"
    },
    {
        "title": "Olives",
        "desc": "<p>To see or eat olives in your dream symbolize healing and immortality.<\/p><p>To see an olive tree or branch signifies reconciliation, peace, and hope.<\/p><p>To see or wear a crown of olive leaves indicates that you will overcome your obstacles and find a resolution to a conflict. A burden will be lifted off you and you will come out victorious.<\/p>"
    },
    {
        "title": "Olympics",
        "desc": "<p>To dream that you are competing in the Olympics symbolizes the spirit of competition. You need to go after what you want. Alternatively, the Olympics represent unity. It may be telling you that despite our differences and disagreements, we can all still come together. You need to apply this ideology to some aspect of your waking life. A more direct interpretation may represent your aspirations of being an Olympian athlete.<\/p>"
    },
    {
        "title": "Omelet",
        "desc": "<p>To see or eat an omelet in your dream indicates a bright start to your day. The dream is telling you that you are headed in the right direction. Also consider the phrase &quot;you can't make an omelet without breaking eggs&quot;. Perhaps the dream is trying to tell you that there are certain sacrifices that you need to make in order to achieve your goal.<\/p>"
    },
    {
        "title": "Omen",
        "desc": "<p>To dream about an omen reflects your concerns, fears and\/or anxieties about the future. You are worried about some outcome in your waking life and want to control what is happening around you.<\/p>"
    },
    {
        "title": "One-Eyed",
        "desc": "<p>To dream that you have one eye indicates your refusal to accept another viewpoint. You are too one-sided in your ways of thinking.<\/p>"
    },
    {
        "title": "Onions",
        "desc": "<p>To see or eat onions in your dream represent the multitude of layers that you need to get through in order to unveil what is really underneath. You need to dig a little deeper into a situation or problem. The dream may be a metaphor for some revelation.<\/p><p>To dream that an onion is making you cry indicates that you are not being genuine. It symbolizes phoniness, fakeness and deceit.<\/p>"
    },
    {
        "title": "Online Game",
        "desc": "<p>To dream that you are playing an online game indicates that you are trying to escape from the stresses in your daily life. You want to be someone else. You want to be in control. Alternatively, dreaming about an online game may simply mean that you are spending so much time playing the game that the images have drifted into your dreams.<\/p><p>In particular, dreaming about MMO games symbolize mutual goals and teamwork. Sometimes you have to depend on others in order to achieve a goal or to move up in life. Alternatively, playing MMO games in your dream suggests that you are filling a social void in your waking life.<\/p>"
    },
    {
        "title": "Onyx",
        "desc": "<p>To see onyx in your dream represents self- confidence, spiritual and mental balance and peace of mind. Alternatively, an onyx signifies some unknown or unacknowledged power.<\/p>"
    },
    {
        "title": "Opal",
        "desc": "<p>To see an opal in your dream refers to your libido and sexual desire. You need to be more passionate in your love life. Alternatively, some believe opals are unlucky and signal tears and heartaches.<\/p>"
    },
    {
        "title": "Open Floor Plan",
        "desc": "<p>To dream that you have a house with an open floor plan or an open layout suggests that you need to work on integrating aspects of yourself. You are over compartmentalizing things. Alternatively, the dream means that you need to be more honest and open with your family.<\/p>"
    },
    {
        "title": "Opening",
        "desc": "<p>To see an opening in your dream signifies a strong influence and powerful inspiration entering your life. You are feeling uplifted, confident and happy.<\/p><p>To dream that you are opening something suggests that you are unleashing your potential. It represents new opportunities, insight, and self-discovery.<\/p>"
    },
    {
        "title": "Opera",
        "desc": "<p>To watch an opera in your dream represents your quest for the grander things in life. The dream may also be trying to tell you that you are being overly dramatic in some waking situation.<\/p>"
    },
    {
        "title": "Operation",
        "desc": "<p>To dream that you are having an operation suggests that you need to get something out of your system or cut it out of your life. Perhaps you need to let go of something or change your habits.<\/p><p>To dream that you are operating on someone indicates that you are facing some deep issues or dealing with some repressed thoughts.<\/p><p>To dream of a military operation suggests that you need to approach some issue or situation with discipline, precision and planning. Do not rush through your decision.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s5.htm#Surgery\">Surgery.<\/p>"
    },
    {
        "title": "Operator",
        "desc": "<p>To dream of a telephone operator indicates that you are looking for some guidance into your subconscious.<\/p>"
    },
    {
        "title": "Opium",
        "desc": "<p>To see or smoke opium in your dream suggests that there is an issue or situation that you are avoiding. You are prolonging a decision that needs to be made. It is time to take control and stop relying on outside help. Alternatively, the dream suggests that you need to relax and take it easy.<\/p>"
    },
    {
        "title": "Opossum",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p4.htm#Possum\">Possum.<\/p>"
    },
    {
        "title": "Opponent",
        "desc": "<p>To dream that you have an opponent signifies an aspect of yourself in which you are in conflict with. Consider what you are fighting within yourself."
    },
    {
        "title": "Opposite Sex To dream that you are the opposite sex suggests that you need to incorporate certain qualities of the opposite sex. Ask yourself, how do you feel being a man or a woman? In what ways can you incorporate those feelings into your waking life.",
        "desc": "<p>Optician\/Optometrist<\/p><p>To see an optometrist in your dream suggests that there is some situation or problem that you are unclear about. You need to look at things from a different angle or new perspective.<\/p>"
    },
    {
        "title": "Opulence",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/w.htm#Wealth\">Wealth.<\/p>"
    },
    {
        "title": "Oracle",
        "desc": "<p>To dream of an oracle symbolizes your belief of fate. You are seeking some guidance or are expressing a desire to know what the future has in stored for you. The dream also serves to offer reassurance needed for you to move forward and look ahead in a positive direction.<\/p>"
    },
    {
        "title": "Oral Sex",
        "desc": "<p>To dream that you are giving or receiving oral sex signifies your willingness to give or receive pleasure\/joy. It is symbolic of your creative energy and reaffirms that you are headed in the right direction in life. The dream may also be a pun on &quot;talking about sex.&quot; Perhaps, you need to communicate with your mate about your sexual needs and desires. Or you are acting out your sexual wishes.<\/p><p>To dream that you are performing oral sex on yourself represents your need for self-gratification.<\/p>"
    },
    {
        "title": "Orange Juice",
        "desc": "<p>To see or drink orange juice in your dream symbolizes energy and vitality. Consider also the initials O.J. In particular, if you spill or dump orange juice in your dream implies that you need to get out of your shell and be more sociable.<\/p>"
    },
    {
        "title": "Oranges",
        "desc": "<p>To see an orange tree in your dream signifies health and prosperity.<\/p><p>To dream that you are eating oranges indicate satisfaction with your life and where you are at. You are in a good place. Alternatively, it means that you need to be reenergized.<\/p>"
    },
    {
        "title": "Orangutan",
        "desc": "<p>To see an orangutan in your dream signifies your wild inner character and sexual desires. Alternatively, an orangutan suggests that you are being manipulated.<\/p>"
    },
    {
        "title": "Orb",
        "desc": "<p>To see an orb in your dream symbolizes truth and a sudden understanding or realization. You have clarity on some nagging problem or issue. Alternatively, the orb refers to your subconscious. Something from your subconscious is trying to make its way to the surface. The color of the orb indicates whether the dream is positive or negative. If it is multi-color, then it is positive.<\/p>"
    },
    {
        "title": "Orca",
        "desc": "<p>To see an orca in your dream indicates that you need to be more social or more vocal about something. Step up and speak up. Alternatively, the dream symbolizes spiritual guidance. You are ready to confront your emotions and make the connection between the conscious and subconscious aspects of yourself.<\/p>"
    },
    {
        "title": "Orchard",
        "desc": "<p>To see or be in an orchard in your dream represents your potential for success. Alternatively, it symbolizes fertility.<\/p>"
    },
    {
        "title": "Orchestra",
        "desc": "<p>To dream that you are in an orchestra represents inner integration, resolution, and harmony. You need to incorporate various aspects of your life. Alternatively, an orchestra refers to your desires to fit in and be accepted by society.<\/p><p>To hear the music of an orchestra signifies your connection to humanity. You are sympathetic and passionate about your beliefs.<\/p><p>To dream that you are conducting an orchestra indicates control, empowerment. or manipulationThe dream may also be a metaphor suggests that you are &quot;orchestrating&quot; some plan.<\/p>"
    },
    {
        "title": "Orchids",
        "desc": "<p>To see orchids in your dream symbolize gentleness, romance, beauty, lust and sensuality. There is a situation or relationship that requires special attention and care. Alternatively, the orchid serves as a reminder that you are surrounded by wealth and riches.<\/p>"
    },
    {
        "title": "Ore",
        "desc": "<p>To see ore in your dream indicates that you are still in the process of digesting certain concepts that you have learned in your life. Understand the lesson learned and apply them to solve life's problems. Some information as presented may need to be deciphered and dissected in order to be understood.<\/p>"
    },
    {
        "title": "Organ",
        "desc": "<p>To hear or play an organ in your dream represents your spiritual connection and religious views. The dream may also be a metaphor to represent the penis.<\/p><p>To dream of your internal organ indicates concerns about your health. Consider the specific organ for additional significance.<\/p>"
    },
    {
        "title": "Organist",
        "desc": "<p>To see an organist in your dream represents discipline and harmony. You need to learn to embrace and express your spirituality.<\/p>"
    },
    {
        "title": "Organize",
        "desc": "<p>To dream that you are organizing means that you need to sort out some issue in your life. You need order and stability. Consider what you are organizing and how it parallels an issue in your waking life. Alternatively, the dream signifies that you are in a rut. Life has become mundane and monotonous.<\/p>"
    },
    {
        "title": "Orgasm",
        "desc": "<p>To dream that you are having an orgasm represents an exciting end to something. What have you just completed in your life? Alternatively, the dream means that you are not getting enough sex. You need to relieve some of your sexual tensions.<\/p><p>To dream that you do not achieve orgasm signifies some frustration in your life. Something is leaving you unfulfilled and unsatisfied. Note that the frustration may not necessarily be sexually related.<\/p>"
    },
    {
        "title": "Orgy",
        "desc": "<p>To see an orgy in your dream signifies repressed desires of your own sexuality and passion.Perhaps you are too conservative in your sex life and need to experiment. It may also mean that there is some sort of confusion in how and where you distribute your energies. You may be going into too many directions and as a result, are spread too thin.<\/p>"
    },
    {
        "title": "Orient",
        "desc": "<p>To dream that you are in the orient signifies spiritual awakening, wisdom and intuition. Alternatively, the dream may be telling you that you need to reevaluate your decisions and goals.<\/p>"
    },
    {
        "title": "Origami",
        "desc": "<p>To fold or make origami in your dream represents your creativity. You need to learn to express yourself through paper and your imagination. In other words, you should write more. Consider also what you are making in origami and look up the significance of that object.<\/p>"
    },
    {
        "title": "Ornament",
        "desc": "<p>To see or hang an ornament in your dream refers to the things in your life that you do to make yourself feel good. It is also symbolic of a spiritual gift.<\/p>"
    },
    {
        "title": "Oriole",
        "desc": "<p>To see an oriole in your dream represents the sun, light and happiness. It may be symbolic of summertime.<\/p>"
    },
    {
        "title": "Orphan",
        "desc": "<p>To see an orphan in your dream signifies fears of abandonment. You feel lonely and rejected.<\/p><p>To dream that you are an orphan suggests that you need to learn to be more independent and self-sufficient. Alternatively, the dream may be telling you that you have a lot of love to offer others. Don't sell yourself short.<\/p>"
    },
    {
        "title": "Orphanage",
        "desc": "<p>To dream that you are in an orphanage signifies your sense of belonging or the lack of. You feel you are alone in the world. Perhaps you think no one understands what you are going though or how you are feeling.<\/p><p>Dreaming of escaping from an orphanage reflects your desire to get away from certain restrictions or rules. You are trying to discover your own place in the world.<\/p>"
    },
    {
        "title": "Orthodontist",
        "desc": "<p>To see an orthodontist in your dream represents your concerns about your appearance. Alternatively, the dream indicates your diminishing power. You are losing your authority or effectiveness in some area of your waking life.<\/p>"
    },
    {
        "title": "Ostrich",
        "desc": "<p>To see an ostrich in your dream suggests that you are not facing reality. You are in denial about something and living in a world of your own. Perhaps, there is a situation that you are unwilling to accept. Alternatively, the ostrich can symbolize truth and justice.<\/p><p>To see an ostrich egg in your dream symbolizes rebirth.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/www.dreammoods.com\/commondreams\/chasedream4.htm\">Alligator In Ostrich Suit&quot;<\/p>"
    },
    {
        "title": "Otter",
        "desc": "<p>To see an otter in your dream symbolizes happiness, playfulness and good fortune. You are navigating through your emotional life with ease and joy.<\/p>"
    },
    {
        "title": "Ottoman",
        "desc": "<p>To see or use an ottoman in your dream symbolizes relaxation. You need to slow down and take some time out for yourself.<\/p>"
    },
    {
        "title": "Otoscope",
        "desc": "<p>To see or use an otoscope in your dream implies that you need to pay close attention to something that you are overlooking in your waking life. Listen carefully."
    },
    {
        "title": "Ouija Board",
        "desc": "<p>To see an Ouija board in your dream indicates that some relationship or situation is falling apart. Nothing is going according to planned. Alternatively, it suggests that you are ready to take certain risks in order to move ahead. The dream may also be a way of connecting with your subconscious. Consider the message that the Ouija board is telling you.<\/p><p>To dream that the Oiuja board fails to function indicates that your pursuit for pleasure will cause your demise and downfall. Alternatively, the dream implies that you are inviting negativity into your life.<\/p>"
    },
    {
        "title": "Out Of Order",
        "desc": "<p>To dream that something is out of order (as in not working) indicates that you are being confronted with an obstacle toward your goal. You need to find a new or different way to achieve this goal. Alternatively, dreaming of something that is out of order is analogous to a dysfunctional relationship or unfulfilled goal. Some aspect of your life is not working smoothly.Consider the significance of the object that is broken and who it play into your daily life.<p>Dreamingof something being out of order (as in not in the correct sequence) represents your thought process. The dream is telling you to look at things from a different perspective."
    },
    {
        "title": "Outbreak",
        "desc": "<p>To dream that there is an outbreak suggests that you are letting negativity rule your behavior. Feelings of resentment is taking over you.<\/p>"
    },
    {
        "title": "Outcast",
        "desc": "<p>To dream that you are an outcast represents some rejected aspect of yourself. Perhaps there is a quality or characteristic that you need to rid yourself of.<\/p>"
    },
    {
        "title": "Outer Space",
        "desc": "<p>To dream of outer space represents your boundless creativity. Alternatively, the dream may be a metaphor that something or someone has just came out of nowhere.<\/p>"
    },
    {
        "title": "Outhouse",
        "desc": "<p>To see an outhouse in your dream suggests that you need to be more open with your feelings. You are holding something back, especially when it comes to your emotions.<\/p>"
    },
    {
        "title": "Outlaw",
        "desc": "<p>To dream that you are an outlaw signifies the repressed and animalistic side of your character. Alternatively, the dream suggests that you feel the rules do not apply to you. You feel that you are above those around you.<\/p>"
    },
    {
        "title": "Outlet",
        "desc": "<p>To see an outlet in your dream represents your potential and untapped energies. The dream symbol may also be a metaphor for something shocking. Or perhaps you are looking for an &quot;outlet&quot; to express your raw emotions.<\/p>"
    },
    {
        "title": "Outside",
        "desc": "<p>To dream that you are outside represents freedom, openness and opportunities. You are able to spread out and enjoy. Alternatively, the dream signifies your need to be more expressive. It is telling you that you need to stop closing yourself off.<\/p>"
    },
    {
        "title": "Oval",
        "desc": "<p>To see an oval in your dream represents the vagina, womb and feminine qualities. The oval shape is also symbolic of your aura and your spiritual energy.<\/p>"
    },
    {
        "title": "Ovaries",
        "desc": "<p>To dream of your ovaries signify your desire for children or your preoccupation with getting pregnant. Alternatively, the dream symbolizes fruitfulness, growth or new beginnings.<\/p>"
    },
    {
        "title": "Oven",
        "desc": "<p>To see a hot oven in your dream indicates passion, loyalty, warmth, devotion, togetherness and unselfishness. You are surrounded by friends and family. Alternatively, an oven symbolizes the womb. You are either in anticipation or in fear of having children. Consider the phrase &quot; a bun in the oven&quot; to indicate a pregnancy.<\/p><p>To see a toy oven in your dream implies that you or someone is not being genuine. Your passion or loyalty is being questioned.<\/p>"
    },
    {
        "title": "Oven Mitts",
        "desc": "<p>To see or wear oven mitts in your dream indicates that you are dealing with some emotional situation or issue in your life that needs to be handled with care. The dream may be a metaphor that if you are not careful, you may get burned by a business deal or romantic relationship.<\/p>"
    },
    {
        "title": "Overcoat",
        "desc": "<p>To wear an overcoat in your dream suggests that you are shielding yourself from life's hurt. You are putting up a proverbial wall.<\/p>"
    },
    {
        "title": "Overalls",
        "desc": "<p>To dream that you are wearing overalls represent your sloppy attitudes and incoherent thoughts. Or it may signify your laid-back attitudes. Alternatively, the dream may be a pun on the &quot;overall&quot; picture. You need to look at the broad perspective.<\/p>"
    },
    {
        "title": "Overdose",
        "desc": "<p>To dream that you or someone overdosessuggests that you do not know your limits. You may be pushing yourself too hard. Alternatively, the dream means that you are on a self-destructive path. You need to make some significant changes to your life.<\/p>"
    },
    {
        "title": "Ovulation",
        "desc": "<p>* Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m2.htm#Menstruation\">Menstruation.<\/p>"
    },
    {
        "title": "Owl",
        "desc": "<p>To see an owl in your dream symbolizes wisdom, insight, magic, expanded awareness and virtue. You are highly connected to your intuitive senses and psychic power. The owl is also synonymous with death, darkness and the subconscious. The appearance of an owl may be telling you to let go of the past or certain negative behaviors. Dreaming of a white owl or a snow owl highlights your new awareness and enlightenment.<\/p><p>To hear the hoot of an owl in your dream denotes disappointments and death. Your subconscious mind may be trying to get your attention.<\/p><p>To see a dead owl in your dream signifies some illness or death.Death in this sense may be a symbolic death, as in an important transition in life or the end of a negative habit.<\/p><p>To dream that an owl is trying to peck your eyes out means lacking insight. There is an issue that you are trying desperately to avoid.<\/p><p>To see the feather of an owl, implies that you need to share your knowledge and wisdom with others.<\/p>"
    },
    {
        "title": "Ox",
        "desc": "<p>To see an ox in your dream represents the balance between the masculine power and the feminine mystique. You are well in tune with the opposite sex. Alternatively, an ox symbolizes hard work, strength, and reliability. Consider also the familiar metaphor, &quot;as stubborn as an ox&quot;.<\/p>"
    },
    {
        "title": "Oxygen",
        "desc": "<p>To dream of oxygen symbolizes renewal and creative energy. You are feeling rejuvenated and reenergized.<\/p><p>To dream that you do not have enough oxygen suggests that you are feeling suffocated or smothered by a situation in your life.<\/p>"
    },
    {
        "title": "Oxygen Mask",
        "desc": "<p>To see or wear an oxygen mask in your dream suggests that you are feeling helpless, stifled or smothered in your waking life. You are unable to express your feelings.<\/p>"
    },
    {
        "title": "Oysters",
        "desc": "<p>To dream that you are eating oysters indicate sexual urges and gratification.<\/p><p>To see oysters in your dream symbolize beauty, humility, wealth, and wisdom. Alternatively, oysters indicate that you are closing yourself off and shutting others out. Or perhaps, the dream is telling you that &quot;the world is your oyster&quot;. You need to go out and go after what you want and achieve your heart's desires. Experience life.<\/p><p>To see oyster shells in your dream signify financial frustrations.<\/p>"
    }
]