[
    {
        "title": "P",
        "desc": "<p>To see the letter &quot;P&quot; in your dream is a pun on &quot;pee&quot; or urine. You need to better express your emotions.<\/p>"
    },
    {
        "title": "Pac Man",
        "desc": "<p>To see or play Pac Man in your dream represents some sort of habit or behavior that is taking over your daily life.<\/p>"
    },
    {
        "title": "Pacifier",
        "desc": "<p>To see a pacifier in your dream represents emotional nurturance. You are expressing a desire to escape from your daily responsibilities and demands.<\/p><p>To dream that you are sucking on a pacifier implies that you are trying to &quot;suck up to&quot; someone in your waking life. It may also denote your immature attitude.<\/p>"
    },
    {
        "title": "Pacify",
        "desc": "<p>To dream that you are trying to pacify someone or something indicates your ability to remain calm or objective in a situation. Others are looking onto you in a time a crisis.<\/p>"
    },
    {
        "title": "Package",
        "desc": "<p>To see a package in your dream represents hidden creative energy, skills, and\/or feelings. If you receive a package, then it indicates that you are acknowledging certain feelings or acquiring new resources. If you are giving or sending a package, then it suggests that you are projecting your feelings onto another instead of dealing with them.<\/p>"
    },
    {
        "title": "Packing",
        "desc": "<p>To dream that you are packing signifies big changes ahead for you. You are putting past issues to rest or past relationships behind you. Alternatively, it represents the burdens that you carry.<\/p><p>To dream that you are packing, unpacking and packing and unpacking again represents chaos in your life. You are feeling overwhelmed with the various things you are juggling in your life. You are carrying around too many burdens and need to let go. Consider what unfinished business you have to tend to. Try to resolve these issues so they can finally be put to rest.<\/p><p>To dream that you are packing, but the more your pack, the more there is to pack implies that you are weighed down by the endless responsibilities and expectations in your life. As a result, you are stuck in your current circumstances.<\/p>"
    },
    {
        "title": "Padlock",
        "desc": "<p>*Please See: <a href=\"#Lock\">Lock<\/a>.<\/p>"
    },
    {
        "title": "Paddle",
        "desc": "<p>*Please See: <a href=\"#Oar\">Oar<\/a>.<\/p>"
    },
    {
        "title": "Paddleball",
        "desc": "<p>To see or play with a paddleball in your dream represents your frivolous pursuits. You are restrained from going after what you really want.<\/p>"
    },
    {
        "title": "Paddleboat",
        "desc": "<p>*Please See: <a href=\"#Rowboat\">Rowboat<\/a>.<\/p>"
    },
    {
        "title": "Paddling",
        "desc": "<p>*Please See: <a href=\"#Rowing\">Rowing<\/a>.<\/p>"
    },
    {
        "title": "Pagan",
        "desc": "<p>If you are not a pagan, but dream that you are, then it suggests that you are misdirecting or misusing your energy.<\/p><p>If you are a pagan and see another pagan in your dream refers to an important message from a divine power. You are looking for guidance.<\/p>"
    },
    {
        "title": "Page",
        "desc": "<p>To see or read a page in your dream signifies a summary of your life. It is a reflection of what you have done what where you are headed. Alternatively, it suggests that you are on the rebound from a broken relationship. Be careful not to jump into a hasty relationship with someone ill-suited for you.<\/p><p>To see a blank page in your dream signifies unproductively. You are not doing anything or going anywhere in your life. You are stagnant state.<\/p><p>To dream that you are a page refers to your lack of motivation. You are spending too much time on pleasure and fruitless activities.<\/p>"
    },
    {
        "title": "Pageant",
        "desc": "<p>To watch or dream that you are in a beauty pageant refers to your own insecurities about your appearances. You are constantly comparing yourself to others and how you measure up to them. You may also be subscribing to society's unattainable standards of beauty.<\/p>"
    },
    {
        "title": "Pager",
        "desc": "<p>To see a pager in your dream suggests that someone is trying hard to communicate their thoughts to you. Someone is trying to get through to you one way or another. On the other hand, you may feel that someone is pushing their beliefs and ideas onto you.<\/p>"
    },
    {
        "title": "Pagoda",
        "desc": "<p>To see a pagoda in your dream represents your own sense of spirituality. You may be embracing something that you may not be familiar with. Alternatively, the pagoda symbolizes the phallus and thus have sexual connotations.<\/p>"
    },
    {
        "title": "Pail",
        "desc": "<p>To see or carry a pail in your dream indicates an improvement in your current situation. If the pail is filled, then it signifies abundance, love and wealth. If the pail is empty, then it means that you will overcome some loss or conflict. The dream may also be a pun on &quot;pale.&quot;<\/p>"
    },
    {
        "title": "Pain",
        "desc": "<p>To dream that you are in pain suggests that you are being too hard on yourself, especially if a situation was out of your control. The dream may also be a true reflection of actual pain that exists somewhere in your body. Dreams can reveal and warn about health problems. Consider where the pain is for additional significance. If the pain is in your neck, then the dream may be a metaphor that you are literally being a &quot;pain in the neck&quot;.<\/p><p>To dream that you are inflicting pain to yourself indicates that you are experiencing some overwhelming turmoil or problems in your waking life. You are trying to disconnect yourself from your reality by focusing on the pain that you inflicted to yourself.<\/p>"
    },
    {
        "title": "Paint",
        "desc": "<p>To see paint in your dream symbolizes expression of your inner emotions. Consider the color of the paint and how the color makes your feel. It is this feeling that you need to express more in your waking life.<\/p><p>To mix paint in your dream suggests that you are incorporating a little variety in your life.<\/p><p>If you see or touch wet paint in your dream, then it implies that you are unsure about your feelings. It may also mean that whatever you are feeling is still very fresh or raw.<\/p>"
    },
    {
        "title": "Paintball",
        "desc": "<p>To dream that you are playing paintball represents your competitive, but fun side. You have a chance to accomplish something great in an area of your life. However, you need to proceed carefully to avoid being ambushed or blindsided, especially by malicious coworkers, friends or enemies. If you are hit by a paintball, then it symbolizes a minor setback. Also consider the color of the paint for clues on your emotions.<\/p><p>To dream of stalking someone in paintball signifies your eagerness to tackle a challenge.<\/p><p>If you are being stalked in paintball, then it symbolizes hidden dangers.<\/p>"
    },
    {
        "title": "Paintbrush",
        "desc": "<p>To see or use a paintbrush in your dream represents harmony and creativity. It is also symbolic of your artistic talents.<\/p>"
    },
    {
        "title": "Painting",
        "desc": "<p>To dream that you are painting your house indicates that you will experience success in a new project. You may even be promoted to a coveted position. You may be expressing your creativity. Alternatively, the dream indicates that you are covering up something. If someone else is painting your house, then it suggests that someone close to you is hiding something from you. Also consider the color of the paint to determine any additional significance. For example, red colored paint may imply painting the town red and releasing pent up excitement.<\/p><p>To dream that paint has gotten on your clothes signifies that you are too easily offended by criticism about you.<\/p><p>To see a painting in your dream represents creativity and your need for self-expression. The painting is symbolic of your intuition and inner realizations.<\/p><p>To dream that you are painting a picture indicates that you need to express your creative side more.<\/p>"
    },
    {
        "title": "Pairs",
        "desc": "<p>To see a pair of something in your dream represents the need for balance in your life. The pair may be symbolic of your life partner or soul mate.<\/p>"
    },
    {
        "title": "Pajama Party",
        "desc": "<p>*Please See: <a href=\"#Sleepover\">Sleepover<\/a>.<\/p>"
    },
    {
        "title": "Pajamas",
        "desc": "<p>To see or wear pajamas in your dream suggests that you need to relax and get some rest. In particular, if you dream that you are wearing pajamas in public, then it means that you are unaware of something important that may be right in front of you. You are drifting through life without fully paying attention to what is going on around you.<\/p>"
    },
    {
        "title": "Palace",
        "desc": "<p>To see a palace in your dreamsymbolizes wealth and prominence. You are ready to utilize your full potential.<\/p><p>If you are living in a palace, then it signifies that success is right within your reach.<\/p>"
    },
    {
        "title": "Pale",
        "desc": "<p>To dream that you are pale symbolizes sickness, disaster or fear. Some situation or relationship is emotionally draining you.<\/p>"
    },
    {
        "title": "Palette",
        "desc": "<p>To see or use a an artist's palette in your dream indicates that you are not afraid to express your innermost emotions. Alternatively, dreaming about a palette means that you are being your true self or that someone is being their real self; the are not putting on any facade.<\/p>"
    },
    {
        "title": "Pall",
        "desc": "<p>To see a pall in your dream symbolizes death or the end of something. Alternatively, the dream indicates that you are trying to hide or suppress some emotion or aspect of your life that you are not ready to confront.<\/p><p>To dream that you raise the pall from a coffin signifies bad news, bereavement, or grief. Alternatively, the dream suggests that you are ready to reveal some deep emotion.<\/p>"
    },
    {
        "title": "Pallbearer",
        "desc": "<p>To see a pallbearer in your dream suggests denotes that you have to keep your temper in check.<\/p><p>If the pallbearer is carrying a coffin in your dream then it reflects changes in your life. Perhaps you are transitioning into a new career, new home, or new life path.<\/p>"
    },
    {
        "title": "Pallet",
        "desc": "<p>To see a pallet in your dream symbolizes industry and manual labor.<\/p>"
    },
    {
        "title": "Palm",
        "desc": "<p>To notice your palm in your dream represents your generosity and openness, especially if they are open. You are always willing to help others. If you dream that your palm is closed, then it means that there is something that you are trying to hide or shield. Alternatively, to dream of your palm means that you hold the power in your own hands. You have the knowledge within yourself to maximize your potential.<\/p>"
    },
    {
        "title": "Palm Reading",
        "desc": "<p>To dream that you are having your palms read represent your life goals and ambition. The dream shows how you want to live your life and where you want to be headed.<\/p>"
    },
    {
        "title": "Palm Tree",
        "desc": "<p>To see a palm tree in your dream represents tranquility, high aspirations, fame, victory, hopes, and longevity. It also symbolizes paradise and leisure. Perhaps you need to take time for a vacation and relaxation.<\/p>"
    },
    {
        "title": "Palpitations",
        "desc": "<p>To dream that you are having palpitations represent fears that you are not confronting in your waking life. You may also be nervous about something.<\/p>"
    },
    {
        "title": "Pan",
        "desc": "<p>To see a pan in your dream refers to your attitude and your stance on a particular situation. It may also represent criticism and anger. If the pan is made of glass, then it means that you being conscious and aware about a particular situation. You are also opening yourself up to criticism. As a receptacle, it symbolizes the womb.<\/p><p>To see a frying pan in your dream represents completeness in love. Alternatively, it suggests that you need to start accepting the consequences of your actions. You may have found yourself in an inescapable situation.<\/p>"
    },
    {
        "title": "Pancake",
        "desc": "<p>To make or eat pancakes in your dream represent gratification and pleasure in your current situation. You take pleasure and comfort in the simple things of life.<\/p>"
    },
    {
        "title": "Panda",
        "desc": "<p>To see a panda in your dream suggests that you are having difficulties coming to a compromise in a waking situation. You need to find a middle ground so that all parties involved will be satisfied. Alternatively, a panda is symbolic of your own childlike qualities or something that is cuddly.<\/p>"
    },
    {
        "title": "Pandora's Box",
        "desc": "<p>To dream of a Pandora's box indicates hope. You will soon experience a turn for the better. Alternatively, it symbolizes your curiosity, your subconscious thoughts and your need to express them.<\/p>"
    },
    {
        "title": "Pangolin",
        "desc": "<p>To see a pangolin in your dream means that you need to protect yourself from your own drive. You are moving forward too recklessly and need to think before taking action.<\/p>"
    },
    {
        "title": "Panic",
        "desc": "<p>To dream that you are in a panic indicates a lack of control and power in your life. You are feeling helpless in some situation or unable to make a clear decision. Calm down.<\/p>"
    },
    {
        "title": "Pansy",
        "desc": "<p>To see a pansy in your dream symbolizes undying and never ending love. It may also mean thoughtfulness, remembrance and nobility of the mind. Alternatively, it suggests that you are being too gullible. Or that you are not standing up for yourself.<\/p>"
    },
    {
        "title": "Panther",
        "desc": "<p>To see a panther in your dream signifies lurking danger and enemies working to do you harm. It represents darkness, death, and rebirth. On a more positive note, panthers signify power, beauty and\/or grace. Consider the feel of your dream to determine which meaning applies.<\/p>"
    },
    {
        "title": "Panties",
        "desc": "<p>To see or wear panties in your dream represent your feminine attitudes and feelings. It reflects a female point of view.<\/p><p>To dream that you are taking off your panties signifies your ideas of sexuality. It may also indicate your need to get to the bottom of things. You may want to find a way out of a situation.<\/p>"
    },
    {
        "title": "Pantomime",
        "desc": "<p>To see a pantomime in your dream represents a time in your life when things were more carefree and spontaneous. Alternatively, the dream may be dramatically calling your attention to an area that you need to be more aware of.<\/p><p>To dream that you are a pantomime indicates that your voice is not being heard. Or your actions are being misunderstood and misconstrued.<\/p>"
    },
    {
        "title": "Pantry",
        "desc": "<p>To see or open the pantry in your dream means that you have many resources within your reach. There is help when you need it. If the pantry is bare or empty, then it points to an emotional void that you are experiencing in your waking life.<\/p>"
    },
    {
        "title": "Pants",
        "desc": "<p>To see or wear pants in your dream suggest that you are questioning your role in some situation. Consider the material and color of the pants for additional interpretation. Alternatively, the dream may be hinting at some sexual matter.<\/p><p>To dream that you are wearing velvet pants signifies your sensual side.<\/p>"
    },
    {
        "title": "Pantyhose",
        "desc": "<p>To see or wear a pantyhose in your dream represents alluring sexuality. Consider the color of the pantyhose. If it is nude or beige color, then it signifies your discreteness. If it is black, then it symbolizes your hidden sexuality waiting to be expressed. If it is red, then it represents overt sexuality. If the pantyhose is torn or have a run, then it indicates lacking self esteem and reduced self confidence.<\/p>"
    },
    {
        "title": "Papaya",
        "desc": "<p>To see or eat papaya in your dream indicates a healthy sex drive.<\/p>"
    },
    {
        "title": "Pap Smear",
        "desc": "<p>To dream that you are getting a pap smear indicates concerns with your body and\/or sexuality. You are feeling insecure. Alternatively, the dream may just represent your anxiety about your pap smear results or that you are due for a pap smear.<\/p>"
    },
    {
        "title": "Paper",
        "desc": "<p>To see blank white paper in your dream signifies your desire to make a fresh start in your life. You need to express yourself through writing or art. Alternatively, blank paper indicates that you need to work on being more communicative.<\/p><p>To see a stack of papers in your dream denotes overwhelming responsibilities and stress that you are having to cope with. You are not effectively dealing with the issues at hand.<\/p><p>To see crumpled paper in your dream symbolizes abandoned ideas.<\/p><p>Dreaming of a piece of red paper suggests that you need to communicate your anger in a more effective and rational manner. Alternatively, red paper is symbolic of luck, happiness and wealth.<\/p>"
    },
    {
        "title": "Paper Bag",
        "desc": "<p>To see an empty or folded paper bag in your dream represents the womb, secrets and the feminine.<\/p><p>To see a filled paper bag in your dream denotes something that may appear ordinary on the outside but can be extraordinary inside. In other words, do not judge something or someone by outside appearances. Consider what is inside the bag for additional significance.<\/p>"
    },
    {
        "title": "Paper Plane",
        "desc": "<p>To see or fold a paper plane in your dream represents your frivolous pursuits. You are wasting time with ideas that go no where.<\/p>"
    },
    {
        "title": "Paper Plates",
        "desc": "<p>To see or use a paper plate in your dream represents temporary nourishment or rewards. You need to take advantage of an opportunity before it is gone forever.<\/p><p>To dream that you are writing on a paper plate refers to a fleeting idea or a message that you need to quickly convey.<\/p>"
    },
    {
        "title": "Paper Towel",
        "desc": "<p>To see or use a paper towel in your dream suggests that you are experiencing some temporary setbacks. You need to quickly clean up your past issues before you can move forward with your life.<\/p>"
    },
    {
        "title": "Paperclip",
        "desc": "<p>To see or use a paper clip in your dream indicates that you are trying to hold together a relationship. Alternatively, a paperclip means that you need to organize certain aspects of your life.<\/p>"
    },
    {
        "title": "Paparazzi",
        "desc": "<p>To dream that you are being chased or stalked by the paparazzi indicates that your privacy is being violated. You feel that your own identity is lost. Alternatively, the dream represents your aspirations for fame.<\/p><p>To dream that you are a paparazzo suggests that you chasing and seeking fame.<\/p><p>To see the paparazzi in your dream represents your need to focus in on a particular situation. You are trying to capture some idea or concept.<\/p>"
    },
    {
        "title": "Paprika",
        "desc": "<p>To see or taste paprika in your dream represents someone or something is trying to get your attention. Alternatively, dreaming about paprika is a warning of seeing a different side of a person when they are angry.<\/p>"
    },
    {
        "title": "Papyrus",
        "desc": "<p>To see a papyrus in your dream indicates that you need to look to the past order to learn from it.<\/p>"
    },
    {
        "title": "Parachute",
        "desc": "<p>To dream that you are in a parachute represents a protective force over you. You have a sense of security. Alternatively, the dream implies that it is time to bail out of a situation or abandon an old idea or habit.<\/p><p>To dream that you have difficulties with a parachute or that the parachute does not open suggests that you are let down by someone you relied on and trusted. You feel abandoned.<\/p>"
    },
    {
        "title": "Parade",
        "desc": "<p>To dream that you are watching a parade indicates that you are being sidetracked or distracted from achieving your goals. You may even be purposely preventing yourself from pursuing your goals and desires because you fear that you will fail. Alternatively, the parade symbolizes cycles, passage of time, or a special event in your life. Consider also the symbolism of whatever figures\/animals\/floats are in the parade. They may reflect a need for you to incorporate these attributes into your own character.<\/p><p>To dream that you are in a parade indicates that you are going along with the masses and with what everybody else wants. Alternatively, the dream indicates that you have a set path in life and know which direction you want to go.<\/p>"
    },
    {
        "title": "Paradise",
        "desc": "<p>To dream that you are in paradise symbolizes your desire to achieve spiritual perfection. Your dream is expressing a desire to retreat from the stresses of the real world. Alternatively, it indicates that you are living in your own world. You are not being realistic.<\/p>"
    },
    {
        "title": "Parakeets",
        "desc": "<p>To see a parakeet in your dream indicates that you lack initiative and new idea. You need to be more unconventional and spontaneous. The dream also relates to dependency and immaturity.<\/p>"
    },
    {
        "title": "Parallel",
        "desc": "<p>To see a parallel line in your dream suggests that you like to avoid conflict and confrontation. The dream may also be highlighting how you are too linear in your thinking.<\/p><p>To dream that you are in a parallel dimension or parallel universe implies some regret you have about a past decision or choice.<\/p>"
    },
    {
        "title": "Paralyzed",
        "desc": "<p>To dream that you are paralyzed reflects the current state of your body while you are dreaming. During the REM state of sleep, your body is really immobile and paralyzed. People report that they cannot run or hit, despite how hard they try.<\/p><p>Symbolically, dreaming that you are paralyzed means you are feeling helpless or pinned down in some aspects or circumstances of your waking life. You may feel unable to deal with a situation or change anything. Alternatively, the dream suggests that you are feeling emotionally paralyzed. You have difficulties expressing your feelings.<\/p><p>*Please see also: <a href=\"#immobility\">Immobility<\/a>. See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=firedream2\">Smell Of Fire<\/a>&quot; and &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=paralyzedream1\">Paralyzed<\/a>&quot;<\/p>"
    },
    {
        "title": "Paramedics",
        "desc": "<p>To see the paramedics in your dream signify an issue that you need to address immediately before it gets to a critical state. You have been avoiding the problem for too long. Alternatively, the dream may mean that there is a situation or relationship that you need to &quot;revive&quot;.<\/p>"
    },
    {
        "title": "Paranoia",
        "desc": "<p>To dream that you are paranoid indicates your hesitance in moving forward in some situation or relationship. You are so overcome with fear and suspicion that you are not ready to take that major step in your life.<\/p>"
    },
    {
        "title": "Paranormal",
        "desc": "<p>To dream that objects are moving on its own or that switches and electronics are turning on\/off or some other paranormal activity indicates that you are refusing to take responsibility for your actions. The dream is also saying that you tend to let things happen instead of making things happen.<\/p>"
    },
    {
        "title": "Parasite",
        "desc": "<p>To see a parasite in your dream suggests that you are feeling physically drained. You are becoming too dependent on others and experiencing a significant loss of vitality. Alternatively, a parasite refers to your tendency of taking without giving back.<\/p>"
    },
    {
        "title": "Parasol",
        "desc": "<p>*Please See: <a href=\"#Umbrella\">Umbrella<\/a>.<\/p>"
    },
    {
        "title": "Parcel",
        "desc": "<p>*Please See: <a href=\"#Box\">Box<\/a>.<\/p>"
    },
    {
        "title": "Parchment",
        "desc": "<p>To see or dream that you are writing on parchment implies that there is special importance in the words that you are seeing or writing. Pay attention to the words and its significance to your waking life.<\/p>"
    },
    {
        "title": "Pardon",
        "desc": "<p>To dream that you or someone has been pardoned suggests that you need to be more forgiving in some situation.<\/p>"
    },
    {
        "title": "Parents",
        "desc": "<p>To see your parents in your dream symbolize both power, shelter, and love. You may be expressing your concerns and worries about your own parents. Alternatively, it represents the merging of the female and male aspects of your character.<\/p><p>To dream about the death of your parents indicates that you are undergoing a significant change in your waking life. Your relationship with your parents has evolved into a new realm.<\/p><p>Dreaming about your friend's parents, even though you may have never met them, refers to your wishes of how you want your own parents to be like.<\/p><p>*See: <a href=\"#father\">Father<\/a> and: <a href=\"#mother\">Mother<\/a>.<\/p>"
    },
    {
        "title": "Paris",
        "desc": "<p>To dream that you are in Paris symbolizes your need for romance and passion. It also suggests that you are a person of distinction. You own personal experiences and knowledge of Paris will supersede the suggested interpretation here.<\/p>"
    },
    {
        "title": "Park",
        "desc": "<p>To dream that you are at a park represents a temporary escape from reality. It indicates renewal, meditation, and spirituality. You may be undergoing a readjustment period after experiencing some serious personal conflict or an end to a passionate affair.<\/p><p>To dream that you are lost in a park indicates your struggles with your career, relationship, or other problem. You may feel alienated by society.<\/p><p>To dream that you are parking your car represents your desire to settle down. Alternatively, it means that you feel accomplished in your goals and satisfied with your life. If you have difficulty parking the car, then it means that you are in some sort of a rut. You are feeling restless. Perhaps you wished you had taken a different path in your life.<\/p><p>To dream that you parked your car in a non-parking zonesuggests that you are poking your head in places where you do not belong. If you forgot where you parked, then it indicates that you have lost your direction in life. You are going off track.<\/p>"
    },
    {
        "title": "Park Ranger",
        "desc": "<p>To see or dream that you are a park rangerrepresents control of your subconscious. You are also keeping your emotions in check.<\/p>"
    },
    {
        "title": "Parking Attendant",
        "desc": "<p>To dream that you are a parking attendant indicates that you arelacking your own direction in life. You are always helping others with their goals.<\/p>"
    },
    {
        "title": "Parking Lot",
        "desc": "<p>To dream that you are in parking lot suggests that you need to slow down and take time from your daily activities.<\/p><p>To dream that you cannot find a parking space indicates your inability to find your place in life. You may still be searching for your niche. Alternatively, the dream may reflect your busy life and the lack of time you have.<\/p>"
    },
    {
        "title": "Parking Meter",
        "desc": "<p>To see a parking meter in your dream indicates that your leisurely and carefree days are soon coming to an end. You need to decide on a goal and what you want to do with your life before your time runs out. Alternatively, a parking meter suggests that you need to adjust your attitude or run the risk of offending others.<\/p>"
    },
    {
        "title": "Parking Structure",
        "desc": "<p>To see or dream that you are in a parking structure suggests that you are going around in circles in some area of your life. You are feeling lost in what you want to do. If you cannot find your car, then it means that you have lost a little bit of yourself along the way toward your goals. You are turning into someone you dread or someone you don't know anymore.<\/p>"
    },
    {
        "title": "Parking Ticket",
        "desc": "<p>To dream that you are getting a parking ticket suggests that you are feeling lost and not knowing what you want to do with your life. You feel that you are being judged and criticized for the path you want to take. The dream may also be analogous to your lack of accomplishments or to the setbacks in your life.<\/p>"
    },
    {
        "title": "Parkour",
        "desc": "<p>To dream that you are performing a parkour move indicates that you are not letting any obstacles stand in your way of your goals. Alternatively, the dream means that you are in tune with your surroundings and environment. You are able to adapt to any situation.<\/p><p>To see someone performing parkour in your dream suggests that you need to be more flexible and efficient with how your manage your time.<\/p>"
    },
    {
        "title": "Parliament",
        "desc": "<p>To dream that you are part of parliament represents your leadership abilities. You need to speak up about some public matter. Alternatively, the dream means that you are seeking the spotlight or looking for attention.<\/p>"
    },
    {
        "title": "Parole",
        "desc": "<p>To dream that you are on parole implies that you need to consider the consequence of all your actions. There is a higher force who you need to answer to.<\/p>"
    },
    {
        "title": "Parrot",
        "desc": "<p>To see a parrot in your dream represents some message or gossip that is being conveyed to you. You need to think twice about repeating or sharing certain information. Alternatively, the parrot can denote a person in your waking life who is eccentric or obnoxious. It may also mean that you or someone is being repetitive or even mocking you.<\/p>"
    },
    {
        "title": "Parsley",
        "desc": "<p>To see parsley in your dream represents success. Your achievements will soon be recognized. Alternatively, it symbolizes purification. You need to rid yourself of the negativity and things that are weighing you down.<\/p>"
    },
    {
        "title": "Partner",
        "desc": "<p>To see a partner in your dream suggests that you need to seek the help of others in order to accomplish a mutual goal. Alternatively, a partner symbolizes the duality of your personality. Also consider your waking relationship with your own partner.<\/p>"
    },
    {
        "title": "Partner Swapping",
        "desc": "<p>To dream about partner swapping suggests that you want to add some spice to your sex life. You want to be more sexually adventurous. Consider the couple who you are swapping with for additional significance. Alternatively, the dream may mean that there are certain aspects that you wish that your significant other possess.<\/p>"
    },
    {
        "title": "Partridge",
        "desc": "<p>To see a partridge in your dream signifies independence. The partridge highlights your leadership abilities. Alternatively, it represents deception and temptation.<\/p>"
    },
    {
        "title": "Party",
        "desc": "<p>To dream that you are at a party suggests that you need to get out more and enjoy yourself. If the party is a bad one, then it indicates that you are unsure of your social skills. If you dream that you are at your own birthday party, then it represents appreciation for the life you have.<\/p><p>To dream that you are planning a party implies that you are being too methodical and need to be more spontaneous. It is time to let loose. Alternatively, the dream may simply reflect your stress level about planning an actual party.<\/p><p>If you are a man and dream that there are only men at a party suggests that you are questioning your abilities. You fear that you are being overlooked or not measuring up to others. Or perhaps you are also expressing desires of blending in and not standing out.<\/p><p>Dreaming that you are having a Tupperware party symbolizes your practical thinking.<\/p><p>* Please see: <a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?search=relationshipdream4&amp;method=exact&amp;header=dreamid\">Dream Moods Dream Bank: &quot;Do I Like Him?&quot;<\/a><\/p>"
    },
    {
        "title": "Party Horn",
        "desc": "<p>To see a party horn in your dream indicates that you do not have an outlet to freely express yourself. You feel stifled in some way.<\/p>"
    },
    {
        "title": "Passageway",
        "desc": "<p>To discover secret passageways in your dream parallel to something new and\/or exciting that is occurring in your waking life. It refers to a new opportunity, a new relationship, or a new attitude toward life. If you wake up before fully exploring these passageways, then it suggest that you may not know how to take advantage of these opportunities or how to move forward with a relationship. Perhaps the newness and uncertainty of this discovery also makes you a littlemore cautious. Overall, this is a positive dream.<\/p>"
    },
    {
        "title": "Passenger",
        "desc": "<p>To dream that you are a passenger suggests that you are not in control of your life. You are letting others decide for you. To see other passengers in your dream indicates that you are spending too much energy pleasing others. Perhaps, you feel that others have been leeching off of you.<\/p>"
    },
    {
        "title": "Passion Fruit",
        "desc": "<p>To see or eat a passion fruit in your dream represents your spiritual connection. You are in tune with your spirituality. Alternatively, it signifies fertility, good health, life and longevity. The allure and invitation of sex is also implied. The dream may be a metaphor for a project (fruit) that you are &quot;passionate&quot; about.<\/p><p>To drink passion fruit in your dream signifies life or vitality. &#65533;<\/p>"
    },
    {
        "title": "Passport",
        "desc": "<p>To see a passport in your dream represents your identity and your ability to traverse through various situations. You are experiencing new found freedom to do what you want and go where you want. You may be going through a period of self-discovery.<\/p><p>To dream that you lose your passport indicates that you are trying to find yourself and get a sense of who you are. Alternatively, the dream means that opportunities are closing off to you.<\/p><p>To dream that your passport is getting stamped represents approval. You are given the green light to go ahead with a new project or journey.<\/p>"
    },
    {
        "title": "Password",
        "desc": "<p>To see a password in your dream represents access and control. You hold the key to unlocking your inner feelings and emotions. Analyze the letters and\/or numbers within the password for additional significance. It could be a hidden message.<\/p><p>To dream that you forget your password indicates a loss of control in some aspect of your waking life.<\/p>"
    },
    {
        "title": "Past",
        "desc": "<p>To dream of the past suggests that a current waking situation is paralleling a past situation. You need to learn from the past and not make the same mistake again. Alternatively, the dream may represent unresolved issues from the past. Or that you need to stop living in the past and look forward toward the future.<\/p>"
    },
    {
        "title": "Past Life",
        "desc": "<p>To dream that you have a past life indicates greater awareness of your subconscious. You are seeking for better understand of your Self and of your origins. The past life may reflect an actual past life or it may be the life that your parents or grandparents or ancestors were living. Alternatively, the dream refers to previous lessons that you can learn from. You are open to rectifying current issues in order to move forward.<\/p>"
    },
    {
        "title": "Pasta",
        "desc": "<p>To make or eat pasta in your dream represents your need for energy. Also consider the shape of the pasta and how it relates to a waking situation. Penne signifies your narrow perspective. Spaghetti noodles symbolize an entangling situation. Elbow shaped pasta represents your need to focus on yourself more. And corkscrew pasta means that some aspect of your life is out of control.<\/p>"
    },
    {
        "title": "Paste",
        "desc": "<p>*Please See: <a href=\"#Glue\">Glue<\/a><\/p>"
    },
    {
        "title": "Pastel",
        "desc": "<p>To dream of pastel colors indicate that you are not fully recognizing and dealing with some part of your emotions. There is some ambiguity in your life.<\/p>"
    },
    {
        "title": "Pastor",
        "desc": "<p>To see a pastor in your dream suggests that you are in need of spiritual guidance and advice. You may be experiencing feelings of guilt.<\/p>"
    },
    {
        "title": "Pastry",
        "desc": "<p>To see or eat a pastry in your dream refers to indulgence, sensual pleasure and satisfaction. You are enjoying life and reaping its rewards.<\/p>"
    },
    {
        "title": "Patent",
        "desc": "<p>To dream that you are applying for a patent signifies your successes and your many accomplishments. It also means that you need to be more methodical in how you pursue your goals.<\/p>"
    },
    {
        "title": "Path",
        "desc": "<p>To walk through an open path in your dream signifies clarity of thought and peace of mind. It also symbolizes your progress.<\/p><p>To see a blocked or windy path in your dream denotes that you need to give serious attention to the direction you are heading in your personal and\/or business life. You need to take time out to consider and rethink the consequences before acting on your choices.<\/p>"
    },
    {
        "title": "Patient",
        "desc": "<p>To dream that you are a patient suggests that you are going through a healing process. Alternatively, this dream may be a pun on your need for patience. Remember that good things come to those who wait.<\/p>"
    },
    {
        "title": "Patio",
        "desc": "<p>To dream that you are in the patio represents your openness toward a particular situation.<\/p><p>To dream that the doors to the patio are opened refer to your receptive state of mind. If they are closed, then it indicates that you are not being open to a situation. Patio doors symbolize the merging of your mental and spiritual state.<\/p>"
    },
    {
        "title": "Patricide",
        "desc": "<p>To dream that you commit patricide means that you are rejecting authority and rules. You refuse to answer to a higher power. Alternatively, killing your father may also be symbolic of killing an aspect of your own self. You feel that you are becoming like your father and you don't like it.<\/p>"
    },
    {
        "title": "Patron",
        "desc": "<p>*Please See: <a href=\"#Customer\">Customer<\/a>.<\/p>"
    },
    {
        "title": "Pattern",
        "desc": "<p>To see a pattern in your dream suggests that your life has become monotonous and repetitious. You need to break free from theroutine.<p>To see or work with a dress pattern in your dream indicates that you are trying to emulate somebody. The dream may be a metaphor that you are trying to &quot;pattern&quot; yourself after someone you look up to. Or perhaps you are lacking your own identity.<\/p>"
    },
    {
        "title": "Patty-Cake",
        "desc": "<p>To play patty-cake in your dream represents your carefree nature. You approach life to your own rhythm and beat. Alternatively, the dream implies that you are wasting your time and energy on unproductive pursuits.<p>To see children playing patty-cake refers to your own childhood memories. The dream may serve to remind you not to take some things too seriously.<\/p>"
    },
    {
        "title": "Pauper",
        "desc": "<p>To dream that you are a pauper suggests that you are not utilizing your inner talents and full potential. You are not acknowledging your own self-worth.<\/p>"
    },
    {
        "title": "Pavement",
        "desc": "<p>To see or walk on pavement in your dream suggests that you have a clear understanding and grasp of a situation. You are standing on solid ground. The dream may also indicate that you have paved and laid out a firm path toward your life goals.<\/p>"
    },
    {
        "title": "Paw",
        "desc": "<p>To see an animal paw in your dream suggests that you need to trust your intuition and animal instincts. The dream may also be a pun on your &quot;Pa&quot; or father.<\/p><p>To see bloody paw prints in your dream represents a repression of your animalistic desires.<\/p>"
    },
    {
        "title": "Pawnshop",
        "desc": "<p>To see or be in a pawnshop in your dream suggests that you are depleting your resources, either physically, spiritually or emotionally. You need to be more careful with how you are allocating these resources or risk spreading yourself too thin and ending up with nothing. Alternatively, the dream indicates that you are not really dealing with your problems in the best of way.<\/p>"
    },
    {
        "title": "Paycheck",
        "desc": "<p>To see your paycheck in your dream symbolizes the results of your hard work and the fruits of your labor. It is an indication of your level of confidence and strength. The dream also serves as encouragement and motivation for you to continue working hard. You will be rewarded for your efforts. Consider the amount on the check. If it is higher than expected, then it means that you are being well rewarded. If it is lower than expected, then you are being undervalued. It may also refer to money worries and your concerns about making ends meet. Perhaps you are lacking confidence and suffering from low self-esteem. You are unsure about your work performance.<\/p>"
    },
    {
        "title": "Paying",
        "desc": "<p>To dream that you are paying for something indicates the price you pay for your decisions and actions.<\/p><p>Dreaming that you are paying for someone's bills or tab implies that you are trying to buy others' favor or affection. You are trying too hard to be likeable.<\/p>"
    },
    {
        "title": "Payphone",
        "desc": "<p>To use a payphone in your dream represents a message or advice that comes with a price. It may also mean that your communication with others is having a toll on you in some way, either directly or indirectly.<\/p><p>To dream that the payphone is out of order indicates that you are being shut out. You are experiencing difficulties in getting your thoughts and feelings across. Or you are having difficulties connecting to others.<\/p><p>*Please Also See: <a href=\"#Telephone\">Telephone<\/a>.<\/p>"
    },
    {
        "title": "PE",
        "desc": "<p>To dream that you are in PE class indicates that you need to lay a better foundation for a healthier lifestyle. Your own personal experiences in PE class will play significantly in the interpretation of the dream. Something in your waking life maybe causing you to flashback to your experiences in PE. Alternatively, the dream suggests that you need to be more of a team player. Learn to work together.<\/p>"
    },
    {
        "title": "Peace",
        "desc": "<p>To dream of peace and tranquility indicates a resolution to some emotional issue or inner conflict. It may signal the end of a cycle and the pause before the beginning of a new endeavor. It also suggests that you have reached a new level of stability and calmness. Alternatively, the maddening quietness may refer to the calm before the storm.<\/p>"
    },
    {
        "title": "Peach",
        "desc": "<p>To see a peach in your dream represents pleasure and joy. You take pleasure in the simple things in life. The dream may also imply that something in your life is just &quot;peachy&quot; and going well. Alternatively, a peach may be indicative of virginity, lust and sensuality. Consider how it may be a metaphor for your sweetheart or loved one.<\/p><p>Dreaming of wiping melted chocolate off of a wrinkly peach relates to having someone completely dependent on you or having to take care of someone.<\/p>"
    },
    {
        "title": "Peacock",
        "desc": "<p>To see a peacock in your dream represents spring birth, new growth, longevity, and love. It is a good omen, signaling prestige, success and contentment in your relationship or career. Alternatively, the peacock signifies pride, confidence and vanity. You may be showing off too much or are overly arrogant with your success and achievements. A peacock may also suggest that many eyes are watching you.<\/p>"
    },
    {
        "title": "Peak",
        "desc": "<p>To dream that you are at the peak of a mountain symbolizes your successes and achievements. You will go far in your life. Alternatively, the dream may also be a pun on &quot;peek&quot;. Perhaps you saw something that you should not have. Or perhaps you are curious about something.<\/p>"
    },
    {
        "title": "Peanut Butter",
        "desc": "<p>To see or eat peanut butter in your dream suggests that you are having difficulties communicating your thoughts and ideas. It may also indicate a misunderstanding; your words are coming out all wrong.<\/p>"
    },
    {
        "title": "Peanuts",
        "desc": "<p>To see or eat peanuts in your dream symbolize the need to get to the truth or core of something. You may also need to start pushing yourself and utilizing your full potential. The peanuts in your dream may be a metaphor for money and what little you have of it. Are you experiencing financial difficulties?<\/p>"
    },
    {
        "title": "Pear",
        "desc": "<p>To see a pear in your dream symbolizes the womb and fertility. Thus, it may refer to some female in your life. It is also often associated with the Virgin Mary. The dream may also be a pun on a &quot;pair&quot; of something.<\/p><p>To see a pear tree in your dream represents new opportunities.<\/p>"
    },
    {
        "title": "Pearl",
        "desc": "<p>To see pearls in your dream symbolize the human soul, inner beauty, perfection, purity and chastity. Alternatively, it represents tears and sadness.<\/p><p>To see a string of pearls in your dream represents conformity and sameness.<\/p><p>To see or wear pearl earrings in your dream indicates that are being given some wise advice you should follow. Alternatively, pearl earrings may serve as a memory of a person in your life who wore them.<\/p><p>To see a pearl ring in your dream symbolizes tenderness, purity of love and early romance.<\/p><p>To see a black pearl in your dream denotes bad luck. There is a flaw in your thinking.<\/p>"
    },
    {
        "title": "Peas",
        "desc": "<p>To see peas in your dream symbolize some minor problems and annoyances that are continually bothering you.<\/p>"
    },
    {
        "title": "Pebble",
        "desc": "<p>To see a pebble in your dream represents minor difficulties and annoyances in your life.<\/p><p>To dream that you are throwing pebbles suggest that you are feeling hurt by the little things that may seem insignificant. It is symbolic of criticism and gossip.<\/p>"
    },
    {
        "title": "Pecan",
        "desc": "<p>To see or eat a pecan in your dream implies that big things often start small. A pecan symbolizes potential, heartiness and\/or longevity.<\/p>"
    },
    {
        "title": "Pedal",
        "desc": "<p>To dream that you are pedaling or notice the pedals indicates that you are moving toward your goals by your own efforts. It also means that you are moving at a slow and steady pace.<\/p>"
    },
    {
        "title": "Pedestal",
        "desc": "<p>To dream that you are on a pedestal indicates recognition and honor. You are the object of admiration and are being made an example. Alternatively, it may suggest that your ego is becoming over-inflated. You are showing off.<\/p><p>To see a pedestal in your dream refers to something or someone that you look up to.<\/p>"
    },
    {
        "title": "Pedicure",
        "desc": "<p>To dream that you are getting a pedicure indicates that you are moving in the right direction. You are progressing through life with great confidence, poise and integrity. Perhaps you are also seeking for some recognition for your progress. Alternatively, the dream represents your need to be pampered. You need to kick off your shoes, sit back and relax.<\/p>"
    },
    {
        "title": "Pedophile",
        "desc": "<p>To dream about a pedophile signifies your ultimate fears. If you have come in contact with a pedophile in your waking life, then the dream may be an indicator of some post traumatic stress and professional counsel is recommended.<\/p><p>To dream that you are a pedophile signifies a transitional phase in your life. You want to explore and experiment. This dream may leave you extremely disturbed, ashamed or embarrassed, but it does not necessarily mean that you have pedophilic tendencies. Perhaps you are feeling ambiguous or insecure about your own sexuality.<\/p>"
    },
    {
        "title": "Pee",
        "desc": "<p>*Please See: <a href=\"#Urination\">Urination<\/a>.<\/p>"
    },
    {
        "title": "Peel",
        "desc": "<p>To dream that you are peeling something represents the shedding away of old ways, habits and conditions. It may also mean that you are finally getting rid of and discarding unneeded exterior pretenses.<\/p>"
    },
    {
        "title": "Peephole",
        "desc": "<p>To look through a peephole in your dream indicates that you have a narrow perspective on a situation. You need to have all the facts before you can make an informed decision. Alternatively, the dream signifies a non-reciprocating situation. Someone has the upper hand.<\/p>"
    },
    {
        "title": "Peeping",
        "desc": "<p>To dream that you are peeping on someone signifies mistrust and insecurities. You are feeling uneasy about a situation. Alternatively, the dream indicates your fear of commitment. You are afraid of getting close to some relationship or situation.<\/p><p>To dream that you are being watched suggests that you are feeling confined in your work environment or personal relationship. You feel you are lacking a sense of privacy.<\/p>"
    },
    {
        "title": "Pegasus",
        "desc": "<p>To see Pegasus in your dream symbolizes swiftness and agility. You are able to brave through a stormy relationship.<\/p>"
    },
    {
        "title": "Pelican",
        "desc": "<p>To see a pelican in your dream represents nurturance, sacrifice, and charity. It indicates your selflessness and how you put others first before yourself. You are always caring for others.<\/p><p>Dreaming of being attacked by a pelican means that you see being nurturing as a weakness. You feel the need to fend for yourself.<\/p>"
    },
    {
        "title": "Pellet Gun",
        "desc": "<p>*Please See: <a href=\"#BB%20Gun\">BB Gun<\/a>.<\/p>"
    },
    {
        "title": "Pelvis",
        "desc": "<p>To see your pelvis in your dream represents sexual issues and you sense of femininity and masculinity. You may be dealing with issues of creativity and self-expression.<\/p>"
    },
    {
        "title": "Pen",
        "desc": "<p>To see a pen in your dream signifies self-expression and communication. Consider also the phrase of how the pen is mightier than the sword.<\/p>"
    },
    {
        "title": "Pencil",
        "desc": "<p>To see a pencil in your dream indicates that you are making a temporary impact in a situation. It may also suggest that a relationship will not last long.<\/p><p>To dream that you are sharpening a pencil suggests that you need to be more flexible in your way of thinking. Listen to what others have to say; don't be so quick to reject their views and opinions. Alternatively, to sharpen a pencil means that you need to make your best offer in some business deal. Perhaps the dream is trying to offer you some professional advice on how to close a deal.<\/p><p>To dream that you have pencil lead stuck in your fingers implies that you need to start putting your words into action.<\/p><p>Dreaming of color pencils indicate that you are not letting your creativity go wild. You are very controlled in the way you express yourself.<\/p>"
    },
    {
        "title": "Pendant",
        "desc": "<p>To see or wear a pendant in your dream represents your relationships and the desires for unconditional love. You are feeling connected so someone. The dream may also indicate that you are feeling emotionally touched by some situation or by someone.<\/p>"
    },
    {
        "title": "Pendulum",
        "desc": "<p>To see the back and forth swinging of a pendulum suggests that you are experiencing some difficulties or confusion in making an important choice in your life. You are afraid of change. People around you are anxiously awaiting your decision.<\/p>"
    },
    {
        "title": "Pendulum Thrill Ride",
        "desc": "<p>To see or dream that you are on a pendulum thrill ride implies that you are experiencing wild mood swings. You are getting carried away by your feelings.<\/p>"
    },
    {
        "title": "Penguin",
        "desc": "<p>To see a penguin in your dream signifies that your problems are not as serious as you may think. It serves as a reminder for you to keep your cool and remain level-headed. Alternatively, seeing a penguin in your dream suggests that you are being weighed down by your emotions or by a negative situation. You need to find some balance and inner harmony.<\/p>"
    },
    {
        "title": "Penis",
        "desc": "<p>To see a penis in your dream signifies sexual energy, power, aggression, and fertility, especially if the penis is erect. If the penis is flaccid, then it points to sexual frustration.<\/p><p>To dream that someone says he or she saw your penis means that you are dealing with some sexual matter in a roundabout or indirect way.<\/p><p>To dream that your penis falls or snaps off implies a loss of power. You feel you are losing an important part of your identity. If you dream that your penis is detachable, then it refers to your desire to temporarily escape from the demands of your waking life.<\/p><p>For a man to see an exceptionally large penis suggests doubts and anxieties about sexual performance, drive and libido. For a woman to dream about a penis symbolizes overt sexuality and raw sexual desires.<\/p><p>Dreaming of seeing a penis of a family member indicates an awkward situation that you are trying to avoid or overlook.<\/p><p>To dream that a stream of milk is coming out of your penis implies that someone is taking advantage of your weaknesses. Alternatively, dreaming of milk coming out of your penis symbolizes fertility. You may be ready to start a family.<\/p><p>If you dream that a woman has a penis, then it represents her extreme level of boldness. The dream may also mean that you relate to this woman on some intimate level that you are afraid to admit. If you are a woman and dream that you have a penis, then it means that you are feeling particularly aggressive or bold. Alternatively, the dream implies that you feel you are losing a part of yourself in a male-centric surrounding. You are not expressing the masculine side of your personality.<\/p>"
    },
    {
        "title": "Penitentiary",
        "desc": "<p>*Please See: <a href=\"#Prison\">Prison<\/a><\/p>"
    },
    {
        "title": "Penny",
        "desc": "<p>To see a penny in your dream indicates your fears of poverty or financial loss. Alternatively, the dream is often connected with your talents, energies, and perseverance. Do not underestimate your ability. If the penny is shiny, then it signifies luck.<\/p><p>To find a penny in your dream suggests that you are discovering your hidden talents and are ready to unleash your potential. Consider the common phrase &quot;a penny saved is a penny earned&quot; and how the dream may be telling you to save money.<\/p>"
    },
    {
        "title": "Pentacle",
        "desc": "<p>To see or wear a pentacle in your dream indicates that you are being protected by some spiritual power. The dream is giving you strength to confront some issue or conflict in your waking life.<\/p>"
    },
    {
        "title": "Pentagon",
        "desc": "<p>To see or draw a pentagon shape in your dream represents strength, power and stability. You feel that you are standing in solid ground.<\/p><p>To see or dream that you are in the Pentagon implies that you are looking for protection in some area of your life. Alternatively, the Pentagon symbolizes the United States' political and military agenda. Your dream may reflect your political views.<\/p>"
    },
    {
        "title": "Pentagram",
        "desc": "<p>To see a pentagram in your dream represents humanity and protection. The five points of the pentagram symbolize the connection of your spirit to the earth, air, fire, and water. These elements contribute to various aspect of your well-being. It signifies protection.<\/p><p>To see an inverted pentagram (where the point is facing downward) signifies conflict, negativity and aggression. It is often associated with Satanism and evil. Are you feeling guilty about something? Alternatively, it represents the physical world and your preoccupation with materialistic gains.<\/p>"
    },
    {
        "title": "Penthouse",
        "desc": "<p>To dream that you are in a penthouse represents the creative and spiritual aspect of yourself. You are looking at life from a new perspective and accessing your highest potential.<\/p>"
    },
    {
        "title": "Peony",
        "desc": "<p>To see a peony in your dream represents your well thought-out plans and ideas. You need to draw wisdom from your past experiences. Alternatively, a peony represents shyness or bashfulness. Perhaps, you are being overly cautious in your pursuits.<\/p>"
    },
    {
        "title": "People",
        "desc": "<p>To see people you know in your dream signifies qualities and feelings of them that you desire for yourself. If these people are from your past, then the dream refers to your shadow and other unacknowledged aspects of yourself. It may represent a waking situation that is bringing out similar feelings from your past relationships.<\/p><p>To see people you don't know in your dream denotes hidden aspects of yourself that you need to confront or acknowledge.<\/p><p>To dream that people are standing or blocking your way refers to those around you who don't want you to move ahead and succeed in life. You feel that someone in your social circle is working against you. Alternatively, the dream implies that you are being protected from some harm.<\/p><p>To see dangerous people in your dream suggests that you need to proceed with caution in some endeavor.<\/p><p>*Please see: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/characters.htm\">Dream Themes: Characters for specific people<\/a>.<\/p>"
    },
    {
        "title": "Pepper",
        "desc": "<p>To see or taste pepper in your dream indicates that you need to put a little more spice and variety in your life. Alternatively, there may be something that is bothering or irritating you. Your dream may lend a clue to the source of the irritation.<\/p>"
    },
    {
        "title": "Peppermint",
        "desc": "<p>To smell or taste peppermint in your dream suggests that you are feeling calm, soothed and relaxed. Some aspect of your life is having a soothing effect on you. You are undergoing a positive change. On the other hand, the dream could be saying that you need to be more calm. Don't get too wound up over minor issues. Consider your own personal associations with this smell and how a waking situation may have triggered these same associations.<\/p><p>To see or eat a peppermint candy in your dream represents a sweet reward. It also denotes festivities, pleasure and joy.<\/p>"
    },
    {
        "title": "Pepperoni",
        "desc": "<p>To see or eat pepperoni in your dream indicates that you need to add a little pizzazz and spice to your life. Alternatively, it denotes wholeness and completeness.<\/p>"
    },
    {
        "title": "Percolator",
        "desc": "<p>To see or hear a percolator in your dream suggests that you need to take things a little slower. You need to think things through before taking any action.<\/p>"
    },
    {
        "title": "Perfect",
        "desc": "<p>To dream that something or someone is perfect represents your unrealistic expectations and idealistic notions.<\/p>"
    },
    {
        "title": "Perfume",
        "desc": "<p>To dream that you are spraying or wearing perfume suggests that you are seeking for more pleasure in your life. It is also symbolic of your sexuality, sensuality, and indulgence.<\/p><p>To smell perfume in your dream represents memories and nostalgia. You are reminiscing about the past.<\/p>"
    },
    {
        "title": "Peridot",
        "desc": "<p>To see a peridot in your dream signifies good company and long lasting friendship.<\/p>"
    },
    {
        "title": "Period",
        "desc": "<p>To see a period in your dream symbolizes the end to something.<\/p><p>*Please Also See: <a href=\"#Menstruation\">Menstruation<\/a>.<\/p>"
    },
    {
        "title": "Periodic Table",
        "desc": "<p>To see the periodic table in your dream indicates that you need to get to the core of some matter. If one element on the table stands out, then consider the significance of the letter or the letters. It may represent initials for someone. Perhaps you need to get to know this person on a deeper level. If the periodic table appears out of the ordinary, then it means that something or someone is preventing you from seeing the truth.<\/p>"
    },
    {
        "title": "Periscope",
        "desc": "<p>To see or use a periscope in your dream indicates that you need to rise above your current situation in order to get a better perspective on things. Sometimes you need to take yourself out of the situation so you can gain a different view. Alternatively, the dream suggests that you need to stop being so linear in your thinking.<\/p>"
    },
    {
        "title": "Perm",
        "desc": "<p>To dream that that you are getting a perm signifies a change in your outlook and way of thinking. You need to start to look at things from another point of view. Alternatively, the dream may be a metaphor for some &quot;permanent&quot; change in your life.<\/p>"
    },
    {
        "title": "Permit",
        "desc": "<p>To dream that you are applying for a permit represents your rights. Consider what sort of permit it is for additional significance. If it is a gun permit, then the dream indicates that you feel your anger or acts of aggression are validated. If it is a building permit, then it suggests that you are seeking approval to move ahead toward your goals or onto the next phase in your life.<\/p>"
    },
    {
        "title": "Persecution",
        "desc": "<p>To dream that you are being persecuted implies that you need to stand up for yourself in some waking situation.<\/p>"
    },
    {
        "title": "Permission",
        "desc": "<p>To dream that you are asking for or need permission represents your lack of power and freedom. You are feeling stifled. Alternatively, the dream signifies self-doubt in your own abilities. You are second-guessing your decisions and are looking for validation or approval.<\/p><p>To dream that someone is asking for your permission represents your authoritative power. You are in full control of a situation or relationship.<\/p>"
    },
    {
        "title": "Perpetual Motion",
        "desc": "<p>To dream of perpetual motion indicates that you are experiencing general anxiety and nervousness over a situation. You need a change from the repetitive and the predictable nature of your job, relationship or daily life.<\/p>"
    },
    {
        "title": "Persimmon",
        "desc": "<p>To see or eat a persimmon in your dream symbolizes joy, glory and victory.<\/p>"
    },
    {
        "title": "Person",
        "desc": "<p>To dream of someone who you are estranged from signifies your desire to rebuild a connection or relationship with this person. It may also mean reconnecting an aspect of your own self that you have ignored or abandoned.<\/p><p>*Please refer to the type of person, i.e. boy, girl, ex, mother, etc., please see: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/characters.htm\">Dream Themes: Characters for specific people<\/a>.<\/p>"
    },
    {
        "title": "Personal Trainer",
        "desc": "<p>To see or dream that you have a personal trainer suggests that you need to push yourself to do better. Do not take the easy way. Alternatively, the dream indicates that you are seeking guidance and help in some area of your life.<\/p>"
    },
    {
        "title": "Perspective",
        "desc": "<p>To have a dream where your perspective changes from the first person to the third person means that you need to take other people's point of view into consideration. Perhaps you are being too self-centered.<\/p>"
    },
    {
        "title": "Perspire",
        "desc": "<p>*Please see: <a href=\"#Sweat\">Sweat<\/a>.<\/p>"
    },
    {
        "title": "Pervert",
        "desc": "<p>To see a pervert in your dream suggests that you are having issues with closeness in some relationship. You are trying to keep your distance in order to avoid getting hurt.<\/p>"
    },
    {
        "title": "Pet Food",
        "desc": "<p>To see or buy pet food in your dream represents the development of some skill. Remember that it takes time and effort to hone and improve your skill. If you are feeding pet food to a pet in your dream, then it refers to disloyalty in some area of your life.<\/p><p>To eat pet food in your dream suggests that you need to address some animalistic or primitive thoughts.<\/p>"
    },
    {
        "title": "Pet Store",
        "desc": "<p>To see or dream that you are at a pet store represents the responsibilities that you are undertaking. Consider also the symbolism of the pet that you see or purchase and how you may need to incorporate certain qualities of the animal into your own self. Alternatively the dream implies that you are searching for love and acceptance.<\/p><p>To dream that you are stealing an animal from the pet store means you are underestimating your self worth.<\/p>"
    },
    {
        "title": "Petals",
        "desc": "<p>To see petals in your dream indicate a broken relationship or a rift in a friendship. It also refers to regret and guilt.<\/p>"
    },
    {
        "title": "Peter Pan",
        "desc": "<p>To see Peter Pan in your dream represents your desires to escape from your daily burdens. You want to retreat back to a time where you were free of any responsibilities, deadlines, or problems. Alternatively, the dream may be a variation of a flying dream. Perhaps, you need to look at things from a different perspective.<\/p>"
    },
    {
        "title": "Petition",
        "desc": "<p>To dream that you are signing a petition suggests that you are ready to make a major change in your life. You want to see progress.<\/p>"
    },
    {
        "title": "Petrifaction",
        "desc": "<p>To dream that you have been petrified suggests that you are in a rut. You are not doing the things that you really want to do. You feel that there is no way out of a relationship or situation that you are in.<\/p><p>To dream that something or someone has been petrified represents permanence and longevity. Alternatively, it refers to how time has stool still. Perhaps you feel that you have plenty of time on your hands.<\/p>"
    },
    {
        "title": "Petroleum",
        "desc": "<p>To see petroleum in your dream symbolizes an aspect of your life that is potentially volatile and explosive. Alternatively, petroleum represents your vitality, enthusiasm and energy.<\/p>"
    },
    {
        "title": "Pets",
        "desc": "<p>To see a pet in your dream represents civilized instincts. You are keeping your temper in line. Alternatively, seeing a pet indicates a need for love and acceptance. Perhaps, you are lacking attention from others and are feeling neglected. The pet may also be a pun for &quot;petting&quot; as in some sexual behavior.<\/p><p>To dream of a dead pet suggests that something that you had thought was left in the past is coming back to haunt you. Similarly to seeing your childhood home, a past pet serves the same function as trying to bring you back into that particular time period. A situation in your waking life may parallel a situation from your past and the dream is providing a means of resolving it.<\/p><p>If you dream that your living pet is dead or is dying means that you are feeling stifled or restricted in some way.<\/p><p>Dreaming that your pet escaped or got loose implies that you need to express some of your primal urges. You can not suppress them any longer.<\/p>"
    },
    {
        "title": "Petticoat",
        "desc": "<p>To dream that you are wearing a petticoat represents your reluctance in revealing something about yourself. You are being modest or conservative about some aspect of your life.<\/p>"
    },
    {
        "title": "Petting",
        "desc": "<p>To dream that you are petting an animal indicates that you are acknowledging or embracing some physical attribute or primitive desire within yourself.<\/p>"
    },
    {
        "title": "Pew",
        "desc": "<p>To see or sit on a pew in your dream suggests that you need to stop and reflect on your past mistakes or issues before you can move forward. You need to question the decisions and choices that you are making. Perhaps it is time to acknowledge your former wrongdoings.<\/p>"
    },
    {
        "title": "Pewter",
        "desc": "<p>To see items made of pewter in your dream suggests that you are holding on to the past. Your ways of thinking may be outdated.<\/p>"
    },
    {
        "title": "Phantom",
        "desc": "<p>To see a phantom in your dream represents guilt, fear, and\/or repressed memories. Your dream is serving as a medium for you to face your fears and thus it is important to pay attention to what message the phantom is trying to convey.<\/p><p>*Please see also: <a href=\"#Ghost\">Ghost<\/a>.<\/p>"
    },
    {
        "title": "Pharaoh",
        "desc": "<p>To see or dream that you are a pharaoh indicates that you are acknowledging the authoritarian within yourself. Alternatively, the dream serves as a connection to your spirituality and the divine.<\/p>"
    },
    {
        "title": "Pharmacy",
        "desc": "<p>To dream that you are in pharmacy suggests that you need to correct your thinking and readjust your attitude. You need to look within yourself for the solution to a problem instead of relying on outside help.<\/p>"
    },
    {
        "title": "Pheasant",
        "desc": "<p>To see a pheasant in your dream symbolizes motherhood and nurturance.<\/p>"
    },
    {
        "title": "Philanthropist",
        "desc": "<p>To dream that you are a philanthropist represents your generosity and giving nature. Or perhaps you need to be more giving in your waking life. The dream may also mean that you are ready to share an important part of yourself.<\/p>"
    },
    {
        "title": "Philosophy",
        "desc": "<p>To dream about philosophy implies that you are trying to understand the world around you. You are reevaluating your life and where it is taking you. Perhaps you are struggling to find answers to some fundamental question or you are seeking the truth to something.<\/p>"
    },
    {
        "title": "Phlegm",
        "desc": "<p>*Please see: <a href=\"#Mucus\">Mucus<\/a>.<\/p>"
    },
    {
        "title": "Phobia",
        "desc": "<p>To dream that you have a phobia suggests that you need to confront your fears. Do not let your fears control your life. Consider the specific phobia for additional clues in interpreting your dreams. For example, if you dream that have a phobia of heights, then it may mean that your position at the top is a precarious one. You are afraid that you may fall from grace.<\/p>"
    },
    {
        "title": "Phoenix",
        "desc": "<p>To see a phoenix in your dream symbolizes transformation, immortality and renewal. You are moving toward a new phase in your life. It may also mean that your past continues to haunt you.<\/p>"
    },
    {
        "title": "Phone",
        "desc": "<p>*Please see: <a href=\"#Telephone\">Telephone<\/a>.<\/p>"
    },
    {
        "title": "Phone Booth",
        "desc": "<p>To see or dream that you are inside a telephone booth refers to a message or advice that comes with a price. It may also point to your communication or relationship with someone and how it is taking a toll on you in some way.<\/p><p>Dreaming that the the phone booth is out of order implies that you are being shut out . You are having difficulties connecting to others or you are unable to get your thoughts across in an effective way.<\/p>"
    },
    {
        "title": "Phone Number",
        "desc": "<p>To see a phone number in your dream suggests that you need to make contact with someone and reach out for help.<\/p><p>To dream that you cannot remember or find a phone number means that you need to start being more independent and responsible.<\/p><p>To dream that you cannot dial a phone number correctly suggests that you are having difficulties in getting through to someone in your waking life. Consider whose phone number you are trying to dial. Perhaps he or she is not taking your advice or listening to what you have to say. The message is not getting through.<\/p><p>To dream that you are giving someone your telephone number means that you need to take the initiative and reach out to others. You need to make the first move.<\/p><p>If you have a dream that you are deleting a phone number implies that you need to learn to cut ties with those who are not supportive of you. You need to evaluate who your true friends are and who are negative energy.<\/p>"
    },
    {
        "title": "Phosphorescence",
        "desc": "<p>To dream that something is phosphorescent refers to previously suppressed material that is coming to light. You are cautious about what you share with others.<\/p>"
    },
    {
        "title": "Photo Album",
        "desc": "<p>To dream that you are looking through a photo album suggests that you are unwilling to let go of your memories and the past. You are idealizing about the past.<\/p>"
    },
    {
        "title": "Photo Booth",
        "desc": "<p>To dream that you are in a photo booth implies that things that are thought to be private may not be so private. Be careful with what you post or put out there. Alternatively, the dream signifies your desires to hold on to some current emotion that you are experiencing.<\/p>"
    },
    {
        "title": "Photo Shoot",
        "desc": "<p>To dream that you are in a photo shoot suggests that you are keeping up an appearance. Things are not what it seems.<\/p>"
    },
    {
        "title": "Photocopier",
        "desc": "<p>*Please See: <a href=\"#Copier\">Copier<\/a>.<\/p>"
    },
    {
        "title": "Photograph",
        "desc": "<p>To see a photograph in your dream indicates that there is a relationship that needs your attention. You are not looking deep enough into the problem. Alternatively, the dream means that you are clinging on to the past or to some false hope. Consider who or what is on the photo. The image may be trying to take you back to a particular moment in time.<\/p><p>To dream that you are altering a photo suggests that you are putting out a false image. Or something is not what it seems to be.<\/p><p>To dream that you rip up a photo indicates that you are letting go of the past and living for the future.<\/p><p>*Please see also: <a href=\"#Picture\">Picture<\/a>. See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=weddingdream1\">Black Wedding<\/a>&quot;<\/p>"
    },
    {
        "title": "Photographer",
        "desc": "<p>To dream that you are a photographer represents your desire to hold on to a certain image, time or period in your life.<\/p>"
    },
    {
        "title": "Photoshop",
        "desc": "<p>To use photoshop in your dream means that you are trying to fit into someone else's ideals. Alternatively, using photoshop in your dream indicates that you are manipulating others or manipulating some outcome.<\/p><p>Dreaming that a picture has been photoshopped represents how you wish others to perceive you. It also points to something that is not really as it appears.<\/p>"
    },
    {
        "title": "Physician",
        "desc": "<p>*Please see: <a href=\"#Doctor\">Doctor<\/a>.<\/p>"
    },
    {
        "title": "Piano",
        "desc": "<p>To dream that you are playing a piano indicates a quest for harmony in your life. Consider where the piano is placed as a clue as to what aspect of your life needs accordance. If no sound is coming out of the piano, then it implies a lack of confidence. You are not sure about how to express yourself and how to voice your beliefs.<\/p><p>To dream that you hear the sound of a piano suggests harmony in your life. You are pleased with the way your life is going.<\/p><p>To dream that the piano needs to be tuned indicates some aspect of your life is in discord. You need to devote more time to a relationship, family duties, project, or other situation.<\/p>"
    },
    {
        "title": "Pickaxe",
        "desc": "<p>To see or use a pickaxe in your dream represents a level of sexual aggression or sexual tension. You need to loosen up.<\/p>"
    },
    {
        "title": "Pickle",
        "desc": "<p>To see or eat a pickle in your dream signifies some anxiety and fear of coming trouble. Alternatively, a pickle may be seen as a symbol for the penis. Sexual messages from the subconscious are usually disguised in symbols.<\/p>"
    },
    {
        "title": "Pick-up Truck",
        "desc": "<p>To see a pick-up truck in your dream represents hard work. You need to return to the basics. Alternatively, the dream may be a metaphor for something that you need to &quot;pick up&quot;.<\/p>"
    },
    {
        "title": "Pickpocket",
        "desc": "<p>To dream that someone picks your pocket suggests that you are reluctant in sharing your ideas with others for fear that they will get the credit.<\/p><p>To dream that you are a pickpocket indicates that you are willing to go to any lengths in order to get the information you need.<\/p>"
    },
    {
        "title": "Picnic",
        "desc": "<p>To dream that you are at a picnic signifies a joyful and tranquil domestic life. You prefer the simpler things in life.<\/p><p>To see a picnic basket in your dream indicates an opportunity to share your ideas and opinions with others. You are receptive to different viewpoints.<\/p><p>To see or sit at a picnic table in your dream symbolizes unity and togetherness. If you are under the picnic table, then it points to some disagreement that is not being properly addressed or resolved.<\/p>"
    },
    {
        "title": "Picture",
        "desc": "<p>To see a picture in your dream symbolizes a mental imprint that remains persistent in your mind. Your actions are irreversible. There is no turning back in what you do. Also consider the phases &quot;picture this&quot; or &quot;seeing the big picture&quot; in a situation. In particular, if the picture is in black and white picture, then it indicates that you need to consider opposing viewpoints. Alternatively, it may mean that you need to add more color and pizzazz to your life.<\/p><p>To dream that you are hanging a picture represents acceptance the image that is depicted in the picture. You have come to an understanding or compromise regarding the situation.<p>To dream that you are taking a picture suggests that you need to focus more attention on some situation or relationship. Perhaps, you feel that you need to recapture some past moments in a relationship. Alternatively, taking a picture refers to your desires to hold onto a certain moment in your life. If you are trying to take a picture, but people are standing in your way, then it means that outside influences are not letting you focus on your goals and what you really need to do.<\/p><p>To see a blurry picture in your dream suggests that your memory of the depicted event, incident, or people, is fading. Perhaps you need to let go of the past and stop holding on to what was and concentrate on what is. On the other hand, you are attempting to disguise a situation and refusing to see it as it really is. You need to learn acceptance.<\/p><p>*Please see also: <a href=\"#Photograph\">Photograph<\/a>.<\/p>"
    },
    {
        "title": "Picture Frame",
        "desc": "<p>To see or place a picture in a picture frame in your dream represents a wish to have a current situation or relationship remain the same as it is now. You dread change. Perhaps you are reminiscing of the past. Consider what is depicted on the picture for additional significance. Alternatively, the dream may be a pun on &quot;being framed&quot; for something. Is someone in your walking life undermining or working against you?<\/p>"
    },
    {
        "title": "Pie",
        "desc": "<p>To see a pie in your dream symbolizes the rewards of your hard work. Perhaps you are reaching beyond your abilities. Alternatively, the pie may also have the same meaning as a circle. Or the pie indicates sharing and getting your fair share, as in your &quot;piece of the pie&quot;.<\/p>"
    },
    {
        "title": "Piecrust",
        "desc": "<p>To see or make piecrust in your dream indicates broken promises. You or someone is not keeping their word.<\/p>"
    },
    {
        "title": "Pier",
        "desc": "<p>To see or dream that you are on a pier represents self-reflection and introspective into your subconscious. You are ready to explore and grow as an individual. The dream signals emotional and spiritual growth.<\/p>"
    },
    {
        "title": "Piercing",
        "desc": "<p>To dream that you are getting your tongue or lip pieced refers to regret over some stinging remarks and hurtful words that you said.<\/p><p>To dream thatyou or someone is getting their eyebrow pierced may be a metaphor for your &quot;piercing eyes&quot;. Alternatively, the dream is drawing your attention to something disturbing or significant that you saw. Perhaps you saw something you that shouldn't have.<\/p><p>To dream that you or someone has a navel piercing denotes your deep connection with your mother. Perhaps the dream is telling you to reconnect with your mother. Or that you need to be more in tune with your maternal instincts.<\/p><p>To dream that you are getting your ears pierced represents some stinging remarks or insults.<\/p><p>To dream that you or someone has a nose piercing implies that you need to pay closer attention to some issue. Focus!<\/p><p>Less symbolically, dreams of getting pierced may just be your waking desire or anxiety on getting pierced.<\/p>"
    },
    {
        "title": "Pieta",
        "desc": "<p>To see the pieta in your dream symbolizes the eternal bond and love between mother and child. The dream also points to a mother's loss. This loss does not necessarily mean death, but rather an end to something.<\/p>"
    },
    {
        "title": "Pig",
        "desc": "<p>To see a pig in your dream symbolizes dirtiness, greediness, stubbornness or selfishness. Alternatively, the pig may represent gluttony, opulence and overindulgence. Perhaps it refers to someone who is dirty or someone who is chauvinistic.<\/p><p>If you like pigs and think that pigs are cute, then your dream about a fat dirty pig represents your misconceptions about certain things. What you believe and what is reality may be two different things. This pig may be analogous to a relationship or a man in your life. You think that the pig will be a certain way, but in actuality reality is not at all what you had imagined.<\/p><p>To see a pig being cooked alive in your dreamsuggests that you are undergoing a drastic transformation. You are ready to rid yourself of the negativity surrounding your life.<\/p>"
    },
    {
        "title": "Pigeon",
        "desc": "<p>To see a pigeon in your dream suggests that you are taking the blame for the actions of others. Pigeons also represent gossip or news. Perhaps the pigeon refers to a message from your subconscious. Alternatively, the dream may be expressing a desire to return home.<\/p><p>To dream that a pigeon is being eaten or swallowed by another animal implies that you will suffer the consequences of spreading some rumor or news.<\/p>"
    },
    {
        "title": "Piggyback",
        "desc": "<p>To dream that you are giving someone a piggyback ride symbolizes your supportive role. You literally feel that you are carrying the weight of others. Perhaps you are feeling overwhelmed of being the responsible or dependent one.<\/p><p>To dream that you are riding piggyback on someone represents your lack of power or control in a situation. You are just going along with whatever decisions are being made. Alternatively, being on piggyback points to issues of codependency.<\/p>"
    },
    {
        "title": "Piggybank",
        "desc": "<p>To see a piggybank in your dream represents financial worries. Perhaps you need to cut back on your spending or adhere to a budget.<\/p>"
    },
    {
        "title": "Piglet",
        "desc": "<p>To see a piglet in your dream refers to someone in your life who has character flaws and imperfections, but you accept them. That someone may even be yourself. Alternatively, piglets are also symbolic of children.<\/p>"
    },
    {
        "title": "Pigsty",
        "desc": "<p>To see a pigsty in your dream symbolizes a messy situation. The dream is making a commentary on your waking life. You need to organize and sort out some life issues so you can progress forward. Alternatively, the dream indicates an attack on your character.<\/p>"
    },
    {
        "title": "Pigtails",
        "desc": "<p>To dream that you are wearing pigtails indicates a regression into childhood, where times were more innocent and carefree. You are displaying a &quot;don't-care&quot; attitude and don't want to be weighed down by responsibilities.<\/p>"
    },
    {
        "title": "Pile",
        "desc": "<p>To see a pile of something in your dream signifies some overwhelming burden or excess in your life. In particular, to see a pile of papers in your dream represents your overwhelming responsibilities and stresses that you are having to cope with. You are not effectively dealing with the issues at hand.<\/p><p>To see a pile of debris or trash in your dream represents the rejected or unwanted aspects of yourself. To see a pile of wood in your dream symbolizes your overwhelming passion.<\/p>"
    },
    {
        "title": "Pilgrim",
        "desc": "<p>To dream that you are a pilgrim suggests that you are undergoing a spiritual journey.<\/p><p>To see a pilgrim in your dream represents an aspect of yourself that is striving toward greater understanding of who you are and of the world you live in.<\/p>"
    },
    {
        "title": "Pill",
        "desc": "<p>To see or take a pill in your dream signifies a restoration of your inner harmony. You are experiencing a period of healing and an end to the negative ideas in your mind. Alternatively, the dream may be a metaphor for something or someone who is hard to follow.<\/p>"
    },
    {
        "title": "Pillar",
        "desc": "<p>To see a pillar in your dream represents your strength, stability, and a firm stance, especially in the face of adversity. Alternatively, the dream indicates that you have the full support of those around you. You are being honored and recognized. As with most elongate objects, a pillar may also have phallic connotations.<\/p>"
    },
    {
        "title": "Pillow",
        "desc": "<p>To see a pillow in your dream represents comfort. relaxation, ease, and\/or luxury. You need to take it easy on yourself. Alternatively, the dream indicates laziness. If the pillow is lumpy, then it indicates that there is something unsettling in your mind.<\/p><p>To dream that you are lying on a pillow suggests that you are in need of some mental support. Perhaps there is a situation or matter that you need to &quot;cushion&quot; and soften the blow.<\/p><p>To dream that your pillow is gone indicates that you are in self-denial.<\/p>"
    },
    {
        "title": "Pilot",
        "desc": "<p>To dream that you are a pilot indicates that you are in complete control of your destination in life. You are confident and self-assured in your decisions and accomplishments.<\/p>"
    },
    {
        "title": "Pimples",
        "desc": "<p>To dream that you have a pimple relates to issues about your self-esteem and self-image. You are feeling awkward or out of place in some situation or relationship.<\/p><p>To dream that you are popping a pimple indicates that some negative emotion needs to be expressed and acknowledge. These emotions that you are holding back are on the verge of erupting.<\/p>"
    },
    {
        "title": "Pin",
        "desc": "<p>To dream that you are pricked by a pin signifies a sticky situation or relationship that is falling apart or that is unstable. You may be feeling anxious or feeling the need to hold together a particular relationship. Also consider the dream as a metaphor for someone who may be a \"prick\".<\/p><p>Alternatively, to see pins in your dream refer to feeling of being trapped or immobilized, as exemplified by the phrase &quot;being pinned down&quot;.<\/p>"
    },
    {
        "title": "Pin Cushion",
        "desc": "<p>To see or use a pin cushion in your dream signifies stinging remarks or hurtful comments. You are feeling used and manipulated. Alternatively, a pin cushion means that you are trying to harm others with your sharp words and negative attitude.<\/p>"
    },
    {
        "title": "Piñata",
        "desc": "<p>To see a piñata in your dream symbolizes joy, celebration and festivities. If you smashed open the piñata, then it suggests that you will be well rewarded for your tenacity, drive and hard work. If you are unable to hit the piñata, then it indicates that you are experiencing difficulties toward success, even though it may be seemingly within reach. Perhaps you have a self-defeatist attitude. You need to believe in yourself and in your abilities.<\/p><p>To dream that insects are inside the piñata indicates that you have been mislead. Perhaps someone in your life has not delivered on their promise. The dream could also be telling you that some offer may be too good to be true. Don't take it!<\/p>"
    },
    {
        "title": "Pinball",
        "desc": "<p>To see a pinball machine or dream that you are playing pinball suggests that with patience, control, and precision, you will succeed in your goals. Something that may look risky or challenging at first can be tackled if you break it down.<\/p>"
    },
    {
        "title": "Pinwheel",
        "desc": "<p>To see or play with a pinwheel in your dream suggests that you will succeed on your own power and your creative energy. Alternatively, a pinwheel symbolizes childhood and your carefree nature. Consider the color(s) of the pinwheel.<\/p>"
    },
    {
        "title": "Pincers",
        "desc": "<p>To dream that you have pincers for hands suggest that you are going to great lengths to try to get your hands on something, even through underhanded means.<\/p><p>To see or be grabbed by pincers in your dream indicates that someone or some situation has a strong hold over you. Perhaps they have something on you.<\/p>"
    },
    {
        "title": "Pinch",
        "desc": "<p>To dream that someone is pinching you suggests that you need a reality check. Perhaps your goals or ideals are too lofty. Alternatively, the dream indicates that things are going smoothly for you. You may even feel that something is too good to be true.<\/p>"
    },
    {
        "title": "Pine Tree",
        "desc": "<p>To see a pine tree in your dream symbolizes immortality, life, and\/or fertility. The dream could also be a pun on &quot;pining&quot; for something or someone.<\/p><p>To smell pine in your dream indicates that you need to be reenergized and uplifted.<\/p>"
    },
    {
        "title": "Pineapple",
        "desc": "<p>To see a pineapple in your dream represents self-confidence, ambition and success. You are self-assured in what you do. Alternatively, the pineapples symbolize hospitality. Or perhaps you need to relax or take a vacation.<\/p><p>To eat a pineapple indicates sexual problems and issues of losing control.<\/p>"
    },
    {
        "title": "Pinecone",
        "desc": "<p>To see a pinecone in your dream symbolizes wealth and good fortune. Alternatively, a pinecone represents life and fertility. The dream could also be a pun on &quot;pining&quot; for something or someone.<\/p>"
    },
    {
        "title": "Ping Pong",
        "desc": "<p>To see or play ping pong in your dream suggests that you are going back and forth between two choices. You are confused over an important decision in your life and have difficulty committing to a decision, to a relationship or social obligation.<\/p>"
    },
    {
        "title": "Pinky Finger",
        "desc": "<p>To notice your pinky finger in your dream represents mental power, intellect, memory, and the power of communication.<\/p>"
    },
    {
        "title": "Pinocchio",
        "desc": "<p>To see Pinocchio in your dream suggests that you or someone are not being truthful in some situation.<\/p>"
    },
    {
        "title": "Pioneer",
        "desc": "<p>To dream that you are a pioneer suggests that you are exploring aspects of your subconscious. You are looking for a new way to express yourself and expand your thinking.<\/p>"
    },
    {
        "title": "Pipe",
        "desc": "<p>To see a water pipe in your dream indicates that you are open and receptive to new ideas. It may also represent your connections to those around you. You are able to steer something toward a direction.<\/p><p>To dream that you are inside a pipe represents your narrow vision and your seemingly lack of options. Perhaps the dream is telling you to look at things from a different angle.<\/p><p>To dream that you are smoking a pipe denotes knowledge or contemplation. Alternatively, it symbolizes comfort, relaxation, contentment and satisfaction with your waking life. If someone in your life smokes a pipe, then the dream symbol may serve as a reminder of her or him.<\/p>"
    },
    {
        "title": "Piranha",
        "desc": "<p>To see piranhas in your dream suggest that something is eating away at your subconscious. You need to release some of those pent up feelings and confront those issues that are causing much internal conflict.<\/p>"
    },
    {
        "title": "Pirate",
        "desc": "<p>To see a pirate in your dream signifies that some person or situation is adding chaos to your emotional life. You feel that someone has violated your integrity or creativity. Alternatively, the pirate may symbolize freedom, risk, and adventure. You want to explore new adventures and take riskier ventures.<\/p><p>To dream that you are a pirate suggests that you are taking advantage of others. The dream may be a metaphor that you are &quot;pirating&quot; something and taking something that does not rightfully belong to you.<\/p>"
    },
    {
        "title": "Pirate Ship",
        "desc": "<p>To see a pirate ship in your dream signifies your suppressed desires for freedom and adventure. You want to cut loose and go wild. Alternatively, the dream symbolizes hidden danger or hostility.<\/p><p>To dream of a flying pirate ship implies that you are letting your adventurous side guide you and take control. You are living it up!<\/p>"
    },
    {
        "title": "Pirouette",
        "desc": "<p>To dream that you are doing pirouettes represents your ability to balance many responsibilities at the same time. You have total control over your life. Alternatively, the dream highlights your grace and poise in a situation or circumstance.<\/p>"
    },
    {
        "title": "Pisces",
        "desc": "<p>To dream that someone is a Pisces indicates your sensitivity, imagination, compassion and sympathy for others. It suggests that you are ready to make certain sacrifices for what you believe in. Alternatively, the dream may reflect your inability to change who you are.<\/p>"
    },
    {
        "title": "Piss",
        "desc": "<p>*Please See: <a href=\"#Urination\">Urination<\/a>.<\/p>"
    },
    {
        "title": "Pistachio",
        "desc": "<p>To see a pistachio in your dream indicates that you are ready to explore and open yourself to new experiences. What you thought was difficult at first is going to be worth your while. Alternatively, dreaming of eating pistachios symbolizes joy and positivity.<\/p>"
    },
    {
        "title": "Pistol",
        "desc": "<p>To dream that you are aiming a pistol denotes that you are trying to target a specific goal. Alternatively, the dream also symbolizes fear, anger and aggression. You are using your power to defend yourself against the fear and anger. It may also indicate your hot and quick temper.<\/p><p>*Please see also: <a href=\"#Gun\">Gun<\/a>.<\/p>"
    },
    {
        "title": "Piston",
        "desc": "<p>To see a piston in your dream symbolizes your drive, determination and ambition. You are evaluating your goals and your means to achieve them. Alternatively, the dream may also be a metaphor for sexual activity. You may be lacking passion in your sex life to the point where it has gotten somewhat mechanical.<\/p>"
    },
    {
        "title": "Pit",
        "desc": "<p>To dream that you are in a pit indicates feelings of hopelessness about some situation or circumstance. Also consider the familiar phrase of &quot;being in the pits&quot;.<\/p><p>If you dream that you are falling into a bottomless pit, then it suggests that you are unable to recover from a setback or that you are unable to overcome some problem.<\/p>"
    },
    {
        "title": "Pit Bull",
        "desc": "<p>To see a pit bull in your dream suggests that you are on the defensive. You may be feeling threatened.<\/p><p>To dream that you own a pit bull indicates that you are well protected or perhaps even overly protective.<\/p>"
    },
    {
        "title": "Pita",
        "desc": "<p>To see or eat pita in your dream represents wholeness and the circle of life. It refers to the positive things and sacrifices you have made in your life. Alternatively, pita symbolizes the womb.<\/p>"
    },
    {
        "title": "Pitcher",
        "desc": "<p>To see a water pitcher in your dream refers to the outpouring of ideas, knowledge, or emotions. You may be spilling your guts out to others and sharing aspects of yourself which you have previously kept to yourself.<\/p><p>To see a baseball pitcher in your dream suggests that you are in control. You have the power to make decisions and change the course that you are taking.<\/p>"
    },
    {
        "title": "Pitchfork",
        "desc": "<p>To see a pitchfork in your dream symbolizes self-sufficiency. You need to learn to do things for yourself. Alternatively, the dream suggests that you are seeking a simpler way of life.<\/p>"
    },
    {
        "title": "Pixel",
        "desc": "<p>To have a dream where the images are pixelated indicates a lack of clarity in a situation. Alternatively, if you see pixels of a picture, then it means that you are too focused on small details. You need to look at the big picture.<\/p>"
    },
    {
        "title": "Pixie",
        "desc": "<p>To see a pixie in your dream indicates your childish ways. It may also represent your unrecognized energy and your hidden potential. Alternatively, the dream means that you need to seek some outside advice.<\/p>"
    },
    {
        "title": "Pizza",
        "desc": "<p>To see or eat pizza in your dream represents abundance, choices, and variety. It may also indicate that you are lacking or feeling deprived of something. Alternatively, a pizza may have similar significance to a <a href=\"#Circle\">circle<\/a>.<\/p>"
    },
    {
        "title": "Pizzeria",
        "desc": "<p>To dream that you are in a pizzeria implies that you are surrounded by love and warmth. You feel at ease.<\/p><p>Dreaming that your own a pizzeria represents dedication and commitment.<\/p>"
    },
    {
        "title": "Place Mat",
        "desc": "<p>To see or put a place mat on a table in your dream represents where you stand in your personal relationship. You may be entering into a new relationship, either on a friendship level or romantic level. Alternatively, the dream signifies your sociability, your openness and your sharing nature.<\/p>"
    },
    {
        "title": "Placenta",
        "desc": "<p>To see a placenta in your dream symbolizes dependency and reliance on other people. It also suggests that there is something in your life that is no longer needed. You need to let go of some unnecessary burden.<\/p>"
    },
    {
        "title": "Places",
        "desc": "<p>To dream of a certain place in your dream is telling of your inner state of mind. Consider the feel, the appearance, and the coloring of the place. Also consider your own personal feelings and memories with that particular place.<\/p><p>Please see: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/places.htm\">Dream Moods Dream Themes: Places<\/a>.<\/p>"
    },
    {
        "title": "Plague",
        "desc": "<p>To dream of a plague indicates that you are being confronted with a broad issue that affects those around you. The decisions that you make will have a major impact and large-scale consequences.<\/p>"
    },
    {
        "title": "Plaid",
        "desc": "<p>To dream that you are wearing plaid suggests that some of your conservative views are in conflict with your liberal and wild side.<\/p>"
    },
    {
        "title": "Plains",
        "desc": "<p>To see the plains in your dream represent wholesomeness and homegrown goodness. Alternatively, the dream suggests that you have a clear and smooth path ahead. The plains may also be a pun on someone who is plain.<\/p>"
    },
    {
        "title": "Plan",
        "desc": "<p>To dream that you are planning an activity or event indicates that you need to be more organized and methodical in your decision-making and other aspects of your daily life. There are some issues that you are trying to sort out. Alternatively, the dream may reflect your actual stress or concerns about the activity or event in real life.<\/p><p>Dreams can help you solve certain problems that you are stuck on. The solution to a problem came about in a dream for some inventors and scientists. Some authors look to their dreams for their novels. Thus dreaming of a plan may give you an answer to a problem you are having.<\/p><p>If you dream of having plans or making plans, then it means that you need to make a commitment and stick to it.<\/p>"
    },
    {
        "title": "Plane",
        "desc": "<p>To see a plane in your dream may be a pun on someone or something that is &quot;plain&quot;. Perhaps the plane refers to a new level.<\/p><p>*Please See Also: <a href=\"#Airplane\">Airplane<\/a>.<\/p>"
    },
    {
        "title": "Planet",
        "desc": "<p>To see a planet in your dream signifies creativity, exploration, and new adventures. You are trying to align yourself with untapped energies that you never knew you had. Alternatively, to dream of planets, suggests that you are trying to escape from your own waking reality.<\/p><p>To dream that you discover life on a new planet refers to your desire to escape from a current situation. Alternatively, the dream represents your own self-discovery. You have uncovered a part of yourself that you did not realize existed within yourself.<\/p><p>Look up the specific planet for additional significance.<\/p>"
    },
    {
        "title": "Plank",
        "desc": "<p>To dream that you are walking the plank suggests you are feeling emotionally vulnerable. You are plunging into new emotional territory.<\/p><p>To see a wooden plank indicates something that is in need of repair or that you need to maximize your resources and make something out of seemingly nothing.<\/p>"
    },
    {
        "title": "Planting",
        "desc": "<p>To dream that you are planting something represents your faith and optimism about the future. You have an optimistic view.<\/p>"
    },
    {
        "title": "Plants",
        "desc": "<p>To see plants in your dream indicate fertility, spiritual development, potential, and growth. Alternatively, the appearance of plants in your dream reflect your caring and loving nature. If you are estranged from your children, then the plants may be seen as representative for your children.<\/p><p>In particular, to see indoor plants in your dream suggest that your growth is being hindered or slowed in some way. You are experiencing a lack of independence. Alternatively, the dream signifies your desire to be closer to nature.<\/p><p>To see droopy, withered or dead plants in your dream suggest that you are at a standstill in your life. You are lacking initiative.<\/p><p>Dreaming that plants are growing at a rapid pace or that the plants are growing right before your eyes mean that time is passing you by. You are taking certain things for granted or that you are not taking the time to notice the little things in life.<\/p>"
    },
    {
        "title": "Plaster",
        "desc": "<p>To work with plaster in your dream suggests that there is some matter that you are trying to resolve or settle.<\/p><p>If you are making a plaster mold in your dream, then it means that you are stuck with living in the past. You are unwilling to change and evolve with the times.<\/p>"
    },
    {
        "title": "Plastic",
        "desc": "<p>To see plastic objects in your dream suggests that you are being fake, artificial and\/or insensitive in some way. You are not being genuine and true to yourself. Alternatively, it signifies flexibility in your way of thinking.<\/p>"
    },
    {
        "title": "Plastic Bag",
        "desc": "<p>To see or use a plastic bag in your dream represents the temporary burdens and responsibilities that you are carrying with you. You need to exercise better control in certain areas of your life. Alternatively, it denotes concern for the environment.<\/p>"
    },
    {
        "title": "Plastic Surgery",
        "desc": "<p>To dream that you are having plastic surgery suggests that you are rebuilding your self-esteem and trying to improve your self-image. The dream may be an anxiety dream if you are considering plastic surgery or scheduled to go in for plastic surgery.<\/p>"
    },
    {
        "title": "Plates",
        "desc": "<p>To see a plate in your dream symbolizes your hunger for life. You are showing potential and promise for the future. The dream may be a symbol that you have too much on your plate.<\/p><p>If the plate is empty in your dream, then it indicates that there is an emotional void in your waking life. You may be feeling left out. Alternatively, it suggests that you need to rethink your priorities.<\/p><p>*Please See Also: <a href=\"#Dishes\">Dishes<\/a>.<\/p>"
    },
    {
        "title": "Plateau",
        "desc": "<p>To dream that you are on a plateau suggests that you are in a rut. You feel that your life is going nowhere or that you are lacking excitement in your life. Perhaps you are just taking a breather from life's fast pace. Alternatively, the plateau symbolizes a high state of consciousness.<\/p>"
    },
    {
        "title": "Platform Shoe",
        "desc": "<p>Tosee or wear platform shoes in your dream indicate that you need to stand tall and be proud. You are striving for a higher status in life. Alternatively, the dream may be a pun on having a &quot;platform&quot; on some political position. Due to its association with the seventies, the dream indicate the easy going and party attitudes of that era.<\/p>"
    },
    {
        "title": "Platinum",
        "desc": "<p>Tosee platinum in your dream symbolizes success, prosperity and wealth. Your achievements and accomplishments are attributed to your determination and drive. Do not ever believe that your goals are unattainable. Alternatively, the platinum represents coldness and toughness to your exterior persona.<\/p>"
    },
    {
        "title": "Platter",
        "desc": "<p>To see a platter in your dream indicates that you are feeling lazy or envious. Alternatively, the dream refers to some sort of entitlement. Perhaps you are wanting everything served to you &quot;on a silver platter&quot;.<\/p>"
    },
    {
        "title": "Platypus",
        "desc": "<p>To see a platypus in your dream refers to your tendency to wallow and dwell on your emotions. It may also suggest that your repressed thoughts and subconscious materials are slowly coming to the surface and making its presence known. Alternatively, a platypus is indicative of shyness and reservation, especially in social situations.<\/p>"
    },
    {
        "title": "Play",
        "desc": "<p>To dream that you are playing refers to your tendency to go against the norm and break the rules of convention. You are displaying unrestricted creativity. Alternatively, playing implies that you are all work and no play. You need to relax and let loose. On the other hand, the dream may also be saying that you are not taking things seriously enough. You need to face reality.<\/p><p>To dream that you are in a play represents the roles you play in your life and the various acts and personas you put on. If you are watching the play, then it suggests that you need to draw from the inspiration of others.<\/p>"
    },
    {
        "title": "Play Doh",
        "desc": "<p>To dream that you are playing with Play Doh refers to your ability to create something from an idea. You are using your imagination and exploring possibilities. Alternatively, dreaming about Play Doh signifies something that you are trying to manipulate.<\/p>"
    },
    {
        "title": "Playground",
        "desc": "<p>To dream that you are on a playground indicates your desires to escape from your daily responsibilities. Perhaps you need to be more carefree. You need to acknowledge your talents.<\/p>"
    },
    {
        "title": "Playpen",
        "desc": "<p>To see a playpen in your dream suggests that you need to make time for leisure and pleasure. Alternatively, the dream refers to your immature actions and behavior.<\/p>"
    },
    {
        "title": "Pliers",
        "desc": "<p>To see a pair of pliers in your dream suggests that you need to draw out all the details of a situation before you make a decision about it. Alternatively, the dream means that you need to rid yourself of something from your life.<\/p>"
    },
    {
        "title": "Plot",
        "desc": "<p>*Please See: <a href=\"#Conspiracy\">Conspiracy<\/a>.<\/p>"
    },
    {
        "title": "Plough",
        "desc": "<p>To see a plough in your dream represents growth and expansion. You are cultivating new ideas and projects.<\/p>"
    },
    {
        "title": "Plowing",
        "desc": "<p>To dream that you are plowing indicates that you are making a fresh new start. You are preparing yourself for growth and change. Alternatively, the dream may represent the monotony or routine of your daily life.<\/p>"
    },
    {
        "title": "Plug",
        "desc": "<p>To see a plug in your dream represents power, potential and untapped energies. You need to draw from within in order to move forward. Alternatively, the dream may be a pun that you need to stay &quot;plugged in&quot; about some information or news. There is something that you need to be aware of.<\/p>"
    },
    {
        "title": "Plum",
        "desc": "<p>To see or eat a plum in your dream symbolizes youth and vitality. The plum may also represent you self-image and the way you feel about your body. Perhaps the dream is a pun on being &quot;plump&quot;.<\/p><p>To see a plum tree in your dream represents youth, vitality, and innocence. The dream also indicates that you will overcome some difficulties.<\/p>"
    },
    {
        "title": "Plumage",
        "desc": "<p>To notice plumage in your dream signifies a need to feel protected and shielded from the elements. It also symbolizes an outward display of strength, triumph and power. You are being a little show-offy.<\/p>"
    },
    {
        "title": "Plumber",
        "desc": "<p>To see a plumber in your dream suggests that there is some emotional issue that you need to deal with instead of letting it clog up within you. Perhaps you need to turn to a friend or even professional help in order to deal with your problems effectively.<\/p>"
    },
    {
        "title": "Plumbing",
        "desc": "<p>To see plumbing in your dream symbolizes the flow of emotions. If the plumbing is clogged up, then it signifies repressed or pent up emotions that needs to be released and expressed. Seeing plumbing may also be a metaphor for your body and its internal working. Thus the dream may point to health concerns.<\/p>"
    },
    {
        "title": "Plunge",
        "desc": "<p>To dream that you are plunging into something indicates that you are facing some uncertainty in your waking life. You need to be willing to take a risk in order to move forward toward your goals.<\/p><p>To dream that something is plunging in your chest or someone else's chest suggests that you are ignoring some obvious truth. You are refusing to acknowledge and confront the truth.<\/p>"
    },
    {
        "title": "Plunger",
        "desc": "<p>To see a plunger in your dream suggests that you need to force yourself to confront certain emotions. It is hindering your progress and preventing you from moving forward in your life.<br><br><\/p>"
    },
    {
        "title": "Pluto",
        "desc": "<p>To see Pluto in your dream symbolizes death and destruction. You are undergoing a rebirth an a transformation. Your hidden potential will also be unveiled.<\/p>"
    },
    {
        "title": "Plywood",
        "desc": "<p>To see plywood in your dream represents flexibility and creativity in your way of thinking. Alternatively, it also symbolizes warmth.<\/p>"
    },
    {
        "title": "Pocket",
        "desc": "<p>To see a pocket in your dream represents your hidden talents and undeveloped abilities. You are not utilizing your strengths to the fullest potential. Did you find anything in the pocket? Consider the significance of what is inside the pocket. If the pocket is empty, then it symbolizes the womb and your desire to isolate yourself from others. Alternatively, a pocket symbolizes secrets. If there is a hole in the pocket, then it implies that your resources or abilities are being drained.<\/p>"
    },
    {
        "title": "Pocket Watch",
        "desc": "<p>To see or wear a pocket watch in your dream suggests that you are too overly concerned with time. You are being chained down by time. Be more spontaneous. Alternatively, the dream represents your old fashioned thinking and outdated attitude. You are living in the old ages. The pocket watch may also symbolize the ticking of the human heart and thus is indicative of the emotional side of your life.<\/p>"
    },
    {
        "title": "Pocketknife",
        "desc": "<p>To see a pocketknife in your dream suggests a good friend is hiding her or his true feelings.<\/p><p>*Please See Also: <a href=\"#Knife\">Knife<\/a>.<\/p>"
    },
    {
        "title": "Podium",
        "desc": "<p>To dream that you are standing at a podium suggests that there is something important that you need to say and get out. You need to be heard. Perhaps you are having difficulties conveying your message and it is weighing on your mind. Just let it out! Alternatively, dream that you are at a podium denotes your position of prominence and status. You are an influential figure.<\/p>"
    },
    {
        "title": "Poetry",
        "desc": "<p>To see or read poetry in your dream signifies inspiration and idealistic notions. It also suggests that you need to improve the lines of communications with someone.<\/p>"
    },
    {
        "title": "Pogo Stick",
        "desc": "<p>To see or play with a pogo stick in your dream represents life's ups and downs. If you do not have control of your pogo stick, then it indicates that you are all over the place in your emotions and thinking. You need to focus and zero in on one issue at a time. Alternatively, being on a pogo stick may be analogous to sex.<\/p>"
    },
    {
        "title": "Poinsettia",
        "desc": "<p>To see poinsettias in your dream symbolize joy, good health and\/or festivity. The dream may also imply that you need an uplift to your spirit.<\/p>"
    },
    {
        "title": "Point",
        "desc": "<p>To see something pointed in your dream represents action, urgency and completion. The dream suggests that you have arrived to a decision or common understanding. Alternatively, the dream may also be a metaphor that there is a point to your dream. Or you need to get your point across.<\/p>"
    },
    {
        "title": "Pointing",
        "desc": "<p>To dream that you are pointing at someone or something indicates that you need to pay more attention to that particular person or object. The dream may be showing you the way to solving a problem in your waking life.<\/p><p>To dream someone is pointing at yousuggests feelings of self guilt or even shame. You are being accused of some wrongdoing.<\/p>"
    },
    {
        "title": "Poison",
        "desc": "<p>To see poison in your dream denotes that you need to get rid of something in your life that is causing you much sickness and distress. You need to cleanse and purge away the negativity in your life.<\/p><p>To dream that you ingest or inhale poison indicates that you are introducing something into yourself that is harmful to your well-being. This may be feelings of bitterness, jealousy or other negative feelings that are consuming you.<\/p>"
    },
    {
        "title": "Poison Ivy",
        "desc": "<p>To see poison ivy in your dream refers to your vengeful or devious thoughts. It is indicative of resentment, jealousy, and revenge. Alternatively, poison ivy represents a situation, behavior or condition that you need to avoid. Perhaps you need to avoid certain food, habit, person, situation, etc.<\/p>"
    },
    {
        "title": "Poke",
        "desc": "<p>To dream that you are being poked represents something that needs your attention. Perhaps the dream is giving you a poke or a nudge to move forward. Thus, the dream may be a pun on being &quot;pokey&quot; or slow. You need to stop sitting around and start accomplishing your goals.<\/p>"
    },
    {
        "title": "Pokemon",
        "desc": "<p>To play pokemon in your dream indicates a desire to expand your social circle. You are looking for acceptance.<\/p><p>To dream that you are a pokemon points to your individualism and qualities that sets your apart from others.<\/p>"
    },
    {
        "title": "Poker",
        "desc": "<p>To dream that you are playing poker suggests that a situation in your waking life requires strategy and careful planning. You need to think things through before carrying out your actions. Alternatively, the dream may also be a pun on &quot;poke her&quot;. Are you trying to get a girl's attention?<\/p>"
    },
    {
        "title": "Poker Chips",
        "desc": "<p>To see poker chips in your dream symbolize the uncertainty of life. Sometimes you need to take a chance.<\/p>"
    },
    {
        "title": "Polar Bear",
        "desc": "<p>To see a polar bear in your dream signifies a reawakening. Alternatively, the polar bear symbolizes your frigid and cold emotions.<\/p>"
    },
    {
        "title": "Pole",
        "desc": "<p>To see a pole in your dream represents security and stability. The dream is a reminder that you always have something or someone you can lean on. Alternatively, the dream may also be a phallic symbol.<\/p>"
    },
    {
        "title": "Pole Dancing",
        "desc": "<p>To dream that you are pole dancing symbolizes your sexual expression. You need to be more open and expressive with your sexuality. The pole is a phallic symbol. Thus the dream may be analogous to some that you have wrapped around your finger.<\/p>"
    },
    {
        "title": "Pole Vaulting",
        "desc": "<p>To dream that you are pole vaulting indicates that you are trying to overcome some sexual issue.<\/p>"
    },
    {
        "title": "Police",
        "desc": "<p>To see the police in your dream symbolizes structure, rules, power, authority and control. You need to put an end to your reckless behavior or else the law will catch up to you. Alternatively, the dream refers to failure in honoring your obligation and commitments.<\/p><p>To dream that you are arrested by the police suggests that you feel sexually or emotionally restrained because of guilt. The dream may also be a metaphor that you are feeling apprehensive about something.<\/p><p>To dream that you are a police officer represents your own sense of morality and conscience. The dream may serve to guide you down a straight path. If you have recurring dreams that you are a police officer, then it may mean that your past actions are leaving you with guilt. Consider your behavior and actions as the cop. If your dream that you are in pursuit of a suspect, then it indicates that your naughty and devious side is in conflict with your moral standards. To dream that you are an undercover cop implies that you are going against your conscience.<\/p><p>To dream that you are having difficulties contacting the police suggests that you have yet to acknowledge your own authoritativeness in a situation. You need to take control and be in command of the direction of your life.<\/p><p>To dream that you are pulled over by the police suggests that you need to slow down and take things down a notch.<\/p><p>Dreaming that you are running from the police means that you are refusing to face the consequences of your actions. It also indicates that you are rejecting certain rules.<\/p>"
    },
    {
        "title": "Police Car",
        "desc": "<p>To see a police car in your dream indicates that help is on the way for you. You are experiencing some inner turmoil and need intervention.<\/p>"
    },
    {
        "title": "Political Party",
        "desc": "<p>To dream of a political party suggests that you need to stand up and defend your beliefs. Be prepared for any dissent and backlash.<\/p>"
    },
    {
        "title": "Police Tape",
        "desc": "<p>To see police tape in your dream represents protection from your subconscious. Something is preventing you from delving deeper. Alternatively, the dream symbolizes restriction.<\/p>"
    },
    {
        "title": "Polish",
        "desc": "<p>To dream that you are polishing metal means that you are honing your skills and realizing your full potential.<\/p><p>If you dream that you are polishing rocks or stones, then it indicates that you are able to see the true beauty in something or someone. It represents endurance, patience and longevity.<\/p>"
    },
    {
        "title": "Politician",
        "desc": "<p>To dream that you are a politician indicates that you are being deceptive and manipulative. Alternatively, the dream suggests that you are trying to persuade others to support your views and ideas. Perhaps you are abusing your position in some situation in your life.<\/p><p>To see a politician in your dream suggests that you need to choose and take a side. The dream parallels a decision that you need to make in your waking life. Alternatively, the politician may reflect your desires for political office or your interest in world affairs.<\/p>"
    },
    {
        "title": "Polka Dots",
        "desc": "<p>To see polka dots in your dream symbolize routine and monotony. If the polka dots are misshapen, then it refers to your desire to break out of the routine; you want a change of pace.<\/p>"
    },
    {
        "title": "Poll Booth",
        "desc": "<p>To see or dream that you are at a poll booth represents your desires to make a difference in your community or society. You want to leave an impact on others. Alternatively, the dream indicates that you are feeling boxed in or cornered.<\/p>"
    },
    {
        "title": "Pollen",
        "desc": "<p>To see or inhale pollen in your dream represents the annoyances in your life. You are feeling irritable. Alternatively, it signifies the sharing and spreading of new ideas.<\/p>"
    },
    {
        "title": "Pollution",
        "desc": "<p>To dream of pollution indicates that you need to clean up your words and thoughts.<\/p>"
    },
    {
        "title": "Polo",
        "desc": "<p>To dream that you are playing polo signifies a life of wealth, access and prestige. Alternatively, the dream refers to a patriarchy. You feel that you are living in a male-dominated world.<\/p>"
    },
    {
        "title": "Poltergeist",
        "desc": "<p>To see or hear a poltergeist in your dream signifies a lack of control in your life. You are experiencing some disruptions that are hindering your goals.<\/p>"
    },
    {
        "title": "Polyester",
        "desc": "<p>To dream that something is made of polyester suggests that you are just getting by in life. You are satisfied with mediocrity.<\/p>"
    },
    {
        "title": "Polygamy",
        "desc": "<p>To dream of polygamy indicates some unresolved sexual issues. Perhaps you need to be less prudish and explore your sexuality.<\/p>"
    },
    {
        "title": "Polygraph",
        "desc": "<p>To see a polygraph in your dream represents your lack of confidence. You are experiencing a loss of faith in others.<\/p><p>To dream that you are taking a polygraph suggest that it is time to face the facts. You are trying to hide from the pain. Stop being in denial.<\/p>"
    },
    {
        "title": "Pomander",
        "desc": "<p>To see or wear a pomander in your dream signifies protection. You are expressing your concerns about your health.<\/p>"
    },
    {
        "title": "Pomegranate",
        "desc": "<p>To see a pomegranate in your dream signifies fertility, good health, life and longevity. The allure and invitation of sex is also indicated. Alternatively, it represents blood.<\/p>"
    },
    {
        "title": "Pompeii",
        "desc": "<p>To dream about Pompeii implies that life can stop in an instant. Take time to appreciate those around you because tomorrow is not guaranteed.<\/p>"
    },
    {
        "title": "Pompoms",
        "desc": "<p>To see pompoms in your dream symbolize the spirit of competition. The dream is offering you motivation and encouragement to proceed with some endeavor. You need to forge ahead. Alternatively, to see pompoms waving in your dream indicate that you are moving forward in the right direction. Keep doing what you're doing.<\/p>"
    },
    {
        "title": "Pond",
        "desc": "<p>To see a pond in your dream represents tranquility. You need some more quiet time to yourself. It is a time to reflect on your situation and what is going on in your life. Alternatively, a pond suggests that you tend to keep your feelings contained and in check. You are an emotionally calm person.<\/p><p>Dreaming of a frozen pond implies that you are emotionally frigid. You are not expressing your feelings effectively. The dream may also mean that you are indifferent to a situation or relationship. You are giving someone the cold shoulder.<\/p>"
    },
    {
        "title": "Pony",
        "desc": "<p>To see a pony in your dream signifies the playful aspects of your life. It is representative of your unexplored, underdeveloped, or undisciplined power.<\/p>"
    },
    {
        "title": "Ponytail",
        "desc": "<p>To dream that you are wearing a ponytail symbolizes a casual and carefree attitude.<\/p>"
    },
    {
        "title": "onzi Scheme",
        "desc": "<p>To dream of a Ponzi scheme indicates that you are experiencing deep financial worries. You have second thoughts about some investment. Perhaps you should trust what your instincts are trying to tell you. Alternatively, a Ponzi scheme implies that your relationship is not worth putting any more attention and effort into.<\/p>"
    },
    {
        "title": "Poo",
        "desc": "<p>*Please See: <a href=\"#Feces\">Feces<\/a>.<\/p>"
    },
    {
        "title": "Poodle",
        "desc": "<p>To see a poodle in your dream symbolizes an upper class attitude.<\/p>"
    },
    {
        "title": "Pool",
        "desc": "<p>To see a pool of water in your dream indicates that you need to acknowledge and understand your feelings. It is time to dive in and deal with those emotions. Alternatively, a pool indicates your desire to be cleansed. You need to wash away the past.<\/p><p>If you have a dream of a dark and\/murky pool, then it suggests that you are wallowing in some negative emotions. Alternatively, a dark pool implies that your thinking or judgment is being clouded by your emotions. You are not thinking rationally.<\/p><p>To dream that you are playing or shooting pool represents your competitive nature. You need to learn to win or lose gracefully. Alternatively, shooting pool means that you need to concentrate harder on a problem in your waking life.<\/p>"
    },
    {
        "title": "Pool Noodle",
        "desc": "<p>To see or use a pool noodle in your dream points to a false sense of security. Alternatively, a pool noodle means that you need to be more yielding and flexible in some situation.<\/p>"
    },
    {
        "title": "Pool Table",
        "desc": "<p>To see a pool table in your dream suggests that you need to show more cooperation. Perhaps you need to &quot;pool&quot; your efforts together.<\/p>"
    },
    {
        "title": "Poor",
        "desc": "<p>To dream that you are poor refers to feelings of inadequacies. You are not utilizing your full potential or are underestimating your self worth. Alternatively, to dream that you are poor symbolizes neglect of your sexual nature. You may be taking on too many responsibilities and working too hard that you are not catering to your sexual self.<\/p>"
    },
    {
        "title": "Popcorn",
        "desc": "<p>To eat or make popcorn in your dream suggests positive growth. You are full of ideas. Some important fact or truth is being made aware to you through the dream. If the popcorn is unpopped, then it symbolizes potential.<\/p>"
    },
    {
        "title": "Pope",
        "desc": "<p>To see a pope in your dream represents your spiritual guidance, beliefs, and spiritual self. The dream serves to be an inspiration. Alternatively, it may indicate your own self-righteousness, narrow-mindedness, and holier-than-thou attitudes.<\/p>"
    },
    {
        "title": "Popeye",
        "desc": "<p>To see Popeye in your dream indicates that you have overstepped your boundaries. Perhaps you are forcing your opinions or beliefs on others.<\/p>"
    },
    {
        "title": "Poplar",
        "desc": "<p>To see a poplar in your dream symbolizes life and vitality.<\/p>"
    },
    {
        "title": "Poppy",
        "desc": "<p>To see a poppy in your dream symbolizes fertility, and abundance. Alternatively, the dream suggests that you need to learn to forget or forgive. You need to let go out the past and look forward to the future.<\/p><p>In particular, if the poppy is red, then it represents a sacrifice that you need to make or have made. It is also symbolic of remembrance.<\/p>"
    },
    {
        "title": "Popsicle",
        "desc": "<p>To see or eat a popsicle in your dream suggests that you need to cool off and not let your temper get out of hand. Alternatively, a popsicle may represent the phallus.<\/p>"
    },
    {
        "title": "Popular",
        "desc": "<p>To dream that you are popular signifies your desires to be liked and recognized. You want others to look up to you. Alternatively, the dream represents your insecurities. You are looking for some reaffirmation, encouragement and approval from others.<\/p>"
    },
    {
        "title": "Porcelain",
        "desc": "<p>To see or touch porcelain in your dream symbolizes smoothness. Things are going well for you. Alternatively, the dream may also represent some delicate situation. You need to treat it with care.<\/p>"
    },
    {
        "title": "Porch",
        "desc": "<p>To dream of a porch represents your personality, your social self, your facade and how you portray yourself to others. Consider the condition and size of the porch. In particular to dream of an enclosed porch suggests of your tendency to distance yourself from others and your desires for privacy. If the porch is open, then it signifies your outgoing nature and welcoming attitude.<\/p>"
    },
    {
        "title": "Porcupine",
        "desc": "<p>To see a porcupine in your dream suggests that you need to look out for yourself and protect yourself from emotional or psychological harm. Trust and honesty are important qualities. Alternatively, a porcupine indicates that there is a situation which you need to approach with openness. Someone in your waking life may be on the defensive and are not be exposing their vulnerabilities.<\/p>"
    },
    {
        "title": "Pork",
        "desc": "<p>To see or eat pork in your dream signifies your desire for routine and normalcy. Alternatively, the dream may be a pun on overspending.<\/p>"
    },
    {
        "title": "Pornography",
        "desc": "<p>To dream that you are watching pornography indicates your issues with intimacy, power, control, and effectiveness. You may be having concerns about your own sexual performance. Alternatively, you are afraid of exposing some aspect of yourself.<\/p><p>To dream that you in a porno film suggests your desire to be more sexually adventurous. It also implies lust and wish-fulfillment.<\/p>"
    },
    {
        "title": "Porpoise",
        "desc": "<p>To see a porpoise in your dream may be a pun on your &quot;purpose&quot; for something. Perhaps you are looking for your purpose in life.<\/p><p>*Please see also: <a href=\"#Dolphins\">Dolphins<\/a>.<\/p>"
    },
    {
        "title": "Port",
        "desc": "<p>*Please See: <a href=\"#Harbor\">Harbor<\/a>.<\/p>"
    },
    {
        "title": "Porta Potty",
        "desc": "<p>To see or use a porta potty in your dream indicates that you need to express your feelings more openly. Don't hold back your emotions. You need to let yourself go.<\/p>"
    },
    {
        "title": "Portables",
        "desc": "<p>To dream that you are in a school portable indicates that you need to learn to adapt to various situations. There is also an important life lesson that you need to learn.<\/p>"
    },
    {
        "title": "Portal",
        "desc": "<p>*Please See: <a href=\"#Door\">Door<\/a>.<\/p>"
    },
    {
        "title": "Portrait",
        "desc": "<p>To see a portrait of yourself in your dream represents how you see yourself or how you want others to see you. Consider the details in the portrait: if you were smiling, how you were painted or drawn, what you were wearing, etc.<\/p><p>To see a family portrait in your dream signifies your core values and beliefs. Family is obviously important to you and in your decision making. The dream may serve to remind you of what really matters in life.<\/p>"
    },
    {
        "title": "Posing",
        "desc": "<p>To dream that you are striking a pose indicates that you are being someone you are not. You are trying to live up to the expectations of others. Perhaps, you are too idealistic. Alternatively, posing means that you are keeping your true self hidden. You are putting up a facade.<\/p>"
    },
    {
        "title": "Posse",
        "desc": "<p>To dream that you have a posse represents a unified whole. You have a strong support system. Alternatively, the dream indicates that various aspects of yourself are converging together for a common goal. All your waking conflicts have dissipated.<\/p>"
    },
    {
        "title": "Possessed",
        "desc": "<p>To dream that you or someone else is possessed represents a state of helplessness. You feel you are not in control of things.<\/p>"
    },
    {
        "title": "Possession",
        "desc": "<p>To see your possessions in your dream symbolize your identity or self-worth. Consider the significance of each item for additional clues to the meaning of your dream. Metaphorically, the dream may mean that you are being &quot;possessive&quot;. You need to learn to let go.<\/p>"
    },
    {
        "title": "Possum",
        "desc": "<p>To see a possum in your dream indicates that something may not be what it appears to be. You need to dig deeper and look for the hidden meaning of some situation or circumstance.<\/p>"
    },
    {
        "title": "Post-Apocalypse",
        "desc": "<p>To dream that you are in the post-apocalypse implies that you will overcome the difficulties you are experiencing in your current life. Alternatively, the dream means that you need to fend for yourself. You need to be more independent and resourceful instead of relying on others.<\/p>"
    },
    {
        "title": "Post-It Note",
        "desc": "<p>To see or write on a post-it note in your dream indicates that there is something that you need to make a mental note of. Perhaps the note is a message from your subconscious. Alternatively, the dream may be a metaphor telling you to go ahead and &quot;post&quot; a message or mail a note.<\/p>"
    },
    {
        "title": "Postcard",
        "desc": "<p>To see or read a postcard in your dream represents your desire to be more open. If you receive a postcard in your dream, it may imply that someone is thinking of you.<\/p><p>Dreaming of looking for a specific postcard means that you are trying to express your current feelings or convey your status.<\/p>"
    },
    {
        "title": "Poster",
        "desc": "<p>To see or hang a poster in your dream represents your personality. You want to display and share an aspect of yourself for all to see. Consider the content of the poster for significance of what you are trying to express to the public.<\/p>"
    },
    {
        "title": "Postman",
        "desc": "<p>*Please See: <a href=\"#Mailman\">Mailman<\/a>.<\/p>"
    },
    {
        "title": "Post Office",
        "desc": "<p>To dream that you are in a post office signifies an important message from your subconscious or inner wisdom. It may relate to your need to reach out and communicate with others. Alternatively, the dream means that you are trying to maintain your beliefs or reestablish contact with someone from your past.<\/p>"
    },
    {
        "title": "Posture",
        "desc": "<p>To have good posture in your dream represents your self confidence. If your posture is noticeably bad, then it signifies a lack of confidence or low self esteem. You are feeling unsure of yourself.<\/p>"
    },
    {
        "title": "Pot",
        "desc": "<p>To see a pot in your dream represents your attitudes. The dream may be revealing hidden anger or frustration. You are up to something. Consider also how it may be a reference to marijuana and\/or drug use.<\/p><p>To dream that the pot is boiling or bubbling over suggests that you are filled with enthusiasm, excitement or ideas. Alternatively, a boiling pot indicates that you have more than you can handle. You are feeling overwhelmed with emotions.<\/p>"
    },
    {
        "title": "Pot Holder",
        "desc": "<p>To see or use a pot holder in your dream represents protection. There is some emotional situation or issue in your life that needs to be handled with care.<\/p>"
    },
    {
        "title": "Potato",
        "desc": "<p>To see potatoes in your dream represent your earthiness and simplicity. Alternatively, the dream may be a metaphor that you are being a &quot;couch potato&quot;. In other words, you are being lazy. Or seeing a potato in your dream may also be a metaphor that some issue is like a &quot;hot potato&quot;. A situation is being passed around instead of properly dealt with; nobody wants to handle the issue.<\/p><p>To see or eat mashed potatoes in your dream suggest that you are experiencing concerns over financial matters.<\/p>"
    },
    {
        "title": "Potato Bug",
        "desc": "<p>To see a potato bug in your dream represents your intuition or subconscious desire. Alternatively a potato bug refers to some negative, or even evil influence that you are confronted with in your waking life.<\/p>"
    },
    {
        "title": "Potato Chips",
        "desc": "<p>To see or eat potato chips in your dream symbolize your overindulgent behavior. Perhaps you need to exercise more self control.<\/p>"
    },
    {
        "title": "Potholes",
        "desc": "<p>To see a pothole in your dream represents difficulties and setbacks in achieving your goals. You need to make some changes in how you approach your goals. The dream also indicates that things are not going smoothly for you in some aspect or situation in your waking life.<\/p>"
    },
    {
        "title": "Potion",
        "desc": "<p>To see or take a potion in your dream indicates a negative influence in your life. Sometimes you should not try to purposely alter the normal rhythm of things. Alternatively, the dream means that you are trying hard to change the course of some action.<\/p>"
    },
    {
        "title": "Potluck",
        "desc": "<p>To dream that you are attending a potluck represents your social life, your interpersonal relationships, and how you connect with others. Consider the significance of what you bring to the potluck and how you may need to incorporate it into your waking life.<\/p>"
    },
    {
        "title": "Potpourri",
        "desc": "<p>To make potpourri in your dream represents the sweet smell of success. You are enjoying the results of your labor. Alternatively, the potpourri may serve to remind you of a particular stage or time in your life.<\/p>"
    },
    {
        "title": "Pottery",
        "desc": "<p>To see pottery in you dream symbolizes the womb and all things feminine. The pottery in your dream may also represent your tendency to keep you emotions and thoughts inside instead of expressing them.<\/p>"
    },
    {
        "title": "Pottery Wheel",
        "desc": "<p>To see or use a pottery wheel in your dream suggests that you need to take time and care in shaping and molding a relationship. Alternatively, the dream symbolizes the feminine mystique.<\/p>"
    },
    {
        "title": "Poultry",
        "desc": "<p>To see or eat poultry in your dream indicates togetherness. It may point to some special occasion.<\/p><p>*Please also see: <a href=\"#Chickens\">Chickens<\/a> or: <a href=\"#Turkey\">Turkey<\/a>.<\/p>"
    },
    {
        "title": "Powder",
        "desc": "<p>To dream that you are powdering your face indicates that there is some flaw or mistake that you are trying to cover up.<\/p><p>To see something powdery in your dream suggests that you need to be more refined in your behavior and speech.<\/p>"
    },
    {
        "title": "Power",
        "desc": "<p>To dream that you have power indicates your growing confidence, high self-esteem and increasing skills. Alternatively, your dream of power may try to compensate for a waking situation where you felt powerless.<\/p><p>To dream that you do not have any power refers to a waking situation in which you felt unable to do anything.<\/p>"
    },
    {
        "title": "Power Lines",
        "desc": "<p>To see or become entangled in power lines represents your struggle for power and empowerment. You are experiencing an obstacle toward your career goal or in your relationship.<\/p>"
    },
    {
        "title": "Power Plant",
        "desc": "<p>To see a power plant in your dream symbolizes your potential and abilities. You can accomplish your goals or achieve success as long as you set your mind to it. Alternatively, the dream is symbolic of energy.<\/p>"
    },
    {
        "title": "Poverty",
        "desc": "<p>*Please See: <a href=\"#Poor\">Poor<\/a>.<\/p>"
    },
    {
        "title": "Practice",
        "desc": "<p>To dream that you are practicing for a sport or musical instrument suggests that you are visualizing success of your talent. Dreams can be used as a training ground. Alternatively, the dream signifies your commitment to success and to achieving your goals. It is offering you some encouragement. The dream is also telling you that &quot;practice makes perfect.&quot; Don't give up.<\/p>"
    },
    {
        "title": "Prairie Dog",
        "desc": "<p>To see a prairie dog in your dream represents an underground community. The dream may be telling you to go against the masses and the norm.<\/p>"
    },
    {
        "title": "Prawn",
        "desc": "<p>*Please See: <a href=\"#Shrimp\">Shrimp<\/a>.<\/p>"
    },
    {
        "title": "Praise",
        "desc": "<p>To hear praise in your dream indicates pride and self-love. You are feeling good about yourself and the work that you are doing. Alternatively, hearing praise in your dream suggests that you are seeking encouragement and self motivation.<\/p><p>To dream that you are giving praise means that you need to be steadfast and not let others questions your authority and position on things.<\/p>"
    },
    {
        "title": "Prank",
        "desc": "<p>To dream that someone is playing a prank on you suggests that someone is undermining your ability. Your character is being called to question.<\/p><p>To dream that you are playing a prank on someone indicates that you need to start taking things more seriously. Stop looking at things as a joke.<\/p>"
    },
    {
        "title": "Praying",
        "desc": "<p>To dream that you are praying signifies respect, sincerity and humility. You are looking for help from a higher source. You need to relinquish your worries and let go of your old problems. More directly, the dream means that you need to pray more. Alternatively, the dream may be a pun on &quot;preying&quot;. Perhaps you are taking advantage of others or that someone is taking advantage of you.<\/p><p>To see or hear someone else pray in your dream indicates that you are looking for some guidance. You are feeling lost.<\/p>"
    },
    {
        "title": "Praying Mantis",
        "desc": "<p>To see a praying mantis in your dream suggests that you are involved in a destructive relationship. It may also indicate that you are preying on others. You are behaving deviously.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=insectdream1\">Devil In Disguise<\/a>&quot;<\/p>"
    },
    {
        "title": "Preacher",
        "desc": "<p>To see a preacher in your dream represents a harsh personal lesson that you need to learn. You may be harboring feelings of guilt and self-punishment. It is time to stop being so hard on yourself. Alternatively, the dream indicates that you are being too preachy. You are forcing your own ideas and beliefs on others.<\/p>"
    },
    {
        "title": "Precipice",
        "desc": "<p>*Please See: <a href=\"#Cliff\">Cliff<\/a>.<\/p>"
    },
    {
        "title": "Prediction",
        "desc": "<p>To hear or receive a prediction in your dream reflects your concerns, fears and\/or anxieties about the future. You are worried about some outcome in your waking life and want to control what is happening around you.<\/p><p>To give someone a prediction in your dream suggests that you are in tune with your intuition. You are confident about the decisions you are making.<\/p>"
    },
    {
        "title": "Pregnant",
        "desc": "<p>To dream that you are pregnant symbolizes an aspect of yourself or some aspect of your personal life that is growing and developing. You may not be ready to talk about it or act on it. Being pregnant in your dream may also represent the birth of a new idea, direction, project or goal. Dreaming that you did not realize you were pregnant implies that you are in denial about something. You also have a tendency to ignore things until it is right in front of you. Alternatively, if you are trying to get pregnant, then the dream may be a wish fulfillment. If you are not trying to get pregnant, but dream that you are, then it symbolizes fear of new responsibilities.<\/p><p>To dream that you are pregnant with the baby dying inside of you suggests that a project you had put a lot of effort into is falling apart and slowly deteriorating. Nothing is working out the way you had anticipated.<\/p><p>To dream that someone else is pregnant indicates that you are experiencing a closer connection to this person.<\/p><p>To dream that your girlfriend or significant other is pregnant with someone else's baby implies that your significant other is moving toward a different direction than you envisioned. The two of you no longer share common goals.<\/p><p>If you are really pregnant and have this dream, then it represents your anxieties about the pregnancy. If you are in your first trimester of pregnancy, then your dreams tend to be about tiny creatures, fuzzy animals, flowers, fruit and water. In the second trimester, dreams will reflect anxieties about being a good mother and concerns about possible complications with the birth. Dreams of giving birth to a non-human baby are also common during this period of the pregnancy. Finally, in the third trimester, dreams consists of labor, being attacked or something happening to the baby. As your body changes and grows, dreams of whales, elephants and dinosaurs and other larger animals may also start appearing at this stage of pregnancy.<\/p><p>If you are pregnant and dream of the gender of the baby, then the dream reflects your waking preoccupation with the gender of the baby. It is normal to wonder whether you are having a boy or a girl. In fact, when others find out that you are pregnant, they often ask if you are having a boy or a girl. There is no evidence that dreams can &quot;tell&quot; you the sex of the baby.<\/p><p>To dream that your ex-girlfriend is pregnant or that you are pregnant with your ex's baby implies your subconscious desires to get back with your ex. You are looking to reconnect in some way. If you dream that your ex-girlfriend is pregnant with someone else's baby, then it means that you have fully accepted that the relationship is over. You still care for her even though the two of you are no longer together.<\/p><p>Dreaming of a pregnant belly being violently ripped or cut open implies that you are unprepared for the new changes in your life. You feel that you are thrown into a situation that you cannot control.<\/p><p>***Read our special section on: <a href=\"http:\/\/www.dreammoods.com\/dreaminformation\/pregnancy-dreams.htm\">Dreaming While Pregnant<\/a>. See also: <a href=\"#Birth\">Birth<\/a> or: <a href=\"#Belly\">Belly<\/a>. See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=pregnantdream1\">Pregnant Mother<\/a>&quot;<\/p>"
    },
    {
        "title": "Pregnancy Test",
        "desc": "<p>To dream that you are taking a pregnancy test indicates that you are entering a new phase in your life (a new job, relationship, etc.) You feel that you are being put to the test as to whether you are prepared or ready for these changes. Alternatively, this dream may be literal in meaning and address your anxieties\/fears of getting pregnant.<\/p>"
    },
    {
        "title": "Prehistoric",
        "desc": "<p>To dream of prehistoric times suggests that your thinking and beliefs are outdated. Alternatively, the dream means that you need to adapt and incorporate what you have learned in the past to the present.<\/p>"
    },
    {
        "title": "Premonition",
        "desc": "<p>To dream of a premonition signifies growth. Some relationship or situation is evolving and moving into a new phase.<\/p>"
    },
    {
        "title": "Preschool",
        "desc": "<p>To dream that you are in preschool suggests that you are going through a transitional phase in your life. The dream may also represent some unresolved feelings of anxiety or separation.<\/p>"
    },
    {
        "title": "Prescription",
        "desc": "<p>To see or fill a prescription in your dream indicates that you are trying to find clarity to a situation. You are looking for answers to a problem.<\/p>"
    },
    {
        "title": "Present",
        "desc": "<p>To see a present in your dream may be a pun on being &quot;present&quot; and here. Or perhaps you need to live for the moment and not dwell in the past.<\/p><p>*Please see: <a href=\"#Gift\">Gift<\/a>.<\/p>"
    },
    {
        "title": "Presentation",
        "desc": "<p>To dream that you are giving a presentation symbolizes the way you want to &quot;present&quot; yourself to the public. You are working on your image and how you portray yourself.<\/p>"
    },
    {
        "title": "President",
        "desc": "<p>To see the president of your country in your dream symbolizes authority, power and control. Your own personal views and opinions of the president and their actions will also play strongly in the significance of this dream.<\/p><p>To dream that you are running for president signifies your quest for power. You have set high goals for yourself.<\/p><p>If you dream that you are the president, then it represents your high level of self-confidence. You believe that you can do a better job if you were in charge of things.<\/p>"
    },
    {
        "title": "Press",
        "desc": "<p>To see the press in your dream suggests that there is a messages that you need to convey and get across to others. You need to pay more attention to the outside world and not be so self-absorbed. Alternatively, the dream may be a pun on some &quot;pressing&quot; issue that needs your immediate attention.<\/p><p>To dream that the press is chasing you indicates your lack of privacy. You may feel that someone or some situation is invading into your space.<\/p>"
    },
    {
        "title": "Press Conference",
        "desc": "<p>To dream that you are holding a press conference represents an important message that you need others to hear. There is some information that you need to reveal or share.<p>Dreaming that you are watching or are at a press conference refers to your expanded awareness.<\/p>"
    },
    {
        "title": "Pressure",
        "desc": "<p>To dream of pressure symbolizes stress and tension in your life. You are feeling overwhelmed, overworked, or overloaded. The dream may be telling you to take it easy. Relax.<\/p>"
    },
    {
        "title": "Pretend",
        "desc": "<p>*Please See: <a href=\"#deception\">Deception<\/a>.<\/p>"
    },
    {
        "title": "Pretty",
        "desc": "<p>To dream that you are pretty indicates that you need to acknowledge the beauty within yourself. It's all about a positive attitude and high self-confidence. Alternatively, to dream about your prettiness points to your concerns about how others perceive you.<\/p><p>To see someone pretty in your dream represents qualities that you need to accept or incorporate into your own self.<\/p>"
    },
    {
        "title": "Pretzel",
        "desc": "<p>To see a pretzel in your dream symbolizes devotion, spiritual beliefs and life's sweet rewards. You are embracing life and extending yourself to help others. Alternatively, a pretzel indicates that you are preoccupied with some complex issue and are not sure how to handle it.<\/p>"
    },
    {
        "title": "Price",
        "desc": "<p>To see a price of something in your dream represents the value you are placing on yourself, your time and your abilities. If the price is high, then it indicates that you value yourself highly. If the price is low, then you are undervaluing yourself or taking somebody else for granted. The dream also relates to your self esteem.<\/p>"
    },
    {
        "title": "Prickerbush",
        "desc": "<p>To see a prickerbush in your dream indicates that you are experiencing problems and difficulties in some waking relationship. You may need to put up your defenses and stand up for yourself. Alternatively, the dream refers to someone in your life who is a &quot;prick&quot;.<\/p>"
    },
    {
        "title": "Pride",
        "desc": "<p>To have or feel pride in your dream indicates that you will have to stand up and fight against attacks to your integrity. You are being challenged.<\/p><p>To dream that others are displaying pride suggests that your support is needed in some cause.<\/p>"
    },
    {
        "title": "Priest",
        "desc": "<p>To see a priest in your dream represents your spiritual needs, sense of morality and religious beliefs. You are looking for guidance. It also symbolizes chastity and abstinence. Perhaps, you are feeling sexually repressed.<\/p><p>To see a dictatorial or condemning priest in your dream signifies unyielding authority and over-protectiveness. You may feel that you are living under unreasonable rules.<\/p>"
    },
    {
        "title": "Prime Meridian",
        "desc": "<p>To have a dream about the Prime Meridian signifies the balance between your objective thinking and your emotions. The Prime Meridian can also be seen as a line separating your left brain and right brain. Perhaps you feel conflicted between your creative side and your rational side.<\/p>"
    },
    {
        "title": "Prime Minister",
        "desc": "<p>To see the prime minister of your country in your dream symbolizes authority, power and control. Your own personal views and opinions of the prime minister and their actions will dominate in the meaning of the dream. Perhaps you are trying to incorporate a decision that the prime minister has made into your own life.<\/p>"
    },
    {
        "title": "Prime Rib",
        "desc": "<p>To see or eat prime rib in your dream suggests that you are indulging in life's pleasures and rewards.<\/p>"
    },
    {
        "title": "Primrose",
        "desc": "<p>To see primrose in your dream symbolizes purity, youth, and vitality.<\/p>"
    },
    {
        "title": "Prince",
        "desc": "<p>To dream that you are a prince suggests that you are feeling important and needed. You may be admiring your own accomplishments.<\/p><p>To see a prince in your dream signifies your association with honor and prestige. You will be recognized for some task. Alternatively, it indicates your desires for romance. Perhaps you are waiting for your Prince Charming.<\/p>"
    },
    {
        "title": "Princess",
        "desc": "<p>To dream that you are a princess indicates that you are realizing your full potential. However, there is still more growing that you need to do. It is also a symbol of youth and mental development. Alternatively, the dream may mean that that you are too demanding. Or that you are too use to getting your own way. Perhaps you are acting like a spoiled brat.<\/p><p>To see a princess in your dream represents the object of your affections or desires.<\/p><p>If you are male and dream of a princess, then it represents your sister or an important female figure in your life. Perhaps you feel you feel that you have come to save the day. It also suggests your desires for the ideal woman.<\/p>"
    },
    {
        "title": "Princess Diana",
        "desc": "<p>To see Princess Diana in your dream indicates that you need to be more compassionate or giving. Alternatively, the image of Princess Diana may signify a loveless relationship and your search for true love.<\/p>"
    },
    {
        "title": "Principal",
        "desc": "<p>To see the principal or dream that you are in the principal's office indicates feelings of guilt. You are expressing some anxiety over your actions and the fear that you will be exposed. Alternatively, it represents inferiority or low self esteem.<\/p><p>To dream that you are a principalsymbolizes your leadership skills and your ability to shape the minds of others. Alternatively, the dream may be a pun on your own personal principles.<\/p>"
    },
    {
        "title": "Print",
        "desc": "<p>To dream that you are printing something indicates that you are about to reveal something that you had previously kept to yourself.<\/p>"
    },
    {
        "title": "Printer",
        "desc": "<p>To see a printer in your dream suggests that you are trying to express a thought or idea in a way that others can understand.<\/p><p>To dream that the printer is not functioning indicates your difficulties and frustrations in communicating your thoughts across.<\/p>"
    },
    {
        "title": "Printing Press",
        "desc": "<p>To see a printing press in your dream represents communication. Alternatively, the dream suggests that you have not learned from your past life lessons or previous mistakes. You need to take in what you learned from the past and incorporate it into your present life.<\/p>"
    },
    {
        "title": "Prism",
        "desc": "<p>To see a prism in your dream represents your connection to your spirituality. You need to be more in tune with your spiritual side. Alternatively, the dream symbolizes the multiple aspects of a problem and the various angles of looking at the problem. You need to approach some issue from a new direction.<\/p>"
    },
    {
        "title": "Prison",
        "desc": "<p>To dream that you are in prison indicates that you are being censored in some area of your life. You feel that your creativity is being limited and that you are not allowed to express yourself.<\/p><p>To see someone else in prison in your dream signifies an aspect of yourself that you are unable to express freely.<\/p><p>To dream that you or someone is released from prison means that you need to make some major changes in your waking life. Eventually, you will overcome your obstacles<\/p><p>*Please also see: <a href=\"#jail\">Jail<\/a>.<\/p>"
    },
    {
        "title": "Prisoner",
        "desc": "<p>*Please See: <a href=\"#Convict\">Convict<\/a>.<\/p>"
    },
    {
        "title": "Privacy",
        "desc": "<p>To dream that you have no privacy suggests that you are feeling exposed and unprotected. Perhaps there is something that are you trying to hide. To dream that you have privacy indicates that you are repressing your emotions and not allowing them to be fully expressed. You are worried that others will see the real you and criticize you.<\/p>"
    },
    {
        "title": "Private School",
        "desc": "<p>If you go to private school in real life, then the dream may just be a reflection of your current surroundings. If you do not go to private school and dream that you are, then it denotes that some privileged information or knowledge is about to be revealed to you. You are about to learn a valuable life lesson.<\/p>"
    },
    {
        "title": "Prize",
        "desc": "<p>To dream that you receive a prize represents your accomplishments. You have made significant progress in personal goals.<\/p>"
    },
    {
        "title": "Pro Shop",
        "desc": "<p>To see or dream that you are in a pro shop indicates that you do not have all the necessary tools needed for success or needed to accomplish your goals.<\/p>"
    },
    {
        "title": "Probation",
        "desc": "<p>To dream that you are on probation suggests that you need to stop putting things off and start confronting the problem at hand. You have had enough time to reflect on your past mistakes. It is time to make amends.<\/p>"
    },
    {
        "title": "Procession",
        "desc": "<p>To see a procession in your dream suggests that you are ready to stand up for your beliefs. Alternatively, it signifies the constancy of your love.<\/p>"
    },
    {
        "title": "Profanity",
        "desc": "<p>*Please See: <a href=\"#Swearing\">Swearing<\/a>.<\/p>"
    },
    {
        "title": "Professor",
        "desc": "<p>To see a professor in your dream symbolizes higher learning and wisdom. You will have prominence in some field.<\/p>"
    },
    {
        "title": "Profits",
        "desc": "<p>Todream that you are making a profit signifies your business aspirations and professional goals. The dream also implies that you or someone is taking advantage of a situation in a negative way.<\/p>"
    },
    {
        "title": "Programming",
        "desc": "<p>To dream about computer programming represents your mindset. The dream warns that you are doing things by rote. You are not thinking through what you are doing. Alternatively, the dream indicates a lack of autonomy over the direction of your own life.<\/p>"
    },
    {
        "title": "Projector",
        "desc": "<p>To see or use an overhead projector in your dream suggests that you need to &quot;project&quot; yourself. You need to make your presence known and your voice heard.<\/p>"
    },
    {
        "title": "Prom",
        "desc": "<p>To dream that you are at a prom signals an end to something and the beginning of something else. It refers to cycles and the passage of time. Alternatively, the dream may just be about your anticipation of your own upcoming prom in real life.<\/p>"
    },
    {
        "title": "Promise",
        "desc": "<p>To dream that you make a promise symbolizes your waking life commitments. Perhaps you have concerns about being able to keep your word.<\/p>"
    },
    {
        "title": "Promissory Note",
        "desc": "<p>To see a promissory note in your dream indicates that you need to allow yourself more freedom to do something. Don't be so hard or strict on yourself.<\/p>"
    },
    {
        "title": "Promotion",
        "desc": "<p>To dream that you are getting a promotion at work signifies an increase in your level of self confidence. You are feeling good about yourself.<\/p>"
    },
    {
        "title": "Propane Tank",
        "desc": "<p>To see a propane tank in your dream suggests that you are under some sort of pressure or stress. If the propane tank is empty, then it means that you have overcome the stress in your life.<\/p>"
    },
    {
        "title": "Propeller",
        "desc": "<p>To see a propeller in your dream represents forward movement and progress. It may also symbolize a spiritual journey.<\/p>"
    },
    {
        "title": "Property",
        "desc": "<p>To dream that you are buying property represents your standing in life. You are expressing concern about the future. Alternatively, buying property in your dream signifies intellect, stability and status.<\/p><p>To dream that you lose your property suggests that you have lost your sense of security. You are on instable ground.<\/p><p>These interpretations are property of dm inc.<\/p>"
    },
    {
        "title": "Prophet",
        "desc": "<p>To see a prophet in your dream indicates knowledge, wisdom, and your need for guidance. The dream also highlights your fears and anxieties about the future. You want to know the unknown.<\/p>"
    },
    {
        "title": "Proposal",
        "desc": "<p>To dream that you are being proposed to indicates that you are merging a previously unknown aspect of yourself More directly, the dream may mean that you are thinking about marriage or some serious long-term commitment\/project\/situation. Are you thinking about proposing to someone? Your reaction to the proposal indicates your true feelings about marriage or commitment.<\/p>"
    },
    {
        "title": "Prosecution",
        "desc": "<p>To dream that you are being prosecuted suggests that you are feeling guilty about something in your waking life. Alternatively, the dream means that you need to be more accepting of yourself and less judgmental of others. Perhaps, you are too harsh on yourself or on others.<\/p>"
    },
    {
        "title": "Prostate Exam",
        "desc": "<p>To dream that you are getting a prostate exam refers to some unpleasant, but necessary task that you need to go through in your life. You may not enjoy the experience, but it is for your own good. Alternatively, a prostate exam indicates that you are uptight about something. A more direct interpretation of this dream may be that you are nervous about an upcoming prostate exam.<\/p>"
    },
    {
        "title": "Prosthesis",
        "desc": "<p>To dream that you have a prosthesis indicates that you are exploring a new perspective in life. You are reaching out in a different and profound way. Consider also where on the body the prosthesis is fitted as that body part may offer additional significance. If you have a prosthetic arm, then it means that you are exploring a completely new way of doing something. If you have a prosthetic leg, then it means that you are headed toward a new journey.<\/p>"
    },
    {
        "title": "Prostitute",
        "desc": "<p>To dream that you are a prostitute indicates your desires for more sexual freedom\/expression and sexual power. You want to be less inhibited and explore other areas of sexuality. Perhaps your waking ideology about sex is too rigid. On a negative side, to dream that you are a prostitute suggests that you are harboring feelings of guilt toward a relationship. You are having difficulties integrating love and sexuality. Alternatively, the dream may be a metaphor suggesting that you are &quot;prostituting&quot; yourself in some situation, either emotionally or morally. Are you selling yourself in some way?<\/p><p>To see or dream that you are with a prostitute suggests that you are feeling sexually deprived or needy. Alternatively, the dream is commenting on how you wished that sexual relationships were more simple and straightforward.<\/p>"
    },
    {
        "title": "Protection",
        "desc": "<p>To dream that you are being protected or need protection indicates that you are feeling helpless in some situation. Life's difficulties has made you dependable on others. You need to start taking charge of the situation.<\/p><p>To dream that you are protecting someone or something suggests that you are putting up an emotional wall or barrier between you and others around you. Consider who or what you are protecting for clues as to what aspect of your own self you are afraid of letting out and letting others know.<\/p>"
    },
    {
        "title": "Protest",
        "desc": "<p>To dream that you are at a protestindicates that you need to speak up for yourself and for your rights. Pay attention to the details of your dream as you may be ignoring or overlooking some important issue in your life. It is time to take action.<\/p>"
    },
    {
        "title": "Protractor",
        "desc": "<p>To see or use a protractor in your dream implies that you are trying to look at things from someone else's angle. You want to put yourself in their place so you can better relate to what they are going through or experiencing. Alternatively, the dream may be a pun; you are looking for a time extension on something.<\/p>"
    },
    {
        "title": "Prowler",
        "desc": "<p>*Please see: <a href=\"#Intruder\">Intruder<\/a>.<\/p>"
    },
    {
        "title": "Prune",
        "desc": "<p>To dream that you are pruning represents growth. You need to get rid and cut away at your old habits and former ways in order to move forward. Get rid of what you no longer need.<\/p>"
    },
    {
        "title": "Prunes",
        "desc": "<p>To see prunes in your dream symbolize an emotional or creative blockage. It may also imply old age as suggested by the metaphor &quot;as wrinkled as a prune&quot;.<\/p>"
    },
    {
        "title": "Prybar",
        "desc": "<p>*Please See: <a href=\"#Crowbar\">Crowbar<\/a>.<\/p>"
    },
    {
        "title": "Psychic",
        "desc": "<p>To see a psychic in your dream represents your desires to know the unknown. You are experiencing anxieties about the future and in achieving your goals. Additionally, you may feel a lack of control in the path that your life is taking.<\/p><p>To dream that you are psychic represents your intuition and the sensitive side of your personality.<\/p>"
    },
    {
        "title": "Psychokinesis",
        "desc": "<p>To dream that you have psychokinesis indicates how you manipulate your surroundings. You are being over controlling.<\/p>"
    },
    {
        "title": "Psychologist",
        "desc": "<p>To see or dream that you are a psychologist symbolizes the intellectual and mental aspect of yourself. Perhaps you to be more understanding about a situation or event. Don't be so hard on yourself.<\/p>"
    },
    {
        "title": "Psychopath",
        "desc": "<p>To see a psychopath in your dream suggests that you are being deceived or manipulated. It may also mean that you are feeling detached.<\/p><p>To dream that you are a psychopath implies that you are feeling larger than life. The dream is a warning that your ego is getting out of control.<\/p>"
    },
    {
        "title": "Pterodactyl",
        "desc": "<p>To see a pterodactyl in your dream implies that your sexual desires are reaching new heights. Alternatively, the dream refers to a conflict between your primal urges and your rational mind.<\/p>"
    },
    {
        "title": "Pub",
        "desc": "<p>To dream that you are in a pub represents your social interactions and how you relate to others. Sometimes you need to relax and let loose sometimes.<\/p>"
    },
    {
        "title": "Pubic Hair",
        "desc": "<p>To see pubic hair in your dream suggests that you are coyly making your sexual feelings known.<\/p>"
    },
    {
        "title": "Public Speaking",
        "desc": "<p>To dream that you are speaking in public indicates that you need to vocalize your feelings and thoughts. You need to communicate something important and\/or urgent. Alternatively, the dream may highlight your fear and nervousness of speaking in public, especially if you have an upcoming speech to give. Consider the demeanor and behavior of the audience. Perhaps you are afraid of being scrutinized for your actions or being judged by others. It is also a form of an anxiety dream where you are feeling exposed or put on the spot.<\/p><p>To dream that there is no one listening to your speech suggests that you are not being acknowledged for your work or achievement. Perhaps you are feeling ignored or neglected.<\/p><p>To hear someone speaking in public in your dream suggests that your inner feelings are being made known to those around you. Consider what is said in the speech. If you hear a politician give a speech, then it represents egotism or deceit.<\/p>"
    },
    {
        "title": "Pudding",
        "desc": "<p>To see or eat pudding in your dream indicates that you are feeling slow and lethargic in your waking life. You need to be more active. Alternatively, the dream may be telling you that &quot;the proof is in the pudding.&quot; You need to learn to question everything. Don't believe everything until you have seen it or experienced it yourself.<\/p>"
    },
    {
        "title": "Puddle",
        "desc": "<p>To see a puddle in your dream represents feelings that have been downplayed and overlooked. Although these feelings may appear minor, it is worthwhile to address them before it erupts unexpectedly.<\/p>"
    },
    {
        "title": "Puffer Fish",
        "desc": "<p>To see a puffer fish in your dream signifies suppressed or unexpressed anger. You are holding something in that is on the verge of erupting at any moment. Alternatively, the dream indicates that others tend to underestimate your abilities or misjudge you.<\/p>"
    },
    {
        "title": "Puffin",
        "desc": "<p>To see a puffin in your dream refers to your ability to dig into your subconscious and learn from it. You are looking within yourself for answers. It is a time for exploration, self-reflection and introspection. Perhaps you need to get to the bottom of some situation. Alternatively, a puffin may be a pun and imply your smoking habit. Or it may suggest that you are experiencing some anxiety, tension, or fear concerning a new situation in your waking life.<\/p>"
    },
    {
        "title": "Pug",
        "desc": "<p>To see a pug in your dream highlights your playful and strong character. It may also mean that you are open and receptive to new changes.<\/p>"
    },
    {
        "title": "Pull Ups",
        "desc": "<p>To do pull ups in your dream means that you will rise above a difficult situation through your own willpower and perseverance. Alternatively, the dream suggests that you need to literally pick yourself up and move on from the past. You need to look to the future.<\/p>"
    },
    {
        "title": "Pulling",
        "desc": "<p>To dream that you are pulling something refers to your burdens and struggles. You have difficulties accomplishing your tasks and goals. You need to unload and\/or let go some of your responsibilities. Perhaps it is a relationship that you need to let go of. Consider also what or who you are pulling. Alternatively, the dream may be a pun on your &quot;pull&quot; or influence for some favor or decision.<\/p>"
    },
    {
        "title": "Pulse",
        "desc": "<p>To feel your pulse in your dream symbolizes some sort of anxiety in your waking life.<\/p><p>To dream that you are feeling someone else's pulse suggests that you are trying to connect with an aspect of that person. Perhaps you are trying to incorporate that aspect into your own self.<\/p>"
    },
    {
        "title": "Puke",
        "desc": "<p>*Please See: <a href=\"#Vomiting\">Vomiting<\/a>.<\/p>"
    },
    {
        "title": "Puma",
        "desc": "<p>To see a puma in your dream symbolizes lurking danger, aggression, raw emotions or sometimes death. You need to keep your attitude and emotions in check. Alternatively, the puma represents power, confidence, beauty and\/or grace.<\/p>"
    },
    {
        "title": "Pump",
        "desc": "<p>To see a pump in your dream symbolizes untapped energy or health issues. Alternatively, it may be analogous to the heart and issues of the heart. If the pump is not working, then it signifies setbacks. Some aspects of your life is deviating from the norm.<\/p>"
    },
    {
        "title": "Pumpjack",
        "desc": "<p>To see a pumpjack in your dream implies that you are mindlessly agreeing to things and going along with everything without questioning it. Alternatively, the dream may be telling you to say &quot;yes&quot; to some question you have been asking yourself.<\/p>"
    },
    {
        "title": "Pumpkin",
        "desc": "<p>To see a pumpkin in your dream implies your openness and your receptiveness to new ideas and experiences. A pumpkin is also symbolic of female sexuality. Alternatively, the dream may relate to the popular fairy tale of Cinderella where a carriage turns back into a pumpkin. In this regard, a pumpkin may represent some situation in which time is running out.<\/p>"
    },
    {
        "title": "Punch",
        "desc": "<p>To dream that you are punching someone or something represents hidden anger and aggression. It may also be a symbol of power and your ability to draw strength from within yourself. If someone is punching you, then the dream is highlighting your helplessness and powerlessness in some waking situation. It also implies that someone is forcing their views on you. In particular, to dream that you are punched in the stomach indicates that you are experiencing some sort of emotional void.<\/p><p>To dream that you are unable to throw a punch indicates that you are feeling helpless. You may have self-esteem and confidence issues. The dream may also be due to REM paralysis.<\/p><p>To dream that you are drinking punch represents vitality and renewal.<\/p>"
    },
    {
        "title": "Punching Bag",
        "desc": "<p>To see or hit a punching bag in your dream represents your pent up anger and hidden aggression. You are looking for a safe outlet to express your frustrations. Consider who or what the punch bag symbolizes. Alternatively, the dream may mean that you are feeling like a punching bag. It denotes self-punishment and self-blame.<\/p>"
    },
    {
        "title": "Punishment",
        "desc": "<p>To dream that you are punished signifies guilt or shame about your actions. You need to learn to forgive yourself. Are you punishing yourself?<\/p><p>To dream that you are punishing others signifies hidden resentment towards that person. Alternatively, they may represent aspects of your own personality that you fear or that you are trying to repress.<\/p>"
    },
    {
        "title": "Punk",
        "desc": "<p>To see or dream that you are a punk indicates rebellion. You are going against the norm and are expressing your own personal choice and freedom.<\/p>"
    },
    {
        "title": "Pupil",
        "desc": "<p>To dream that your pupils are red symbolize energy, power, and vigor. Negatively, it also suggests that some negative or evil force has taken over you. A switch has been turned on inside you where you are not acting like yourself.<\/p>"
    },
    {
        "title": "Puppet",
        "desc": "<p>To see a puppet in your dream suggests that you are easily swayed by others and are allowing them to control you. You feel you can not stand up for yourself.<\/p>"
    },
    {
        "title": "Puppeteer",
        "desc": "<p>To dream that you are a puppeteer refers to your tendency to control or manipulate someone or some situation.<\/p>"
    },
    {
        "title": "Puppy",
        "desc": "<p>To see a puppy in your dream symbolizes your playfulness and carefree nature. It also refers to a blossoming friendship. If you are taking care of a puppy, then it means that you are reliable and trustworthy. Others can depend on you, especially during difficult times.<\/p><p>To see a litter of newborn puppies in your dream is indicative of the amount of time that an idea has been developing or will take to develop. Look to the number of puppies to give you that approximate amount of time.<\/p><p>To dream that you are saving a puppy means that you are looking to recapture a more playful or carefree side of your persona.<\/p>"
    },
    {
        "title": "Purchasing",
        "desc": "<p>*Please See: <a href=\"#Buying\">Buying<\/a><\/p>"
    },
    {
        "title": "Purr",
        "desc": "<p>To hear a purr in your dream signifies satisfaction, contentment and comfort in your life. Things are going well for you. The dream may also be a pun on being &quot;pure&quot;.<\/p>"
    },
    {
        "title": "Purse",
        "desc": "<p>To see or carry a purse in your dream represents secrets, desires and thoughts which are being closely held and guarded. It symbolizes your identity and sense of self. Consider also the condition of the purse for indications of your state of mind and feelings. Alternatively, a purse symbolizes the female genitalia and the womb.<\/p><p>To dream that you lost your purse denotes loss of power and control. You may have lost touch with your real identity. To dream that you lost your purse, but find the contents inside means that what is inside is what matters most and what is important. You need to look past the exterior and focus on the inside. If you find a purse, then it represents a renewed sense of self.<\/p><p>To see an empty purse represents feelings of insecurity or vulnerability.<\/p><p>To dream that someone gives your a new purse implies that some fortune or good luck will come your way. Alternatively, a new purse is analogous to a new start. It is time to reinvent yourself and get a fresh outlook in life.<\/p>"
    },
    {
        "title": "Pursuit",
        "desc": "<p>To dream that someone or something is in pursuit of you indicates that you are refusing to acknowledge a certain viewpoint or idea.<\/p><p>To dream that you are in pursuit of someone or something suggests that you are being denied of your power and influence. You need to re-evaluate your strengths and concentrate your efforts in something more worthwhile.<\/p><p>*Please also see Dream Moods's: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/chase-dreams.html\">Common Dreams: Chase<\/a><\/p>"
    },
    {
        "title": "Pus",
        "desc": "<p>To see pus in your dream suggests that you need to express some aspect of your feeling. You may be harboring some prejudices, attitudes, or some other negative emotion that attempting to be released. You need to acknowledge these feelings and deal with them. Also consider the symbolism of where on the body the pus is located.<\/p>"
    },
    {
        "title": "Push",
        "desc": "<p>To dream that you are pushing something symbolizes energy, effort, encouragement and motivation. You have a new drive to succeed in life. Consider also how you or someone in your life may be a &quot;pushover&quot;.<\/p><p>To dream that you are pushed or being pushed suggests that you are being coerced into doing something. You are facing a lot of pressure. Alternatively, the dream implies that you do not have enough time to complete a task. You strive for perfection.<\/p>"
    },
    {
        "title": "Push Ups",
        "desc": "<p>To do push ups in your dream indicates that you need to take more initiative and get these accomplished. It is time to utilize your potential and be more assertive. In particular, if you are doing one-handed push ups, then it means that you need to better exert yourself.<\/p>"
    },
    {
        "title": "Pushpins",
        "desc": "<p>To see or use pushpins in your dream indicate that you need to open your eyes and look at what is in front on you. You may be overlooking something that is in plain view.<\/p>"
    },
    {
        "title": "Putty",
        "desc": "<p>To dream that you are handling putty represents some situation, person, or relationship that you are still molding and forming. Also consider the phrase &quot;like putty in your hands&quot; to mean how you or someone is being easily influenced.<\/p>"
    },
    {
        "title": "Puzzle",
        "desc": "<p>To see or do a jigsaw puzzle in your dream represents a mental challenge or problem that you need to solve in your waking life. If there are pieces missing in the puzzle, then it suggest that you do not have all the facts needed to make an informed decision.<\/p><p>To see or do a crossword puzzle in your dream suggests that you are being faced with a mental challenge. The dream may be a pun on &quot;cross words&quot; directed at you or aimed toward someone.<\/p>"
    },
    {
        "title": "Pyramid",
        "desc": "<p>To see a pyramid in your dream symbolizes longevity and stability. You have built a solid foundation for success. Alternatively, the dream suggests that major changes will occur over a short period of time.<\/p><p>To dream that you are climbing a pyramid indicates that you will find gratification and fulfillment through perseverance.<\/p>"
    },
    {
        "title": "Pyrite",
        "desc": "<p>To see pyrite in your dream indicates that something is too good to be true. Remember that things are not always what it seems.<\/p>"
    },
    {
        "title": "Python",
        "desc": "<p>To see a python in your dream represents lurking danger, sin, lacking freedom and overt sexuality. The symbol may also parallel a waking relationship where you are feeling constricted and confined. Alternatively, a python may signify your determination.<\/p><p>To see a python kill its prey suggests that you are feeling emotionally stressed and anxious. You are being suffocated in some area of your life.<\/p><p>*Please see also: <a href=\"#Snake\">Snake<\/a>.<\/p>"
    }
]