[
    {
        "title": "Q",
        "desc": "<p>To see the letter Q in your dream is a pun on &quot;cue&quot;. You are waiting for a sign to make the next move.<\/p>"
    },
    {
        "title": "Quack",
        "desc": "<p>To hear a quack in your dream refers to an unoriginal idea. Someone may be trying to pass off an idea as their own. Alternatively, to hear quacking symbolizes imitation.<\/p>"
    },
    {
        "title": "Quack Doctor",
        "desc": "<p>To see or meet with a quack doctor in your dream means that you need to be more cautious of people who claim to be something that they are not.Someone in your waking life may be falsely building themselves up.<\/p>"
    },
    {
        "title": "Quack Medicine",
        "desc": "<p>To dream of taking quack medicine indicates that you are taking the wrong course of action. You are approaching your problem all wrong.<\/p>"
    },
    {
        "title": "Quadrille",
        "desc": "<p>To dream that you are dancing a quadrille refers to your lack of commitment in a relationship. You don't want to be tied down.<\/p>"
    },
    {
        "title": "Quadruplets",
        "desc": "<p>To see quadruplets in your dream represent wholeness. You are close to becoming who you really want to be. You will enjoy calmness and peace after a period of much chaos and problems.<\/p>"
    },
    {
        "title": "Quagmire",
        "desc": "<p>To see yourself bogged down in a quagmire refers to your inability to meet your obligations and fulfill your goals. You are literally stuck in a rut.<\/p>"
    },
    {
        "title": "Quail",
        "desc": "<p>To see a quail in your dream symbolizes lust, love and eroticism. The dream also suggest that you will overcome your obstacles and hardships. You will be victorious despite the negativity surrounding you in your life.<\/p>"
    },
    {
        "title": "Quake",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/e.htm#earthquake\">Earthquake.<\/p>"
    },
    {
        "title": "Quaker",
        "desc": "<p>To see a Quaker in your dream symbolizes your convictions and spiritual beliefs. It also represents peace and serenity.<\/p><p>To dream that you are a Quaker suggests that you are seeking some solace. It is time for introspection. In addition, you need to be more self-sufficient.<\/p>"
    },
    {
        "title": "Quarantine",
        "desc": "<p>To dream that you are placed in quarantine suggests that you need to distance yourself from others or from a situation. You need to alter your actions before you or someone gets hurt.<\/p><p>To dream that someone or something is in quarantine indicates that someone is in desperate need of your help but is afraid to ask.<\/p>"
    },
    {
        "title": "Quarrel",
        "desc": "<p>To dream that you are quarreling with someone refers to some hidden negativity that you have toward someone in your waking life. You are having difficulties expressing your negative feelings and thus the dream is trying to draw those feelings out. You need to express them in order to resolve the internal conflict. Alternatively, the dream suggests some turmoil that is bothering you inside. You are under extreme tension and stress.<\/p><p>To overhear quarreling in your dream denotes dissatisfaction with some waking situation.<\/p>"
    },
    {
        "title": "Quarry",
        "desc": "<p>To see a quarry in your dream indicates thatyou have dug yourself into an emotional hole. Perhaps a relationship has just ended and you are trying to fill a void.<\/p>"
    },
    {
        "title": "Quarter",
        "desc": "<p>To see or find a quarter in your dream signifies incompleteness. You are not feeling whole.<\/p>"
    },
    {
        "title": "Quartet",
        "desc": "<p>To dream that you are in a quartet represents practicality. It also indicates that you are seeking out support and partnerships to work together in a harmonious way.<\/p><p>To see a quartet that you cannot join signifies your attempt to do a job that is beyond your capacity.<\/p>"
    },
    {
        "title": "Quartz",
        "desc": "<p>To see quartz in your dream represents rigidity. You have an unyielding personality. Alternatively, quartz symbolizes the union of feminine and masculine energies.It may signal wholeness.<\/p>"
    },
    {
        "title": "Quay",
        "desc": "<p>To see many ships docked at the quay signifies fulfillment of your wishes.<\/p><p>To dream that you are on a quay suggests that you are moving forward into a new phase of your life.<\/p>"
    },
    {
        "title": "Queen",
        "desc": "<p>To see a queen in your dream symbolizes intuition, personal growth, power and influence. The queen is also a symbol for your mother.<\/p><p>For a woman to dream that she is a queen indicates a desire for increased status and power. Alternatively, it may indicate that you need to listen to others. The queen may also be a metaphor for a homosexual man.<\/p>"
    },
    {
        "title": "Queen of Hearts",
        "desc": "<p>To see the queen of hearts in your dream represents your pompous and arrogant attitude.<\/p>"
    },
    {
        "title": "Quest",
        "desc": "<p>To dream that you are on a quest represents your life path and your life goals. You will encounter obstacles, questions, and difficulties, but it is necessary for growth and progress.<\/p>"
    },
    {
        "title": "Question",
        "desc": "<p>To question something in your dream signifies self doubt. The ability to question things in your dream may also lead to higher knowledge and spiritual enlightenment.<\/p><p>To dream that someone is asking you a question suggests that you have information or knowledge that needs to be shared.<\/p>"
    },
    {
        "title": "Queue",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/l2.htm#Line\">Line.<\/p>"
    },
    {
        "title": "Quicksand",
        "desc": "<p>To dream that you are sinking in quicksand indicates feelings of insecurity. You have misjudged the solid foundation that you are on. Perhaps you have mistakenly gotten too comfortable in some situation. You need to pay attention to what you are doing and where you are going.Alternatively, the dream is analogous to regressing into your subconscious.<\/p>"
    },
    {
        "title": "Quicksilver",
        "desc": "<p>To see quicksilver in your dream symbolizes rapid and swift movement. It also represents your quick and unpredictable temper.<\/p>"
    },
    {
        "title": "Quiet",
        "desc": "<p>To dream that it is particularly quiet indicates that you need to stop and reflect upon life. It is time for introspection and solace. You need some quiet time in order to restore some sanity and spiritual balance.<\/p>"
    },
    {
        "title": "Quill",
        "desc": "<p>To see or write with a quill in your dream denotes success, social status, sophistication and prestige. The dream may also mean that you need to be careful in what you write, as words can be a powerful tool. According to Freudian thought, quills are symbolic of the penis.<\/p><p>To dream that you are putting a quill in your hat represents your flirty tendencies.<\/p>"
    },
    {
        "title": "Quilts",
        "desc": "<p>To see a quilt in your dream signifies harmony, protection, warmth, and pleasant and comfortable circumstances. The dream may be a metaphor for various components in your life that help to make up the overall scenario or big picture. Consider the color and pattern of the quilt for additional significance.<\/p><p>To see a soiled quilt in your dream signifies carelessness in dress and manner.<\/p>"
    },
    {
        "title": "Quinine",
        "desc": "<p>To take quinine in your dream suggests that you need to relax. A situation is making you too tense. Alternatively, the dream means that you are feeling reenergized.<\/p>"
    },
    {
        "title": "Quiver",
        "desc": "<p>To see a quiver in your dream suggests that you need to better focus on your goals. Alternatively, the dream may be a metaphor that you are nervous about something.<\/p>"
    },
    {
        "title": "Quinsy",
        "desc": "<p>To dream that you or someone is afflicted with quinsy means that you are not able to full express yourself and verbalize your feelings. You are feeling stifled by some circumstance.<\/p>"
    },
    {
        "title": "Quintuplets",
        "desc": "<p>To see quintuplets in your dream represent the five senses: sight, smell, taste, hearing, and touch. It may also symbolize the essential and fundamental human being. Alternatively, quintuplets represent the connection between the female and the male.<\/p>"
    },
    {
        "title": "Quiver",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s2.htm#Shiver\">Shiver.<\/p>"
    },
    {
        "title": "Quiz",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/e2.htm#Exam\">Exam.<\/p>"
    },
    {
        "title": "Quota",
        "desc": "<p>To dream about meeting a quota suggests that you are feeling overwhelmed by the demands that others are putting on you. You fear that you will not meet other's expectations.<\/p>"
    },
    {
        "title": "Quote",
        "desc": "<p>To give a price quote in a dream symbolizes the value you are assigning to your talents and abilities.<\/p><p>To quote somebody in a dream suggests that you need to listen and heed the message in that quote.The quote may be a message from your subconscious.<\/p>"
    },
    {
        "title": "Quoits",
        "desc": "<p>To play quoits in your dream suggests that you need to set your sights on your target and focus on your goals. Alternatively, the dream may be analogous to sexual conquest.<\/p>"
    }
]