[
    {
        "title": "R",
        "desc": "<p>To see the letter &quot;R&quot; in your dream suggests that you are in need of some &quot;R &amp; R&quot; or some rest and relaxation.<\/p>"
    },
    {
        "title": "Rabbi",
        "desc": "<p>To see a rabbi in your dream represents your attitudes about Judaism. The dream may serve to reaffirm your faith and beliefs.<\/p>"
    },
    {
        "title": "Rabbit",
        "desc": "<p>To see a rabbit in your dream signifies luck, magical power, and success. You have a positive outlook on life. Alternatively, rabbits symbolize abundance, warmth, fertility and sexual activity. Perhaps your sex life needs to be kept in check. The dream can also beassociated with Easter time and your own personal memories of Easter.<p>In particular, to seea white rabbit in your dream symbolizes faithfulness in love. The white rabbit also serves as a guide to steer you toward the right direction. To see a black rabbit in your dream refers to fear of intimacy.<\/p><p>If the rabbit is hopping in your dream, then it indicates fertility. You will be surrounded by children. Alternatively, the dream may be analogous to your lack of commitment and how you jump from one thing or another.<\/p><p>If you dream that the rabbit scratches or bites you, then it means that you need to pay more attention to your personal relationship or love life. If the bunny bites your toes, then it implies that this relationship is headed down the wrong direction.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=dogdream1\">The Bunny Dog&quot;, &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=rabbitdream1\">Black Rabbit&quot;, &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=abortiondream1\">Boiling A Rabbit&quot; &amp; &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=rabbitdream2\">Turned Into A Bunny&quot;<\/p>"
    },
    {
        "title": "Rabbit's Foot",
        "desc": "<p>To see or wear a rabbit's foot in your dream symbolizes good luck. You are relying too much on fate and need to start taking control of your life.<\/p>"
    },
    {
        "title": "Rabies",
        "desc": "<p>To dream that you have rabies represents unexpressed hostility which may erupt in violence if not expressed in a controlled manner.<\/p>"
    },
    {
        "title": "Raccoon",
        "desc": "<p>To see a raccoon in your dream signifies deceit and thievery. You are not being completely honest in some situation. Alternatively, the dream suggests that you are hiding something. You are keeping a secret.<\/p>"
    },
    {
        "title": "Race",
        "desc": "<p>To dream that you are in a race represents your competitive spirit and how you tend to measure yourself against others. Alternatively, this dream may mean that you need to slow down and take a different course in life.<\/p><p>If you dream that you win a race, then it represents your full potential and your ability to achieve your goals. You are feeling empowered and able to overcome your obstacles and those who stand in your way.The dream gives you confidence and may be a &quot;rehearsal&quot; for your success.<\/p><p>If you dream you lose the race, then it indicates that you may be overextending yourself. You are setting your goals too high.<\/p><p>Dreaming of a dog race indicates that you are looking out for your own self and your own needs. You are motivated by personal gains over community goals.<\/p>"
    },
    {
        "title": "Race Car",
        "desc": "<p>To see a race car in your dream symbolizes your hard driving and headstrong attitudes. It may also reflect your competitive nature and the need to win. Alternatively, the race may be a pun for your issues with &quot;race&quot; and ethnicity.<\/p><p>To dream that you are driving a race car represents your fast paced lifestyle. You may be jeopardizing your health with your reckless behavior.<\/p>"
    },
    {
        "title": "Racetrack",
        "desc": "<p>To see a racetrack in your dream represents life in the fast lane for you. The tracks may be a metaphor for your quest to get ahead in life. Alternatively, the dream means that you are going in circles. Or that you have a set path of thinking and doing things and are unwilling to deviate from it.<\/p>"
    },
    {
        "title": "Racism",
        "desc": "<p>To experience racism in your dream indicates that you may be too judgmental and discriminatory in some situation in your waking life. Perhaps you have falsely pre-judged someone because of the way he or she appeared.<\/p><p>To dream that youare racist indicates your unwillingness and refusal to be cast aside. You refuse to be dismissed.<\/p><p>If you believe in racism, then the dream is a reflection of your waking ideologies and beliefs.<\/p>"
    },
    {
        "title": "Rack",
        "desc": "<p>To see an empty rack in your dream signifies your preoccupation with a problem that has given you much anxiety. Perhaps, you are &quot;racking&quot; your brain for an answer to a problem.<\/p><p>To see a rack of clothes in your dream represents your indecisiveness and self doubt. You have a lot of lingering uncertainty.<\/p><p>To dream that you are being racked indicates that you and your actions are being called into question.<\/p>"
    },
    {
        "title": "Racket",
        "desc": "<p>To hear a racket in your dream suggests that your subconscious is desperately trying to get your attention about some matter.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/n2.htm#Noise\">Noise.<\/p>"
    },
    {
        "title": "Racquet",
        "desc": "<p>To see or use a racquet in your dream symbolizes your defense mechanisms. There is an issue that you are unwilling to address.<\/p>"
    },
    {
        "title": "Radar",
        "desc": "<p>To see or use a radar in your dream symbolizes your insight and intuition. The dream may be highlighting a message from your subconscious.<\/p>"
    },
    {
        "title": "Radiant",
        "desc": "<p>To see something radiant in your dream indicates purity, intellectual stimulation, spiritual enlightenment and wisdom.<\/p>"
    },
    {
        "title": "Radiation",
        "desc": "<p>To dream that you are exposed to radiation indicates that you are surrounded by a lot of negativity in your waking life. You are feeling overwhelmed.<\/p>"
    },
    {
        "title": "Radiator",
        "desc": "<p>To see a car radiator in your dream suggests that you need to cool off. You are getting overworked.<\/p>"
    },
    {
        "title": "Radio",
        "desc": "<p>To dream that you are listening to the radio symbolizes your awareness and intuition toward a particular situation. What you hear through the radio also represents messages from your subconscious. It is possible that it is some form of ESP or telepathic communication.<\/p><p>If you dream that the radio is turned off, then it indicates that you have the ability to help in some situation, but you are refusing to do so.<\/p>"
    },
    {
        "title": "Radioactive",
        "desc": "<p>To dream that something is radioactive represents suppressed emotions that are on the verge of spilling over into your conscious and creating a negative influence in your daily life. You need to address these feeling and problems before they do more harm in the long run.<\/p>"
    },
    {
        "title": "Radish",
        "desc": "<p>To see or plant radishes in your garden signify abundance and prosperity.<\/p><p>To dream that you are eating a radish refers to some indiscretion or thoughtlessness. Perhaps the dream may be a pun on something that is &quot;rad-dish&quot; or coolish.<\/p>"
    },
    {
        "title": "Raffle",
        "desc": "<p>To dream that you are raffling an item suggests that you need to be more giving and charitable. Alternatively, the dream is telling you to be more aware of the risks involved in leaving your destiny to fate.<\/p>"
    },
    {
        "title": "Raft",
        "desc": "<p>To see a raft in your dream indicates that you have not built a firm foundation for success. There is still much work ahead.<\/p><p>To dream that you are floating on a raft suggests that you are drifting through life, not knowing where you are headed. You are confused about your purpose and direction in life.<\/p><p>To dream that you are white water rafting means that you are experiencing some turbulent times.<\/p>"
    },
    {
        "title": "Rage",
        "desc": "<p>To dream that you are in rage is symbolic of your bad temper, negative outbursts, and suppressed anger. You need to express your inner strengths and desires.<\/p>"
    },
    {
        "title": "Rags",
        "desc": "<p>To see old, tattered rags in your dream indicate that you are cleaning up old problems and issues.<\/p><p>To dream that you are wearing rags represent anxieties and concerns over your self-image. You are lacking self-esteem.<\/p>"
    },
    {
        "title": "Raid",
        "desc": "<p>To dream that you are in a raid represents your fears that some hidden aspect of your life will be discovered or made public.<\/p>"
    },
    {
        "title": "Railing",
        "desc": "<p>To dream that you are holding on to a railing suggests that you are desperately holding out for a chance to obtain the object of you affection. Alternatively, the dream indicates that you are in need of some support and assistance. Don't be afraid to ask for help.<\/p>"
    },
    {
        "title": "Railroad",
        "desc": "<p>To see a railroad in your dream indicates that you have laid out a set track toward achieving your goals. Your progress will be slow but steady. You are well disciplined and secure in your life. Alternatively, the dream indicates that you may be too linear and rigid in your thinking. Perhaps a situation or relationship in your waking life has become monotonous. Sometimes you need to go off track and explore other possibilities.<\/p><p>To see an obstruction on the railroad refers to the obstacles standing in your way toward your goals. It may also mean that you have lost track of your goals.<\/p><p>To dream that you are walking alongside the railroad tracks signifies completion of your tasks.<\/p><p>To dream that you are crossing railroad tracks indicates that you are going against the path that others have laid out for you. You are doing your own thing and not what others want or expect of you. Alternatively, the dream symbolizes a transitional phase. Consider the phrase of coming\/being from &quot;the wrong side of the tracks.&quot; Perhaps it signifies the progress you have made. Do not forget about your humble beginnings.<\/p>"
    },
    {
        "title": "Railroad CrossingTo see a railroad crossing gate in your dream symbolizes temporary setbacks toward achieving your goals, especially if the gate is going down. If the gate is up, then it means that you have overcome certain obstacles in your life. You are not letting something or someone get in your way of your goals. Rain",
        "desc": "<p>To see and hear rain falling symbolizes forgiveness and grace. Falling rain is also a metaphor for tears, crying and sadness. Alternatively, rain symbolizes fertility and renewal. If you get wet from the rain, then it indicates cleaning from your troubles and problems. In particular, dreaming of acid rain indicates that you have been mislead. You are letting hatred and revenge take over and define you.<\/p><p>To dream that you are watching the rain from a window indicates that spiritual ideas and insights are being brought to your awareness. It may also symbolize fortune and love.<\/p><p>To hear rain tapping on the roof denotes spiritual ideas coming to fruition in your mind.<\/p>"
    },
    {
        "title": "Rainbow",
        "desc": "<p>To see a rainbow in your dream represents hope, success and good fortune in the form of money, prestige, or fame. The rainbow is also seen as a bridge between your earthly, grounded self and the higher, spiritual self. It refers to joy and happiness in your relationship. Alternatively, the rainbow implies that your troubles are almost over. Good will come out of your issues. Just hang in there. In the western culture, the rainbow is a symbol for gay pride.<\/p><p>To see an all white rainbow in your dream signifies heightened spirituality and purity.<\/p><p>To see a rainbow at night or a lunar rainbow in your dream is symbolic of a spiritual or emotional connection within your personal relationship or religious beliefs.<\/p><p>To dream that something is rainbow colored implies that you need to see things in a more positive light. You need to be more optimistic. Also consider the significance of the object.<\/p><p>To dream that you have rainbow colored hair refers to your light-hearted and carefree nature. You are headed in a positive spiritual direction.<\/p>"
    },
    {
        "title": "Raincoat",
        "desc": "<p>To dream that you are wearing a raincoat suggests that you are shielding yourself from your emotions. You are not able to face the nastiness. Alternatively, wearing a raincoat in your dream refers to your pessimistic outlook and unpleasantness.<\/p>"
    },
    {
        "title": "Rainforest",
        "desc": "<p>To dream that you are in a rainforest suggests that you feel your emotions are being undermined and &quot;cut down&quot;. Alternatively, the dream represents your waking concerns about the environment. It may also be a metaphor of the impact that you have on your surroundings.<\/p>"
    },
    {
        "title": "Raisins",
        "desc": "<p>To dream that you are eating raisins represent some negative force that is working against you. The dream may also be a metaphor for something or someone who is old and shriveled.<\/p>"
    },
    {
        "title": "Rake",
        "desc": "<p>To dream that you are using a rake indicates that some task or project will never be accomplished unless you do it yourself. Alternatively, the dream suggests that you need to have better planning and organization in your life. You need to figure out the direction you want to take in life and then carry out that plan.<\/p><p>To see someone raking in your dream denotes that you are effectively taking advantage of some situation.<\/p>"
    },
    {
        "title": "Ram",
        "desc": "<p>To see a ram in your dream signifies aggression, energy, and impulsiveness. You may be pursuing a decision that should be approached with more tact and consideration. A ram also symbolizes strong and powerful friends who will use their influence and authority to your advantage.<\/p><p>To dream that a ram is pursuing you indicates some misfortune or unlucky threat. Perhaps, you feel that something is being &quot;rammed&quot; down your throat or that you feel that you are being rammed by a situation or decision.<\/p>"
    },
    {
        "title": "Rambling",
        "desc": "<p>To dream that you are rambling suggests that you have a lot that you need to get off your mind. You need to express these thoughts and feelings in your waking life or it will continue to haunt you in your dream state.<\/p>"
    },
    {
        "title": "Ramp",
        "desc": "<p>To dream that you are going up a ramp signifies your struggles in achieving a goal. It is symbolic of your determination and ambition. If you fail to go up a ramp, then it suggests that you are not able to overcome your difficulties. There are still obstacles standing on your way.<\/p><p>To dream that you are going down a ramp refers to some instability and lack of control in your life.<\/p>"
    },
    {
        "title": "Ranch",
        "desc": "<p>To dream that you are at a ranch suggests that you need to take stock of your life and ascertain what you hope to achieve and gain. The dream may also refer to your own livelihood and concerns about money.<\/p>"
    },
    {
        "title": "Ransom",
        "desc": "<p>To dream that somebody is demanding ransom from you suggests that you have been deceived.<\/p><p>To demand ransom in your dream means that you are feeling unfairly treated.<\/p>"
    },
    {
        "title": "Rapping",
        "desc": "<p>To hear or dream that you are rapping suggests that you need to better verbalize your thoughts and feelings.<\/p>"
    },
    {
        "title": "Rape",
        "desc": "<p>To dream that you were raped or almost raped indicates vengeful or resentful feelings toward the opposite sex. You feel that you have been violated or that you have been taken advantage of. Something or someone is jeopardizing your self-esteem and emotional well-being. Things are being forced upon you. Dreams of rape are also common for those who were actually raped in their waking life.<\/p><p>To see a rape being committed in your dream denotes sexual dysfunction or uncertainty. In particular, if you witness a gang rape in your dream, then it signifies complete helplessness in a situation. You are lacking the resources or power to do the right thing. It may also mean that you or someone has been humiliated.<\/p><p>If you dream of raping someone, then it represents your need to control others and show them who is in charge. You also have a sense of entitlement.<\/p><p>Dreaming that your young daughter was raped symbolizes your fears as she grows and becomes more independent. You are learning to let go and that can't always be there to protect her.<\/p>"
    },
    {
        "title": "Rapids",
        "desc": "<p>To dream that you are carried away by the rapids suggests that you are experiencing some intense feelings. You may be literally be getting carried away by your emotions.<\/p>"
    },
    {
        "title": "Rapture",
        "desc": "<p>To dream that you have been raptured symbolizes your strong faith and spirituality.<\/p><p>To dream that the rapture is coming forewarns that you need to get aspects of your life in order. Something major is happening in your life that you need to prepare for it.<\/p><p>Dreaming that you are left behind in the rapture symbolizes feelings of abandonment and unworthiness. You may have self-esteem issues and often feel overlooked.<\/p>"
    },
    {
        "title": "Rare",
        "desc": "<p>To dream that something is rare indicates that you need to appreciate certain things. Consider the symbolism or significance of the rare object or event. Don't take things for granted.<\/p>"
    },
    {
        "title": "Rash",
        "desc": "<p>To dream that you have a rash indicates repressed anger, frustrations and annoyances. You may be holding in your anger and frustrations, instead of expressing it. Alternatively, the dream suggests that others are trying to put doubt in your head about some decision or choice that you are making. It may be a pun on a &quot;rash&quot; decision that you are making. You need to think twice before going through with your choice.<\/p>"
    },
    {
        "title": "Raspberry",
        "desc": "<p>To see or eat raspberries in your dream represent some precious or delicate matter.<\/p>"
    },
    {
        "title": "Ration",
        "desc": "<p>To dream that you are rationing something indicates that you are not getting your fair share of something, either emotionally, financially or materially. Alternatively, it symbolizes your fairness and diplomacy in some matter.<\/p>"
    },
    {
        "title": "Rats",
        "desc": "<p>To see a rat in your dream signifies feelings of doubts, greed, guilt, unworthiness and envy. You are keeping something to yourself that is eating you up inside.Or you have done something that you are not proud of. Alternatively, a rat denotes repulsion, decay, dirtiness, and even death. The dream may also be a pun on someone who is a rat. Are you feeling betrayed?<\/p><p>In particular, to see a black rat represents deceit and covert activities.If you see a white rat in your dream, then it means that you will receive help from an unexpected source.<\/p><p>To dream that a rat is biting your feet is analogous to the rat race that you are experiencing in your waking life.<\/p><p>To dream that you catch a rat with your bare hands indicates that you are not letting greed, jealousy, betrayal or some other negativity get the best of you.<\/p>"
    },
    {
        "title": "Rattle",
        "desc": "<p>To see or play with a rattle in a dreamsignifies joy, tranquility and contentment in the home.<\/p><p>To hear a rattle in your dream represents some situation or issue that you need to tend to.<\/p>"
    },
    {
        "title": "Rattlesnake",
        "desc": "<p>To see a rattlesnake in your dream represents the passage of time.<\/p><p>****Go to<a href=\"http:\/\/www.dreammoods.com\/commondreams\/snake-dreams.html\">Common Dreams: Snake Dreams for further analysis. Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s3.htm#Snake\">Snake.<\/p>"
    },
    {
        "title": "Raven",
        "desc": "<p>To see a raven in your dream symbolizes betrayal, disharmony, misfortune, and death. The death may be a symbolic death in that it signals an end to a habit or phase in your life. Alternatively, the dream suggests that someone is taking advantage of your misfortune.<\/p>"
    },
    {
        "title": "Ravine",
        "desc": "<p>To see a ravine in your dream represents your need to be sheltered and protected. You are in deep contemplation about your own emotions or relationships. Perhaps you are trying to make sense of your hidden feelings.<\/p>"
    },
    {
        "title": "Raw",
        "desc": "<p>To eat something that is raw signifies some unexplored or untried experiences. Perhaps you are feeling apprehensive and ill prepared about what is ahead for you. Alternatively, the dream may be a metaphor for your &quot;raw&quot; emotions.<\/p>"
    },
    {
        "title": "Razor",
        "desc": "<p>To see a razor in your dream suggests that there is a situation or problem that you need to smooth out.<\/p><p>To dream that you are sharpening a razor indicates that you are ruthless and &quot;cutthroat.&quot;<\/p>"
    },
    {
        "title": "Razor Blade",
        "desc": "<p>To see or use a razor blade in your dream symbolizes precision and accuracy in what you do.<\/p><p>To find a razor blade in your food refers to some cutting remark that you made and is coming back to haunt you.<\/p>"
    },
    {
        "title": "RC Car",
        "desc": "<p>To see or play with an RC Car in your dream represents your ability to make quick decision. You are also feeling in control of your goals. Alternatively, the dream may mean that your goals are set too low. You are not challenging yourself.<\/p>"
    },
    {
        "title": "Reach",
        "desc": "<p>To dream that you are reaching for something or someone signifies a yearning or desire for something you do not have. The dream may also be symbolic of an emotional void in your life that you are trying to fill.<\/p>"
    },
    {
        "title": "Reading",
        "desc": "<p>To dream that you are reading indicates that you need to obtain more information and knowledge before making a decision. You need to think things through and consider all your options.<\/p>"
    },
    {
        "title": "Real Estate",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p4.htm#Property\">Property.<\/p>"
    },
    {
        "title": "Reality Show",
        "desc": "<p>To dream that you are in a reality show suggests that you feel your life is under public scrutiny. You feel that someone is criticizing your decisions and actions. The dream may also be a pun that you are in need of a reality check.<\/p>"
    },
    {
        "title": "Realtor",
        "desc": "<p>To see or dream that you are a realtor indicates that you are searching for a new sense of self.<\/p>"
    },
    {
        "title": "Reapers",
        "desc": "<p>To see reapers working in your dream denote prosperity and pleasure.<\/p>"
    },
    {
        "title": "Rear Ended",
        "desc": "<p>To dream that you have been rear ended indicates that something from your past is still impacting your present situation. You need to learn from the past in order to move forward.<\/p>"
    },
    {
        "title": "Rearview Mirror",
        "desc": "<p>To dream that you are looking through the rearview mirror suggests that you are dwelling on the past too much. It may indicate regrets, past hurts or &quot;what ifs&quot;. On the other hand, the dream may be telling you not to forget about the past and what you have left behind. You need to maintain a happy median between what is ahead for you in the future and what you left behind in the past.<\/p>"
    },
    {
        "title": "Rebel",
        "desc": "<p>To dream that you are a rebelindicates that you need to stand up for yourself and be your own person, even though it may go against the masses. It is time to take action.<\/p>"
    },
    {
        "title": "Rebirth",
        "desc": "<p>To dream that you are born again indicates that you need to deal with issues that you have been avoiding. You may have been given a second chance to regain what was previously thought to be lost. Alternatively, the dream means that you are starting or entering a new stage in your life. You are looking toward the future instead of dwelling on the past.<\/p><p>Some Christians are described as &quot;born again&quot;. Thus the dream may also represent your renewed religious faith and commitment.<\/p>"
    },
    {
        "title": "Receipt",
        "desc": "<p>To see a receipt in your dream indicates that you are accepting or acknowledging some aspect of yourself. It is a reflection of your openness and genuineness. What is the receipt for? Alternatively, the dream symbolizes guaranteed success. Better times are ahead for you.<\/p>"
    },
    {
        "title": "Reception",
        "desc": "<p>To dream that you are attending a reception represents togetherness and social gatherings. The dream may parallel your social calendar. Alternatively, the dream could be a pun that you need to be more &quot;receptive&quot; to some new idea, situation, relationship or person.<\/p>"
    },
    {
        "title": "Recess",
        "desc": "<p>To dream about recess time suggests that you need to take a little break from your daily life for yourself. It is time to think things through and replenish your energy.<\/p>"
    },
    {
        "title": "Recipe",
        "desc": "<p>To dream of a recipe symbolizes your creativity, talents and enjoyment of life. You need to take advantage of life's pleasures. Consider what the recipe is for. Desserts suggest that you need to indulge in life and devote some time to leisure. A recipe for preparing meat represents your desires for physical\/emotional satisfaction.<\/p>"
    },
    {
        "title": "Recital",
        "desc": "<p>To dream that you are in a recital indicates your level of self-confidence and self esteem. Consider how you perform in the recital and how it may parallel a waking situation.<\/p>"
    },
    {
        "title": "Recliner",
        "desc": "<p>To see or sit on a recliner in your dream suggests that you need to take a step back to evaluate a situation. Since a recliner is sometimes referred to as a &quot;lazy boy&quot;, the dream may indicate that you are unproductive.<\/p>"
    },
    {
        "title": "Recognition",
        "desc": "<p>To dream that you are being recognized suggests that your hard work and abilities are not going unnoticed. Keep up the good work!<\/p><p>To dream that someone is being recognized indicates that you need to incorporate some aspects of their character into your own self. Alternatively, the dream refers to your hidden feelings and fondness toward that person.<\/p>"
    },
    {
        "title": "Reconcilement",
        "desc": "<p>To dream about a reconcilement represents a person in your waking life who you need to reconnect with. You need to rid yourself of some burden that has been weighing you down. Alternatively, the dream suggests that you need to come to terms with the changes in your life.<\/p>"
    },
    {
        "title": "Record",
        "desc": "<p>To see or listen to a record in your dream suggests that you need to consider both sides of a situation before making a decision. You need to be more in tune with your instincts. Maybe there is something that you need to say &quot;on or off the record.&quot; Or the dream is telling you that you are going round and round in circles; you are not making any progress in life. Alternatively, a record represents a need for enjoyment and sensual pleasure.<\/p><p>To dream that the record is scratched may be a pun on how you are &quot;sounding like a broken record&quot;. Or the dream may literally mean &quot;breaking a record&quot;.<\/p>"
    },
    {
        "title": "Record Player",
        "desc": "<p>To see a record player in your dream suggests that you are going around in circles over a problem or situation. In other words, you are going nowhere.<\/p><p>To dream that the record player is broken indicates that you have broken free from a cycle or habit.<\/p>"
    },
    {
        "title": "Recording Studio",
        "desc": "<p>To dream that you are in a recording studio suggests that there is a message that you need to absorb and incorporate into your daily life.<\/p>"
    },
    {
        "title": "Recovery",
        "desc": "<p>To dream that you are recovering or in recovery means that you are visualizing success or envisioning a positive future. You will overcome current struggles or hardships.<\/p><p>Dreaming that you are recovering an object means you are trying to relive parts of your past.<\/p>"
    },
    {
        "title": "Rectangle",
        "desc": "<p>To see a rectangle in your dream represents permanence, materialism and stability. Because of its four corners and four sides, it is also symbolic of the number 4.<\/p>"
    },
    {
        "title": "Recurring Dream",
        "desc": "<p>To have recurring dreams indicate unresolved issues, unhealthy behavior patterns, or unexpressed emotions in your waking life.<\/p><p>*For more information, please See Dream Moods' article on<a href=\"http:\/\/www.dreammoods.com\/dreaminformation\/dreamtypes\/recurringdreams.htm\">Recurring Dreams.<\/p>"
    },
    {
        "title": "Recycle",
        "desc": "<p>To dream that you are recycling suggests that you are trying to sort out aspects of your life. You are trying to learn from your past mistakes and turn them into positives. Alternatively, the dream may mean that you are reliving the past. It is time to move forward.<\/p>"
    },
    {
        "title": "Red Carpet",
        "desc": "<p>To dream that you are walking on a red carpet represents your desire to be admired and looked up to. You are seeking validation and acknowledgement for your achievements.<\/p><p>To see the red carpet in your dream suggests that you are welcoming fun and festivities in your life. You are ready for a celebration.<\/p>"
    },
    {
        "title": "Red Cross",
        "desc": "<p>To see the Red Cross in your dream suggests that you are in need of spiritual healing. Don't be shy about asking for help when you need it. The Red Cross is also representative of humanitarian work.<\/p>"
    },
    {
        "title": "Red Giant",
        "desc": "<p>To dream of a Red Giant implies that the end is near in your career or relationship.<\/p>"
    },
    {
        "title": "Red Light",
        "desc": "<p>To dream that you are running a red stoplight indicates that you are doing something despite being told not to do it. You are going against the rules.<\/p>"
    },
    {
        "title": "Red Snapper",
        "desc": "<p>To dream of a red snapper fish implies that you are speaking and acting out of anger. You are letting negative emotions dictate your behavior.<\/p>"
    },
    {
        "title": "Redecorating",
        "desc": "<p>To dream that you are redecorating indicates your need for change. You need a makeover of yourself.<\/p>"
    },
    {
        "title": "Redhead",
        "desc": "<p>To dream that you are a redhead suggests that you need more spontaneity and vitality in your life. It is time to make some dramatic changes.<\/p>"
    },
    {
        "title": "Redwood",
        "desc": "<p>To see redwood trees in your dream symbolize longevity and continuity. Due to their color, the redwoods also represent passion, life, and blood.<\/p>"
    },
    {
        "title": "Reeds",
        "desc": "<p>To see reeds in your dream symbolize your flexibility and resilience in various situations.<\/p>"
    },
    {
        "title": "Reef",
        "desc": "<p>To see a reef in your dream suggests that you are blocking out subconscious material from emerging onto the surface.Alternatively, the dream may also mean a refuge or protection from your emotions.<\/p>"
    },
    {
        "title": "Reenactment",
        "desc": "<p>To dream of a reenactment signifies a memory, especially if it is a painful or difficult memory. Your subconscious is trying to protect you by creating a level of separation from a direct memory.<\/p>"
    },
    {
        "title": "Referee",
        "desc": "<p>To see a referee in your dream signifies an inner battle between your own ideals and values and between the ideals and values of others. You are looking for a resolution to some conflict in your daily life.<\/p>"
    },
    {
        "title": "Reflection",
        "desc": "<p>To see your reflection in your dream represents your true self; it is time to look within. The reflection may highlight both your flaws and positive attributes. Learn from your flaws and how to improve them. At the same time, appreciate your good qualities. Alternatively, your reflection indicates how you want others to perceive you.<\/p><p>If you see a strange figure or something other than your own reflection, then it suggests that you are undergoing some identity crisis. You are not sure about who you are anymore.<\/p><p>To dream that you do not see your reflection in a mirror implies that you have lost your self-identity. Perhaps you have changed for the benefit of others that you don't know who you are anymore.<\/p>"
    },
    {
        "title": "Refrigerator",
        "desc": "<p>To see or open a refrigerator in your dream represents your chilling personality and\/or cold emotions. The dream may also be telling you that you need to put some goal, plan, or situation on hold. Alternatively, a refrigerator signifies that you have accomplished what you have been subconsciously seeking.<\/p><p>To dream that the refrigerator has broken down suggests that you need to warm up to somebody or some situation. It is time to let go of those harsh, cold feelings.<\/p><p>If you dream of a very full refrigerator, then it symbolizes your untapped resources.<\/p>"
    },
    {
        "title": "Refugee",
        "desc": "<p>To dream that you are a refugee refers to feelings of rejection by society. You feel emotionally isolated and that you do not belong anywhere. Alternatively, the dream means that you are trying to escape a situation or issue instead of confronting it.<\/p>"
    },
    {
        "title": "Refusal",
        "desc": "<p>To dream that you are refusing something suggests that you are in denial about something. Consider what you are refusing. Alternatively, the dream may be a pun on &quot;refuse&quot; or trash. Is there some aspect or characteristic that you are rejecting?<\/p>"
    },
    {
        "title": "Register",
        "desc": "<p>To dream that you are registering for something signifies your commitments toward your goals. Alternatively, the dream may be a pun on something that has made an impact or impression on you.<\/p>"
    },
    {
        "title": "Regret",
        "desc": "<p>To dream about regret indicates that you are preoccupied with waking disappointments and dissatisfaction. These could be repressed or negative feelings about yourself. The feelings you have in your dream are usually reflective of what you are feeling in real life, but you may not be expressing themappropriately."
    },
    {
        "title": "Rehabilitation",
        "desc": "<p>To dream that you are in rehabilitation indicates that you are recovering from some emotional hurt or trauma. You are ready for a fresh new start and rebuilding a new self-image.<\/p>"
    },
    {
        "title": "Rehearsal",
        "desc": "<p>To dream that you are rehearsing for a part suggests that you are getting ready for some important stage in your life. You are making sure that you know exactly what you need to do. This could refer to your preparedness for a meeting, a project or even a date.<\/p><p>Dreaming of a wedding rehearsal implies that you need to prepare yourself for an important transition in your life.<\/p>"
    },
    {
        "title": "Reincarnation",
        "desc": "<p>To dream that you have reincarnated into someone else suggests that you are not being yourself. Perhaps you need to incorporate aspects of the dream person into your own character. Alternatively, reincarnating indicates that you are undergoing major changes in your life. If you reincarnated into an animal, then consider the qualities of the specific animal.<\/p>"
    },
    {
        "title": "Reins",
        "desc": "<p>To see reins in your dream indicate that you are being restrained or inhibited from expressing yourself. You are censoring yourself. Alternatively it symbolizes control. The dream may be a pun on &quot;reign&quot; and thus represent your power over others.<\/p>"
    },
    {
        "title": "Reindeer",
        "desc": "<p>To see a reindeer in your dream symbolizes the holidays, festivities, and the season of giving. Alternatively, a reindeer refers to your sense of loyalty.<\/p>"
    },
    {
        "title": "Rejection",
        "desc": "<p>To dream that you are rejecting something indicates that there is some aspect of your life that you want to be rid of. It may be some failing situation. Alternatively, you are refusing to accept a situation that is being imposed and forced upon you.<\/p><p>To dream that you are being rejected signifies a lack of self-worth. You feel alienated. Alternatively, the dream means that you are being too agreeable and accommodating, where your own sense of self is lost. You need to be more assertive and learn to say no to others. If you are being rejected by a lover, then it suggests that you are you are rejecting some part of your own character.<\/p><p>Dreaming that you are rejected for a job implies a lack of self-esteem. You don't believe in yourself and don't feel you have something to offer.<\/p>"
    },
    {
        "title": "Relationships",
        "desc": "<p>To dream about your waking relationships indicate wish-fulfillment. Your dream relationship usually parallels your waking relationship in some way and may be highlighting something that you are doing wrong. In your dream state, you may be more incline to confront issues that you would normally ignore or are afraid of bringing up. Compare your dream relationship with your waking relationship.<\/p><p>To dream about a relationship with a stranger represents the different sides of your personality. You may be trying to connect to unknown aspects of your subconscious.<\/p>"
    },
    {
        "title": "Relative",
        "desc": "<p>To see your relatives in your dream signify family issues and feelings. Relatives are symbolic of some aspect of your own self.<\/p>"
    },
    {
        "title": "Relic",
        "desc": "<p>To see or find a relic in your dream symbolizes an aspect of your former self that you still have not completely let go. Although you may grow and evolve, you never forget where you came from. A relic may also refer to a prior relationship that you still cherish and look back fondly on.<\/p>"
    },
    {
        "title": "Relief",
        "desc": "<p>Todream about relief suggests that you are trying to reduce the affect of the dream message and images. You may be experiencing a disturbing dream and your conscious is seeking to alleviate the impact. You need to take some time out in order to evaluate your decisions and judgment carefully.<\/p>"
    },
    {
        "title": "Religion",
        "desc": "<p>Todream of your religion represents your faithfulness and sense of spirituality. Perhaps your dream is telling you to be more religious or that you need to be more spiritual. Alternatively, the dream may be a metaphor for some behavior or habit which you are &quot;religious&quot; about.<\/p><p>To dream about a different religion from your own suggests that you need to incorporate some key component of that religion in your own life. The dream may also mean that you need to be more accepting and tolerant of the differences in humanity.<\/p>"
    },
    {
        "title": "Relish",
        "desc": "<p>To see or eat relish in your dream suggests that you need to add a little spice or pizzazz to your life. Alternatively, the dream may be a metaphor that you are &quot;relishing&quot; in some joy, interest, hobby, activity, or situation. You have a zest for life.<\/p>"
    },
    {
        "title": "Remarry",
        "desc": "<p>To dream that you remarry someone signifies healing and acceptance of your new self. It also implies giving yourself a second chance. You have resolved your issues with commitment.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m.htm#Marriage\">Marriage.<\/p>"
    },
    {
        "title": "Remember",
        "desc": "<p>To remember something in your dream indicates that you have learned something significant from your past mistakes or previous experiences. The dream may also serve as a reminder of something important that is occurring in your waking life. You are so worried that you will forget something that the preoccupation has made its way into your dream.<\/p>"
    },
    {
        "title": "Remodeling",
        "desc": "<p>To dream that you are remodeling indicates that you are reevaluating your values and making changes to your belief system. Alternatively, the dream means that you need a change in your life.<\/p>"
    },
    {
        "title": "Remote Control",
        "desc": "<p>To see a remote control in your dream refers to how your buttons are being pushed by someone. Perhaps a relationship or situation that is too controlling.<\/p>"
    },
    {
        "title": "Renaissance",
        "desc": "<p>To dream that you are living during the renaissance represents your non-conformist attitude. You are looking to be different and trying something new. It is time to branch out and break out of the box.<\/p>"
    },
    {
        "title": "Renovate",
        "desc": "<p>To dream that you are renovating indicates that you are looking at life from a new perspective. Your old ideas or habits are being replaced by new ways of looking at the world. Alternatively, the dream suggests that you have triumph over much adversity.<\/p>"
    },
    {
        "title": "Rent",
        "desc": "<p>Todream that you are paying rent represents your personal responsibilities and sense of independence. Alternatively, it indicates a transitional phase in your life.<\/p><p>To dream that you do not have enough money to pay the rent or that your rent is going up suggests that your emotional psyche is strained. Someone or some situation is putting heavy demands on you. More directly, the dream could represent financial worries.<\/p><p>To dream that you rent out your home implies that you have put your own priorities aside for the sake of others. In particular, if you are renting your childhood house, then it means that it is time to let go of the past and recognize the value of the future.<\/p>"
    },
    {
        "title": "Repair",
        "desc": "<p>To dream that you are repairing something implies that you are recovering from an upsetting or difficult situation. The item that you are repairing is indicative of the area in your life that you are working on.<\/p>"
    },
    {
        "title": "Repairman",
        "desc": "<p>To see a repairman in you dream signifies psychological healing.<\/p>"
    },
    {
        "title": "Repeat",
        "desc": "<p>To dream that something is repeating indicates that there is some message that you need to ingrain in your mind. Perhaps you are trying to memorize something. Alternatively, the dream refers to the monotony and routine of your daily life. You need to get out of the rut.<\/p>"
    },
    {
        "title": "Repent",
        "desc": "<p>To dream that you are repenting means you need to recognize your past mistakes and learn from it. The dream reflects your feelings of guilt and remorse about some situation.<\/p><p>To dream that someone repents implies that you need to be more accepting of their flaws of shortcomings.<\/p>"
    },
    {
        "title": "Replacement",
        "desc": "<p>To dream that you have been replaced at work represents your concern about your current job security. You feel that you are in a precarious position at work or in some group project.<\/p><p>To dream that something has been replaced indicates that you are struggling with feelings of insecurity.<\/p>"
    },
    {
        "title": "Replay",
        "desc": "<p>To have a dream that is on replay or on a loop points to something that you are refusing to acknowledge. Such dream are similar to recurring dreams which occur over a period of more than one day as opposed to within the same dream. Alternatively, dreaming of the same scene over and over again indicates that you are unable to move forward. You feel stuck in you current situation and do not know how to get out of it.<\/p>"
    },
    {
        "title": "Report",
        "desc": "<p>To dream that you are writing a report suggests that you need to think things through before acting on them. You need to be more objective when evaluating a situation.<\/p><p>To see or read a report in your dream indicates some anxiety over an issue. You may be faced with an approaching deadline.<\/p>"
    },
    {
        "title": "Report Card",
        "desc": "<p>To see a report card in your dream symbolizes how you are performing in various aspects of your waking life. You may be questioning your job or your abilities. If you are still in school, then the dream may represent your anxieties about your grades. Also consider the significance of the specific letters or grades on the report card.<\/p>"
    },
    {
        "title": "Reporter",
        "desc": "<p>To see or dream that you are a reporter refers to a situation where you need to be neutral and not pick sides.<\/p>"
    },
    {
        "title": "Reprieve",
        "desc": "<p>Todream that you are granted a reprieve indicates that you will overcome some difficulty which has been giving you much anxiety.<\/p>"
    },
    {
        "title": "Reproductive System",
        "desc": "<p>Tosee or dream about the reproductive system refers to the early stage of a new project or new relationship in your life. It symbolizes creation, imagination and new ideas. A more direct interpretation may just mean that you want to be pregnant or are anxious about an existing pregnancy.<\/p>"
    },
    {
        "title": "Reptile",
        "desc": "<p>Tosee a reptile in your dream symbolizes your basic urges, instincts and suppressed sexual desires.<\/p>"
    },
    {
        "title": "Reputation",
        "desc": "<p>Todream that your reputation is called into question suggests that you are too overly concerned with what other people think about you.<\/p>"
    },
    {
        "title": "Rescue",
        "desc": "<p>Todream that you are being rescued or rescue others represents an aspect of yourself that has been neglected or ignored. You are trying to find a way to express this neglected part of yourself. Alternatively, it symbolizes an subconscious cry for help. Perhaps you are too proud in your waking life to ask for assistance.<\/p><p>In particular, to dream that you rescue someone from drowning indicates that you have successfully acknowledged certain emotions and characteristics that is symbolized by the drowning victim.<\/p>"
    },
    {
        "title": "Reservoir",
        "desc": "<p>To see a filled reservoir in your dream symbolizes pent up or repressed emotions. If the reservoir is empty in your dream, then it indicates that you have expended all your energy and emotions on others. You need to focus on yourself for a change.<\/p>"
    },
    {
        "title": "Reset Button",
        "desc": "<p>To see or press a reset button in your dream indicates that you are stuck in some problem, situation or relationship. You need to push forward. Perhaps, it is time to make a new start. Alternatively, the dream symbolizes second chances.<\/p>"
    },
    {
        "title": "Resign",
        "desc": "<p>Todream that you resign from a position indicates major changes in your life.You can no longer continue on in the same course and must make drastic changes.<\/p>"
    },
    {
        "title": "Resolution",
        "desc": "<p>To dream that you are making a resolution symbolizes your commitment and dedication to the changes that you are making in your life. Alternatively, the dream may be a metaphor for a &quot;resolution&quot; or an answer.<\/p>"
    },
    {
        "title": "Resort",
        "desc": "<p>To dream that you are on a resort represents your need for some relaxation. You need to escape from the pressures of everyday life in order to re-energize yourself. The dream may also be a pun on some &quot;last resort&quot;. You may be feeling desperate. Don't be afraid to turn to someone for help.<\/p>"
    },
    {
        "title": "Restaurant",
        "desc": "<p>Todream that you are in a restaurant suggests that you are feeling overwhelmed by decisions and choices that you need to make in your life. Alternatively, it indicates that you are seeking for emotional nourishment outside of your social support system.<\/p>"
    },
    {
        "title": "Restrained",
        "desc": "<p>To dream that you are restrained indicates that you are holding yourself back and not fully expressing yourself. Perhaps you are feeling helpless in some situation. The dream may also be a reflection of the actual state of your body, known as REM paralysis.<\/p><p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p.htm#Paralyzed\">Paralyzed.<\/p>"
    },
    {
        "title": "Restricted",
        "desc": "<p>To dream that you are in a restricted area indicates that you are not ready to face up to some issue or problem. It may also imply that you are being hindered from expressing yourself.<\/p>"
    },
    {
        "title": "R�sum�",
        "desc": "<p>To see a r�sum� in your dreamsuggests that you are evaluating your own abilities and performance in some situation. Depending on how you feel about the r&#65533;sum&#65533;, it is telling of whether or not you feel you have what it takes for the task at hand.<\/p>"
    },
    {
        "title": "Resurrection",
        "desc": "<p>Todream that you or someone is resurrected from the dead suggests that you will eventually overcome your current obstacles to achieve your goals. It signals an awakening of your spirituality and renewed energy. Alternatively, the dream indicates that the same old problems are coming back to haunt you because they were not properly addressed or dealt with in the first place.<\/p>"
    },
    {
        "title": "Resuscitate",
        "desc": "<p>Todream that you are being resuscitated suggests that something from your subconscious is emerging to the surface. Alternatively, the dream means that you are feeling exhausted or emotionally drained. You are seeking advice.<\/p><p>To dream that you resuscitate someone indicates that you are able offer some insight on a situation. Alternatively, the dream implies that you have resolved some anxiety, fear or tension in your life.<\/p>"
    },
    {
        "title": "Retainer",
        "desc": "<p>To wear a retainer in your dream suggests that are holding your emotions back and not expressing yourself. As a result, you are feeling stifled.<\/p>"
    },
    {
        "title": "Retarded",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/m2.htm#MentallyChallenged\">Mentally Challenged.<\/p>"
    },
    {
        "title": "Retire",
        "desc": "<p>To dream of retirement represents issues you have with getting old. Retirement may also refer to a transition or phase. Alternatively, the dream may be a metaphor for something that you need to &quot;retire&quot; or put to rest.<\/p>"
    },
    {
        "title": "Retreat",
        "desc": "<p>To dream that you are on a retreat represents spiritual renewal and healing. It is time to replenish your energy.<\/p><p>To dream that you are retreating from a situation indicates that you do not have the strength or the energy to deal with some waking situation. Perhaps you are in denial about something.<\/p>"
    },
    {
        "title": "Reunion",
        "desc": "<p>Todream that you are attending a reunion suggests that there are feelings from the past which you need to acknowledge and recognize. Or perhaps the dream is highlighting how you have already incorporated certain aspects or qualities of the people in your dream reunion.<\/p>"
    },
    {
        "title": "Revelation",
        "desc": "<p>To dream that you have a revelation signifies a new or bright outlook toward a situation. You have a clear perspective on things. Alternatively, a dream revelation symbolizes a new idea.<\/p>"
    },
    {
        "title": "Revenge",
        "desc": "<p>To dream that you are taking revenge suggests that you are experiencing some emotional imbalance. You are harboring some repressed emotions.<\/p><p>To dream that someone is taking revenge on you signifies fear and distrust.<\/p>"
    },
    {
        "title": "Reverend",
        "desc": "<p>To see a reverend in your dream indicates that you are looking for respect and guidance. The dream may also mean that you need to be more selfless and reach out to others in their time of need.<\/p>"
    },
    {
        "title": "Reverse",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/b.htm#Backward\">Backward.<\/p><p>Revolt<\/p><p>To see a revolt in your dream indicates the influence of peer pressure working against you. You want to go against the masses.<\/p>"
    },
    {
        "title": "Revolver",
        "desc": "<p>To see a revolver in your dream symbolizes lingering danger. It also represents fear, anger, aggression, and your quick temper. You are using your power to protect yourself against the fear and anger.<\/p><p>*Please also see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p2.htm#pistol\">Pistol or<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/g2.htm#gun\">Gun.<\/p>"
    },
    {
        "title": "Revolution",
        "desc": "<p>To dream that you are part of a revolution suggests that major changes are occurring within yourself. You are experiencing some major emotional turmoil that needs to be confronted and resolved. Alternatively, the dream symbolizes your view of the world and your future.<\/p>"
    },
    {
        "title": "Revolving Door",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d3.htm#Door\">Door.<\/p><p>Rewind<\/p><p>To dream that something is rewinding represents your desires to turn back time and redo certain things over again. It may denote regrets and remorse. You need to stop living in the past and look toward the future. Alternatively, the dream may be a reminder of where you came from and how you got to be where you are today. Give appreciation to those who have helped you along the way.<\/p>"
    },
    {
        "title": "Rheumatism",
        "desc": "<p>To dream that you have rheumatism suggests that some unexpected issue will delay the achievement of your goals and plans. Alternatively, the dream symbolizes your rigid and inflexible ways. You need to loosen up.<\/p>"
    },
    {
        "title": "Rhinestones",
        "desc": "<p>To see rhinestones in your dream signify short-lived pleasures.<\/p>"
    },
    {
        "title": "Rhinoceros",
        "desc": "<p>To see a rhinoceros in your dream suggests that you need to forge ahead toward your goals. Do not take &quot;no&quot; for an answer or let any obstacles sidetrack you from your destination. You need to be more aggressive.<\/p>"
    },
    {
        "title": "Rhubarb",
        "desc": "<p>To see or eat rhubarb in your dream suggests that you are freeing yourself out of an unwanted situation or relationship. Alternatively, it implies that the pleasant times are here to stay.<\/p>"
    },
    {
        "title": "Rhyme",
        "desc": "<p>To hear or make rhymes in your dream indicate that you are seeking balance and harmony in your life.Rhymes may be a way for you to better remember an important component in your dream when you wake. Focus on what it may be trying to tell you. Alternatively, the dream symbolizes a silly or confusing situation. Consider the phrase &quot;no rhyme or reason&quot;.<\/p>"
    },
    {
        "title": "Rhythm",
        "desc": "<p>To hear a rhythm in your dream symbolizes the pace of your life.<\/p>"
    },
    {
        "title": "Rib",
        "desc": "<p>To see your ribs in your dream suggest that you are shielding yourself from heartbreak. In the biblical sense, the rib is symbolic of your spouse.<\/p>"
    },
    {
        "title": "Ribbon",
        "desc": "<p>To see a ribbon in your dream signifies innocence, playfulness, festivities, frivolity and girliness. Consider the type of ribbon and how it is tied. Also consider the color of the ribbon for additional significance. For example, a blue ribbon is associated with being the best. Pink ribbon is symbolic of breast cancer awareness. Yellow ribbon signifies the pending return of a loved one from the military. And a red ribbon symbolizes AIDS awareness.<\/p>"
    },
    {
        "title": "Rice",
        "desc": "<p>To see grains of rice in your dream symbolize success, prosperity, luck, fertility and warm friendships.<\/p><p>To dream that you are eating rice denotes happiness and tranquility in the home.<\/p><p>To dream that you are cooking rice signifies the new responsibilities that will bring you much joy.<\/p>"
    },
    {
        "title": "Rich",
        "desc": "<p>To dream that you are rich signifies pride and self confidence. You will experience much success through your perseverance. The dream may also refer to someone named &quot;Rich&quot; or &quot;Richard&quot;.<\/p><p>*Please also see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/w2.htm#wealth\">Wealth.<\/p>"
    },
    {
        "title": "Rickshaw",
        "desc": "<p>To see or ride in a rickshaw represents a simpler way of life. It also represents manual power and resourcefulness. Alternatively, the dream suggests that you will progress through life at a slow and steady pace.<\/p><p>To pull a rickshaw in your dream symbolizes the burdens that you are literally carrying on your shoulders. You feel that someone else is not pulling their own weight and you are having to support them. Alternatively, it signifies that hard work and manual labor will eventually get you to where you need.<\/p>"
    },
    {
        "title": "Riddles",
        "desc": "<p>To dream that you are trying to solve a riddle suggests that your patience is being put to the test in some waking situation. Alternatively, the dream indicates that you are intentionally being cryptic about your true feelings or intentions.<\/p>"
    },
    {
        "title": "Ride",
        "desc": "<p>To dream that you are riding an animal or vehicle symbolizes the path and direction of your life.If you were riding away, then it suggests that you need to distance yourself from some issue. Alternatively, the dream means that you are going along with someone else's plans and ideas. You need to be less passive and stand up for yourself. In particular, to dream that you are riding a bicycle, motorcycle, or horse, is analogous to your sexual rhythm.<\/p><p>To dream that you are being refused a ride implies that your views are in conflict with the person or persons in the vehicle.<\/p>"
    },
    {
        "title": "Ridge",
        "desc": "<p>To dream that you are on a mountain ridge represents the struggles and challenges you have experienced and\/or overcame in your waking life.<\/p><p>To see a ridge in your dream refers to the balance that you need to maintain in various aspects of your life.<\/p>"
    },
    {
        "title": "Rifle",
        "desc": "<p>To see a rifle with a scope in your dream implies that you are directing your anger and aggression toward a specific person or issue. Alternatively, a rifle is symbolic of the penis and raw masculine energy.<\/p><p>Dreaming that you are standing on a roof holding a rifle means that you feel the need to protect the things that are important to you. You are standing firm on your beliefs.<\/p><p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/g3.htm#Gun\">Gun.<\/p>"
    },
    {
        "title": "Right",
        "desc": "<p>To dream of the right side represents conscious reality, deliberate action and rational thoughts. It may also be a pun on the rightness of an idea, decision, or plan. The dream is telling you that you are doing the right thing or that you are on the right path. Alternatively, the dream may mean that you need to stand up for your &quot;rights&quot;. Or it may be a metaphor for your right leaning political views.<\/p>"
    },
    {
        "title": "Rigor Mortis",
        "desc": "<p>To dream that a body is in rigor mortis suggests that you are feeling emotionally numb, withdrawn, and detached from those around you.<\/p>"
    },
    {
        "title": "Ring",
        "desc": "<p>To see or receive a ring in your dream symbolizes emotional wholeness, continuity, commitments and honor. If the ring is on your finger, then it signifies your commitment to a relationship or to a new endeavor. You are loyal to your ideals, responsibilities, or beliefs.<\/p><p>To dream that your ring is broken indicates that your loyalty is called into question. Alternatively, a broken ring symbolizes an end to some relationship. There is a loss of commitment.<\/p><p>To dream that you lose a ring or someone has stolen your ring represents insecurity. You may be losing interest in some relationship or issue.<\/p>"
    },
    {
        "title": "Ringmaster",
        "desc": "<p>To see or dream that you are a ringmaster suggests that you are taking control of your hectic life. You are searching for order in your life.<\/p>"
    },
    {
        "title": "Ringworms",
        "desc": "<p>To dream that you have ringworms signify a major annoyance or frustration in your waking life. You are being sidetracked by counterproductive activities.<\/p>"
    },
    {
        "title": "Rink",
        "desc": "<p>To see a rink in your dream suggests that you are going around in circles. Alternatively, the dream indicates that you have control over your cold or bitter feelings.<\/p>"
    },
    {
        "title": "Riot",
        "desc": "<p>To see or participate in a riot in your dream suggests that you need to stand up for yourself. You need to speak up and address what is bothering you. Alternatively, the dream signifies a loss to your individuality. You are involved in a situation that is destructive to your well being.<\/p>"
    },
    {
        "title": "Rip",
        "desc": "<p>To rip something in your dream indicates dissatisfaction with the direction that a project or situation is going. Alternatively, the dream may be a a pun on &quot;rip off&quot; or &quot;to rip on someone&quot; as in to insult or bad mouth them. Consider if these scenarios parallel your waking situation.<\/p><p>To see something rip in your dream suggests that you are overestimating the strength of something. In particular, to dream that your notebook is ripped means that you lack confidence in your ability to write and convey your thoughts. Perhaps you are having difficulty acceptingyour flaws and imperfections. Alternatively, the dream may be a metaphor to signify the acronym for &quot;R.I.P.&quot;<\/p>"
    },
    {
        "title": "Rising",
        "desc": "<p>To dream that something is rising into the air refers to unexpected wealth and pleasures. The dream may be a metaphor that you are rising above a situation.<\/p><p>To dream that you are rising to a high position means that success will come as a result of your determination.<\/p>"
    },
    {
        "title": "Risk",
        "desc": "<p>To dream that you are taking a risk indicates that you are pushing yourself to the limit. You are seizing an opportunity and standing up to your fears.<\/p>"
    },
    {
        "title": "Ritual",
        "desc": "<p>To dream of a ritual indicates that there is a habit that you need to break. Some waking pattern is repeating itself, resulting in a viscous cycle.You need to focus your energies and cleanse yourself spiritually and emotionally.<\/p>"
    },
    {
        "title": "Rival",
        "desc": "<p>To dream that you have a rival indicates that you are reluctant in asserting you rights and standing up for yourself. Consequently, you are losing your credibility and standing with others. Alternatively, the dream means that you need to be more aggressive.<\/p><p>To dream that you are outwitted by a rival suggests that you have neglected your duties or abandoned your responsibilities.<\/p>"
    },
    {
        "title": "River",
        "desc": "<p>To see a clear and calm river in your dream indicates that you are just going with the flow. You are allowing your life to float away. It is time to take a more decisive role in directing your life. Alternatively, a river symbolizes joyful pleasures, peace, prosperity and fertility. If you are crossing a river in your dream, then it represents an obstacle or issue that you need to deal with in order to move closer toward your goal. It is also reflective of a new stage in your life.If the river is muddy, then it indicates that you are in turmoil.<\/p><p>To see a raging or an overflowing river in your dream signifies that your life is feeling out of control. You arefeeling emotionally unsettled. Alternatively, this dream means you are ready to confront life's challenges and life's twists and turns.To see a contaminated river in your dream implies that you are feeling tired and lethargic. It may also be a sign of some illness.<p>To dream that a river is comprised of flowing red chili refers to the raw emotion and intense passion or anger that is flowing through you and yearning to be expressed. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "To dream that you are bathing in a river represents purification and cleansing.",
        "desc": "<p>Riverbed<\/p><p>To see a dried up riverbed in your dream means that you are devoid of emotions. Perhaps something has made you emotionally numb.<\/p>"
    },
    {
        "title": "Roaches",
        "desc": "<p>*Please see<a href=\"http:\/\/dreammoods.com\/dreamdictionary\/c3.htm#Cockroach\">Cockroach.<\/p><p>Road<\/p><p>To see a road in your dream refers to your sense of direction and how you are pursuing your goals. If the road is winding, curvy, or bumpy in your dream, then it suggests that you will encounter many obstacles and setbacks toward achieving your goals. You may be met with unexpected difficulties. If the road is dark, then it reflects the controversial or more frightening choices which you have made or are making.<\/p><p>If the road is smooth and bordered by trees or flowers, then it denotes a steady progress and steady climb up the social ladder. If the road is straight and narrow, then it means that your path to success is going as planned.<\/p><p>Dreaming of a dirt or gravel road implies that the path toward your goals will take some effort and work. It may take perseverance and time before you see progress. Alternatively, the dream suggests that you are paving the way. You are doing all the work to make it easier for others later on.<\/p><p>To see an unknown road in your dream represents a path that has not been ventured. You are setting a new precedence for something.<\/p><p>To dream that a threatening creature is on a road parallels a hostile situation\/person you are encountering in your waking life. It is an obstacle that you need to overcome, no matter how intimidating the situation or person may appear.<\/p><p>To dream that the road is flooded implies that you are letting your emotions stop you have moving toward your goals. You are being too subjective in some matter.<\/p><p>*Please see also<a href=\"http:\/\/dreammoods.com\/dreamdictionary\/s4.htm#Street\">Street.<\/p>"
    },
    {
        "title": "Road Rage",
        "desc": "<p>To dream that you have road rage indicates that your emotions are out of control. You feel that someone is out to get you. You need to find a better way to express your feelings or you or someone will get hurt.<\/p>"
    },
    {
        "title": "Road Signs",
        "desc": "<p>To see road signs in your dream represent some advice and message that your subconscious is trying to convey. The road sign may be trying to guide you toward certain decisions. Consider what the road sign is saying and how you need to apply its message to an aspect of your daily life.<\/p><p>*Please See<a href=\"http:\/\/dreammoods.com\/dreamdictionary\/s4.htm#StopSign\">Stop Sign or<a href=\"http:\/\/dreammoods.com\/dreamdictionary\/u.htm#U-Turn\">U-Turn.<\/p>"
    },
    {
        "title": "Road Trip",
        "desc": "<p>To dream that you are taking a road trip signifies your life journey and the decisions you make in life. If the road trip is a smooth one, then it indicates that you are transitioning smoothly through life's events. If the road trip is chaotic, then it denotes the many obstacles and issues in your waking life. Consider the destination and the stops that you make on your road trip.<\/p>"
    },
    {
        "title": "Roadblock",
        "desc": "<p>To see a roadblock in your dream signifies obstacles in your business or personal life. You are experiencing some setbacks toward your goals. You just need to be more persistent and diligent in trying to overcome the obstacles that come your way.<\/p>"
    },
    {
        "title": "Roadkill",
        "desc": "<p>To see roadkill in your dream represents unavoidable death. The death may be a symbolic death representing an end to a habit, behavior or idea. It is time to let go of old habits and put those ideas to rest, as you are only prolonging the inevitable. Alternatively, roadkill suggests that there is some issue in your past that is hindering your pursuit of your goals.<\/p><p>To dream that an animal is about to become roadkill indicates loss of control in some aspect of your life. Consider the type of animal that is hit for clues as to what aspect of your life is out of control.<\/p>"
    },
    {
        "title": "Roadrunner",
        "desc": "<p>To see a roadrunner in your dream represents mental agility. You tend to run toward one idea after another. At the same time, you also have the ability to stop at a moment's notice to consider your next plan of action.<\/p>"
    },
    {
        "title": "Roadwork",
        "desc": "<p>To see roadwork in your dream represents the many obstacles, setbacks, and delays that you will need to overcome as your move toward your goals. You need to allow yourself more time to complete your goals. The dream may also be analogous to the complications and difficulties that you are experiencing in your waking life.<\/p>"
    },
    {
        "title": "Roar",
        "desc": "<p>To make or hear a roar in your dream symbolizes repressed aggression and anger. You may be holding back these negative feelings in your waking life, but they need to be expressed and let out.<\/p>"
    },
    {
        "title": "Roast",
        "desc": "<p>To see or eat roast in your dream refers to comfort and warmth in the home.<\/p><p>To dream that you are roasting something may be a pun on &quot;roasting someone&quot;. Perhaps you need to learn to laugh at yourself.<\/p>"
    },
    {
        "title": "Robbery",
        "desc": "<p>To dream that you have been robbed indicates that you are experiencing an identity crisis or are suffering from some sort of loss in your life. Alternatively, the dream means that someone has stolen your success or has taken credit for something you did. Perhaps you feel that you have been treated unfairly.<\/p><p>If you witness an armed robbery in your dream, then it means that you are feeling helpless in a situation. You want to take action but are afraid to speak out. Alternatively, the dreams points to a lack of stability in your life.<\/p><p>To dream that you are committing armed robbery represents suppressed anger. You feel that you are only taking what you are entitled to.<\/p>"
    },
    {
        "title": "Robe",
        "desc": "<p>To see or wear a robe in your dream signifies personal issues that you need to confront. The dream may also refer to your secret desire to let loose.<\/p>"
    },
    {
        "title": "Robin",
        "desc": "<p>To see a robin in your dream represents new beginnings. It is a time for growth. You are feeling invigorated and inspired by the possibilities that are out there for you. Alternatively, a robin signifies self-sacrifice. The dream may also be a pun on someone whose name is Robin.<\/p>"
    },
    {
        "title": "Robin Hood",
        "desc": "<p>To see or dream that you are Robin Hood indicates your compassion for those who are less fortunate. It refers to your giving and charitable nature.<\/p>"
    },
    {
        "title": "Robot",
        "desc": "<p>To see a robot in your dream indicates that you are going about life in a mechanical, methodical and rigid way. You have lost the ability to express your feelings. Alternatively, a robot symbolize the way you view your working life.<\/p>"
    },
    {
        "title": "Rock Climbing",
        "desc": "<p>To dream that you are rock climbing symbolizes your struggle, determination, and ambition. You are not letting any obstacles get in the way of your goal. Additionally, the dream indicates that you have an edge over others.<\/p>"
    },
    {
        "title": "Rock Slide",
        "desc": "<p>To see a rock slide in your dream suggests that you are experiencing a &quot;rocky&quot; period in your waking life. You are overwhelmed with pressure. You feel like the weight of life's daily demands is crumbling down on you.<\/p>"
    },
    {
        "title": "Rock Star",
        "desc": "<p>To dream that you are a rock star indicates your desire to be looked up to. You want to be admired and wanted. Perhaps you are lacking a sense of belonging or excitement in your waking life or you want to escape the mundaneness Alternatively, the dream maybe be a metaphor that you need to be a &quot;rock&quot;. In other words, you need to gain a more solid footing of a situation.<\/p><p>To see a rock star in your dream signifies the beat of your life.<\/p>"
    },
    {
        "title": "Rocket",
        "desc": "<p>To see a rocket in your dream indicates that your plans or ideas will soon be taking off in a big way. You are experiencing a higher level of awareness. All your hard work is paying off. Alternatively, you feel that things are going too fast. If a rocket is taking off, then it is symbolic of male sexuality.<\/p>"
    },
    {
        "title": "Rocking",
        "desc": "<p>To dream that you are rocking yourself suggests that you are regressing into childlike behavior. The dream may be pointing out your juvenile attitude. Alternatively, the dream indicates your need to be comforted and reassured.<\/p>"
    },
    {
        "title": "Rocking Chair",
        "desc": "<p>To dream that you or someone is sitting in a rocking chair signifies a life of ease, comfort and relaxation. You have no worries.<\/p><p>To see an empty rocking chair in your dream represents sadness or quiet contemplation. If you dream that an empty rocking chair is chasing you, then it points to your tenacity and refusal to give up. It may also mean that you are not confronting an issue from your past. The empty rocking chair may be a reminder of someone in your past who sat in a rocking chair; perhaps you have some unfinished business between this person.<\/p>"
    },
    {
        "title": "Rocking Horse",
        "desc": "<p>To see a rocking horse in your dream indicates that you are feeling stuck in some area of your life. You are not making any progress toward your goals. Alternatively, a rocking horse may be memories of your childhood. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Rock",
        "desc": "<p>To see a rock in your dream symbolizes strength, permanence, stability and integrity, as conveyed in the common phrase &quot;as solid as a rock&quot;. The dream may also indicate that you are making a commitment to a relationship or that you are contemplating some changes in your life that will lay the groundwork for a more solid foundation. Alternatively, a rock represents stubbornness, disharmony and unhappiness.<\/p><p>To dream that you are climbing a rock signifies your determination, ambition and struggle. If the rock is particularly steep, then it refers to obstacles and disappointments.<\/p><p>Dreaming that you are hit by a rock or that someone is throwing rocks at you represents insults and criticism that is aimed toward you. It also points to a situation where you are caught off guard.<\/p><p>If you are walking on rocks in your dream, then it indicates that you are on shaky ground. You may be involved in an uneasy situation. The dream may also be telling you not to get too comfortable or too arrogant.<\/p><p>*Please also see<a href=\"http:\/\/dreammoods.com\/dreamdictionary\/s4.htm#Stones\">Stones.<\/p>"
    },
    {
        "title": "Rodent",
        "desc": "<p>To see a rodent in your dream symbolizes filth, dirtiness, repulsiveness and death.There is a negative influence in your life. Please look up the significance of the specific rodent for additional meaning.<\/p>"
    },
    {
        "title": "Rodeo",
        "desc": "<p>To dream that you are at the rodeo suggests that you need to take control of your animalistic forces and primal urges.<\/p>"
    },
    {
        "title": "Rogue",
        "desc": "<p>To dream that you are going rogue indicates that you are pushing the limits. You are lacking restraint and control in your life.<\/p>"
    },
    {
        "title": "Roughneck",
        "desc": "<p>To see a roughneck in your dream represents hard work and dedication. You are trying to work through a difficult time.<\/p><p>Dreaming that you are a roughneck implies that you are keeping your emotions in check or that you are not fully expressing them.<\/p>"
    },
    {
        "title": "Roller Blades",
        "desc": "<p>To dream that you are on roller blades suggests that you are moving rapidly through life with tremendous ease and determination. You are experiencing a sense of liberation and freedom.<\/p>"
    },
    {
        "title": "Roller Coaster",
        "desc": "<p>To dream that you are riding a roller coaster represents life's frequent ups and downs. You are experiencing erratic behavior brought on by yourself or a situation.<\/p><p>Dreaming that a roller coaster is missing rails implies that you are lacking a support system in your waking life.<\/p><p>If you dream that you are stuck on a roller coaster or that the roller coaster has broken down, then it implies that a project or relationship has lost its momentum. Perhaps what started out as something fun or exciting has slowed down.Alternatively, a broken-down roller coaster refers to a project or plan that was poorly thought out.<\/p>"
    },
    {
        "title": "Roller Derby",
        "desc": "<p>To watch or be in a roller derby in your dream means that you need to show more determination in achieving your goals. You cannot always be nice if you want to move ahead. Sometimes you need to go for it.<\/p>"
    },
    {
        "title": "Roller Skates",
        "desc": "<p>To dream that you are on roller skates implies that you are progressing toward your goals at a steady and leisurely pace. If you are wobbly on roller skates, then it means that you are unsure of your direction in life.<\/p><p>To see someone on roller skates in your dream refers to someone in your life who may be &quot;skating&quot; around some issue. It is time to confront this person on the issue.<\/p><p>To see or buy roller skates in your dream signifies balance or lack of balance in your life. It also represents innocence and carefree attitude.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s3.htm#Skating\">Skating.<\/p>"
    },
    {
        "title": "Rolling Credits",
        "desc": "<p>To see rolling credits in your dream represents recognition for your work. You are looking for acknowledgement for a job well done.<\/p><p>To see your name in the rolling credits in your dream symbolizes your confidence in your own ability. You believe that you can succeed in whatever you pursue.<\/p>"
    },
    {
        "title": "Rolling Pin",
        "desc": "<p>To see or use a rolling pin in your dream represents your creative ability. You are feeling productive and optimistic about some new project.<\/p><p>To dream that you are using a rolling pin as a weapon indicates that you are being too hasty about a decision. You are on the verge of losing your temper.<\/p>"
    },
    {
        "title": "Roly Poly",
        "desc": "<p>To see a roly poly in your dream indicates that you tend to keep to yourself and wallow in your emotions. Alternatively, dreaming of a roly poly means that you are feeling misunderstood.<\/p>"
    },
    {
        "title": "Roman Numerals",
        "desc": "<p>To see roman numerals in your dream denote the initials of someone in your waking life. It may also correspond to the actual meaning of the letter. The Roman numeral may also share the same significance as the Arabic numeral.<\/p><p>I - symbolizes yourself<\/p><p>II - it may represent the number 2 or 11.<\/p><p>V- symbolizes the number 5 or victory.<\/p><p>X - symbolizes the number 10 or the letter X.<\/p>"
    },
    {
        "title": "Romance",
        "desc": "<p>To dream of romance suggests that you need to be more affectionate in your waking life. Perhaps you are longing for more romance in your personal relationship.<\/p>"
    },
    {
        "title": "Rome",
        "desc": "<p>To dream that you are going to Rome or are in Rome signifies love, death, destiny or fate. Consider the phrases &quot;Rome wasn't built in a day&quot; or &quot;when in Rome, do as the Romans do&quot; or &quot;all roads lead to Rome&quot;. Think about how these adages are applicable to some aspect of your walking life.<\/p><p>Dreaming of Ancient Rome symbolizes power, domination and limitless goals. You are expanding your awareness.<\/p>"
    },
    {
        "title": "Romeo And Juliet",
        "desc": "<p>To dream that you are Romeo indicates that you are in touch with your emotions. It also implies that you go after your desires.<\/p><p>To dream that you are Juliet suggests that something that you desire is being kept from you.<\/p><p>To see Romeo and Juliet in your dream represents the battle of love and hate. Perhaps you are having to deal with these feelings in some waking situation.<\/p>"
    },
    {
        "title": "Roof",
        "desc": "<p>To see a roof in your dream symbolizes a barrier between two states of consciousness. You are protecting or sheltering your consciousness, mentality, and beliefs. The dream provides an overview of how you see yourself and who you think you are.<\/p><p>To dream that you are on top of a roof symbolizes boundless success. If you fall off the roof, then it suggests that you do not have a firm grip and solid foundation on your advanced position. If you dream that the rooftops are falling away from you as you cross from rooftop to rooftop, then it implies that there is no turning back once you move forward with your goals. You need to stay the course and continue to move forward. If you are re-roofing in your dream, then it suggests that you need to raise your goals and set your sights higher.<\/p><p>To dream that the roof is leaking represents distractions, annoyances, and unwanted influences in your life. New information is slowly revealing itself to you. Something is finally getting through to you. Alternatively, the dream means that someone is imposing and intruding their thoughts and opinions on you. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "To dream that the roof is falling in indicates that your high ideals are crashing down on you. Perhaps you need to rethink the high expectations or goals you have set for yourself.",
        "desc": "<p>Dreaming that the sky lowers itself and touches the roof of your house suggests that you may be setting your sights or goals too low. Perhaps you are lowering your standards. Alternatively, to dream that the sky is touching your roof represents spiritual guidance. Something or someone is looking out for you.<\/p>"
    },
    {
        "title": "Rook",
        "desc": "<p>To see a rook in your dream represents your ability to move and traverse through life with relative ease. Alternatively, the dream means that you are going in to many direction. You are too scattered.<\/p>"
    },
    {
        "title": "Room",
        "desc": "<p>To dream that you are in a room represents a particular aspect of yourself or a specific relationship. Dreams about various rooms often relate to hidden areas of the conscious mind and different aspects of your personality. If the room is welcoming or comfortable, then it signifies opulence and satisfaction in life. If you see a dark or confined room, then it denotes that you feel trapped or repressed in a situation.<\/p><p>To dream that you find or discover a new room suggests that you are developing new strengths and taking on new roles. You are growing emotionally. Consider what you find in the discovered room as it may indicate repressed memories, fears, or rejected emotions.Alternatively, such rooms are symbolic of neglected skills or rejected potential.<\/p><p>Dreaming that you are building or adding a room means that you are experiencing a surge of energy and renewed confidence. You have a different outlook on life and are moving toward a new direction in life. Alternatively, to build a room in your dream is symbolic of an expansion to your family.<\/p><p>To dream that you are in an empty white room indicates a fresh start. It is like a blank canvas where you want to start life anew. Alternatively, the dream means that you are trying to isolate yourself. You do not want any outside influences.<\/p><p>Dreaming that you are in a dark room with no doors signify ignorance. You are isolating yourself. Alternatively, the dream means that you refuse to be influenced by outside forces.<\/p><p>To dream of a dirty or messing room refers to an aspect of yourself that you are ashamed of or are refusing to acknowledge.<\/p><p>To dream of a yellow room suggests that you need to use your mind. You are feeling stimulated mentally.<\/p><p>*Please see also<a href=\"http:\/\/dreammoods.com\/dreamdictionary\/b2.htm#Bathroom\">Bathroom or<a href=\"http:\/\/dreammoods.com\/dreamdictionary\/k.htm#kitchen\">Kitchen.<\/p>"
    },
    {
        "title": "Roommate",
        "desc": "<p>To see your old roommate in your dream suggests that there is a lesson that you need to acknowledge from that former relationship and apply it to a current life situation. Perhaps you need to incorporate aspects of your ex-roommate with your own self.<\/p><p>To dream of your current roommate indicates that there are issues that you are not confronting with her or him.<\/p><p>To dream that you are looking for a roommate suggests that you are ready to incorporate a new and unknown component into your life. You are receptive to change.<\/p><p>If you don't have any roommates, but dream that you do, then it means that you are looking for a friend or for companionship. You want a friend who you can share your feelings with, who you can be open with and who you can talk to about anything.<\/p>"
    },
    {
        "title": "Rooster",
        "desc": "<p>To see a rooster in your dream symbolizes masculinity, pride, valor, cockiness and arrogance. It indicates that you or someone is being a show-off with little or no regards for others.Alternatively, the dream highlights your eccentricities or wittiness. The dream may also be a pun on the penis.<\/p><p>To hear a rooster in your dream signifies bragging and self-glorification.<\/p><p>To see roosters fighting in your dream suggests that you are involved in some bitter rivalry.<\/p>"
    },
    {
        "title": "Root Beer",
        "desc": "<p>To see or drink root beer in your dream signifies being happy and carefree. Consider the name of the root beer for further significance of the dream.<\/p>"
    },
    {
        "title": "Roots",
        "desc": "<p>To see plant or tree roots in your dream symbolize the depths and core of your subconscious mind and soul. It represents your values and belief system. Alternatively, roots denote your family ties and bonds. You may be searching into your past. Or perhaps you need to get to the root of some problem in your waking life. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "To dream that you are pulling up roots suggests that you are ready to move on from the past. You have to let go of the relationship that is holding you back.",
        "desc": "<p>Rope<\/p><p>To see a rope in your dream represents your connection and attachment to others. It is symbolic of what is holding your relationship together. Alternatively, a rope signifies bondage, restriction and captivity.<\/p><p>To dream that you are walking on a rope indicates that you are in a very precarious situation. You need to proceed carefully and weigh all the pros and cons of your decisions.<\/p><p>To dream that you are climbing up a rope represents your determination to succeed and overcome adversity. It may be analogous to your climb to the top. If you are climbing down a rope, then it indicates that you are experiencing disappointments and decline in some professional progress.<\/p><p>To dream that you are tied up in ropes suggests that you are letting your heart guide you, despite your better judgment.<\/p><p>To dream that you are splicing a rope indicates that you are reaching out to someone who needs your help.<\/p>"
    },
    {
        "title": "Rosary",
        "desc": "<p>To see or hold a rosary in your dream symbolizes comfort, solace, or satisfaction. It is also connected to the act of giving and asking.<\/p><p>If you dream of someone giving you a rosary, then it highlights your compassion for others. Since you are always there for your loved ones, it is time they reciprocate.<\/p>"
    },
    {
        "title": "Rose Garden",
        "desc": "<p>To dream that you are in a rose garden indicates that you are feeling satisfied and happy about some waking situation.<\/p>"
    },
    {
        "title": "Rosebush",
        "desc": "<p>To see a rosebush in your dream indicates that you are involved in some prickly situation.<\/p>"
    },
    {
        "title": "Rosemary",
        "desc": "<p>To see rosemary in your dream symbolizes sadness and remembrance. You are reflecting on something in your dream.<\/p>"
    },
    {
        "title": "Roses",
        "desc": "<p>To see roses in your dream signify faithfulness in love and the coming of joy in some area of your life. Roses also symbolize love, passion, desire, femininity, unity, and romance, particularly if they are red roses. If you see a white rose, then it symbolizes virginity, pureness, and secrecy. It you see a yellow rose, then it refers to infidelity, jealousy, or friendship. If the rose is pink, then it means fresh love and new romance. According to Freud, the rose represents the female genitalia.<\/p><p>To see withered roses in your dream refers to the parting or absence of a loved one. Alternatively, it is symbolic of death or an end to something.<\/p><p>Dreaming that a red rose is melting into a clear liquid means that you are feeling deceived by love. It is symbolic of faked or forced passion.<\/p><p>To smell roses in your dream denote happiness and pleasure. The dream is telling you that you need to slow down and smell the roses or else you will miss out on some opportunity or event in your life.<\/p><p>To see thorny roses in your dream suggest that you are having difficulties or issues in your personal relationship. Alternatively, the dream indicates that you need to overcome some sticky or prickly situation before you can reap the benefits, as represented by the rose.<\/p><p>To see burning roses in your dream symbolizes your passion. However, your passion can also destroy if not kept in check. You become consumed by your passion.<\/p>"
    },
    {
        "title": "Rosette",
        "desc": "<p>To dream that you or someone is wearing rosettes indicate that you are wasting your time on frivolous pursuits. You will regret the opportunities that you are missing out on.<\/p>"
    },
    {
        "title": "Rotate",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s4.htm#Spinning\">Spinning.<\/p><p>Rotten<\/p><p>To dream that something is rotten suggests that you are wasting away your potential. You have failed to make use of the opportunities that have come your way.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/s4.htm#Spoiled\">Spoiled.<\/p>"
    },
    {
        "title": "Rottweiler",
        "desc": "<p>To see a rottweiler in your dream symbolizes confidence, protection, and courage. If the rottweiler is growling, then it indicates that you are experiencing some inner conflict. There is something that you are afraid to confront.<\/p>"
    },
    {
        "title": "Rouge",
        "desc": "<p>To dream that you are wearing or putting on rouge symbolizes some form of deception. You are trying to get your way by tricking others. If rouge is rubbing off of your face, then it suggests that your true self is being revealed. Your intentions will be made known.<\/p><p>To see others wearing rouge in your dream indicates that you are being manipulated and deceived.<\/p>"
    },
    {
        "title": "Roulette",
        "desc": "<p>To dream that you are playing roulette indicates that you are ready to take a chance. You to carefully consider the consequences of your actions.<\/p>"
    },
    {
        "title": "Round Table",
        "desc": "<p>To see a round table in your dream symbolizes wholeness and equality. It means that you have the same power and strength as those around you.<\/p>"
    },
    {
        "title": "Roundabout",
        "desc": "<p>To see a roundabout in your dream suggests that you are not approaching your goals in a direct manner. Perhaps you feel that you are going around in a circle or that you are stuck with a decision that needs to be made.<\/p>"
    },
    {
        "title": "Rowboat",
        "desc": "<p>Todream that you are in a rowboat symbolizes hard work and perseverance. You are coping with your problems and emotions in your own way and at your own pace. Consider the condition of the water.<\/p>"
    },
    {
        "title": "Rowing",
        "desc": "<p>To dream that you are rowing indicates a hard and difficult journey or path. You may be going about things the hard way. However, you still display much confidence in your abilities. If you stay the course, then you will accomplish your tasks and realize your goals. Alternatively, rowing represents your spiritual progress and emotional journey.<\/p>"
    },
    {
        "title": "Royalty",
        "desc": "<p>To see a member of royalty in your dream represents spiritual strength, grace, power, extravagance, as well as ruthlessness. Alternatively, royalty represents your desires of dominating and commanding others. Look up the specific member of royalty for additional meaning.<\/p><p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/k.htm#king\">King,<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p3.htm#prince\">Prince,<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p3.htm#Princess\">Princess, or<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/q.htm#queen\">Queen in the DreamM00ds dictionary for additional significance.<\/p>"
    },
    {
        "title": "Rub",
        "desc": "<p>To dream that you are rubbing something suggests that you are looking for some comfort and support. You are feeling nervous or uneasy about a decision or event in your waking life. Alternatively, rubbing symbolizes your sensual side and intimate desires.<\/p>"
    },
    {
        "title": "Rubber",
        "desc": "<p>Tosee rubber in your dream represents your adaptability and versatility to various situations.Alternatively, the dream may be a metaphor for a condom. Perhaps you dream relates to a sexual issue.<\/p><p>To dream that you or someone is hit with a rubber object indicates that things literally bounce off of you. You are unaffected by what is going around you or what others are saying about you.<\/p>"
    },
    {
        "title": "Rubber Band",
        "desc": "<p>To see or use a rubber band in your dream suggests that you need to be more accommodating to others. You need to expand your attitude, imagination and way of thinking.<\/p><p>To dream that a rubber band snaps indicates that you have outstretched yourself into too many responsibilities.You may be overextended.<\/p>"
    },
    {
        "title": "Rubber Chicken",
        "desc": "<p>Tosee a rubber chicken in your dream indicates that you are being too serious and need to lighten up. It is okay to be silly sometimes.<\/p>"
    },
    {
        "title": "Rubber Duck",
        "desc": "<p>To see or play with a rubber duck in your dream represents your playful attitude or your child-like emotions. You are lacking depth and compassion in the way you are expressing your feelings. In other words, your emotions are very superficial and shallow.<\/p>"
    },
    {
        "title": "Rubbish",
        "desc": "<p>To see rubbish in your dream may be a metaphor for something that is nonsensical.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/g.htm#Garbage\">Garbage.<\/p>"
    },
    {
        "title": "Rubble",
        "desc": "<p>To see a pile of rubble in your dream symbolizes unwanted or rejected aspects of yourself. Alternatively, the dream points to a self-destructive behavioral pattern. Aspects of your life are falling apart.<\/p>"
    },
    {
        "title": "Rube Goldberg",
        "desc": "<p>To see or make a Rube Goldberg machine suggests that you are needless complicating a simple issue. You need to be more direct in your approach. Stop going around in circles.<\/p>"
    },
    {
        "title": "Rubik's Cube",
        "desc": "<p>To see or play with Rubik's cube in your dream represents a problem or challenge that you are being confronted with in your walking life. You are looking for order. If you solve the cube, then it suggests that will overcome your problems.<\/p>"
    },
    {
        "title": "Ruby",
        "desc": "<p>To see a ruby in your dream symbolizes passion, vitality and sexual desire. Be cautious in affairs of the heart as they may be fleeting. Alternatively, consider the proverb, &quot;wisdom is better than rubies&quot;, which means that wisdom and knowledge is better than wealth and money. The dream may also be a metaphor for someone who is named Ruby.<\/p><p>To see ruby slippers in your dream represent your path to spiritual enlightenment. You need to venture out on a journey in order to find who you are as a person.<\/p>"
    },
    {
        "title": "Rudder",
        "desc": "<p>Tosee a rudder in your dream signifies the path that your life is taking and the decisions you are making throughout this path.<\/p>"
    },
    {
        "title": "Rue",
        "desc": "<p>To see rue in your dream symbolizes remembrance, grief and repentance. Consider the phrase &quot;to rue the day&quot; indicating regret for something that you have done.<\/p>"
    },
    {
        "title": "Rug",
        "desc": "<p>To see a rug in your dream suggests that you are trying to shield yourself from some harsh reality. Perhaps there is something that you are trying to hide. Consider the design and condition of the rug. If it is old and worn, then it suggests that you are being taken advantage of. You feel you are being stepped on by others.<\/p>"
    },
    {
        "title": "Rugby",
        "desc": "<p>To watch or play rugby in your dream refers to your overly competitive and aggressive nature. Alternatively, dreaming about rugby indicates that you are experiencing a lot of resistance toward your goals. There are many forces working against you.<\/p>"
    },
    {
        "title": "Ruins",
        "desc": "<p>Tosee ruins in your dream suggest that you are neglecting aspects of your life or that it is falling apart. You feel you are self-destructing. It is time to get on the right path.<\/p>"
    },
    {
        "title": "Ruler",
        "desc": "<p>To see a ruler in your dream indicates your concerns about not measuring up to the standards of others. Alternatively, the dream means that you need to be careful in making a decision or judgment.<\/p>"
    },
    {
        "title": "Rules",
        "desc": "<p>To dream that you are breaking the rules indicate you feelings of frustrations. You feel that someone or something is treating you unfairly. Alternatively, the dream indicates that you need to stand up for yourself and assert your opinion. Sometimes you need to go against the system.<\/p><p>To dream that you are obeying the rules symbolize integrity.<\/p><p>To dream that you are making rules suggest that you need more discipline in your waking life.<\/p><p>To dream that you are disputing the rules symbolize internal conflict and personal struggles.<\/p>"
    },
    {
        "title": "Rum",
        "desc": "<p>To drink rum in your dream indicates a lack of class and morality. You may be living a life of excess and overindulging in certain things.<\/p>"
    },
    {
        "title": "Rumor",
        "desc": "<p>To hear a rumor in your dream signifies a hidden message from your subconscious. Alternatively, the dream may be telling you that you should not believe everything you hear. You need to do your own research and get a first hand account on things before making a judgment call.<\/p><p>To spread a rumor in your dream signifies your personal insecurities.<\/p>"
    },
    {
        "title": "Rumpelstiltskin",
        "desc": "<p>To see Rumpelstiltskin in your dream refers to a repressed or negative aspect of subconscious that is holding you back. You need to acknowledge and confront it. Alternatively, dreaming of Rumpelstiltskin signifies the hefty price you have to pay in exchange for what you desire.<\/p>"
    },
    {
        "title": "Runaway",
        "desc": "<p>To dream that you are a runaway indicates that you are struggling with issues of belonging and acceptance. Alternatively, the dream means that you are refusing to confront some issue or situation.<\/p><p>If you dream that you are running away from home, then it indicates that you feel misunderstood or mistreated by your family. You are longing for a better or happier place.<\/p>"
    },
    {
        "title": "Rune Stones",
        "desc": "<p>To see or cast runes in your dream represent magic. It suggests that you are leaving your choices and path in life to fate. Consider the significance of the symbol on the rune and how it parallels your life.<\/p>"
    },
    {
        "title": "Running",
        "desc": "<p>To dream that you are running away from someone indicates an issue that you are trying to avoid. You are not taking or accepting responsibility for your actions. In particular, if you are running from an attacker or any danger, then it suggests that you are not facing and confronting your fears.<\/p><p>To dream that something or someone is running towards you refers to your willingness to confront any situation head on. You need to analyze the significance of what is running towards you.If you are the one running towards someone or something, then it refers to your determination to go after what you want. Consider who or what you are running towards for additional analysis.<\/p><p>To dream that you are trying to run but cannot make your feet move as fast as you want them to signifies lack of self-esteem and self-confidence. It may also reflect your actual state of REM paralysis during the dream state.<\/p><p>To dream that you are running alone refers to your determination and motivation in the pursuit of your goals. You will find success and rise above those around you. Alternatively, the dream may mean that you need to hurry up in making a decision.<\/p><p>To dream that you are running with someone signifies cooperation.<\/p>"
    },
    {
        "title": "Runway",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c2.htm#Catwalk\">Catwalk.<\/p><p>Rush<\/p><p>To dream that you are in a rush indicates that you need to better manage your time. You feel that you do not have the time to do all the things you want to do. The dream is also representative of the pressure you are putting on yourself. You feel unprepared. Perhaps, the dream is telling you to slow down.<\/p>"
    },
    {
        "title": "Russia",
        "desc": "<p>To dream of Russia implies that you are experiencing cold, hard times. Consider your own personal associations with the country. Alternatively, the dream may be a pun on &quot;rush&quot;. Perhaps you need to get moving on some decision or goal. You need to hurry along in some area of your life.<\/p>"
    },
    {
        "title": "Rust",
        "desc": "<p>To see rust in your dream signifies neglect, disappointments, depression or old age. Rust also suggests that you are not utilizing your talents and potential.<\/p>"
    },
    {
        "title": "RV",
        "desc": "<p>To see an RV in your dream means that you are feeling empowered. Alternatively, the dream is a metaphor to enjoy life to the fullest. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Rye",
        "desc": "<p>To see rye or fields of rye in your dream symbolizes prosperity in your future.<\/p><p>To see or eat rye bread in your dream refers to a cheerful and tranquil home.<\/p>"
    }
]