[
    {
        "title": "S",
        "desc": "<p>To see the letter &quot;S&quot; in your dream suggests that there is something that needs your attention.<\/p>"
    },
    {
        "title": "Sabotage",
        "desc": "<p>To dream that you have been sabotaged indicates that there is something that you are ignoring or overlooking in your waking life.<\/p><p>To dream that you are sabotaging something or someone indicates that an overwhelming anxiety is threatening the boundary between your subconscious and your ego. You are feeling conflicted between right and wrong.Alternatively, the dream means that you need to get rid of your old attitudes and former ways of thinking<\/p>"
    },
    {
        "title": "Sack",
        "desc": "<p>To see a sack in your dream symbolizes the womb and your sense of security. Alternatively, it represents your burdens and responsibilities.<\/p>"
    },
    {
        "title": "Sackcloth",
        "desc": "<p>To wear a sackcloth in your dream represents humility and humbleness. It also indicates that you need to repent for some misdeed that you have committed.<\/p>"
    },
    {
        "title": "Sacred",
        "desc": "<p>To dream that something is sacred symbolizes the things that you hold close and value. You have invested time and energy into its development and it is paying off.<\/p>"
    },
    {
        "title": "Sacrifice",
        "desc": "<p>To dream that you are being sacrificed signifies your tendency to punish yourself. The dream may parallel waking sentiments where you feel that others do not appreciate your talents and efforts or that you are not being recognized for what you have given up.<\/p><p>Dreaming that you are making a self-sacrifice means that you need to eliminate certain aspects of your life and make time and space for more productive and rewarding experiences.<\/p><p>To see an animal being sacrificed in your dream indicates that you are ready to give up your basic, carnal desires for spiritual pursuits and enlightenment.<\/p>"
    },
    {
        "title": "Sad",
        "desc": "<p>To dream that you are sad suggests that you need to learn from your disappointments and just be happy. Try not to dwell on the negative. The dream may be a reflection of how you are feeling in your waking life.<\/p><p>To dream that someone else is sad may be a projection of your own feelings.<span id=\"ucPreviewMsg_lblMessage0\" class=\"PreviewMsgText visualIEFloatFix\">Perhaps you are sad about something that happened with this person. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Saddle",
        "desc": "<p>To see a saddle in your dream suggests that you need to freely pursue your goals. Go for it and do not let anyone hold you back from achieving your goals.<\/p><p>To dream that you are sitting on a saddle indicates that you will rise to a position of prominence and power. You need to exercise more control over someone or some situation.<\/p>"
    },
    {
        "title": "Sadism",
        "desc": "<p>To dream of sadism indicates repressed anger, often from childhood. You may still be punishing yourself for your misdeeds or past actions.<\/p>"
    },
    {
        "title": "Sagittarius",
        "desc": "<p>To dream that someone is a Sagittarius represents your high ideals. You are outspoken, adventurous, goal-oriented and optimistic in your thinking. The dream may mean that you are trying to break from your routine.<\/p>"
    },
    {
        "title": "Safari",
        "desc": "<p>To dream that you are on a safari represents freedom from societal norms and rules. You are trying to break free from the confines of civilization.<\/p>"
    },
    {
        "title": "Safe",
        "desc": "<p>To see a safe in your dream indicates that you are hiding your sense of self worth and self value. It also refers to your security and secrets. Alternatively, the dream may also be a pun on feeling &quot;safe&quot;.<\/p><p>To see an empty safe signifies loss or lack.<\/p>"
    },
    {
        "title": "Safe Haven",
        "desc": "<p>To dream of a safe haven place indicates that you have a positive outlook in life. No matter how bleak circumstances may currently be, you know deep inside that things will work itself out. Hang in there. Alternatively, the dream implies that you are trying to escape from reality. You do not want to think about your current issues.<\/p>"
    },
    {
        "title": "Safety Pin",
        "desc": "<p>To see a safety pin in your dream indicates that a situation is on the verge of falling apart causing anxiety or fear. You feel that the livelihood of the relationship depends on you.<\/p>"
    },
    {
        "title": "Saffron",
        "desc": "<p>To see or smell saffron in your dream signifies magic, humility and humbleness. Due to its color, it is also symbolic of love and passion.<\/p>"
    },
    {
        "title": "Sage",
        "desc": "<p>To see sage in your dream signifies wisdom, frugality and practicality.<\/p>"
    },
    {
        "title": "Sailboat",
        "desc": "<p>To see a sailboat in your dream represents your emotional persona and how you navigate through the various situations in your life. You need to learn to adapt to ever-changing situations.<\/p>"
    },
    {
        "title": "Sailing",
        "desc": "<p>To dream that you are sailing represents how your life is going and how you are able to handle life's problems.You are in control of your life. The dream may be metaphor that things are &quot;smooth sailing.&quot; If you are sailing through the rough seas, then it means that you will overcome life's difficulties. If you are sailing against the wind, then it indicates that you are experiencing some struggles in your waking life.<\/p>"
    },
    {
        "title": "Sailor",
        "desc": "<p>To see a sailor in your dream signifies your desires for adventure, freedom and exploration. You are ready to venture into deeper waters, particularly in a personal relationship. Alternatively, the dream indicates that you are confronting some emotional issue or dealing with your subconscious.<\/p>"
    },
    {
        "title": "Saint",
        "desc": "<p>To see a saint in your dream indicates that a special message is being given to you from the spiritual realm. Alternatively, it symbolizes genuine goodness and idealistic notions. You are always willing to help others. Or perhaps it is you who is in need.<\/p>"
    },
    {
        "title": "Saint Bernard",
        "desc": "<p>To see a Saint Bernard in your dream implies that an aspect of your self is need of rescue. You are calling out for help in some way.<\/p>"
    },
    {
        "title": "Salad",
        "desc": "<p>To see or eat a salad in your dream suggests that you need to express your feelings and take in the positive influences in your life needed for personal growth. Alternatively, the dream indicates that you are longing for nature and good health.<\/p><p>To dream that there is a bug in your salad represents worries and concerns about your health.<\/p>"
    },
    {
        "title": "Salad Dressing",
        "desc": "<p>To see or eat salad dressing in your dream indicates that you need to add some pizzazz to your life. You need to perk things up in your bland life. Consider the type and color of the dressing for additional significance.<\/p>"
    },
    {
        "title": "Salamander",
        "desc": "<p>To see a salamander in your dream represents your ability to survive through shame, misfortune, and\/or embarrassment.You will persevere through some adversity. Alternatively, the dream denotes your ability to resist temptations.<\/p>"
    },
    {
        "title": "Salami",
        "desc": "<p>To see or eat salami in your dream suggests that you are having issues related to your self-image. It may also be indicative of sexual or relationship problems.<\/p>"
    },
    {
        "title": "Salary",
        "desc": "<p>To dream about your salary symbolizes the results of your hard work. You need to take advantage of the opportunities. It is also an indication of your level of confidence and strength.<\/p>"
    },
    {
        "title": "Sale",
        "desc": "<p>To dream that something is on sale represents opportunities that are readily available to you. Alternatively, it indicates that you are underestimating yourself in some area.<\/p>"
    },
    {
        "title": "Salesperson",
        "desc": "<p>To see or dream that you are a salesperson suggests that there is something you need to incorporate in your life. However, you need to make sure that it is right for you and not what someone else wants for you. Alternatively, the dream indicates that you are open to changes and to looking at things from a different perspective.<\/p>"
    },
    {
        "title": "Saliva",
        "desc": "<p>To see saliva in your dream symbolizes sexual and sensual appetites. You are harvesting some creative energy.<\/p><p>To dream that you are spitting out your saliva implies that you are experiencing some anxieties about losing control, either physically or emotionally.<\/p><p>To see the saliva of an animal in your dream denotes intense feelings of anger and rage.<\/p>"
    },
    {
        "title": "Salmon",
        "desc": "<p>To see a salmon in your dream represents determination, strength, and wisdom. You are able to overcome adversity and achieve success. Alternatively, a salmon suggests that you are comfortable with expressing and dealing with your emotions. You are well balanced.<\/p>"
    },
    {
        "title": "Salon",
        "desc": "<p>To dream that you are at the salon indicates your concerns with your looks. You may be overly conscious about your appearance and beauty. Perhaps you are trying too hard to impress others. The dream also suggests deception and cover-up of some situation. Alternatively, it may denote a new outlook toward life.<\/p>"
    },
    {
        "title": "Saloon",
        "desc": "<p>To dream that you are in a saloon indicates that you are trying to escape from life's stresses. You are looking for a place to relax. Alternatively, being in a saloon means that there is a conflict that you are looking to settle immediately.<\/p>"
    },
    {
        "title": "Salsa",
        "desc": "<p>To eat or see salsa in your dream suggests that you need to add a little bit more spice and variety in your life. The dream may also be a pun on being &quot;saucy&quot;. You need to be more bold and direct with your feelings or opinions even though it may not seem to be an appropriate time.<\/p><p>To dream that you are dancing the salsa implies that you are &quot;dancing around in circles&quot; over some situation. Alternatively, it denotes sensuality, flow or ease.<\/p>"
    },
    {
        "title": "Salt",
        "desc": "<p>To see or taste salt in your dream represents a new found flare in your waking life. You are experiencing increased worth and a higher sense of zest and vigor. Alternatively, salt symbolizes dependability, truth, and dedication. Also consider the phrase of throwing salt on an open wound. The dream may thus elude to some painful or difficult memory.<\/p><p>To dream that you are salting meat symbolizes longevity. There is something that you want to hold on to and preserve.<\/p><p>To dream that you are throwing salt over your shoulder represents protection or luck.<\/p>"
    },
    {
        "title": "Saltpeter",
        "desc": "<p>To see saltpeter in your dream suggests that you will experience some grief over an extended period of time.<\/p>"
    },
    {
        "title": "Saltwater",
        "desc": "<p>To see or taste saltwater in your dream symbolizes tears and heartache. It may also indicate some emotional outburst or suffering.<\/p>"
    },
    {
        "title": "Salute",
        "desc": "<p>To salute someone in your dream represents your yield to authority. You need to accept your status in life and where you stand.<\/p><p>To dream that someone salutes you signifies respect and reverence.<\/p>"
    },
    {
        "title": "Salve",
        "desc": "<p>To dream that salve is being applied on you suggests that you will overcome your struggles.<\/p><p>To dream that you are applying salve on someone else signifies your dependability, especially for those in need.<\/p>"
    },
    {
        "title": "Samples",
        "desc": "<p>To see product samples in your dream signify your need to experience and explore what is available out there for you.<\/p>"
    },
    {
        "title": "Samurai",
        "desc": "<p>To see or dream that you are a samurai symbolizes loyalty, honor, duty and discipline. You need to work on some commitment issue.<\/p>"
    },
    {
        "title": "Sanctuary",
        "desc": "<p>To dream that you are in a sanctuary signifies your need to escape from the demands of your daily life. You are searching for some peace and quiet. You need time to decompress and to restore your faith.<\/p>"
    },
    {
        "title": "Sand",
        "desc": "<p>To see sand in your dream signifies a shift in perspective or a change in your attitude. Consider the familiar phrase, &quot;the sands of time&quot; in which it may be suggesting that you are wasting your time or letting time pass you by. If the sand is wet, then it indicates that you are lacking a sense of balance in your life.<\/p>"
    },
    {
        "title": "Sand Castle",
        "desc": "<p>To dream that you are building a sand castle refers to your delusions of grandeur. You do not have a solid foundation needed for success.<\/p>"
    },
    {
        "title": "Sand Dollar",
        "desc": "<p>To see a sand dollar in your dream suggests that your feelings matter. Do not let anyone undervalue your emotions or opinions. Alternatively, a sand dollar symbolizes your unrealized talents.<\/p>"
    },
    {
        "title": "Sand Dunes",
        "desc": "<p>To see a sand dune in your dream signifiesyour desires to be sheltered from the bitterness of reality.<\/p>"
    },
    {
        "title": "Sandals",
        "desc": "<p>To see or wear sandals in your dream signify comfort and ease. You have an understanding about those around you. Alternatively, the dream indicates that you need to tread lightly around certain people or risk offending them.<\/p><p>To dream that your sandals are broken means that you need to approach some situation more slowly. You need to pace yourself. If you find another pair of sandals, then it implies that you need to start over in a different direction.<\/p>"
    },
    {
        "title": "Sandbag",
        "desc": "<p>To see a sandbag in your dream indicates that something or someone is weighing your down and hindering your progress. Alternatively, the sandbag implies that you are diverting or deflecting your feelings instead of confronting them. The dream may also be a metaphor for someone who is &quot;sandbagging&quot; you.<\/p>"
    },
    {
        "title": "Sandbox",
        "desc": "<p>To see or play in a sandbox in your dream suggests that you are taking a situation too seriously. You need to lighten up and enjoy the experience. Alternatively, the dream refers to your childish or juvenile behavior.<\/p>"
    },
    {
        "title": "Sandpaper",
        "desc": "<p>To see or use sandpaper in your dream suggests that you need to smooth over some rough spots in your situation or relationship. Alternatively, it may indicate that you are a little too abrasive or harsh in your words or attitude.<\/p>"
    },
    {
        "title": "Sandstorm",
        "desc": "<p>To dream that you are in a sandstorm indicates that you are feeling trapped, confined and disoriented in some waking situation. Time is working against you.<\/p>"
    },
    {
        "title": "Sandwich",
        "desc": "<p>To see a sandwich in your dream suggests that a lot of pressure and stress is being put on you. It also reflects your ability to do two things at once. Alternatively, a sandwich is just a sandwich sometimes.<\/p><p>To see or eat a fish sandwich in your dream indicates conflict between your spiritual beliefs and what is practical.<\/p>"
    },
    {
        "title": "Sandwich Bag",
        "desc": "<p>To see or use a sandwich bag in your dream represents a reserve a energy that you are waiting to exert. Consider the significance of the bag contents.<\/p>"
    },
    {
        "title": "Sanitary Napkin",
        "desc": "<p>*Please See: <a href=\"#Maxi%20Pad\">Maxi Pad<\/a>.<\/p>"
    },
    {
        "title": "Santa Claus",
        "desc": "<p>To see Santa Claus in your dream indicates that you need to be more giving, accepting, and\/or forgiving. You need to acknowledge and tend to some aspect of yourself. Alternatively, the dream means that you are reflecting on the good and bad things that you have done. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "To dream that you or someone is dressed as Santa Claus suggests that you need to treat others as you would like to be treated. Put yourself in someone else's shoe and determine how they might feel.",
        "desc": "<p>To dream that you or someone is taking a picture with Santa Claus signifies your personal memories of the holidays.<\/p><p>To dream that Santa Claus is attending your wedding highlights the jolly occasion.<\/p>"
    },
    {
        "title": "Sanyasi",
        "desc": "<p>To see a Sanyasi in your dream signifies desires for a simpler life. You want to free yourself from the pursuit of material things.<\/p><p>Dreaming that you are a Sanyasi means that you are looking for a higher truth and spiritual enlightenment, even though if it means that it will alienate those around you.<\/p>"
    },
    {
        "title": "Sap",
        "desc": "<p>To see sap in your dream signifies physical health, vigor, and energy. It may also represent someone who is excessively gullible or sentimental.<\/p>"
    },
    {
        "title": "Sapphire",
        "desc": "<p>To see a sapphire in your dream represents protection, heaven, and divinity. Alternatively, you may be getting to the truth of something. Perhaps, you have unlocked an aspect of your subconscious. The sapphire may also refer to a person who is born in September.<\/p>"
    },
    {
        "title": "Sarcasm",
        "desc": "<p>To dream that you are being particularly sarcastic suggest that you are trying to draw attention away from your own flaws. You are afraid that others will notice your imperfections.<\/p><p>Dreaming that sarcasm is aimed at you means that you are fixated on your own shortcomings.<\/p>"
    },
    {
        "title": "Sari",
        "desc": "<p>To see or wear a sari in your dream signifies covert sensuality, simplicity and adaptability. The dream may have exotic connotations. Alternatively, a sari may be a pun on being &quot;sorry&quot;.<\/p>"
    },
    {
        "title": "Sardines",
        "desc": "<p>To see or eat sardines in your dream symbolize the many components that make up your emotional blueprint. Also consider the idiom &quot;packed like sardines&quot;. Are you feeling crowded in or that others are invading your personal space?<\/p>"
    },
    {
        "title": "Sash",
        "desc": "<p>To see or wear a sash in your dream indicates that you are putting up a front or facade. You are not letting others see your true colors. Consider the color and significance of the sash. Alternatively, a sash signifies restrictions. Your energy flow is being constricted.<\/p>"
    },
    {
        "title": "Sasquatch",
        "desc": "<p>*Please See: <a href=\"#Bigfoot\">Bigfoot<\/a>.<\/p>"
    },
    {
        "title": "Satan",
        "desc": "<p>To see Satan in your dream denotes that there is some wrongdoing or evil workings in your life or environment.<\/p><p>*Please see also: <a href=\"#devil\">Devil<\/a>.<\/p>"
    },
    {
        "title": "Satellite",
        "desc": "<p>To see a satellite in your dream symbolizes global communication and how we are all dependent on each other.<\/p>"
    },
    {
        "title": "Satellite Dish",
        "desc": "<p>To see a satellite dish in your dream represents global awareness and your understanding about worldly issues.<\/p>"
    },
    {
        "title": "Satin",
        "desc": "<p>To see or wear satin in your dream signifies a smooth transition.<\/p>"
    },
    {
        "title": "Saturday",
        "desc": "<p>To dream about Saturday represents opportunity. It is also a sign that whatever you are doing or deciding on is going to be to your advantage.<\/p>"
    },
    {
        "title": "Saturn",
        "desc": "<p>To see Saturn in your dream represents discipline, constraints, and limitations. It is a reflection of your conservative attitude. Alternatively, the dream refers to the cycles of life and how it brings about destruction and rebirth.<\/p>"
    },
    {
        "title": "Satyr",
        "desc": "<p>To see a Satyr or dream that you are a Satyr suggests that you are seeking sexual freedom. It is symbolic of male fertility and masculine sexual power. Alternatively, the dream indicates that you need to integrate aspects of your mind and your body. Or that you need to be more in tune with your environment. Satyrs are also known for their carefree nature and so dreaming about them may imply that you need to be more carefree.<\/p>"
    },
    {
        "title": "Sauce",
        "desc": "<p>To see or taste some sort of sauce in your dream represents your sense of wisdom and intellect. Consider the color and flavor of the sauce for additional significance.<\/p><p>The dream may also be a pun on being &quot;saucy&quot;. You need to be more bold and direct with your feelings or opinions even though it may not seem to be an appropriate time.<\/p>"
    },
    {
        "title": "Saucer",
        "desc": "<p>To see or use a saucer in your dream represents your emotional and spiritual support.<\/p>"
    },
    {
        "title": "Sauerkraut",
        "desc": "<p>To see or eat sauerkraut in your dream indicates good health.<\/p>"
    },
    {
        "title": "Sauna",
        "desc": "<p>To dream that you are in a sauna suggests that you need to be more open and receptive to others' opinions and ideas. Perhaps you need to rid yourself of the negativities in your life. Alternatively, a sauna relates to eroticism and your sexual desires.<\/p>"
    },
    {
        "title": "Sausage",
        "desc": "<p>To see or eat sausage in your dream symbolizes material values. It may also represent the phallus and thus refers to sexual feelings or tension.<\/p>"
    },
    {
        "title": "Savage",
        "desc": "<p>*Please See: <a href=\"#Barbarian\">Barbarian<\/a>.<\/p>"
    },
    {
        "title": "Savanna",
        "desc": "<p>To see or dream that you are in a savanna suggests that you need to learn to adjust to the various situations and circumstances in your life. Appreciate the different experiences in your life even though they are not what you may be accustomed to.<\/p>"
    },
    {
        "title": "Savings",
        "desc": "<p>To dream about your savings represents your preoccupation with money matters. You are feeling the financial burden. The dream is telling you to be more frugal and to conserve your resources.<\/p>"
    },
    {
        "title": "Savings Bonds",
        "desc": "<p>To dream of your savings bonds represent your responsibility and commitment to another person or situation.<\/p>"
    },
    {
        "title": "Saw",
        "desc": "<p>To see or use a saw in your dream indicates that you need to quit doing something. There is something in your life that you need to cut out. The dream may also be a pun on something you saw or are seeing. Alternatively, sawing may be analogous to some sexual act.<\/p><p>To see an electric saw in your dream signifies your ability to get down to the core of the problem. You know how to get to the point quickly.<\/p>"
    },
    {
        "title": "Sawdust",
        "desc": "<p>To see sawdust in your dream suggests that you need to clear up an emotional wound that was recently opened.<\/p>"
    },
    {
        "title": "Saxophone",
        "desc": "<p>To see or play a saxophone in your dream indicates that there is something you need to express from deep within your soul. Perhaps you have made a deep connection with someone.<\/p>"
    },
    {
        "title": "Scab",
        "desc": "<p>To see a scab in your dream symbolizes a time of healing. If you are picking at the scab, then it suggests that you are interfering in the healing process. You need to let things be and let things take their natural course. Alternatively, the dream may be a pun for a person who is a scab or someone who is breaking a strike.<\/p>"
    },
    {
        "title": "Scaffolding",
        "desc": "<p>To see or dream that you are on a scaffolding represents a temporary condition in your life. You are looking for support to help you reach your goals or elevate yourself to a new level.<\/p>"
    },
    {
        "title": "Scald",
        "desc": "<p>To get scalded in your dream implies that you are being emotionally distant. Something drastic needs to happen in order for you to react or respond.<\/p>"
    },
    {
        "title": "Scale",
        "desc": "<p>To see a scale in your dream signifies a decision that you need to make. Alternatively, the scales mean that you need to look at a situation from a rational perspective. Don't be so black and white about everything. Consider the gray area in the situation.<\/p><p>To dream that you are standing on a bathroom scale represents concerns about your weight and your image. You are preoccupied with your physical shape and appearance. Perhaps you need to stop comparing yourself to the standards of others.<\/p><p>To see fish scales in your dream represent your protective barrier. You have put up a defensive wall around yourself. If you are descaling a fish, then it means that you are starting to break down your emotional barriers.<\/p>"
    },
    {
        "title": "Scales of Justice",
        "desc": "<p>To see the Scales of Justice in your dream symbolizes balance, harmony and good judgment. It may also represent someone who is a Libra.<\/p>"
    },
    {
        "title": "Scallop",
        "desc": "<p>To see a scallop shell in your dream signifies female sexuality.<\/p>"
    },
    {
        "title": "Scalp",
        "desc": "<p>To see your scalp in your dream indicates that there is something that you need to get out of your head. If someone is massaging your scalp, then it indicates that you need some intellectual stimulation.<\/p><p>To dream that you or someone has been scalped suggests that your vitality and energy is being drained away by some situation or someone else.<\/p>"
    },
    {
        "title": "Scandal",
        "desc": "<p>To dream that you are involved in a scandal suggests that you are overly concerned with what others say or think about you. Alternatively, a dream scandal indicates that you need to re-focus your attention on more important matters.<\/p>"
    },
    {
        "title": "Scanner",
        "desc": "<p>To see or use a computer scanner in your dream represents your lack of originality and your tendency to mimic other's ideas and beliefs. Alternatively, it signifies the processing, transfer, and sharing of information. The dream may also be a metaphor that you need to &quot;scan&quot; and examine your options before making a decision.<\/p><p>To hear a police scanner in your dream indicates an unrest within your subconscious that needs your immediate attention. Your intuition telling you that something is wrong.<\/p>"
    },
    {
        "title": "Scantron",
        "desc": "<p>To see a scantron in your dream represents the choices that you are making in some area of your life. You feel you are being limited by the choices presented to you. Alternatively, dream of a scantron implies that you are stressed or preoccupied about a test.<\/p>"
    },
    {
        "title": "Scapegoat",
        "desc": "<p>To dream that you are a scapegoat suggests that you are feeling victimized. You are being set up to take the fall for the actions of others.<\/p><p>To dream that you are making someone else a scapegoat indicates that you are not accepting responsibilities for your own actions.<\/p>"
    },
    {
        "title": "Scar",
        "desc": "<p>To see a scar in your dream symbolizes your struggles, painful memories and\/or the bad feelings that has never entirely healed and are still lingering in your mind. Perhaps you are living too much in the past as it is influencing and effecting your present life. Alternatively, a scar represents deep-seated insecurities which may be holding you back from accomplishing your goals.<\/p>"
    },
    {
        "title": "Scarab",
        "desc": "<p>To see a scarab in your dream symbolizes your ability to survive, adapt, and change. You are on the right path. It also indicates your anxieties about death and aging. Alternatively, the scarab represents the sun, resurrection, and immortality.<\/p>"
    },
    {
        "title": "Scarecrow",
        "desc": "<p>To see a scarecrow in your dream indicates depression. You are going through some crisis in your life.<\/p>"
    },
    {
        "title": "Scared",
        "desc": "<p>To dream that you are scared indicates that you are experiencing feelings of self-doubt, incompetence, and lack of control in your waking life. Perhaps you are having second thoughts about a decision you have made. Anger often masquerades as fear, so also consider issues about which you are angry about in your waking life.<\/p>"
    },
    {
        "title": "Scarf",
        "desc": "<p>To see a scarf in your dream symbolizes self-restrictions. You may be too controlling of your emotions instead of expressing them. Alternatively, you feel that your voice is being muffled.<\/p><p>To dream that you are wearing a scarf suggests that you are separating your mind from your body. You may be relying too much on how you think, rather than how you feel or vice versa. Alternatively, the dream means that you need to tell yourself that it is mind over matter.<\/p>"
    },
    {
        "title": "Scavenger Hunt",
        "desc": "<p>To dream that you are in a scavenger hunt indicates that you are lacking something in your waking life. You are looking for fulfillment of your needs or wants. Consider exactly what you are looking for.<\/p>"
    },
    {
        "title": "Scent",
        "desc": "<p>*Please see: <a href=\"#Smell\">Smell<\/a>.<\/p>"
    },
    {
        "title": "Scepter",
        "desc": "<p>To see a scepter in your dream represents individual power. One person can make a difference.<\/p>"
    },
    {
        "title": "Schedule",
        "desc": "<p>Tosee a schedule in your dream suggests that you need better planning and organization in your life. Lay out your agenda, your goals and what you want to accomplish.<\/p>"
    },
    {
        "title": "Schematics",
        "desc": "<p>To see a schematic in your dream suggests that you need to lay out your goals and plans clearly in order to be able to grow and move forward in life. Alternatively, the dream means that you need to analyze aspects of your life for any potential problems that might trip you up later on.<\/p>"
    },
    {
        "title": "Schizophrenia",
        "desc": "<p>To dream that you have schizophrenia and you really do not represents your refusal to take responsibilities for your actions. You are unwilling to see or accept your own personal power and growth.<\/p><p>To see a schizophrenic or someone who has schizophrenia in your dream signifies your indecision about something. You are confused and want resolution to a matter, but do not know how to go about it.<\/p>"
    },
    {
        "title": "Schnauzer",
        "desc": "<p>To see a schnauzer in your dream highlights you hyper-alertness and loyalty.<\/p>"
    },
    {
        "title": "School",
        "desc": "<p>To dream that you are in school signifies feelings of inadequacy and childhood insecurities that have never been resolved. It may relate to anxieties about your performance and abilities. If you are still in school and dream about school, then the dream may just be a reflection of your daily life and has no special significance.<\/p><p>Alternatively, a dream that takes place in school may be a metaphor for the lessons that you are learning from your waking life.You may be going through a &quot;spiritual learning&quot; experience.<\/p><p>To dream that you are looking for a school suggests that you need to expand your knowledge and learning. To dream that you are at a new school means that you are feeling out of place in some situation. Or perhaps there is a new lesson that you need to learn.<\/p><p>To dream that you are running away from school means that you are not being receptive to new ideas and viewpoints. You have not learned from your past mistakes.<\/p><p>To dream that your childhood school is in ruins suggests that you are dwelling on some unresolved childhood issue. Alternatively, the dream represents the passage of time. You need to look toward the future instead of reliving the past.<\/p><p>*Please see also: <a href=\"#Teacher\">Teacher<\/a>.<\/p>"
    },
    {
        "title": "School Bag",
        "desc": "<p>*Please See: <a href=\"#Knapsack\">Knapsack<\/a>.<\/p>"
    },
    {
        "title": "School Bus",
        "desc": "<p>To see or ride a school bus in your dream suggests that you are about to venture on an important life journey needed for your own personal growth.<\/p><p>To dream that you drive a school bus indicates that you like to take charge of others and watch out for their best interest.<\/p>"
    },
    {
        "title": "Schoolmates",
        "desc": "<p>*Please See: <a href=\"#Classmates\">Classmates<\/a>.<\/p>"
    },
    {
        "title": "Scientist",
        "desc": "<p>To dream that you are a scientist signifies experimentation, invention, or eccentricity. You need to think outside the box. Alternatively, the dream suggests that you need to look at some problem more objectively and rationally. Perhaps you need to detach yourself from a situation or relationship.<\/p>"
    },
    {
        "title": "Scissors",
        "desc": "<p>To dream that you are using scissors denotes decisiveness and control in your waking life. You need to get rid of something in your life. It also represents your ability to cut things or people out of your life.Perhaps you are being snippy about some situation.<\/p><p>To see a pair of scissors in your dream indicates that your focus is being divided into too many directions.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=treedream1\">Scissors In The Forest<\/a>&quot;<\/p>"
    },
    {
        "title": "Scold",
        "desc": "<p>To dream that you are being scolded indicates that you are being inhibited and prevented from fully expressing yourself in some area of your life.<\/p><p>If you dream that you are scolding someone, then it means that there is some resentment or unexpressed anger that you need to confront.<\/p>"
    },
    {
        "title": "Scooter",
        "desc": "<p>To see or ride a scooter in your dream suggests that you are enjoying your position of power.<\/p><p>To see or ride on a kick scooter in your dream implies that you are trying to balance various areas of your life. The dream also means that you need to be decisive in what you are doing. Dreaming of seeing someone on a kick scooter represents a carefree attitude.<\/p>"
    },
    {
        "title": "Scorch",
        "desc": "<p>*Please See: <a href=\"#Hot\">Hot<\/a>.<\/p>"
    },
    {
        "title": "Score",
        "desc": "<p>To see a game score in your dream symbolizes your successes or failures depending if your team won or lost.<\/p><p>To dream that you score signifies some sexual conquest.<\/p>"
    },
    {
        "title": "Scoreboard",
        "desc": "<p>To see a scoreboard in your dream represents how you are doing in life and how you compare to others. How are you measuring up? Consider the significance of the specific numbers or digits on the scoreboard.<\/p>"
    },
    {
        "title": "Scorpio",
        "desc": "<p>To dream that someone is a Scorpio signifies self-control, determination, tenacity, healing and transformation. You have the ability to get down and penetrate to the core of a matter. Alternatively, the dream indicates some sexual matter.<\/p>"
    },
    {
        "title": "Scorpion",
        "desc": "<p>To see or be stung by a scorpion in your dream represents a situation in your waking life which may be painful or hurtful. Itis also indicative of destructive feelings, &quot;stinging&quot; remarks, bitter words and\/or negative thoughts being expressed by or aimed against you. You may be on a self-destructive and self-defeating path. The scorpion is also a symbol of death and rebirth. You need to get rid of the old and make room for something new. Alternatively, the scorpion represents a person who is born under the astrological sign for Scorpio.<\/p><p>To see scorpions floating in water suggest that you need to let go of some pain and learn to accept the situation. You may be going through the three-step process of denial, acceptance, and finally moving on.<\/p>"
    },
    {
        "title": "Scrabble",
        "desc": "<p>To dream that you are playing with scrabble implies that you still need to piece together your thoughts and emotions. Consider the significance of the letters that you are using or the words that you are spelling.<\/p>"
    },
    {
        "title": "Scrapbook",
        "desc": "<p>To see a scrapbook in your dream represents old feelings and memories. They symbolize the past and things that you have put behind you or have forgotten.<\/p><p>To work on a scrapbook in your dream indicates that you need to incorporate some aspect of your past into a waking situation.<\/p>"
    },
    {
        "title": "Scratch",
        "desc": "<p>To dream that you are scratching yourself symbolizes a minor irritation or frustration. Perhaps something that started out as minor may have the potential to become worse. Or somebody may have hit a sore spot in you.<\/p><p>To see a scratch in your dream suggests that you are feeling anxiety about having to start over or begin something &quot;from scratch&quot;.<\/p>"
    },
    {
        "title": "Scream",
        "desc": "<p>To dream that you are screaming symbolizes anger and fear. You are expressing some powerful emotion which you have kept pent up inside. If you try to scream, but no sound comes out, then it indicates your sense of helplessness and frustration in some situation. No matter how hard you try to get someone's attention, they cannot hear you. The dream highlights your difficulty in communicating with this person. You need to immediately identify your fears or feelings and confront this situation in real life.Alternatively, your inability to scream may be a form of REM paralysis.<\/p><p>To hear or dream that someone is screaming indicates that some friend or family member is in need of your help.<\/p>"
    },
    {
        "title": "Screen",
        "desc": "<p>To see a window screen in your dream implies that you are being cautiously optimistic about the good news you receive.<\/p><p>To see a blank movie screen suggests that you are trying to distance yourself from some issue or emotion. Or you are feeling excluded from some situation. Alternatively, the blank screen symbolizes a lack of accomplishments. You fee that you have nothing to look back on.<\/p>"
    },
    {
        "title": "Screening",
        "desc": "<p>To attend or watch a movie or television screening in your dream suggests that you are watching life pass you by. Perhaps you are living vicariously through the actions of others.Consider also how the movie parallels to situations in your waking life. Alternatively, the dream suggests that you need to take a step back and look at some waking relationship more objectively.<\/p><p>To dream that you are undergoing a medical screening suggests that you need to take a closer look at your actions and your motives. More directly, the dream may be telling you that it is time to go in for your doctor check up.<\/p>"
    },
    {
        "title": "Screw",
        "desc": "<p>To see a screw in your dream represents your feelings of being taken advantaged or that you are messing things up. You are overlooking the little details that keeps and holds everything together. Alternatively, a screw may be a metaphor for having sex.<\/p>"
    },
    {
        "title": "Screwdriver",
        "desc": "<p>To see a screwdriver in your dream indicates the need to hold some situation or relationship together. Consider also if there someone in your life who is &quot;all screwed up&quot; or whom you would like to &quot;put the screws on&quot;?<\/p>"
    },
    {
        "title": "Script",
        "desc": "<p>To read or write a script in your dream signifies the character or persona that you portray in your waking life. The dream is telling you that you have power to control the direction and path of your own life.<\/p>"
    },
    {
        "title": "Scroll",
        "desc": "<p>To see a scroll in your dream represents your hidden knowledge or ultimate potential.<\/p>"
    },
    {
        "title": "Scrubs",
        "desc": "<p>To wear scrubs in your dream refers to your caring, supportive and giving nature. The dream may be a metaphor that you need to literally clean up your act and get back on track. You need to organize aspects of your life before you can progress forward.<\/p>"
    },
    {
        "title": "Scuba Diving",
        "desc": "<p>To dream that you are scuba diving represents your desire to delve deep in to your subconscious. You are ready to confront your base feelings and explore your repressed thoughts. Alternatively, the dream indicates that you are trying to get to the bottom of a current situation or the root of your problems or feelings.<\/p>"
    },
    {
        "title": "Sculptor",
        "desc": "<p>To dream that you are a sculptor refers to your creativity. You will accomplish your goals and overcome obstacles. Alternatively, it may mean that you are working on finding yourself and in getting to the core of things.<\/p>"
    },
    {
        "title": "Sculpture",
        "desc": "<p>To see a sculpture in your dream indicates that you are refusing to accept things as they really are. You are afraid that you are not presenting yourself in a positive light or image.<\/p>"
    },
    {
        "title": "Scythe",
        "desc": "<p>To see or use a scythe in your dream suggests that you need to cut out some of the excess and needless things in your life. Perhaps you need to &quot;cut back&quot; on spending, smoking, eating, gambling or some other habit. Alternatively, the scythe is symbolic of death or the end of something.The dream may also be a metaphor that you are feeling &quot;cut off&quot; or isolated.<\/p>"
    },
    {
        "title": "Sea",
        "desc": "<p>To see the sea in your dream represents your subconscious and the transition between your subconscious and conscious. As with all water symbols, it also represents your emotions. The dream may also be a pun on your understanding and perception of a situation. &quot;I see&quot; or perhaps there is something you need to &quot;see&quot; more clearly. Alternatively, the dream indicates a need to reassure yourself or to offer reassurance to someone.It brings about hope, a new perspective and a positive outlook on life no matter how difficult your current problems may be.<\/p><p>To dream that you are lost at sea suggests that you are drifting around in life without any direction. You are feeling overwhelmed by emotions.<\/p><p>Dreaming of a crystallized sea indicates that you are looking for some emotional stability in your life.<\/p>"
    },
    {
        "title": "Sea Creature",
        "desc": "<p>To see a sea creature in your dream represents an emotional transformation. If the sea creature is captured or in captivity, then it indicates that you are keeping your emotions contained, which can be harmful to your well-being in the end.<\/p><p>In particular, if you dream of a sea monster or a sea serpant with a head on each end, then it implies that you are feeling emotional torn. The dream may point to some love triangle or some relationship conflict.<\/p>"
    },
    {
        "title": "Sea Horse",
        "desc": "<p>To see a sea horse in your dream represents the power of your subconscious. You have a new perspective or different outlook in life. If the sea horse is invisible, then itsuggests that there is an emotional issue that you are not acknowledging or recognizing.<\/p>"
    },
    {
        "title": "Sea Lion",
        "desc": "<p>*Please see: <a href=\"#Seal\">Seal<\/a>.<\/p>"
    },
    {
        "title": "Sea Turtle",
        "desc": "<p>To see a sea turtle in your dream indicates that you are cautious when it comes to expressing your emotions. You may also be a little emotionally sheltered.<\/p>"
    },
    {
        "title": "Sea Urchin",
        "desc": "<p>To see a sea urchin in your dream symbolizes a flaw or weakness in your thinking.<\/p>"
    },
    {
        "title": "Seafood",
        "desc": "<p>To see or eat seafood in your dream indicates recognition and a mergence of your spirituality with your conscious being. You are acknowledging and fulfilling the needs of your subconscious. The dream may also be a pun on &quot;seeing food&quot; and thus the symbolism of &quot;food&quot; is also applicable.<\/p><p>*Please See Also: <a href=\"#Food\">Food<\/a>.<\/p>"
    },
    {
        "title": "Seagulls",
        "desc": "<p>To see seagulls in your dream indicate a desire to get away from your problems or the demands of your walking life. You may be wasting away your potential and unused skills. Alternatively, a seagull symbolizes your strengths. You are able to cope with life's changes with grace and understanding. The dream may also be a pun on &quot;see go&quot; and thus indicate something that you need to let go or see go.<\/p>"
    },
    {
        "title": "Seal",
        "desc": "<p>To see a seal in your dream refers to your playfulness and jovial disposition. Seals also symbolize prosperity, good luck, faithfulness, success, security in love and spiritual understanding. You have the ability to adapt to various emotional situations. Alternatively, the dream symbol may also be a pun and indicate you need to put closure on some situation as in &quot;sealing the deal&quot;.meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Seam",
        "desc": "<p>To see a seam in your dream suggests that there are two components in your life that you need to bring together and unify as a whole. Alternatively, the dream may be a pun on something that may not be what it &quot;seems&quot;.<\/p><p>To dream that a seam has come undone signifies unfocused energy. Your plans are falling apart.<\/p>"
    },
    {
        "title": "Seamstress",
        "desc": "<p>To see a seamstress in your dream represents your ability to create and mend things.<\/p>"
    },
    {
        "title": "S�ance",
        "desc": "<p>To see or be part of a s�ance in your dream represents your intuition and awareness. You need to assess some hidden information within your subconscious. Gain more insight into some situation and look beyond what is in front of you. Stand back and look at the big picture. Alternatively, the dream is a way for you to cope with issues of death.<\/p>"
    },
    {
        "title": "Search",
        "desc": "<p>To dream that you are searching for something signifies the need to find something that is missing or needed in your life. The dream may be analogous to your search for love, spiritual enlightenment, peace or even a solution to a problem. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Searchlight",
        "desc": "<p>*Please See: <a href=\"#Flashlight\">Flashlight<\/a><\/p>"
    },
    {
        "title": "Seashells",
        "desc": "<p>To see seashells in your dream represent security and protection. You are not showing your true self or real feelings. In protecting yourself from getting hurt, you are also becoming reclusive and emotionally closed off.<\/p>"
    },
    {
        "title": "Seasick",
        "desc": "<p>To dream that you are seasick represents emotions that are dragging you and weighing you down. You need to get rid of these feelings.<\/p>"
    },
    {
        "title": "Seasons",
        "desc": "<p>To dream of the seasons signify a passage of time and the phases and periods in your life.In particular, if the seasons are changing rapidly through your dream, then it suggest that you are undergoing an important transformation and deep spiritual development in your life. Consider the specific season for additional meaning.<\/p>"
    },
    {
        "title": "Seat",
        "desc": "<p>*Please See: <a href=\"#Chair\">Chair<\/a>.<\/p>"
    },
    {
        "title": "Seatbelt",
        "desc": "<p>To wear a seatbelt in your dream suggeststhat you need to work on controlling youremotions. Try to stay compose and do not fall apart in any situation.<p>To dream that you are having trouble putting on your seatbelt indicates that you are worried about what is ahead in your future.<\/p>"
    },
    {
        "title": "Seaweed",
        "desc": "<p>To see seaweed in your dream suggests that you need to rely on your intuition and trust your instincts.<\/p>"
    },
    {
        "title": "Secret",
        "desc": "<p>To dream that you or someone has a secret represents hidden power. It suggests that something is emerging from your subconscious.<\/p><p>To dream that your secret is revealed signifies fear of being exposed for who you really are. It may also indicate pressure of keeping a waking secret that you are desperate to let out. Alternatively, the secret is analogous to some subconscious material that needs to be confronted or addressed.<\/p>"
    },
    {
        "title": "Secret Admirer",
        "desc": "<p>To dream that you have a secret admirer suggests that there are some unknown aspects of yourself that you need to find out about and incorporate into your character. Alternatively, the dream may be drawing your attention to someone who is interested in you. Or perhaps the dream is telling you to be more aware of your surroundings.<\/p>"
    },
    {
        "title": "Secret Santa",
        "desc": "<p>To dream that someone is your Secret Santa signifies the spirit of giving. It is about doing something good without having any expectations in return.<\/p>"
    },
    {
        "title": "Secretary",
        "desc": "<p>To see or dream that you are a secretary indicates that you need to more order and organization in your life. Don't be afraid to ask for help when you need it.<\/p>"
    },
    {
        "title": "Sect",
        "desc": "<p>*Please See: <a href=\"#Cult\">Cult<\/a>.<\/p>"
    },
    {
        "title": "Security",
        "desc": "<p>To dream that you have a sense of security may be a dream of the contrary and thus signify insecurity in your waking life. The dream is compensating for your lack of security. You are not feeling well-protected, either physically and emotionally.<\/p>"
    },
    {
        "title": "Security Bars",
        "desc": "<p>To see security bars on a window in your dream represents opportunities that are in your view but still out of your grasp. Alternatively, the dream symbolizes mistrust.<\/p>"
    },
    {
        "title": "Security Camera",
        "desc": "<p>To see a security camera in your dream means that you feel that you are being scrutinized and judged for your actions or behavior. More directly, the dream refers to your lack of privacy. You feel that all eyes are on you.<\/p>"
    },
    {
        "title": "Security Guard",
        "desc": "<p>To see or dream that you are a security guard suggests that you are seeking security in some situation or relationship. The dream is compensating for the lack of security in your waking life. Alternatively, the dream means that there is something of value that you want to protect.<\/p>"
    },
    {
        "title": "Sedate",
        "desc": "<p>To dream that you are sedated indicates that you are trying to avoid an issue, responsibility or situation that is causing you emotional pain. You need to take control of the issue and stop relying on outside help. Alternatively, the dream suggests that you need to relax and take it easy.<\/p>"
    },
    {
        "title": "Seduction",
        "desc": "<p>To dream of seduction is an expression of your sexual desires. You need to be more passionate and direct with your sexual needs. Alternatively, the dream may mean that you are being lured into doing something you don't really want to do. You may be giving up your power of choice.<\/p>"
    },
    {
        "title": "Seed",
        "desc": "<p>To see seeds in you dream symbolize fertility heritage, potential, and continuity of life. Now is the time to start a new venture. Alternatively, a seed relates to the human psyche and soul. An idea has been planted in your mind and new a experience is being created.<\/p>"
    },
    {
        "title": "Seepage",
        "desc": "<p>To see seepage in your dream indicates that some repressed feelings are emerging from your subconscious or from your past.Perhaps there is a some emotion that you need to express slowly. Metaphorically, the dream may suggest that some secret information has &quot;leaked&quot; out.<\/p>"
    },
    {
        "title": "Seesaw",
        "desc": "<p>To see or dream that you are on a seesaw represents the ups and downs of your emotions and of your life in general. A seesaw also signifies indecisiveness and lack of initiative. Alternatively, the dream may refer to your childhood memories. You may be acting too carefree in some waking issue or situation.<\/p>"
    },
    {
        "title": "Segway",
        "desc": "<p>To see or ride a Segway in your dream suggests that you need to exercise more balance and control in your waking life. You need to approach your goals at a steady and even pace.<\/p>"
    },
    {
        "title": "Seizures",
        "desc": "<p>To dream that you have a seizure indicates a lack of control in your life.<\/p>"
    },
    {
        "title": "Self Defense",
        "desc": "<p>To dream that you are taking self defense indicates that you are on the defensive about some issue in your waking life. You feel that you are being picked on or criticized.<\/p>"
    },
    {
        "title": "Self-Harm",
        "desc": "<p>To dream that you are harming yourself suggests that you are seeking attention. You are expressing a desperate cry for help. Alternatively, you are trying to disconnect yourself from the unbearable pain you are experiencing in an aspect of your life. If you also self-harm in real life, then you are urged to seek professional help.<\/p><p>Dreaming of someone self-harming themselves indicates that you need to distance yourself from an unhealthy relationship.<\/p>"
    },
    {
        "title": "Self Storage",
        "desc": "<p>To dream that you are at a self storage facility relates to issues that you are keeping to yourself instead of confronting. Items that you put into storage symbolizes the past. You are still hanging to some part of your past and are not completely ready to move forward.<\/p>"
    },
    {
        "title": "Selfie",
        "desc": "<p>To dream that you are taking a selfie suggests that you may be focusing too much on yourself and not enough on others. Perhaps you are feeling out of touch with those around you. If you are taking a nude selfie of yourself, then the dream warns that you are letting your guard down in a situation where you need to be more vigilant. Alternatively, taking a nude selfie may represent a burst of self-confidence.<\/p>"
    },
    {
        "title": "Selling",
        "desc": "<p>To dream that you are selling something indicates that you are undergoing changes in your waking life. You may be experiencing difficulties in letting go or parting with something.Learn to compromise. Alternatively, the dream may be a pun that you are &quot;selling&quot; yourself short.<\/p>"
    },
    {
        "title": "Semen",
        "desc": "<p>*Please see: <a href=\"#Sperm\">Sperm<\/a>.<\/p>"
    },
    {
        "title": "Semi Truck",
        "desc": "<p>To see a semi truck in your dream indicates that you are feeling overburdened or that you are being taken advantage of. You feel that you are pulling more than your own weight and it is time that others share in some of the responsibilities. Alternatively, the dream symbolizes size, largeness and power.<\/p><p>Dreaming of an overturned semi truck indicates that there is an unexpected setback in your plans or goals. Perhaps you are taking on more than you can handle.<\/p>"
    },
    {
        "title": "Seminar",
        "desc": "<p>To dream that you are attending a seminar suggests that you are expanding your knowledge and understanding. There is something that you need to learn or incorporate into your understanding.<\/p>"
    },
    {
        "title": "Senile",
        "desc": "<p>To dream that you are senile indicates that you are letting your abilities go to waste. You need to put more effort into your work and project.<\/p>"
    },
    {
        "title": "Senior Home",
        "desc": "<p>To dream that you live in a senior home (but you don't really live in one in real life) means that you are becoming too dependent on others. You need to take responsibility and control of your own life.<\/p><p>To see or dream that you are visiting a senior home implies that you need to reconnect with some elderly person in your waking life. Perhaps you have been neglecting that relationship.<\/p><p>To dream that you volunteer in a senior home suggests that you need to be more respectful or compassionate of others, particularly people who are older than you.<\/p>"
    },
    {
        "title": "Senses",
        "desc": "<p>To dream that you are hypersensitive or that your senses are heightened indicates new found awareness, insight and increased spirituality<\/p>"
    },
    {
        "title": "Sensuality",
        "desc": "<p>To experience sensuality in your dream suggests that you need to pay more attention to the needs of your body. Nurture it.<\/p>"
    },
    {
        "title": "Sentencing",
        "desc": "<p>To dream that you are being sentenced indicates that you need to take responsibility for your actions and confront your problems. Alternatively, the dream implies that you need to verbalize your feelings and thoughts. If someone else is being sentenced, then you feel they need to take responsibility for their actions. Consider the severity of the sentencing.<\/p><p>In particular to dream of a death sentencing symbolizes the limited time you have to react or to do something. Dreaming of a prison sentence indicates that you are being held back on some area of your life.<\/p>"
    },
    {
        "title": "Separation",
        "desc": "<p>To dream of a separation suggests that you are experiencing some separation anxiety. You are afraid of feeling unneeded or abandoned. Alternatively, the dream means that you need to looking at an issue more objectively. You need to pull yourself away from a situation and look at it from afar.<\/p>"
    },
    {
        "title": "Sepia",
        "desc": "<p>To dream in sepia hues indicates feelings and thoughts from the primal aspects and less developed parts of your subconscious.<\/p>"
    },
    {
        "title": "September",
        "desc": "<p>To dream of the month of September signifies a positive outlook with good luck and fortune.<\/p><p>To dream about the events of September 11, 2001 represents your anger and fears. It brings you back to a time where you feel vulnerable and helpless. Alternatively, the dream denotes a highly stressful time in your life.<\/p>"
    },
    {
        "title": "Sequins",
        "desc": "<p>To see or wear sequins in your dream represent your desires to be noticed. You want to be in the spotlight. Alternatively, the dream indicates that things are not always what it seems. Consider the phrase &quot;all that glitters is not gold.&quot; Don't be fooled by what is on the outside or how things may appear to be.<\/p>"
    },
    {
        "title": "Sequoias",
        "desc": "<p>*Please See: <a href=\"#redwood\">Redwood<\/a>.<\/p>"
    },
    {
        "title": "Serenade",
        "desc": "<p>To dream that you are being serenaded represents emotional and spiritual fulfillment.<\/p><p>To dream that you serenade someone signifies your love for life. You are trying to bring joy and positivity to those around you. Alternatively, the dream suggests that you need to vocalize your love more and express your romantic side.<\/p>"
    },
    {
        "title": "Serial Killer",
        "desc": "<p>To see a serial killer in your dream represents fear and insecurity. If you dream of a famous serial killer, then consider the mo or characteristic of that killer and how it applies to your own life.<\/p><p>To dream that you are a serial killer indicates that your compulsions and habits are working against you. You need to put an end to some vicious cycle and cut out the negativity in your life.<\/p><p>Dreaming that a serial killer is killing off members of your family implies that you are feeling cut off from your family.<\/p>"
    },
    {
        "title": "Serious",
        "desc": "<p>To dream that you or someone is serious suggests that there is a wall that is keeping someone from getting through. You are afraid to show your true feelings and let people in. Alternatively, the dream implies that you need to &quot;lighten up&quot;. Don't be so hard on yourself.<\/p>"
    },
    {
        "title": "Sermon",
        "desc": "<p>To listen to a sermon in your dream indicates that you are looking for some spiritual advice.<\/p><p>To dream that you are giving a sermon suggests that you are forcing your views and beliefs on others.<\/p>"
    },
    {
        "title": "Serpent",
        "desc": "<p>To see a serpent in your dream signifies the balance of good and evil.<\/p><p>To see a winged serpent in your dream denotes wisdom. You have overcome the negativity in your life.<\/p><p>*Please See Also Dream Moods' interpretation of: <a href=\"#Snake\">Snake<\/a>.<\/p>"
    },
    {
        "title": "Servant",
        "desc": "<p>To dream that you are a servant suggests that you are too yielding to others or that you are too submissive in some situation. You need to stand up for yourself.<\/p><p>To dream that you have a servant indicates your authoritative and commanding role in a waking situation.<\/p>"
    },
    {
        "title": "Service",
        "desc": "<p>To dream that you are servicing your car or vehicle suggests that you need to slow down and take a break to replenish yourself. Otherwise you risk burning yourself out.<\/p><p>To dream that you are providing a service symbolizes your willingness to share or help others.<\/p>"
    },
    {
        "title": "Sesame",
        "desc": "<p>To see sesame in your dream signifies hidden treasures and riches.<\/p><p>To dream of sesame oil represents hard work and dedication.<\/p><p>To eat or make sesame paste in your dream refers to something that you are processing in your waking life. Consider also the phrase &quot;open sesame&quot;. Perhaps the dream suggests that you have access to a new area of your subconscious or that have gained acceptance into a group or place.<\/p>"
    },
    {
        "title": "Settle",
        "desc": "<p>To dream that you settle for something means that you need to free yourself from the burdens and responsibilities you are faced with in your waking life. Incorporate some joy, amusement, and relaxation to your life. Alternatively, the dream indicates your lack of ambition and drive. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "The Seventies",
        "desc": "<p>To dream that you are back in the 1970's represents your desire to escape from your current circumstances. The 70's may be personally meaningful to you if your grew up during that period. Perhaps you need to let loose and adopt a more carefree attitude. Or there is a social issue that you need to get involved in.<\/p>"
    },
    {
        "title": "Sewage",
        "desc": "<p>To see sewage in your in dream represents your rejected or shameful emotions. It also symbolic of low esteem.<\/p>"
    },
    {
        "title": "Sewer",
        "desc": "<p>To see a sewer in your dream signifies putrid conditions and old relationships. Something needs to be cleaned up or immediately changed. You need to let go of your outdated ideas and beliefs.<\/p><p>To see a sewer pipe in your dream represents the flow of subconscious material being suppressed deeper and deeper. You need to address these issues before it overflows.<\/p>"
    },
    {
        "title": "Sewing",
        "desc": "<p>To dream that you are sewing suggests that you are trying to make amends with others. There may be a situation or relationship that needs to be repaired. Perhaps you are creating a new self-image and taking on a new attitude. Alternatively, sewing represents fertility, growth, and emotional maturity.<\/p>"
    },
    {
        "title": "Sewing Machine",
        "desc": "<p>To see a sewing machine in your dream denotes that economizing will help you through difficult times. You need to be more frugal.<\/p><p>To dream that you are fixing a sewing machine implies that you need to be more self-sufficient instead of relying on others.<\/p><p>Dreaming about winning a sewing machine indicates increased confidence in your ability to create something new and\/or useful.<\/p>"
    },
    {
        "title": "Sex",
        "desc": "<p>To dream about sex refers to the integration and merging of contrasting aspects of yourself. It represents psychological completion. You need to be more receptive and incorporate aspects of your dream sex partner into your own character. Consider the nature of the love-making. Was it passionate? Was it slow? Was it wild? The sex act parallels aspects of yourself that you wish to express. A more direct interpretation of the dream may be your libido's way of telling you that it has been too long since you have had sex.It may indicate repressed sexual desires and your needs for physical and emotional love.If you are looking for a place to have sex, then the dream may be analogous to your search for intimacy and closeness. You want to rekindle some relationship. If you dream of having sex in a public place, then the dream implies that others are talking about your private relationship. Dreaming of having sex on a ship refers to emotional intimacy. Perhaps the dream is telling you that you are just going through the physical aspects of sex, but are lacking the emotional connection.<\/p><p>To dream about sex with someone other than your spouse or significant other suggests dissatisfaction with the physical side of your relationship. On the other hand, it may be harmless fantasy. In such situations, you may find that you are less inhibited sexually. Perhaps you need to bring the same sense of adventure into your existing relationship.<\/p><p>To dream that you are having sex with an ex or someone who is not your current mate denotes your reservations about embarking in a new relationship or situation. You may feel nervous about exposing yourself and are feeling a resurgence of those old emotions and feelings that you felt back when you and your ex were together. If you are approaching your wedding date, then is not uncommon to experience especially erotic adventures with partners other than your intended spouse. This may be due to the intensity of the sexual passion with your fianc�. It also relates to the new roles that you will be taking on and the uncertainty that that may bring.<\/p><p>To dream that you are having sex with a stranger represents uncertainty about what is ahead. Alternatively, the dream allows you to experiment freely without having any hang ups, emotional baggage or preconceived notions associated with a person you would know. In such a scenario, you are able to let loose and express your desires, passions and emotions. In particular, if you dream of having sex with multiple partners at the same time, then it indicates that you are feeling detached in your personal relationship. You feel that sex is just an act devoid of any emotion or passion. Perhaps your sex life has become too automated.<\/p><p>To dream that you are having sex with a friend refers to the closeness you share with your friend. Because you two share so much between each other and know so much about each other, the dreaming mind may depict this closeness as sex. Alternatively, such a dream indicates a level of attraction between you and your friend, but you are too afraid to act on it. Thus your desires are manifested in a dream.<\/p><p>If you are heterosexual and you dream that you are having sex with someone of the same sex, then it represents an expression of greater self love and acceptance. You need to be in better touch of your feminine or masculine side. The dream does not necessarily imply homosexual desire.<\/p><p>To dream that you are having sex with a celebrity indicates your drive to be successful. You are striving for recognition. Consider what movies you associate this celebrity with for clues as to where and what you want to achieve success in.<\/p><p>To dream that you are having sex with your boss signifies your desires for authority and control. You are feeling empowered.<\/p><p>To see others having sex in your dream refers to your own desires to be more adventurous in your own sex life.<\/p><p>To see your parents having sex in your dream indicate that you are seeing similar aspects between their relationship and your current relationship. Most cringe at the thought of your parents having sex, so this dream imagery is really trying to get your attention. Consider your parents' real life relationship together and what you can learn from it.<\/p><p>To dream that you are the opposite sex suggests that you need to incorporate certain qualities of the opposite sex. Ask yourself how do you feel being a man or a woman? In what ways can you incorporate those feelings into your waking life.<\/p><p>Dreaming that you are watching your girlfriend have sex with someone else suggests that you are taking a passive role in your sex life. Maybe you feel that you are not satisfying her. The dream is signaling you to communicate your sexual concerns and\/or desires. Alternatively, the dream may reflect a personal fantasy you have.<\/p><p>Dreaming that you are having sex with an alien indicates a desire for something new and different in your sex life.<\/p>"
    },
    {
        "title": "Sex Tape",
        "desc": "<p>To dream that you are making a sex tape means that you are sexually open to new things. You are comfortable with your sexuality. If you dream that a sex tape of you has been stolen or leaked, then it means that you are feeling over-exposed. Perhaps things are moving too fast or you are not fully comfortable in your relationship.<\/p>"
    },
    {
        "title": "Sex Toy",
        "desc": "<p>To see or use a sex toy in your dream suggests that you are feeling unsatisfied in some area of your life, which may or may not relate to sex. There is a void in your life. Alternatively, the dream may be a play on words and that you are not taking sex seriously. Perhaps you have an immature attitude towards sex. More directly, the dream indicates your desires for a more gratifying and\/or exciting sex life.<\/p>"
    },
    {
        "title": "Sextant",
        "desc": "<p>To see a sextant in your dream symbolizes adventure, exploration, progress and a new journey. You are expanding your knowledge.<\/p>"
    },
    {
        "title": "Sextuplets",
        "desc": "<p>To see sextuplets in your dream suggests that there is balance, harmony and tranquility in your family life. It also means that that you are experiencing twice as much vitality, strength and energy.<\/p>"
    },
    {
        "title": "Sexuality",
        "desc": "<p>To dream about your own sexuality signifies the secrets and meaning of life. You may be dealing with life issues of birth, marriage, and\/or death. Alternatively, the dream suggests that you are concerned about losing your sex appeal.<\/p>"
    },
    {
        "title": "Shack",
        "desc": "<p>To see a shack in your dream represents your undeveloped self. You need to expand your Self. Alternatively, the dream may also be a pun on &quot;shacking up&quot;.<\/p>"
    },
    {
        "title": "Shackles",
        "desc": "<p>To dream that you are in shackles suggests that you are in a rut. Your daily life is becoming too much of a routine.<\/p>"
    },
    {
        "title": "Shade",
        "desc": "<p>To dream that you are in the shade symbolizes protection. There is something that you are trying to keep hidden.<\/p>"
    },
    {
        "title": "Shadow Boxing",
        "desc": "<p>To dream that you are shadow boxing indicates an internal conflict. You are struggling with some moral issue or inner demons.<\/p>"
    },
    {
        "title": "Shadows",
        "desc": "<p>To see you own shadow in your dream signifies an aspect of yourself which you have not acknowledged or recognized. It may be a quality about yourself or a part of you that you are rejecting or want to keep hidden.These qualities may not necessary be negative, but can be creative ones. Alternatively, the dream may mean that you are in someone else's shadow. You are constantly being overlooked and are fed up with it.In particular, if the shadow in your dream is white, then it is your subconscious' way of highlighting the shadow which is often overlooked.<\/p><p>To see a shadowy figure in your dream represents characteristics which you have not acknowledged or incorporated into your own personality. Alternatively, it symbolizes the young, the helpless or the under-developed.<\/p>"
    },
    {
        "title": "Shakespeare",
        "desc": "<p>To dream that you are reading Shakespeare signifies your literary aptitude. You are well-read and knowledgeable. Consider which Shakespeare novel you are reading and how the plot line may parallel a situation in your waking life.<\/p>"
    },
    {
        "title": "Shaking",
        "desc": "<p>To dream that you are shaking suggests that you are getting rid of your old habits and former ways of thinking. You need to get rid of the old in order to welcome in the new and better. Shake things up a bit. Alternatively, shaking is symbolic of fear.<\/p>"
    },
    {
        "title": "Shallow",
        "desc": "<p>To dream of something shallow refers to conscious knowledge and the things that you are confronting or dealing with. Alternatively, noticing that something is shallow may be a reflection of your personality. You are putting too much emphasis on physical appearances over substance.<\/p>"
    },
    {
        "title": "Shaman",
        "desc": "<p>To see a shaman in your dream symbolizes a spiritual messenger or guide. The shaman is a variation of the &quot;wise old man&quot;, an archetypal figure who represents superior knowledge, wisdom and insight. Alternatively, the dream suggests that you need to turn your negative energy into something positive.<\/p>"
    },
    {
        "title": "Shame",
        "desc": "<p>To feel shame in your dream signifies waking feelings of guilt, insecurity or low esteem that has carried over into the dream world. Perhaps you feel you have failed yourself or others.<\/p>"
    },
    {
        "title": "Shampoo",
        "desc": "<p>To see or use shampoo in your dream indicates that you need clear out your old attitudes and old ways of thinking. You may also need to take a different approach toward some situation or relationship. Alternatively, shampoo represents self-growth and you desire to present a new image of yourself to others.<\/p><p>To dream that you are shampooing someone else's hair represents issues of dependency and hopelessness.<\/p>"
    },
    {
        "title": "Shamrock",
        "desc": "<p>To see a shamrock in your dream symbolizes your need to be or feel protected.<\/p>"
    },
    {
        "title": "Shapes",
        "desc": "<p>To see various shapes in your dreams suggests that things in your life may literally be taking shape. You have a clearer understanding of things. Consult the specific shapes for additional meaning.<\/p><p>Dreaming of floating three-dimensional shapes means that you need to keep in mind that things are not one-sided. Consider issues or problems from a different perspective.<\/p>"
    },
    {
        "title": "Shape Shifting",
        "desc": "<p>*Please see<a href=\"#Metamorphosis\">Metamorphosis<\/a>, <a href=\"#Morph\">Morph<\/a> or: <a href=\"#Zoomorphism\">Zoomorphism<\/a>.<\/p>"
    },
    {
        "title": "Sharing",
        "desc": "<p>To dream that you are sharing something symbolizes your generosity toward others. Perhaps you need to be more generous with your feelings. Alternatively, the dream may be a metaphor for the &quot;shares&quot; you have in the stock market. You are expressing concern over your finances.<\/p>"
    },
    {
        "title": "Shark",
        "desc": "<p>To see a shark in your dream indicates feelings of anger, hostility, and fierceness. You are undergoing a long and difficult emotional period and may be an emotional threat to yourself or to others.Perhaps, you are struggling with your individuality and independence, especially in some aspect of your relationship. Alternatively, a shark represents a person in your life who is greedy and unscrupulous. This person goes after what he or she wants with no regards to the well-being and sensitivity of others. The shark may also be an aspect of your own personality with these qualities.<\/p><p>In particular, if you see a shark in shallow waters, then it means that you are emotionally vulnerable. You are trying to suppress your anger, but it is just too much to keep in.<\/p>"
    },
    {
        "title": "Sharpen",
        "desc": "<p>To sharpen an object in your dream suggests that you need to flexible in your thinking. Sometimes you need to adapt or yield to the requests of others. Consider the overall picture instead of just thinking about yourself.<\/p>"
    },
    {
        "title": "Shave",
        "desc": "<p>To dream that you are shaving suggests that you are making a minor life-changing decision. Some aspect of your daily routine is being altered. Alternatively, it may represent your severe attitude or some sort of self-punishment. It can also have sexual connotations.<\/p><p>To dream that someone is shaving your leg represents a loss of your independence. You are relying on others to get you through some difficult times. You need to build up your self-confidence and self-esteem.<\/p><p>To see someone shaving in your dream indicates that there is some conflict in your self-image. Perhaps what you portray or project does not match who you really are inside.<\/p><p>To dream that you are shaving your head indicates a desire to reveal more of yourself. If you leave some hair on your head, then it suggests that you are not completely prepared to let others see who you really are. You are still afraid what people might think. The few clumpsof your hair serve as some sort of safety net. Alternatively, shaving your head represents humbleness and humility.<\/p>"
    },
    {
        "title": "Shaving Cream",
        "desc": "<p>To see or use shaving cream in our dream signifies issues with your self-image. You are trying to fit in and act in accordance with what is acceptable by society. Alternatively, the dream represents lightheartedness.<\/p>"
    },
    {
        "title": "Shawl",
        "desc": "<p>To see or wear a shawl in your dream signifies comfort. You feel well protected.<\/p>"
    },
    {
        "title": "Shears",
        "desc": "<p>*Please see: <a href=\"#Scissors\">Scissors<\/a>.<\/p>"
    },
    {
        "title": "Sheath",
        "desc": "<p>To dream about a sheath means that you need to be on guard or on the look out about something. If the sheath is empty, then it means that you are nervous about a situation. You are feeling unprotected by some lurking danger.<\/p>"
    },
    {
        "title": "Shed",
        "desc": "<p>To see a shed in your dream suggests that you are not utilizing your full abilities and skills. You are letting your potential go to waste. Alternatively, the dream may be a pun on some characteristic or something that you need to shed and get rid of.<\/p>"
    },
    {
        "title": "Sheep",
        "desc": "<p>To see sheep in your dream indicates docility and conformity. You lack creativity, individuality and initiative to venture out on your own. You tend to go along with the group. Alternatively, seeing a sheep signifies your compassion. The dream may also be a metaphor on being sheepish. Perhaps you have done something wrong.<\/p><p>To see a black sheep in your dream symbolizes greed and temptation. The dream may also be a metaphor for someone who represents the black sheep in your family. Perhaps it is you who is the non-conformist.<\/p>"
    },
    {
        "title": "Sheets",
        "desc": "<p>*Please See: <a href=\"#Bedspread\">Bedspread<\/a>.<\/p>"
    },
    {
        "title": "Sheet Music",
        "desc": "<p>To see sheet music in your dream represents sensuality and harmony, especially in some waking relationship.Perhaps you are lacking these qualities in your relationship.<\/p>"
    },
    {
        "title": "Shelf",
        "desc": "<p>To see a shelf in your dream suggests that there is something that you need to put aside right now. You need to put your ideas or plans on hold.Alternatively, the objects on the shelf my refer to some aspect of yourself that you have forgotten or neglected.<\/p>"
    },
    {
        "title": "Shell",
        "desc": "<p>To see a shell in your dream signifies your inner desire to be sheltered, nourished and protected from life's problems. It also indicates that you are closing yourself off emotionally. You are keeping your feelings inside.<\/p>"
    },
    {
        "title": "Shelter",
        "desc": "<p>To see or dream that you are at a shelter represents the difficulties and sense of helplessness that you are experiencing. You are looking for some sort of security and stability. Alternatively it refers to your fear of things that are different from you.<\/p>"
    },
    {
        "title": "Shepherd",
        "desc": "<p>To see a shepherd in your dream symbolizes the nurturing aspect of your character. It represents guidance, direction, and unification.<\/p>"
    },
    {
        "title": "Shhh",
        "desc": "<p>To shhh someone in your dream indicates that you do not want to hear some truth. Alternatively, the dream symbolizes mutual understanding.<\/p><p>To dream that someone is shhhing you implies that your ideas or beliefs are being suppressed. You feel that you are unable to fully express yourself.<\/p>"
    },
    {
        "title": "Shield",
        "desc": "<p>To see a shield in your dream symbolizes emotional and spiritual protection, as well as physical protection. You may be feeling vulnerable and are in need of comfort.<\/p>"
    },
    {
        "title": "Shiny",
        "desc": "<p>To see something shiny in your dream represents your potential that has yet to be unleashed. Consider the significance of the shiny object as it holds something important.<\/p>"
    },
    {
        "title": "Ship",
        "desc": "<p>To see a ship in your dream denotes that you are exploring aspects of your emotions and subconscious. The state and condition of the ship is indicative of your emotional state. If you on on a ship and experience stormy weather, then it implies that you are going through some dramatic events in your waking life. If you dream of a cruise ship, then it suggests pleasant moods. If you dream of a warship, then it means that you are experiencing feelings of aggression. If you dream of a pirate ship, then it signifies your suppressed desires for freedom and adventure. Dreaming of a tanker ship implies that you are keeping your true feelings inside.<\/p><p>To dream that you are sailing the high seas in a ship denotes that you are still standing tall despite the emotional turmoil occurring in your life.<\/p><p>To dream that a ship has crashed or sunk suggests that you are feeling emotionally out of control. You are expressing some fear or uncertainly within your emotional state. You are afraid of losing something close to you because of certain difficulties.<\/p><p>To dream that you abandon ship indicates that you need to move on and let go. Your emotion may be holding you back. Alternatively, consider the phrase &quot;jumping ship&quot;, to indicate changing of sides.<\/p>"
    },
    {
        "title": "Shipwreck",
        "desc": "<p>To see or dream that you are shipwrecked suggests that you are experiencing some emotional conflict or are having difficulties in expressing your feelings. Additionally, the dream means that you are you ready to confront some issues in your subconscious.<\/p>"
    },
    {
        "title": "Shirt",
        "desc": "<p>To dream of a shirt refers to your emotions or some emotional situation. The shirt you wear reveals your attitude and level of consciousness about a particular situation. In particular, if you are wearing a sleeveless shirt in your dream, then it implies that you need to be more aggressive in your approach to a problem, task or situation.<\/p><p>To dream that you are giving a shirt to someone may be a metaphor for &quot;giving the shirt off your back&quot;. It refers to your self-sacrifice and generosity.<\/p><p>To dream that you are shirtless or that you lost your shirt signifies financial worry, monetary lost or risky endeavor. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Shit",
        "desc": "<p>*Please see also: <a href=\"#Feces\">Feces<\/a> or: <a href=\"#Defecate\">Defecate<\/a>.<\/p>"
    },
    {
        "title": "Shiva",
        "desc": "<p>To see the Hindu god Shiva in your dream signifies struggle and conflict. You are undecided between two choices you have to make.<\/p>"
    },
    {
        "title": "Shiver",
        "desc": "<p>To shiver in your dream indicates that you are experiencing some deep seated fears from the subconscious. The dream may also highlight your emotions and how cold and rigid you are behaving.<\/p>"
    },
    {
        "title": "Shock",
        "desc": "<p>To dream that you receive a shock represents a sudden awakening and new awareness.<\/p>"
    },
    {
        "title": "Shoebox",
        "desc": "<p>To see a shoebox in your dream suggests that you are headed toward a new direction in life. You are in for a new experience.<\/p><p>To see an empty shoebox in your dream indicates that you are feeling lost. You are still trying to figure out your direction in life.<\/p>"
    },
    {
        "title": "Shoehorn",
        "desc": "<p>To see or use a shoehorn in your dream suggests that you are forcing yourself or something into a situation where it is not wanted or welcomed. You tend to leave others no choices.<\/p>"
    },
    {
        "title": "Shoelace",
        "desc": "<p>To dream that your shoelaces are untied indicate that you are unprepared for some task at hand. Perhaps you are not ready to move forward in a relationship or endeavor. Alternatively, the dream may mean that you are living under limited means. Consider the phrase a &quot;shoestring budget&quot;.<\/p><p>To dream that you are tying your shoelaces suggest that you are getting ready for a challenge. Or you are ready to move forward with your goals or a decision.<\/p>"
    },
    {
        "title": "Shoemaker",
        "desc": "<p>To see or dream that you are a shoemaker suggests that a situation or relationship that you thought was dead or dormant is active again. Alternatively, the dream indicates that you need to reevaluate your approach to life. You need to learn to ask for help from others.<\/p>"
    },
    {
        "title": "Shoes",
        "desc": "<p>In general, shoes represent your approach to life. Wearing shoes in your dream suggests that you are well-grounded or down to earth.It also represents your convictions about your beliefs. If you are changing your shoes, then it refers to your changing roles. You are taking a new approach to life. If you forget your shoes, then it suggests that you are leaving behind your inhibitions. You are refusing to conform to some idea or attitude.<\/p><p>To see old and worn shoes in your dream indicates that you will find success through hard work and diligence. You have come to terms about who you are.<\/p><p>To see new shoes in your dream suggests that you are overconfident in your success. Alternatively you may be on a life path that is unfamiliar to you.<\/p><p>To find shoes in your dream suggests that you have regained your foothold on life. You are back on the right path again.<\/p><p>To dream that you are wearing inappropriate shoes for the occasion or for the activity at hand means that your progress and path in life will be long, hard and laborious. It may also indicate that you are heading in the wrong direction. Perhaps you need to reevaluate your goals. If you dream that your shoes do not fit or that they pinch and hurt, then it means that you are questioning your goals. You are doubting the direction of the path you are taking.<\/p><p>To dream that you are not wearing any shoes indicates that you have low self-esteem and a lack of confidence in yourself. You are dealing with issues about your self-identity. It also represents poverty, lack of mobility, or misunderstanding. Alternatively, to dream that you are not wearing shoes represent your playful attitudes and relaxed, carefree frame of mind. You have a firm grasp and good understanding on a situation. If you dream that you lose your shoes, then it suggests that you are searching for your identity and finding yourself.<\/p><p>To see baby shoes in your dream symbolizes purity, innocence, vulnerability, tenderness and the desire for love. If you are planning to have or already have a baby, then it suggests that the baby will or has grounded you. After all, with a baby to tend to, you find yourself rooted at home most of the time and not being able to go out as much.<\/p><p>Dreaming that you are wearing mismatched shoes implies that you are rushing into things and approaching them too hurriedly or sloppily. If you dream that a baby is wearing mismatched shoes, then it means that some aspect of your life is not going the way you want it.<\/p>"
    },
    {
        "title": "Shooting",
        "desc": "<p>To see a shooting in your dream indicates that you have a set goal and know what to aim for in life. Your plans are right on target!<\/p><p>To dream that you shoot a person with a gun denotes your aggressive feelings and hidden anger toward that particular person. If the person you shoot is a stranger, then it indicates that you are rejecting unknown aspects of yourself that you do not understand.<\/p><p>To dream that someone is shooting you with a gun suggests that you are experiencing some confrontation in your waking life. You may be feeling victimized in some situation. If you dream that someone is shooting you in the back, then it means that you are involved with some questionable people who may be harmful to your well-being. It also implies that you are too trusting of others.<\/p>"
    },
    {
        "title": "Shooting Range",
        "desc": "<p>To dream that you are at a shooting range symbolizes your outlet for your aggression and anger. You need to express your frustrations and negative feelings in a safe and constructive way. Alternatively, the dream refers to your determination and dedication. You are zeroing in on your goal.<\/p>"
    },
    {
        "title": "Shooting Star",
        "desc": "<p>To see a shooting star in your dream is a sign of self-fulfillment and advancement. A shooting star is also symbolic of a new birth and big changes in your life.<\/p>"
    },
    {
        "title": "Shoplift",
        "desc": "<p>To dream that you are shoplifting indicates that you are feeling deprived of your needs and desires. You may be lacking love. You feel that you are being shunned or shut out of opportunities that are available to others. Alternatively, the dream represents your sense of entitlement to certain things. Consider the significance of the item that you are shoplifting for further interpretation.<\/p>"
    },
    {
        "title": "Shopping",
        "desc": "<p>To dream that you are shopping symbolizes your needs and desires. It also represents opportunities and options that you come across in life. Consider what you are shopping for and what needs you are try to fulfill. In particular, to dream that you are shopping for food and groceries signifies your hidden attempt to buy the attention of others. If you are shopping for clothes, then it suggests that you are trying to put forth a new image.<\/p><p>To dream that you cannot find what you are shopping for suggests that you are trying to find a solution to some life problem.<\/p><p>To dream that you are shopping for gifts for someone implies that you are looking or searching for acceptance.<\/p>"
    },
    {
        "title": "Shopping Bag",
        "desc": "<p>To see or carry a shopping bag in your dream represents the reward for your hard work and efforts. If you are carrying many shopping bags in your dream, then it refers to your materialistic attitude.<\/p>"
    },
    {
        "title": "Shopping Cart",
        "desc": "<p>To see or use a shopping cart in your dream indicates that you are reaping the rewards and benefits of your hard work. Alternatively, to push a shopping cart in your dream suggests that you need to search out more options for some aspect of your life. Remember that you have choices and you do not need to settle. If the shopping cart is empty, then it suggests that you are coming up empty in some endeavor or plan.<\/p>"
    },
    {
        "title": "Shore",
        "desc": "<p>To see the shore in your dream suggests that your emotional needs are satisfied and inner turmoil has been resolved. It refers to the point where the conscious mind meets the subconscious. You have come to a place of solace and comfort. Alternatively, the dream indicates that you have explored all your options and need to think outside the box. There is still endless possibilities for you to consider.<\/p>"
    },
    {
        "title": "Short",
        "desc": "<p>To dream that someone is shorter than you indicates that you may be looking down on that person. You feel that you are above her or him. Alternatively, the dream represents authority and pride.<\/p><p>To dream that you are shorter than everyone suggests that you have a tendency to overlook things. Perhaps you feel that a higher power is always looking over you and judging your actions. Alternatively, the dream denotes low self-esteem issues. You are looking down on yourself.<\/p>"
    },
    {
        "title": "Shortcut",
        "desc": "<p>To take a shortcut in your dream indicates that you are being careless. You are trying to achieve success without doing the work. Alternatively, the dream implies that you are being shorted or getting the short end of the stick. You feel that you are being unfairly treated.<\/p>"
    },
    {
        "title": "Shorts",
        "desc": "<p>To dream that you are wearing shorts indicates that you are ready to be more open and reveal a little more about your inner persona. Alternatively, the image of shorts refers to your youth and playful attitude. The dream may also be a metaphor that you are selling yourself short.<\/p>"
    },
    {
        "title": "Shot",
        "desc": "<p>To dream that you are shot or being shot at represents a form of self-punishment that you may be subconsciously imposing on yourself. You may have done something that you are ashamed of or are not proud of. If you are shot and come back as a different person, then it indicates that you need to start fresh. You want to wipe the past away and literally become a new person.<\/p><p>*Please also see: <a href=\"#injection\">Injection<\/a> or: <a href=\"#Syringe\">Syringe<\/a>.<\/p>"
    },
    {
        "title": "Shot Put",
        "desc": "<p>To see or throw a shot put in your dream indicates that you are having a hard time getting rid of something that is weighing you down in your life.<\/p>"
    },
    {
        "title": "Shotgun",
        "desc": "<p>To see or shoot a shotgun in your dream means that you need to better focus your energies toward your goal.<\/p><p>*Please also see: <a href=\"#Gun\">Gun<\/a>.<\/p>"
    },
    {
        "title": "Shoulders",
        "desc": "<p>To see your shoulders in your dream symbolize strength, responsibility and burdens. Perhaps you feel that you have too much responsibility to bear and are overburdened by circumstances in your life. Alternatively, shoulders represent your ability to offer support and nurturance others.<\/p>"
    },
    {
        "title": "Shout",
        "desc": "<p>*Please See: <a href=\"#yelling\">Yelling<\/a>.<\/p>"
    },
    {
        "title": "Shovel",
        "desc": "<p>To see a shovel in your dream suggests that you are seeking knowledge, insight, and inner intellect. You are on a quest for a new understanding of your true Self. Alternatively, a shovel means that you are trying too hard in finding the truth to a problem.<\/p><p>To dream that a shovel is broken indicates that you are frustrated with work.<\/p>"
    },
    {
        "title": "Shower",
        "desc": "<p>To dream that you are taking a shower in clear, fresh water symbolizes spiritual or physical renewal and forgiveness. You are washing the burdens out of your life. Alternatively, the dream may be a metaphor that you are &quot;showering&quot; someone with gifts or love.<\/p><p>To dream that you are taking a shower in dirty or muddy water implies that you are feeling unclean about a situation.<\/p><p>To dream that you are showering with your clothes on means that even though you may change your outer appearances, it does not change who you are on the inside. Alternatively, your dream indicates that you are unwilling to let your guard down. You are still keeping up a protective barrier between you and others.<\/p><p>To dream that you are showering with someone suggests that there is something that you need to &quot;come clean&quot; or confess to this person. It is time to be honest. Perhaps the dream is telling you that you need to let down your guard. If you are showering with a group of people, then it means that you are feeling exposed. You feel that your sense of privacy is being invaded.<\/p><p>Dreaming that you are unable to take a shower or that the shower is not working properly means that you are unable to shed some burden. You are feeling weighed down by your emotions or by some responsibility.<\/p>"
    },
    {
        "title": "Shower Cap",
        "desc": "<p>To dream that you are wearing a shower cap suggests that you are trying to shield yourself from some emotional situation. You are trying to remain rational and objective by separating your emotions.<\/p>"
    },
    {
        "title": "Shower Curtain",
        "desc": "<p>To see a shower curtain in your dream indicates that you are not fully expressing your emotions. There is something that you are still hiding from others. Alternatively, the dream suggests that you are trying to protect those around you from your personal setbacks and emotional outbursts.<\/p><p>To see a dirty or moldy shower curtain in your dream represents negative emotions that you are repressing. You feel ashamed about your own feelings.<\/p>"
    },
    {
        "title": "Shrapnel",
        "desc": "<p>To see someone hit with shrapnel signifies the consequences of your own temper. Your actions and anger affect those around you even though it may not be directed at them.<\/p><p>Dreaming that you are hit with shrapnel indicates that you are in the way of someone's goals. Perhaps you are getting involved in some issue where you are not wanted.<\/p>"
    },
    {
        "title": "Shredder",
        "desc": "<p>To see or use a shredder in your dream indicates that there is something that you are trying to hide or protect. Perhaps you are in denial about something. Also consider the significance of what you are shredding.<\/p>"
    },
    {
        "title": "Shrimp",
        "desc": "<p>To see or eat shrimp in your dream suggests that you are feeling overpowered and insignificant. You feel like you want to hide from the world and be left alone for awhile.<\/p>"
    },
    {
        "title": "Shrine",
        "desc": "<p>To see or make a shrine in your dream indicates that you are putting too much of your energy into one element of your life.<\/p>"
    },
    {
        "title": "Shrink",
        "desc": "<p>To dream that you are shrinking suggests that you lack self-confidence and self-esteem. You may be feeling embarrassed, insignificant or unimportant in some situation. Perhaps you feel that you have been overlooked by others. Alternatively, the dream may refer to a time were you were young and small and thus, symbolic of your childhood.<\/p><p>To see others shrink in your dream indicates their insignificance. This may also be a pun on a psychologist and your need to consult one.<\/p><p>To see objects shrinking in your dream indicate that they are not as important as they once were.<\/p>"
    },
    {
        "title": "Shroud",
        "desc": "<p>To see a shroud in your dream symbolizes death or the end of something. Alternatively, the dream indicates that you are trying to hide or suppress some emotion or aspect of your life that you are not ready to confront.<\/p>"
    },
    {
        "title": "Shuffleboard",
        "desc": "<p>To watch or play shuffleboard in your dream indicates that you are idling in some area of your life. Alternatively, playing shuffleboard in your dream represents your desires to knock others out of your path in order to achieve your own goals.<\/p>"
    },
    {
        "title": "Shun",
        "desc": "<p>To dream that you are shunning someone indicates that there is some aspect of yourself that you are also rejecting or refusing to acknowledge.<\/p><p>To dream that you are being shunned signifies a lack of self-worth. You feel alienated. Alternatively, the dream means that you are being too agreeable and accommodating to the point where your own sense of self is lost. You need to be more assertive and learn to say no to others.<\/p>"
    },
    {
        "title": "Shuriken",
        "desc": "<p>To see or throw a shuriken in your dream indicates that you are carrying around some anger, which is about to erupt in a sudden way. If you dream that someone is throwing a shuriken at you, then it means that there is some unexpected anger directed at you.<\/p>"
    },
    {
        "title": "Shutters",
        "desc": "<p>To see window shutters in your dream suggest that you are shutting yourself out in some aspect of your daily life. Or you are shutting someone or something out of your life. Alternatively, you feel that others are trying to hide something from you.<\/p>"
    },
    {
        "title": "Shy",
        "desc": "<p>To dream that you are shy suggests that you need to be more assertive, aggressive and confident in your abilities and talents. The dream may indicate that there is a waking situation that you are trying to avoid.<\/p>"
    },
    {
        "title": "Siamese Twins",
        "desc": "<p>To see Siamese twins in your dream indicates a major conflict in your life. You do not know what direction to take. Alternatively, the dream may be telling you that your decision will directly affect another.<\/p>"
    },
    {
        "title": "Sibling",
        "desc": "<p>To see your sibling in your dream indicates unresolved issues with your sibling or unresolved issues from your childhood that needs to be confronted. Consider their actions in your dream and how it may be a reflection of your own self and your character.<\/p><p>To see someone else's sibling(s) in you dream represents a quality or characteristic of that sibling that you need to incorporate and acknowledge within yourself.<\/p>"
    },
    {
        "title": "Sibling Rivalry",
        "desc": "<p>To dream of sibling rivalry suggests feelings of insecurity or doubt. You are feeling a lack of love.<\/p>"
    },
    {
        "title": "Sibyl",
        "desc": "<p>To see a sibyl in your dream symbolizes insight, intuition and feminine instinct. You are able to see beyond the surface and look at what is on the inside.<\/p>"
    },
    {
        "title": "Sick",
        "desc": "<p>To dream that you or others are sick denotes discordance and trouble in your life. It may signal a part of yourself that needs to be healed, either physically or mentally. Perhaps you are wallowing in your own self-pity. You need to quit feeling sorry for yourself.<\/p><p>*Please see also: <a href=\"#Illness\">Illness<\/a>.<\/p>"
    },
    {
        "title": "Sickle",
        "desc": "<p>To see a sickle in your dream is symbolic of your labor and hard work. The symbol may also be a pun on &quot;sicko&quot;.<\/p>"
    },
    {
        "title": "Sideburns",
        "desc": "<p>To dream that you have sideburns implies that you are giving serious thought to some issue or problem.<\/p>"
    },
    {
        "title": "Sidecar",
        "desc": "<p>To see or ride in a sidecar in your dream indicates that you desire independence and control of your own destiny, but something or someone is holding you back.<\/p>"
    },
    {
        "title": "Sides",
        "desc": "<p>To see the side of something in your dream suggests that you are not approaching the problem directly.<\/p><p>To dream that your sides hurt suggest that what may seem like a lighthearted situation can turn out to be harmful.<\/p>"
    },
    {
        "title": "Sidesaddle",
        "desc": "<p>To dream that you are riding sidesaddle on a horse implies that there is an imbalance of power.You are in a situation where you don't feel like you have full control.<\/p>"
    },
    {
        "title": "Sidewalk",
        "desc": "<p>To dream that you are walking on a sidewalk represents your steady progress and direction in life. You may be experiencing new walks of life. If the sidewalk is cracked, then it signifies minor and temporary setbacks that are keeping you from getting to your destination. Perhaps you need to alter your course and make some changes in your life.<\/p>"
    },
    {
        "title": "Sideways",
        "desc": "<p>To dream that you are traveling or walking sideways suggests that you are not approaching your problems or issues head on. You need to be more straightforward in your approach. Be more direct.<\/p>"
    },
    {
        "title": "Sieve",
        "desc": "<p>To see a sieve in your dream signifies your ability to weigh your options and make wise decisions.<\/p>"
    },
    {
        "title": "Sifter",
        "desc": "<p>To see or use a sifter in your dream is a sign that you need to rid yourself of things that are weighing you down or holding you back. Sort out the things that are important and unimportant in your life. Alternatively, dreaming of a sifter points to your desires for the finer things in life.<\/p>"
    },
    {
        "title": "Sigh",
        "desc": "<p>To hear sighing or dream that you are sighing indicates that you are feeling overwhelmed by waking problems.Alternatively, the dream signifies &quot;a sigh&quot; of relief.<\/p>"
    },
    {
        "title": "Sign",
        "desc": "<p>To see a sign in your dream indicates that you need help. You need some direction and guidance in your life. Pay attention to what the sign says and what it is pointing you to do. Perhaps the dream is highlighting &quot;a sign of the times&quot;.<\/p>"
    },
    {
        "title": "Sign Language",
        "desc": "<p>To communicate in sign language in your dream suggests that you need to find other ways to get your opinion heard since no one is listening to you.<\/p>"
    },
    {
        "title": "Sign Twirler",
        "desc": "<p>To see a sign twirler in your dream refers to a message from your subconscious that you need to listen to or follow. The sign may be trying to point you in the direction that you need to go.<\/p><p>Dreaming that you are a sign twirler means that there is a message or feeling that you are trying to get across. Perhaps you need to be more direct about your desires and wishes.<\/p>"
    },
    {
        "title": "Signature",
        "desc": "<p>To see your signature in your dream represents your agreement and acceptance for a particular condition or situation. It is also an indication of your seal of approval. You are taking charge and accepting responsibility of a situation. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Silence",
        "desc": "<p>To dream that you are silent indicates an inability to express yourself. You may feel inhibited in voicing your opinion and how you really feel.Alternatively, the dream refers to a situation in your waking life that has left you speechless.<\/p><p>To dream that someone is silent means that you are unsure about this person's intentions. Perhaps you are still trying to understand them. There may be a sense of uneasiness.<\/p>"
    },
    {
        "title": "Silhouette",
        "desc": "<p>To see a silhouette in your dream represents some aspect of your life that is not clearly defined. It may also refer to the undeveloped or unacknowledged aspects of your character.<\/p>"
    },
    {
        "title": "Silk",
        "desc": "<p>To see or feel silk in your dream represents luxury, smoothness, and softness.<\/p><p>To dream that you are wearing silk suggests prestige. You will never lack the necessities of life.<\/p>"
    },
    {
        "title": "Silly String",
        "desc": "<p>To see silly string in your dream implies that you are trying to divert attention away from a problem. You are covering up your true feelings.<\/p>"
    },
    {
        "title": "Silo",
        "desc": "<p>To see a silo in your dream suggests that you need to save money. Perhaps you are wasting your money on frivolous things and need to think about saving up.<\/p>"
    },
    {
        "title": "Silver",
        "desc": "<p>To see silver in your dream symbolizes the moon, intuition and the feminine aspects of yourself. It signifies tranquility and understated confidence.<\/p>"
    },
    {
        "title": "Silverfish",
        "desc": "<p>To see silverfish in your dream represents a problem or situation that you have overlooked or refuse to address. Perhaps you are in denial about something. If you dream of a lot of silverfish, then it means that this problem or situation can no longer be ignored.<\/p>"
    },
    {
        "title": "Silverware",
        "desc": "<p>To see or use new and fancy silverware in your dream indicates harmony in your domestic life. Things are going well. Alternatively, the dream signifies your willingness to help others and to lend a hand.<\/p>"
    },
    {
        "title": "Simon Says",
        "desc": "<p>To dream that you are playing Simon Says implies that you need to listen to directions carefully. If you lose, then the dream indicates that you are blindly following orders. You are obeying without hesitation.<\/p>"
    },
    {
        "title": "The Simpsons",
        "desc": "<p>To dream about the Simpsons cartoon implies that you need to take a more unconventional approach to a situation.<\/p>"
    },
    {
        "title": "Sin",
        "desc": "<p>To dream that you or someone has sinned suggests that you are harboring some inner guilt that you are harboring. You have done something that you are not proud of or that is festering inside you.<\/p>"
    },
    {
        "title": "Sindoor",
        "desc": "<p>To wear sindoor in your dream implies that you are undergoing a transitional phase in your life. The dream signals a new beginning for you. Alternatively, the dream may refer to your excitement about getting married.<\/p><p>To dream that your girlfriend is wearing sindoor indicates that you do not know where you stand in the relationship. You are feeling distant from her.<\/p>"
    },
    {
        "title": "Singer",
        "desc": "<p>To see a famous singer in your dream represents a divine influence. It indicates harmony and glorification of the human spirit. Consider also your general impression of this singer and how those specific qualities may be triggered by someone or some situation in your waking life.<\/p>"
    },
    {
        "title": "Singing",
        "desc": "<p>To sing in your dream represents happiness, harmony and joy in some situation or relationship. You are uplifting others with your positive attitude and cheerful disposition. Singing is a way to celebrate, communicate, embrace and express your feelings.<\/p><p>To hear someone sing in your dream signifies emotional and spiritual fulfillment. Your mood is changing for the positive as your outlook in life is looking up.<\/p><p>To hear someone sing in your dream signifies emotional and spiritual fulfillment. Your mood is changing for the positive as your outlook in life is looking up. In particular, dreaming that an enemy is singing to you means that you need to reevaluate the negativity you have towards the enemy. Perhaps it is time to let go of the animosity or some of the feelings you are harboring.<\/p>"
    },
    {
        "title": "Single",
        "desc": "<p>If you are not single, but dream that you are, then it suggests that you need to stand up for yourself. You need to approach a situation or matter on your own instead of leaning on others. Be strong. Alternatively, the dream may be a metaphor that you are being &quot;singled&quot; out or being picked on.<\/p>"
    },
    {
        "title": "Sink",
        "desc": "<p>To see a sink in your dream represents your feelings and your ability to control your emotions. You may need to cleanse yourself of past feelings and start fresh. Consider also the common phrase &quot;everything but the kitchen sink&quot; which refers to a situation where you have almost everything that you can possible want or need. The symbol may also be a pun on &quot;sinking&quot; or drowning.<\/p>"
    },
    {
        "title": "Sinkhole",
        "desc": "<p>To see a sinkhole in your dream suggests that you are unsure of where you stand emotionally in some relationship. You are feeling unstable. Alternatively, the dream symbolizes your shaky foundation.<\/p>"
    },
    {
        "title": "Sinking",
        "desc": "<p>To dream that you or something is sinking suggests that you are feeling overwhelmed. Someone or something is pulling your down. You may be experiencing low self-esteem and confidence. Alternatively, the dream means that some important and significant stage in your life may be coming to an end. Consider what is sinking and its significance.<\/p><p>*Please see also: <a href=\"#Drowning\">Drowning<\/a>.<\/p>"
    },
    {
        "title": "Sippy Cup",
        "desc": "<p>To see or use a sippy cup in your dream implies that you need to take things more slowly in a new relationship.<\/p>"
    },
    {
        "title": "Siren",
        "desc": "<p>To see a Greek Siren in your dream symbolizes some temptation in your waking life. You are being lured into a harmful situation.<\/p><p>To dream that you are a Greek Siren reflects your hidden desires to be more sexually daring and adventurous.<\/p>"
    },
    {
        "title": "Sirens",
        "desc": "<p>To hear sirens in your dream signify a situation or problem that is giving you much stress. The sirens may serve to get your attention and focus on the problem at hand.<\/p><p>To see sirens in your dream, but not hear them refers to your ability to block out certain aspects of a problem. You are only seeing part of the issue. Alternatively, seeing sirens is a warning.<\/p>"
    },
    {
        "title": "Sister",
        "desc": "<p>To see your sister in your dream symbolizes some aspect of your relationship with her, whether it one of sibling rivalry, nurturance, protectiveness, etc. Your sister may draw attention to your family role. Or the dream may also serve to remind you that someone in your waking life has characteristics similar to your sister. Alternatively, your sister may be a metaphor for a nun. In this case, she may represent some spiritual issues.<\/p><p>If you do not have a sister and dream that you have one, then it signifies feminine qualities that you need to activate or acknowledge within your own self. Pay attention to the actions and behavior of your dream sister.<\/p>"
    },
    {
        "title": "Sister-In-Law",
        "desc": "<p>To see your sister-in-law in your dream represents characteristics in her that you find within your own self. Consider also your waking relationship with her. If you dream that you are arguing with your sister-in-law, then it suggests that you are refusing to acknowledge or accept certain qualities of your sister-in-law.<\/p>"
    },
    {
        "title": "Sit-Com",
        "desc": "<p>*Please See: <a href=\"#Comedy\">Comedy<\/a>.<\/p>"
    },
    {
        "title": "Sit Ups",
        "desc": "<p>To do sit ups in your dream suggests that you need to pay better attention to something in your life, like a relationship, school, work, family, or project. Alternatively, doing sit ups could indicate that you need to show more pride and confidence in your ability.<\/p>"
    },
    {
        "title": "Sitar",
        "desc": "<p>To see or hear a sitar in your dream signifies passion, joy and healing. The sitar is also symbolic of the Indian culture.<\/p>"
    },
    {
        "title": "Sitting",
        "desc": "<p>To dream that you are sitting indicates your indecision. You do not know what you want to do about something. It also suggests that you are idling and wasting your life away.<\/p>"
    },
    {
        "title": "Size",
        "desc": "<p>To dream about the size of something represents the importance or lack of importance that you attach to certain objects or persons. The larger something is, the more important it is. Conversely, the smaller something is, the more trivial it is. Size also relates the degree of power you are exerting and the power others have on you. Perhaps the dream indicates that you are &quot;sizing&quot; someone up. According to Freudian school of thought, the size of an object, signifies the size of someone's penis, perhaps your own or your lover.<\/p>"
    },
    {
        "title": "Skateboard",
        "desc": "<p>To see or ride a skateboard in your dream indicates that you have the gift of making any difficult situation look easy. You carry yourself with style, grace and composure in the hardest of situations. Alternatively, the dream signifies your free and fun-loving side.<\/p>"
    },
    {
        "title": "Skatepark",
        "desc": "<p>To dream that you are at a skatepark means that you are not afraid of confronting obstacles that may stand in your way. You confront these obstacles head on without hesitation.<\/p>"
    },
    {
        "title": "Skating",
        "desc": "<p>To dream that are skating symbolizes your ability to maintain a balance in your life. You are progressing through your life's path and working toward your goal. Alternatively, the dream may be a metaphor that you are &quot;skating&quot; over some matter. In other words,you are just getting by. Perhaps you are tying to avoid some issue or not devoting enoughattention to a problem.<p>To dream that you are skating on ice indicates satisfaction witha current project. Consider also the phrase &quot;skating on thin ice&quot; to suggest that you may be on the verge of overstepping your boundaries or taking certain risks in your waking life.<\/p>"
    },
    {
        "title": "Skeeball Machine",
        "desc": "<p>To see or play with a Skeeball machine in your dream indicates that you do not let slim chances of success deter you from going after your goals.<\/p>"
    },
    {
        "title": "Skeleton",
        "desc": "<p>To see a skeleton in your dream represents something that is not fully developed. You may still in be the planning stages of some situation or project. Alternatively, a skeleton symbolizes death, transformation, or changes. You need to get to the bottom of some matter. The skeleton may also be a metaphor for &quot;skeletons in your closet.&quot; Do you have something to hide?<\/p><p>To see someone depicted as a skeleton signifies that your relationship with them is long dead.<\/p>"
    },
    {
        "title": "Skeleton Key",
        "desc": "<p>To see a skeleton key refers to old emotions or memories that you have stored or locked away.<\/p>"
    },
    {
        "title": "Sketch",
        "desc": "<p>To see or draw a sketch of yourself in your dream suggests that you need to view a situation from a different perspective. The dream may also be a metaphor that you need to &quot;draw out&quot; or recognize some aspect of yourself.<\/p>"
    },
    {
        "title": "Ski Jump",
        "desc": "<p>To perform a ski jump in your dream represents a new project or relationship that is taking off quickly. How you land is indicative of the degree of success of the project or relationship. If you tumble, then it means that you need to slow down. If you land gracefully, then you need to stay the course and keep on the track. If you go down the ski jump without skis, then it suggests that you are not completely ready for the task ahead. You are unprepared. This may also be a variation of a <a href=\"http:\/\/www.dreammoods.com\/commondreams\/flying-dreams.html\">flying dream<\/a>.<\/p>"
    },
    {
        "title": "Ski Lift",
        "desc": "<p>To see or ride a ski lift in your dream indicates that you are achieving new heights and overcoming your fears. You have a command over your emotions and are confronting those feelings and inhibitions that you have repressed.You are close to bringing them to the surface.<\/p>"
    },
    {
        "title": "Ski Mask",
        "desc": "<p>To see or wear a ski mask in your dream refers to a dark secret you are keeping. Alternatively, it refers to your desire for anonymity in a situation.<\/p><p>To see someone in a ski mask represents the shadow aspect of your persona.<\/p>"
    },
    {
        "title": "Ski",
        "desc": "<p>If you dream that you are wearing skis and going about your day, then it points to your daily challenges. The dream may also imply that you are feeling awkward in a situation. Perhaps you are headed in the wrong direction. In particular, if you are trying to climb up a ladder while wearing skis, then it indicates that you are succeeding despite those around you telling you that you will fail.<\/p><p>To dream that you are skiing suggests that you are pushing yourself and putting your mental and\/or physical ability to the test. You are your own fiercest competitor.<\/p>"
    },
    {
        "title": "Skillet",
        "desc": "<p>*Please see: <a href=\"#Pan\">Pan<\/a>.<\/p>"
    },
    {
        "title": "Skin",
        "desc": "<p>To dream of your skin represents protection or shield of your inner self. It serves as a physical boundary and how close you let others get to you. Alternatively, your skin indicates that you are being too superficial or shallow.<br><br>To dream that your skin is covered with rashes or other skin deformities signifies your fear of facing a harsh reality. You are afraid of making a wrong impression. The dream may also be a pun that you are making a rash decision. If you dream that your skin has been burned, then it implies that you are unwilling let down your guard. Your line of defense has been compromised. This dream may also be a metaphor that you are &quot;getting burned&quot; or humiliated by someone or some situation.<\/p><p>Dreaming that your skin is melting, deteriorating, or developing holes implies that you are losing your defenses. Your guard is down. Alternatively, the dream means that you are being worn down.<\/p><p>To dream that your skin is orange signifies self-love. You are content with who you are.<\/p><p>To dream that your skin is different color suggests that you are not being true to yourself. Look up the specific color for additional meaning. If your skin is darker than your true skin, then it may mean that you are trying to hide or blend into the background. If it is lighter than your true skin, then it symbolizes fear. Alternatively, it may be a sign of sickness. Perhaps a call to the doctor is in order.<\/p>"
    },
    {
        "title": "Skinless",
        "desc": "<p>Todream that you or someone else is skinless suggests that you are having difficulties in sensing your emotional and psychological world. You are experiencing anxieties about how you are being perceived by others. You need to look beyond the superficial and find the truth about yourself and about others.<\/p>"
    },
    {
        "title": "Skinning",
        "desc": "<p>To dream that you are skinning an animal implies that you want to make your animalistic desires known.<\/p><p>To dream that you are skinning yourself means that you are revealing your true self. You want others to know exactly who you are.<\/p>"
    },
    {
        "title": "Skinny",
        "desc": "<p>*Please see: <a href=\"#Thin\">Thin<\/a>.<\/p>"
    },
    {
        "title": "Skinny Dipping",
        "desc": "<p>To dream that you are skinny dipping indicates that you are freely and openly exploring aspects of your subconscious.<\/p>"
    },
    {
        "title": "Skipping",
        "desc": "<p>To dream that you are skipping suggests that you need to be more light-hearted. You may need to take a friendlier approach toward a situation. Alternatively, the dream may be a metaphor that you have skipped something important.<\/p>"
    },
    {
        "title": "Skirt",
        "desc": "<p>To dream that you are wearing a skirt represents the signals and hidden messages that you are conveying or sending out. It also symbolizes femininity and your sense of sexuality. The dream may also be a metaphor on an issue that you are &quot;skirting&quot; around over and not confronting head on.<\/p><p>If you are a man and dream that you are wearing a skirt, then it indicates that you need to acknowledge the emotional aspects of your personality.<\/p>"
    },
    {
        "title": "Skull",
        "desc": "<p>To see a skull in your dream symbolizes danger, evil or death. Alternatively, a skull represents the intellect or secrets of the mind. You are keeping certain things hidden.<\/p><p>To dream that a skull is talking to you suggests that aspects of yourself that you have suppressed or rejected is starting to come back to the surface. These aspects will not be denied any longer and must be dealt with on a conscious level.<\/p><p>To dream that a skull is trying to swallow you indicates that you are literally being consumed by some danger<span id=\"ucPreviewMsg_lblMessage\" class=\"PreviewMsgText visualIEFloatFix\" style=\"font-size: 11pt\">.<\/p>"
    },
    {
        "title": "Skunk",
        "desc": "<p>To see a skunk in your dream suggests that you are driving people away or turning them off. Alternatively, the dream indicates that your suppressed anger is on the verge of exploding. You are not expressing your true feelings even though you do not agree with a decision.<\/p><p>To smell a skunk or to dream that the skunk is spraying indicates fear. Someone in your waking life may be threatened by you especially if you are being sprayed by the skunk. Alternatively, the dream means that it is time to confront your repressed anger.<\/p>"
    },
    {
        "title": "Sky",
        "desc": "<p>To look up at the clear blue sky in your dream denotes hope, possibilities, creativity, peace and freedom of expression. As the saying goes &quot;the sky's the limit.&quot; If the sky is cloudy and overcast, then it foretells of sadness and trouble.<\/p><p>To see a green colored sky in your dream symbolizes high hopes. The strange color of the sky helps to instantly draw your attention to it. The color green and the sky itself both represent hope, nature or creativity. So these are the qualities that you need to focus on. It is also indicative of a positive outlook and prosperous future.<\/p><p>To see a red colored sky in your dream represents looming danger. Alternatively, it suggests that something is coming to an end. If the sky is white, then it symbolizes desires. If you dream of a colorful sky in your dream, then it denotes romance.<\/p><p>To dream that the sky is falling represents your fear of the unknown. You feel that your hopes and dreams have been shattered. Perhaps you have been too idealistic and the dream is an attempt to bring you back to reality.<\/p><p>To dream that something is falling out of the sky signifies your pessimistic attitude. You are losing perspective on a situation. If the object is getting closer and casting a shadow on you, then it indicates that you are being ignorant about some situation. You need to get out from under the shadow and gain a different perspective on things.<\/p><p>Dreaming that the sky lowers itself and touches the roof of your house suggests that you may be setting your sights or goals too low. Perhaps you are lowering your standards. Alternatively, to dream that the sky is touching your roof represents spiritual guidance. Something or someone is looking out for you.<\/p>"
    },
    {
        "title": "Skydiving",
        "desc": "<p>To dream that you are skydiving represents your high ideals. Sometimes you need to compromise your ideals and be more realistic of your expectations.<\/p>"
    },
    {
        "title": "Skylight",
        "desc": "<p>To see or install a skylight in your dream represents enlightenment. You are receiving guidance from a higher source. The dream also highlights your connection to your spirituality.<\/p>"
    },
    {
        "title": "Skype",
        "desc": "<p>*Please see: <a href=\"#Video%20Chat\">Video Chat<\/a>.<\/p>"
    },
    {
        "title": "Skyscraper",
        "desc": "<p>To see a skyscraper in your dream represents your high ideals, creativity, accomplishments and imagination. You always aim high at whatever you do. The skyscraper is seen as a metaphor for the foresights and achievements of man. Alternatively, the dream represents the phallus.<\/p>"
    },
    {
        "title": "Skywriting",
        "desc": "<p>To see skywriting in your dream represents a spiritual message. It signifies a connection and union between the spiritual realm and the physical realm. You are looking for some reassurance.<\/p>"
    },
    {
        "title": "Slander",
        "desc": "<p>To dream that you are being slandered indicates that you are reevaluating your own values and questioning identity.<\/p><p>Dreaming that you are slandering someone implies your growing mistrust of others. You are suspicious of everyone's intentions.<\/p>"
    },
    {
        "title": "Slap",
        "desc": "<p>To dream that you are slapped in the face indicates carelessness. You either feel unappreciated or betrayed.<\/p><p>To dream that you slap someone suggests that you are harboring some repressed anger and deep-seated rage.<\/p><p>Dreaming of someone slapping someone else implies that you are not taking responsibility or stepping up to resolve issues that concern you in your waking life. You tend to watch things happen instead of taking control.<\/p>"
    },
    {
        "title": "Slate",
        "desc": "<p>To see slate in your dream symbolizes possibilities, potential, information and knowledge. You are open to criticism, ideas and opinions.<\/p>"
    },
    {
        "title": "Slaughter",
        "desc": "<p>To see or slaughter an animal in your dream signifies a loss or an end to an aspect of yourself. Consider the significance of the animal being slaughtered. If you dream that a lamb is being slaughtered, then it represents a loss of innocence. If a pig is being slaughtered, then it signifies an end to your greedy or lazy nature.<\/p><p>Dreaming that dogs are being slaughtered or disemboweled represent a bitter ending to a friendship. It indicates betrayal and\/or misplaced trust.<\/p>"
    },
    {
        "title": "Slaughterhouse",
        "desc": "<p>To see or dream that you are in a slaughterhouse suggests that you may need to compromise an aspect of yourself in order to move ahead.<\/p>"
    },
    {
        "title": "Slave",
        "desc": "<p>To dream that you are a slave suggests that you are not taking charge of your own life. You may be a slave to your job, to your family, to some habit, or to some obsession. In particular, to dream that you are a sex slave implies that you are too submissive when it comes to sex. Perhaps you need to take more of an initiative or be more dominant.<\/p><p>To free slaves in your dream implies that you are liberating an aspect of yourself that you have been suppressing or that you have previously not expressed.<\/p>"
    },
    {
        "title": "Slavery",
        "desc": "<p>To dream about slavery indicates that you are not utilizing your power. You are putting power in someone else's hands and allowing them to make choices and decide for you. Alternatively, the dream means that you are experiencing a lack of autonomy and independence.<\/p>"
    },
    {
        "title": "Sled",
        "desc": "<p>To see a sled in your dream signifies childishness.<\/p><p>To dream that you are sledding represents your fun-loving personality and open-minded perspectives on life.<\/p>"
    },
    {
        "title": "Sledgehammer",
        "desc": "<p>To see or use a sledgehammer in your dream suggests that you need to break down the walls that you have created around you.<\/p>"
    },
    {
        "title": "Sleep Talking",
        "desc": "<p>To dream that you are sleep talking or that someone told you that you were talking in your sleep means that you are feeling distant with someone who you were once close with. There is a lack of communication or understanding in the relationship. Alternatively, sleep talking in your dream is a sign that there is something you are afraid of talking about.<\/p>"
    },
    {
        "title": "Sleeping",
        "desc": "<p>To dream that you are sleeping denotes peace of mind. Alternatively, it means that you are ignorant of the conditions and circumstances around you. If you dream of sleeping together with someone (in a non-sexual manner), then it suggests that you are avoiding some issue or situation that is being symbolized by the person. If you do not know this person, then it indicates that you are refusing to recognize a negative or hidden aspect of yourself. Sleeping may also be synonymous with death in that it beckons renewal and new beginnings.<\/p><p>To see someone sleeping in your dream is a reflection of yourself and your own subconscious mind. It is telling you that you may not be alert or informed about a particular situation. More specifically, to see your parent(s) sleeping implies that you are turning a blind eye to certain things that would normally bother you. To see your boyfriend sleeping in your dream indicates that you are refusing to see a problem in the relationship. You are afraid to confront or bring up the issue.<\/p>"
    },
    {
        "title": "Sleeping Bag",
        "desc": "<p>To see a sleeping bag in your dream represents warmth and protection. You are expressing a desire to slowly explore the realm of your subconscious. Alternatively, a sleeping bag may be analogous to regressing back to the womb where you were completely dependent.<\/p>"
    },
    {
        "title": "Sleeping Beauty",
        "desc": "<p>To see Sleeping Beauty in your dream symbolizes eternal beauty. The dream may also be trying to tell you that you are oblivious to some situation. There is something that you are completely overlooking.<\/p>"
    },
    {
        "title": "Sleeping Pill",
        "desc": "<p>Tosee or take a sleeping pill in your dream indicates that you are choosing to be ignorant about a situation. You are not taking a proactive approach to life's decisions and are refusing to see the reality of things. Alternatively, the dream may mean that you are determined to make a fresh new start for yourself.<\/p>"
    },
    {
        "title": "Sleepover",
        "desc": "<p>Todream that you are at a sleepover indicates that there is a situation that you are refusing to see or accept. You need to be more alert and pay attention to what is going around you. Alternatively, the dream suggests that you need to let your guard down and learn to be more open and receptive.<\/p>"
    },
    {
        "title": "Sleepwalk",
        "desc": "<p>Todream that you are sleepwalking suggests that you are feeling emotionally detached from others. You are out of touch with what is happening around you. Alternatively, the dream means that you are stuck in a routine where you are doing things by rote. There is a lack of excitement and energy in your life. You are just going through the motions.<\/p>"
    },
    {
        "title": "Sleepy",
        "desc": "<p>To feel sleepy in your dream suggests that you are letting an opportunity pass you by if you do not take action. You need to pay more attention to your surroundings. Perhaps you are lacking knowledge or awareness in some area or issue.<\/p>"
    },
    {
        "title": "Sleeves",
        "desc": "<p>To notice your sleeves in your dream suggests that you need to protect yourself against your adversaries or haters out there. The dream may also be a metaphor that you need to roll up your sleeves and prepare for some hard work ahead.<\/p>"
    },
    {
        "title": "Slide",
        "desc": "<p>To dream that you or somebody is on a slide indicates that you are experiencing some instability in your waking life. You have lost your grip on a situation or relationship.<\/p><p>To dream that you are sliding represents a loss of control. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Slime",
        "desc": "<p>To see or feel slime in your dream represents your inability to place your trust in someone. The dream may be a metaphor for some one is a slimeball.<\/p>"
    },
    {
        "title": "Slingshot",
        "desc": "<p>To see or play with a slingshot in your dream represents the negative aspects of your childhood. You are feeling defensive about something. The dream may be brought about by some waking conflict that mimic your experiences from childhood.<\/p>"
    },
    {
        "title": "Slinky",
        "desc": "<p>To see or play with a Slinky toy in your dream denotes your flexibility and adaptability to any situation. It also indicates your ability to take action quickly.<\/p>"
    },
    {
        "title": "Slip",
        "desc": "<p>To dream that you slip on something suggests that you are forcing yourself to do something that you do not really want to do.<\/p><p>To dream that you are wearing only a slip represents your individualism. You are trying not to be like everyone else and wanting to find your own way. You are showing courage by standing by your own beliefs. Alternatively, wearing a slip indicates that you are revealing a part of yourself that was once unknown.<\/p>"
    },
    {
        "title": "Slippers",
        "desc": "<p>To see or wear slippers in your dream suggest that you are feeling sluggish and\/or insecure. You feel that you do not have a strong foothold in some situation. Alternatively, wearing slippers represent domesticity, ease, comfort, and\/or relaxation. This dream symbol may mean that you need to relax. Or you are relaxing too much and are being lazy.<\/p>"
    },
    {
        "title": "Slippery",
        "desc": "<p>To dream that you are walking on slippery ground indicates a lack of progress in some endeavor. You need to rethink your course. Alternatively, it symbolizes caution. You need to be careful in what you say and do; otherwise you might get yourself into trouble.<\/p>"
    },
    {
        "title": "Slot Machine",
        "desc": "<p>To see or play a slot machine in your dream suggests that you need to be more careful with your spending. Or you need to allocate your time and energy to something more productive.Alternatively, a slot machine symbolizes luck and chance. Perhaps the dream is telling you to take a gamble on something. Go for it.<\/p><p>If you dream that the slot machine is broken or malfunctioning, then it means that you are feeling emotionally or financially drained.<\/p>"
    },
    {
        "title": "Sloth",
        "desc": "<p>To see a sloth in your dream indicates your passivity in a situation. You need to assert yourself and make your presence known. The sloth is also symbolic of gentleness, laziness or lack of ambition.<\/p>"
    },
    {
        "title": "Slow Motion",
        "desc": "<p>To dream that you are moving in slow motion suggests that you are feeling powerless, anxious or frustrated. You are currently going through a hard time in your waking life and experiencing tremendous stress, which is almost immobilizing you.<\/p>"
    },
    {
        "title": "Sludge",
        "desc": "<p>To see sludge in your in dream represents your rejected or shameful emotions. It also symbolic of low esteem. Consider the source and color of the sludge to pinpoint what emotion your dream may be highlighting.<\/p>"
    },
    {
        "title": "gs",
        "desc": "<p>To see slugs in your dream indicate that you are progressing through life in a slow, steady, and persistent manner. Perhaps you are moving painfully slowly toward a goal.Alternatively, the dream may be a pun on &quot;feeling sluggish&quot;.<\/p><p>To dream that slugs are coming out from inside your body suggest that you are having difficulties expressing some aspect of your emotion. Consider where in your body are the slugs coming out from.<\/p>"
    },
    {
        "title": "Slumber Party",
        "desc": "<p>*Please See: <a href=\"#Sleepover\">Sleepover<\/a>.<\/p>"
    },
    {
        "title": "Slums",
        "desc": "<p>To dream that you live in the slums indicates your negative outlook, deteriorating thoughts and crumbling ideals. You are feeling sorry for yourself and letting your own negative thinking take over your frame of mind. Alternatively, the dream suggests that you have poor self image or poor health.<\/p>"
    },
    {
        "title": "Small",
        "desc": "<p>To dream that someone or something is smaller than usual represents feelings of insignificance, helplessness and unworthiness. Alternatively, you may be literally trying to &quot;knock&quot; this person down to size. Perhaps it suggests that you or someone in your life has an inflated ego and need to be taught a lesson.<\/p><p>To dream that you are small and everyone is normal sized suggests that you are suffering from low self-esteem and\/or a sense of helplessness. Perhaps you are being overlooked.<\/p>"
    },
    {
        "title": "Smart",
        "desc": "<p>To dream that you are smart indicates that you hold the knowledge to make some important decision in your life. The dream is reaffirming your abilities to proceed with whatever you want to do. Don't underestimate yourself. Alternatively, the dream may be making up for your insecurities about your brain power.<\/p>"
    },
    {
        "title": "Smartphone",
        "desc": "<p>To see or use a smartphone in your dream represents your immediate connection to the world around you. Someone out there is always listening. On the other hand, these connections may be giving you a false sense of community or feeding into your feelings of inadequacies.<\/p><p>To dream that your smartphone screen is cracked suggests that you have been careless about what you are saying or sharing with others. Perhaps the dream is telling you that your perception is flawed or skewed.<\/p>"
    },
    {
        "title": "Smell",
        "desc": "<p>To smell something in your dream indicates your past experiences and feelings you associate with that particular smell. Your dream is trying to convey a feeling with a familiar smell or scent. Alternatively, the scent may be part of your real environment which you have incorporated into your dream.<\/p>"
    },
    {
        "title": "Smelling Salts",
        "desc": "<p>To dream that you are using smelling salts suggests that you need to pay attention to or focus on some goal or urgent matter. If the smelling salts are not working on you or they have the opposite effect, then it means that you are refusing to acknowledging some truth or issue that is right in front on you.<\/p>"
    },
    {
        "title": "Smile",
        "desc": "<p>To dream that you or others are smiling means that you are pleased with your achievements and approve of the decisions you have made. You will be rewarded for the good things you have done for others. Alternatively, a smile indicates that you are in search of something or someone that will make you happy.<\/p>"
    },
    {
        "title": "Smiley",
        "desc": "<p>To see a smiley face in your dream symbolizes approval and validation of your actions. The dream symbol is providing you with reassurance that you are on the right track.<\/p><p>To see different smiley faces in your dream represents your range of emotions. You are feeling emotionally overwhelmed. Alternatively, the dream suggests that your feelings are being trivialized or that someone is discounting how you feel.<\/p>"
    },
    {
        "title": "Smog",
        "desc": "<p>To see smog in your dream symbolizes your negative emotions. You may be feeling upset and fearful of a situation or relationship. Alternatively, smog suggests that you have not fully understood a situation to make an informed decision.<\/p>"
    },
    {
        "title": "Smoke",
        "desc": "<p>To see smoke in your dream indicates some sort of trouble that is entering your life. You are suffering from confusion and anxiety. In particular, if the smoke is black, then it means that you are not seeing some situation or problem clearly.If you dream of white smoke, then it implies that your emotions are clouding your judgment. Alternatively, white smoke symbolizes an agreement or consensus.<\/p><p>To breathe or see secondhand smoke in your dream suggests that your ignorance in some matter is doing your harm.<\/p>"
    },
    {
        "title": "SmokeDetector",
        "desc": "<p>To see or hear a smoke detector in your dream represents a potentially harmful situation that requires your quick action and fast response. You need to react quickly or else deal with the consequences. Consider what waking situation is in need of your immediate attention. Alternatively, the dream suggests that you are able to see through someone's facade or true intentions. You are able to get to the heart of the matter.<\/p>"
    },
    {
        "title": "e Rings",
        "desc": "<p>To blow smoke rings in your dream refer to your carefree and relaxed attitude. You don't care what others think of you.<\/p><p>To see smoke rings in your dream indicate that your judgment is being clouded. You are lacking focus.<\/p>"
    },
    {
        "title": "SmokeStacks",
        "desc": "<p>To see a smoke stack in your dream suggests that there is something rising out of your subconscious and into your awareness. There is a situation that requires your immediate attention before it gets out of hand. Alternatively, a smoke stack symbolizes industry and hard work. A smoke stack may also be seen as a phallic symbol and refer to sexual release.<\/p>"
    },
    {
        "title": "Smoking",
        "desc": "<p>If you do not smoke in waking life and dream that you are smoking, then it indicates that you are trying to shield yourself and others against your emotions. You have trouble letting others in.The dream may also be a metaphor for an addictive relationship or habit in your waking life.<\/p><p>To see someone smoking in your dream depends on your own personal associations with smoking. However, it often indicates some sort of dissension, disagreement or rebellion.<\/p>"
    },
    {
        "title": "Smoothie",
        "desc": "<p>To make or drink a smoothie in your dream is analogous to how your life is going. It is a &quot;smooth&quot; road ahead for you.<\/p>"
    },
    {
        "title": "Smudging",
        "desc": "<p>To dream of smudging implies that you need to rid yourself of some negative energy in your life. It is time to make a fresh, clean start. Alternatively, dreaming about smudging refers to your character flaws.<\/p>"
    },
    {
        "title": "Smuggling",
        "desc": "<p>To dream that you are smuggling something indicates that you are trying to claim what you feel is rightfully yours. Alternatively, the dream means that you are feeling locked out or denied of something. Consider what you are smuggling for additional significance.<\/p>"
    },
    {
        "title": "Snails",
        "desc": "<p>To see a snail in your dream suggests that you are being overly sensitive. You are feeling inhibited, but desire to be more outgoing and energetic. Alternatively, a snail suggests that you are making steady progress toward a goal. You need to go at your own pace.<\/p>"
    },
    {
        "title": "Snake",
        "desc": "<p>To see a snake or be bitten by one in your dream signifies hidden fears and worries that are threatening you. Your dream may be alerting you to something in your waking life that you are not aware of or that has not yet surfaced. If you dream that a snake is submerged in water, then it implies that you are unknowingly letting your emotions influence aspects of your life. If the snake tangles itself, then it represents a subsiding threat. Something that you thought was going to be a problem has resolved itself. Alternatively, the snake may be seen as phallic and thus symbolize temptation, dangerous and forbidden sexuality. More specifically, to see a snake on your bed suggests that you are feeling sexually overpowered or sexually threatened. You may be inexperienced, nervous or just unable to keep up. If you are afraid of the snake, then it signifies your fears of sex, intimacy or commitment. The snake may also refer to a person around you who is callous, ruthless, and can't be trusted. As a positive symbol, snakes represent healing, transformation, knowledge and wisdom. It is indicative of self-renewal and positive change. In particular, if you dream of a multi-colored or brightly colored snake, then it is a clear warning about something bad happening. Dreaming of a red snake highlights the positive characteristics of the snake, as well as your fiery passion. Seeing a green snake in your dream indicates a misunderstanding. It also symbolizes someone who is not as bad as you had assumed.meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "To see a baby snake in your dream means that you are underestimating some threat in your waking life.",
        "desc": "<p>To see the skin of a snake in your dream represents protection from illnesses.<\/p><p>To see a snake with a head on each end in your dream suggests that you are being pulled in two different directions. You are feeling overburdened and do not know whether you are coming or going. Your actions are counterproductive. Perhaps the dream represents some complicated love triangle. Alternatively, the dream signifies your desires for children. If you see a two-headed snake in your dream, then it refers to cooperation and teamwork in some relationship.<\/p><p>To dream of a snake without a head or without any eyes implies that you are refusing to see the danger in a situation. Alternatively, it means that you are being blindsided.To see a bodiless snake in your dream refers to some biting or cutthroat remarks.<\/p><p>To dream that a snake is being beheaded indicates that there is an issue that you are not confronting. You are refusing to face your fears.<\/p><p>To see a dead snake in your dream means that a threat has passed.<\/p><p>To dream that you are eating a live snake indicates that you are looking for intimacy or sexual fulfillment. Your life is lacking sensuality and passion. If you vomit or throw up the snake, then it may mean that you are overcompensating for something that is lacking in your life. You may be rushing into something.<\/p><p>To dream that a snake is eating another snake represents your drive and determination to succeed at whatever cost.<\/p><p>If you are eaten by a snake in your dream, then it means that someone is taking advantage of you. Dreaming of a snake eating your child represents someone who you fear is harming your child in some way. Perhaps you do not trust your child's judgment and are afraid that she is being manipulated by others. The dream may also symbolize your fears of letting go.<\/p><p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">Dreaming of a snake that is eating people signifies ruthlessness. Perhaps you are dealing with someone in your waking life who shows no mercy or sympathy.<\/p><p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline; float: none\">If you dream that you find snakes in every hotel room, then it means that you are moving toward a questionable or risky direction in your life.<\/p><p>***Go to: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/snake-dreams.html\">Common Dreams: Snake Dreams<\/a> for further analysis. See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=snakedream1\">Two Snakes<\/a>, &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=snakedream2\">Snakes Everywhere!<\/a>&quot;, &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=snakedream3\">Raining Snakes<\/a>&quot; &amp; &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=snakedream4\">Snakes Jumping At Me<\/a>&quot;.<\/p>"
    },
    {
        "title": "Snake Charmer",
        "desc": "<p>To see or dream that you are a snake charmer refers to control over your sexual desires.<\/p>"
    },
    {
        "title": "Snapdragon",
        "desc": "<p>To see a snapdragon in your dream symbolizes forgiveness and kindness. Alternatively, the dream may be a metaphor that you are being snappy.<\/p>"
    },
    {
        "title": "Sneakers",
        "desc": "<p>To see or wear sneakers in your dream suggest that you are approaching through life with ease and little obstacles. It also denotes comfort and satisfaction with yourself and who you are. Alternatively, the dream indicates that you lead an active life and are always on the go.<\/p><p>In particular, dreaming of foamposite sneakers means that you want others to take note of your actions.<\/p>"
    },
    {
        "title": "Sneaking",
        "desc": "<p>To dream that you are sneaking around indicates that you are feeling ashamed of your actions or are lacking self-confidence in achieving your goals. If dream that you are sneaking around with somebody, then it implies that you feel others are not supportive of the relationship. If you are sneaking into someone's personal property, then it points to your insecurities.<\/p>"
    },
    {
        "title": "Sneeze",
        "desc": "<p>To dream that you sneeze indicates a life of ease and joy. Alternatively, it suggests inner healing.<\/p>"
    },
    {
        "title": "Sniffle",
        "desc": "<p>To hear or sniffle in your dream signifies a growing problem in your waking life, especially if it is not dealt with properly. You are not expressing yourself in an effective way.<\/p>"
    },
    {
        "title": "Sniper",
        "desc": "<p>To dream that you are a sniper or are being attacked by one represents hidden aggression that you need to acknowledge. You need to express your anger in a more controlled and healthy manner.<\/p>"
    },
    {
        "title": "Snob",
        "desc": "<p>To dream that you are being a snobindicates your tendency to prejudge and look down on others. Perhaps you have misjudged a situation.<\/p>"
    },
    {
        "title": "Snooze",
        "desc": "<p>To dream that you are snoozing signifies ignorance. You are unaware or oblivious to the problems that are surrounding you and are letting opportunities pass you by. Consider the phrase &quot;you snooze, you lose&quot;.<\/p>"
    },
    {
        "title": "Snoring",
        "desc": "<p>To dream that you or someone is snoring indicates that you are completely oblivious to what is going around you. Life is passing you by. The dream may also be a reflection of your waking surroundings. You have incorporated the actual sound of snoring (by you or by your sleep partner) into your dream scenario.<\/p>"
    },
    {
        "title": "Snorkeling",
        "desc": "<p>To dream that you are snorkeling suggests that you are exploring your emotions and trying to understand why you feel the way you do about certain things. It may also indicate that you are looking back at past emotions and what you can learn from those experiences. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Snot",
        "desc": "<p>To dream that you are picking snot out of your nose indicates that you are ready to confront some subconscious material.<\/p><p>To dream that your nose is full of snot implies that you are being stuffy, unyielding and rigid. If you try, but cannot get the snot out of your nose, then it means that you are unable to be your true self. Something or someone is restricting you from fully expressing yourself.<\/p>"
    },
    {
        "title": "Snout",
        "desc": "<p>To see a snout in your dream suggests that you have a keen sense of smell. The dream may be analogous to your ability to sniff out some problem or suspicious activity. Pay attention to your intuition. Also consider the animal that the snout is from.<\/p>"
    },
    {
        "title": "Snow",
        "desc": "<p>To see snow in your dream signifies your inhibitions, unexpressed emotions and feelings of frigidity. You need to release and express these emotions and inhibitions. Alternatively, snow means that you are feeling indifferent, alone and neglected. If the snow is melting, then it suggests that you are acknowledging and releasing emotions you have repressed. You are overcoming your fears and obstacles. If you are driving in the snow, then it means that you need to be extra cautious about how your approach your goals.<\/p><p>To see dirty snow in your dream refers to a lost in innocence, impurity and uncleanness. Some aspect of yourself or situation has been tainted.<\/p><p>To dream that you are watching the snow fall represents a clean start and a fresh, new perspective.It is indicative of spiritual peace and tranquility.<\/p><p>To dream that you are playing in the snow indicates that you need to set some time for fun and relaxation. Alternatively, the dream means that you need to take advantage of opportunities that arise; otherwise such opportunities will disappear.<\/p><p>To dream that you find something in the snow suggests that you are exploring and accessing your unused potential, abilities, and talents. You have uncovered some hidden talent and ability within yourself. It may also refers to a need to forgive.<\/p>"
    },
    {
        "title": "Snow Fox",
        "desc": "<p>To see a snow fox in your dream highlights your feelings of loneliness, either by choice or by circumstances. You are experiencing an isolation period.<\/p>"
    },
    {
        "title": "Snow Globe",
        "desc": "<p>To see a snow globe in your dream signifies your desires for peace and serenity. Consider the scene depicted inside the snow globe and the corresponding significance. The dream may indicate that you are longing for some aspect of your past.<\/p><p>To dream that you are inside the snow globe suggests that you are feeling stuck in your life. You feel that you are in a rut doing the same thing and going to the same places. Alternatively, the dream means that you are not expressing your emotions. You are keeping too much inside and as a result, you are feeling trapped.<\/p>"
    },
    {
        "title": "Snowboarding",
        "desc": "<p>To dream that you or someone is snowboarding indicates that you are overcoming your fears. You are utilizing your skills.<\/p>"
    },
    {
        "title": "Snowdrop",
        "desc": "<p>To see snowdrops in your dream symbolize rebirth, hope, and new opportunities after a period of inactivity. You are emerging from a time of darkness with a fresh attitude. The dream may also be a metaphor for snow dropping or snow falling. Perhaps you are preoccupied with the weather and hope that it doesn't ruin your plans.<\/p>"
    },
    {
        "title": "Snowflake",
        "desc": "<p>To see a snowflake in your dream represents purity and perfection. It also signifies your individuality and uniqueness.<\/p>"
    },
    {
        "title": "man",
        "desc": "<p>To see a snowman in your dream suggests that you are emotionally cold or frigid. Perhaps you have been a little cold-hearted and insensitive. Alternatively, a snowman is symbolic of playfulness, holiday cheer and time of togetherness.<\/p>"
    },
    {
        "title": "Snowmobile",
        "desc": "<p>To see or ride on a snowmobile in your dream indicates that you are taking advantage of the opportunities made available to you while they last. Alternatively, the dream suggests that you are confronting your repressed emotions.<\/p>"
    },
    {
        "title": "Snowshoe",
        "desc": "<p>To dream that you are wearing snowshoes means that you are unbothered by negativity. You keep going even when others try to hold you back or tell you that you can't do it.<\/p>"
    },
    {
        "title": "Snowstorm",
        "desc": "<p>*Please See: <a href=\"#Blizzard\">Blizzard<\/a>.<\/p>"
    },
    {
        "title": "Snowsuit",
        "desc": "<p>To dream that you are wearing a snowsuit means that you are trying to protect yourself from negativity. You are shielding yourself from anymore emotional hurt. Alternatively, the dream highlights your physical limitations and boundaries.<\/p>"
    },
    {
        "title": "p",
        "desc": "<p>To see soap in your dream indicates that you need to wash away some of your past emotions or memories. You may also be feeling emotionally dirty or guilty and are trying to wash away the shame. Perhaps you need to confess something.<\/p><p>To dream that something of value turn into soap suggests that you are not taking care of the things you treasure. Something you value is being washed down the drain.<\/p>"
    },
    {
        "title": "Soap Opera",
        "desc": "<p>To dream that you are in or watching a soap opera indicates that your life is like a drama. Perhaps you are identifying with a character in the soap opera.Also consider the title of the soap opera. For example, &quot;All My Children&quot; may refer to some drama you are experiencing with your children. &quot;Guiding Light&quot; suggests that you need more spirituality in your life.<\/p>"
    },
    {
        "title": "Soaring",
        "desc": "<p>To dream that you are soaring through the air symbolizes freedom from restrictions. You have successfully escaped or gotten out from a burdening situation or relationship.<\/p><p>Please see also Dream Moods' <a href=\"http:\/\/www.dreammoods.com\/commondreams\/flying.htm\">Common Dreams: Flying<\/a>.<\/p>"
    },
    {
        "title": "Soccer",
        "desc": "<p>To dream that you are playing soccer suggests that you are suppressing your sexuality or aggression and expressing it in a more socially acceptable manner. From a Freudian perspective, sports generally serve as a disguise for attitudes about sex as a aggressive act. Hence soccer can be seen as a pun on &quot;sock her&quot;. Alternatively, the game of soccer parallels to how you function and how you run your life when confronted with challenges. You need to be able to think quickly on your feet, if you are going to succeed. The soccer game also reflects you competency, integrity, strengths and weaknesses.<\/p>"
    },
    {
        "title": "Society",
        "desc": "<p>To dream about society in general represents your connection to those around you. You need to expand your relationships and create a cooperative network.<\/p>"
    },
    {
        "title": "Socket",
        "desc": "<p>To see a socket in your dream suggests that you need to reenergize and revitalize yourself. Alternatively, the dream may be a pun on &quot;sock it&quot;. Is there something or someone that you want to take out your aggression on?<\/p>"
    },
    {
        "title": "Socks",
        "desc": "<p>To dream that you are wearing socks signifies warmth and comfort. Alternatively, to see socks in your dream indicate that you tend to yield to other's wishes. You are flexible and understanding in your thinking.<\/p><p>To see a single sock in your dream is a pun on hitting someone or being hit. Or perhaps the dream means that you have been hit with some surprising information or news.<\/p>"
    },
    {
        "title": "Sod",
        "desc": "<p>To dream that you are laying sod indicates that your hard work and effort will pay off in the end. You are laying out a firm foundation for you and your family.<\/p>"
    },
    {
        "title": "Soda",
        "desc": "<p>To drink soda in your dream indicates that you need to be more bubbly or vivacious. Liven up! Alternatively, the dream suggests that you need to be refreshed or rejuvenated.<\/p><p>If the soda is bitter, sour or off-tasting, then something or someone is preventing you from enjoying life to the fullest. Something is holding you back from fully expressing yourself.<\/p>"
    },
    {
        "title": "Soft",
        "desc": "<p>To feel something soft in your dream signifies a warm and welcoming situation. Perhaps the dream is telling you that you are too rough or hard and need to soften up.<\/p>"
    },
    {
        "title": "lar Panel",
        "desc": "<p>To see or install solar panels in your dream mean that you are receptive to spiritual advice and guidance. Alternatively, the dream suggests that you are feeling physically and\/or emotionally drained and need to explore an alternative source of energy.<\/p>"
    },
    {
        "title": "Solstice",
        "desc": "<p>To dream of the summer solstice symbolizes abundance and fertility. It also represents enlightenment. Perhaps you have more clarity on a problem or situation that has been bothering you.<\/p><p>To dream of the winder solstice symbolizes rebirth and rejuvenation. The dream signals new beginnings.<\/p>"
    },
    {
        "title": "Sudoku",
        "desc": "<p>To see or play Sudoku in your dream suggests that you are being faced with a mental challenge and complex problem. Consider the significance of the number or numbers highlighted. The dream may point to financial worries and how you are trying to make the numbers work for you.<\/p>"
    },
    {
        "title": "Sofa",
        "desc": "<p>*Please See: <a href=\"#Couch\">Couch<\/a>.<\/p>"
    },
    {
        "title": "Softball",
        "desc": "<p>To dream that you are playing or watching softball indicates that you need to stay within your own limits and capabilities. Don't overdo things. Alternatively, softball symbolizes relationships and how the masculine aspects (shape of the bat) are in opposition to the feminine aspects (ball).<\/p>"
    },
    {
        "title": "Software",
        "desc": "<p>To see software in your dream represents your personality traits, behaviors and habits. Consider the type of software. If you dream that you are installing or downloading software into your computer, then signifies your ability to adapt to a new way of thinking of a different way of doing things. Alternatively, the dream may be a sexual innuendo for the penis.<\/p>"
    },
    {
        "title": "Soil",
        "desc": "<p>To see or be in contact with soil in your dream symbolizes growth and fertility. It also represents a solid foundation for life. You need to approach your goals with practicality. If the soil is hard and dry, then it indicates that you are not being true to yourself. You are trying to hide under a hard shell. The dream may also be analogous to something that is &quot;soiled&quot; or tainted.<\/p>"
    },
    {
        "title": "Solar System",
        "desc": "<p>To see the solar system in your dream suggests that you are lacking direction in your life. You have a wandering mind. If applicable, look up the specific planet for additional significance in the Dream M**ds dream dictionary.<\/p>"
    },
    {
        "title": "Soldier",
        "desc": "<p>To see or dream that you are a soldier signifies discipline, structure, rigidity and your staunch attitude. You are imposing your opinions and feelings on others. Alternatively, a soldier means that you are preparing yourself to do battle over an issue. You feel the need to defend your beliefs, values and opinions.<\/p><p>To dream that you are an ex-soldier represents your ability to yield in your decisions and your way of thinking. You need to change your approach toward your goal.<\/p>"
    },
    {
        "title": "Solitaire",
        "desc": "<p>To dream that you are playing solitaire indicates that some action needs to be completed before you can move onto the next phase. Success is a step by step process; it will not happen immediately. Alternatively, playing solitaire in your dream may imply that you are isolating yourself. You want to succeed on your own terms.<\/p>"
    },
    {
        "title": "Somersault",
        "desc": "<p>To dream that your or someone is doing a somersault suggests that you like to do things in excess. You need to show some restraint.<\/p>"
    },
    {
        "title": "Sommelier",
        "desc": "<p>To dream that you are a sommelier represents your role in someone else's decision making process. You are good at offering your advice to others.<\/p><p>To see a sommelier in your dream indicates that you are looking for advice on some decision or the direction you should take in life.<\/p>"
    },
    {
        "title": "Son",
        "desc": "<p>To see your son in your dream signifies your ideal, hopes, potential, and the youthful part of yourself. On the other hand, to see your son in your dream may not have any significance and may be simply mirroring your waking relationship with him. The dream may also be a pun on &quot;sun&quot;.<\/p><p>If you do not have a son and dream that you are searching for him represents the undeveloped masculine aspect of your own self. You need to acknowledge the youth and child in you.<\/p>"
    },
    {
        "title": "n-In-Law",
        "desc": "<p>To see your son-in-law in your dream means that you are going with the flow. You don't like to cause trouble or create disagreements.<\/p>"
    },
    {
        "title": "Songs",
        "desc": "<p>To hear or write a song in your dream indicates that you are looking at things from a spiritual viewpoint. Consider the words to the song that you are dreaming about for additional messages. The lyrics can represent a message from your subconscious. Or the lyrics can serve as your voice to express how you are really feeling. Alternatively, the song may be communicating some advice about a situation or relationship.<\/p>"
    },
    {
        "title": "Sonogram",
        "desc": "<p>To see or dream that you are getting a sonogram signifies a new and developing phase in your life. Perhaps you are starting a new relationship, switching jobs or relocating. The dream may also reflect your actual concerns about a pregnancy or your desires to have children.<\/p>"
    },
    {
        "title": "Soot",
        "desc": "<p>To see soot in your dream symbolizes immortality. In particular, if you are covered in soot, then it signifies your subconscious and the negative aspects of yourself. It is the part of yourself that you fear or are ashamed of.<\/p>"
    },
    {
        "title": "Sorcerer",
        "desc": "<p>To see or dream that you are a sorcerer represents your talents, inner strengths, and creative ability. Your mind is squarely set on achieving your goals.<\/p>"
    },
    {
        "title": "Sores",
        "desc": "<p>To dream that you have sores on your body suggest that you are keeping in some negative emotions and attitudes that need to be released and expressed. Consider the symbolism of the body area where the sores are located. Perhaps the dream is an indication that you are still feeling &quot;sore&quot; and resentful about some situation or relationship.<\/p><p>To feel sore in your dream indicates that you are feeling worn down by some emotional issue.<\/p>"
    },
    {
        "title": "Sorority",
        "desc": "<p>To dream that you are in or join a sorority signifies personal growth and social changes that you are experiencing in your life. You need to expand your awareness and knowledge. The dream is also symbolic of the bounds of sisterhood and togetherness. If you are in a sorority in your waking life, then the dream may just be a reflection of the waking relationship and bear no special significance.<\/p>"
    },
    {
        "title": "Sorrow",
        "desc": "<p>*Please See: <a href=\"#Depression\">Depression<\/a>.<\/p>"
    },
    {
        "title": "Sorry",
        "desc": "<p>To dream that you are sorry parallels waking feelings of regret or remorse. Some residual feelings that you have when you are awake can often express themselves in your dream, especially if it is weighing on your mind. Alternatively, the dream may be giving you a nudge to say &quot;sorry&quot; to someone.<\/p><p>To hear someone say sorry in your dream highlights forgiveness and letting go.<\/p>"
    },
    {
        "title": "Sort",
        "desc": "<p>*Please See: <a href=\"#Organize\">Organize<\/a>.<\/p>"
    },
    {
        "title": "Soul",
        "desc": "<p>To dream that you have a lack of soul or no soul suggests that you are feeling spiritually lost. You need to find yourself and find what will makes you feel whole as a person.<\/p><p>To dream that your soul is leaving your body represents your feelings of self-guilt. You may have compromised your own beliefs and values. Perhaps you are feeling numb and out of touch with those around you. It is time to change some vital part of your waking life in order to feel fully alive and whole again.<\/p><p>To dream that you switch souls with your friend implies that you are not accepting yourself as you are. You drive yourself crazy comparing yourself to others and as a result, you suffer from low self-esteem.<\/p><p>To dream that you marry someone in order save their soul refers to the sacrifices you are making in that situation or relationship. You always play the role of the protector in the relationship and try to shield others from being hurt.<\/p>"
    },
    {
        "title": "Soul Patch",
        "desc": "<p>To see someone or dream that you have a soul patch refers to your eccentric thinking. You are vocal about your opinions and thoughts.<\/p>"
    },
    {
        "title": "Sound Waves",
        "desc": "<p>To see or make sound waves in your dream indicates that you are in tune with your own feelings or the feelings of others. Alternatively, sound waves symbolize the ups and downs of your emotions.<\/p>"
    },
    {
        "title": "Soup",
        "desc": "<p>Similarly to food, to dream about soup represents emotional hunger or nourishment. In addition, soup also signifies comfort and healing. Consider the contents inside the soup and its symbolism.<\/p>"
    },
    {
        "title": "our",
        "desc": "<p>To taste something sour in your dream refers to some resentment in your emotional state of mind.The dream may be analogous to a relationship that is going &quot;sour.&quot;<\/p>"
    },
    {
        "title": "South",
        "desc": "<p>To dream of the direction south indicates life, expectations, and questions. Alternatively, the dream may symbolize love, passion and warmth. Or the dream may be a metaphor that a plan has &quot;gone south&quot; or gone awry.<\/p>"
    },
    {
        "title": "South America",
        "desc": "<p>To dream about South America suggests that you are trying to resolve some conflict or conquer the obstacles in your life. Alternatively, the dream also refers to spontaneity.<\/p>"
    },
    {
        "title": "South Pole",
        "desc": "<p>To dream that you are in the South Pole represents the challenges and hardships in your waking life and your ability to endure it all.<\/p><p>To dream that you live in the South Pole symbolizes your survival skills.<\/p>"
    },
    {
        "title": "Souvenir",
        "desc": "<p>To buy or shop for a souvenir in your dream means that you need to focus on the positive aspects of your life. Look past the negativity.<\/p><p>Dreaming about a souvenir is symbolic of life experiences. Material things are not as important as the experiences and memories you create.<\/p>"
    },
    {
        "title": "Sowing",
        "desc": "<p>To dream that you are sowing seeds represent new beginnings and ideas. You are laying the groundwork for some major groundwork. The dream may also be a metaphor for sex or some sexual act.<\/p>"
    },
    {
        "title": "Soybean",
        "desc": "<p>To see or eat soybean in your dream implies that you are expressing some health concern. Perhaps, you need to adapt a healthier lifestyle. Alternatively, the dream suggests that there is some decision or situation that you are thinking hard about. In Spanish, &quot;soy&quot; means &quot;I am&quot; and thus the dream could be a pun on the self.<\/p>"
    },
    {
        "title": "Spa",
        "desc": "<p>To dream that you are at a spa suggests that you need to take time out and pamper yourself. Perhaps you need to come clean and wash away some old secrets, pains, or guilt. It is time to let your emotions out and begin the healing process. Start fresh.<\/p>"
    },
    {
        "title": "Space",
        "desc": "<p>To see or dream that you are in space represents exploration and independent thinking. You are broadening your horizons and view. Alternatively, the dream may be a metaphor that you are &quot;spacing out&quot;. You need to return your concentration back on your future and goals. Or the dream may be a pun on your need for more &quot;space&quot; in a relationship or situation.<\/p>"
    },
    {
        "title": "Space Shuttle",
        "desc": "<p>To see a space capsule or a space shuttle in your dream signifies exploring the unknown. It parallels a situation in your waking life where you find yourself in a new surrounding.<\/p><p>Dreaming of a space shuttle launch implies that a project, relationship or idea is about to take off in a sudden and spectacular way. You are moving toward a goal with full momemtum.<\/p>"
    },
    {
        "title": "Spaceship",
        "desc": "<p>To see a spaceship in your dream symbolizes your creative mind. It denotes a spiritual journey into the unknown and signals self-development and self-awareness. Alternatively, the dream suggests that you need to take on a different perspective, no matter how bizarre or unusual it may be.<\/p><p>Dreaming that spaceships are falling out of the sky and crashing into earth implies that your ideas may be too outlandish and far-fetched. Perhaps you have set unrealistic goals for yourself and you are just setting yourself up for failure.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=spaceshipdream1\">Spaceship In The Old West<\/a>&quot; &amp; &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=spaceshipdream2\">End Of The World<\/a>&quot;<\/p>"
    },
    {
        "title": "Spades",
        "desc": "<p>To see the ace of spades in your dream symbolize spontaneity, mischievous, and\/or heartlessness. It also represents authority and extreme competitiveness. You are afraid of losing.<\/p><p>*Please See Also: <a href=\"#Shovel\">Shovel<\/a>.<\/p>"
    },
    {
        "title": "Spaghetti",
        "desc": "<p>To see or eat spaghetti in your dream symbolizes longevity, nourishment and abundance. Alternatively, eating spaghetti indicates that you find yourself entangled in some messy relationship or uncomfortable position. Perhaps you are not sure how to end a relationship or situation.<\/p>"
    },
    {
        "title": "Spanking",
        "desc": "<p>To dream that you are spanking someone suggests that you need to work on your childish rage and tantrums.<\/p>"
    },
    {
        "title": "Sparrow",
        "desc": "<p>To see a sparrow in your dream represents inner dignity. Never underestimate something that may be seemingly small or weak. Alternatively, the dream symbolizes loneliness. Perhaps you prefer solitude.<\/p>"
    },
    {
        "title": "Spark",
        "desc": "<p>To see a spark in your dream represents a fresh idea, infinite possibilities or a newbeginning. What starts out as something small may generate into something grander and greater. Do not underestimate the smaller things in life. Alternatively, the dream may also symbolize the start of a new love.<\/p>"
    },
    {
        "title": "Sparkle",
        "desc": "<p>To see sparkles or see something sparkly in your dream indicates an aspect of your life that is in need of your attention. The dream may also be a metaphor that you are feeling &quot;sparks&quot; in some new relationship. Alternatively, the dream suggests that things are not always what it seems. Consider the phrase &quot;all that glitters is not gold.&quot; Don't be fooled by what is on the outside or how things may appear to be.<\/p>"
    },
    {
        "title": "Spartan",
        "desc": "<p>To see or dream that you are a Spartan indicates that you are confronting life's challenges and taking conflicts head-on. You are a fighter.<\/p>"
    },
    {
        "title": "Spatula",
        "desc": "<p>To see or use a spatula in your dream indicates that that there is a difficult situation that you are trying your best to handle or manipulate. Alternatively, the dream suggests that you need to look at things from a different perspective. It may also be a metaphor that you are flipping back and forth on a decision.<\/p>"
    },
    {
        "title": "Speakers",
        "desc": "<p>To see speakers in your dream indicates that you are demanding to be heard. The dream may be telling you that you need to project your voice. Your opinion matters.<\/p>"
    },
    {
        "title": "Spear",
        "desc": "<p>To dream that you are throwing spear indicates that you are thrusting forth your will and your power into a situation. It refers to your strength and commitment. A spear is also seen as a phallic symbol and thus represent a sexual situation.<\/p><p>To see a spear in your dream symbolizes power and fertility.<\/p>"
    },
    {
        "title": "Spectacles",
        "desc": "<p>*Please See: <a href=\"#Eyeglasses\">Eyeglasses<\/a>.<\/p>"
    },
    {
        "title": "Speculum",
        "desc": "<p>To see or use a vaginal speculum in your dream means that you need to open up about your sexuality or your sexual desires.<\/p><p>To dream about an aural speculum implies that it is time to listen up. There is something you need to pay close attention to.<\/p><p>Dreaming about a nasal speculum indicates that you need to reevaluate your character and work on the qualities and attributes that are most important to you.<\/p>"
    },
    {
        "title": "Speech",
        "desc": "<p>To give a speech in your dream indicates that you need to vocalize your feelings and thoughts. You need to communicate something important and\/or urgent. Alternatively, the dream may be highlighting your fear and nervousness of speaking in public, especially if the speech goes wrong or if the audience is unruly.<\/p><p>To dream that there is no one listening to your speech suggests that you are not being acknowledged for your work or achievements. Perhaps you are feeling ignored, neglected, or overshadowed.<\/p><p>To hear a speech in your dream suggests that your inner feelings are being made known to those around you. Consider what is said in the speech. If you hear a politician give a speech, then it represents egotism, deceit or pride.<\/p>"
    },
    {
        "title": "Speed",
        "desc": "<p>To dream that you are taking speed indicates that you are putting yourself in a dangerous situation, particularly if you do not use speed in your waking life. The dream may be a pun on &quot;speediness&quot;. Perhaps you need to move more quickly. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "SpeedBump",
        "desc": "<p>To see or go over a speed bump in your dream indicates that you need to slow down. You may be moving too fast in some relationship or some aspect of your waking life. Alternatively, speed bumps represent minor obstacles you are facing in your life.<\/p>"
    },
    {
        "title": "Speedboat",
        "desc": "<p>*Please See: <a href=\"#Motorboat\">Motorboat<\/a>.<\/p>"
    },
    {
        "title": "Speeding",
        "desc": "<p>To dream that you are speeding indicates that you are compelled and driven to complete something. As a result, you may be pushing people away. Alternatively, the dream suggests that you are moving too fast in some relationship or situation. Perhaps you need to slow down.<\/p>"
    },
    {
        "title": "Speeding Ticket",
        "desc": "<p>To get a speeding ticket in your dream indicates that you are rushing through some decision or rushing into a relationship. You need to slow down. Alternatively, the dream may be telling you that life on the fast line is not all that is cracked up to be.<\/p>"
    },
    {
        "title": "Speedo",
        "desc": "<p>To dream that you are wearing Speedo swim briefs indicates a sense of self-confidence. You do not care what other people think of you.<\/p><p>Dreaming of someone in Speedo briefs means that you need to be more open and honest about your feelings.<\/p>"
    },
    {
        "title": "Speedometer",
        "desc": "<p>To see a speedometer in your dream is analogous to the pace of your life. Are you living life on the fast lane or are you moving at a snail's pace? Consider the numbers for additional significance.<\/p>"
    },
    {
        "title": "Spell",
        "desc": "<p>To dream that you are under a spell indicates that someone has a powerful influence on you. You may be taken for a ride or being manipulated in some waking situation. Alternatively, the dream is a commentary on your waking relationship and how deeply intertwined you are within a relationship.<\/p><p>To dream that you are casting a spell implies that you are undergoing an inner transformation. It also means that you are manipulating a situation. Or perhaps the dream is telling you that you are being too controlling.<\/p><p>Dreaming of a protection spell written in red is a message from your subconscious that you need to be more cautious.<\/p>"
    },
    {
        "title": "Spelling",
        "desc": "<p>To dream that you are spelling a word suggests that you are trying to understand a difficult idea by breaking it down into smaller parts.<\/p><p>To dream that you cannot spell indicates that you are having difficulties attacking a problem in your life.<\/p>"
    },
    {
        "title": "Spending",
        "desc": "<p>To spend money in you dream suggests that you are emotionally spent. You are wasting your time on a relationship or on someone who is not worth your time, energy or love.<\/p><p>To dream that you are watching your spending indicates that you are holding back your emotions. You are having second thoughts about a relationship.<\/p>"
    },
    {
        "title": "Sphere",
        "desc": "<p>To see a sphere in your dream represents your spirituality.<\/p>"
    },
    {
        "title": "Sperm",
        "desc": "<p>To see sperm in your dream symbolizes masculinity and fertility. It also refers to the potential for growth and development.<\/p>"
    },
    {
        "title": "Sphinx",
        "desc": "<p>To see a sphinx in your dream signifies fear of the unknown. Alternatively, it represents some cold, hard emotion. by DreamMoods.com<\/p>"
    },
    {
        "title": "Spice",
        "desc": "<p>To dream of spice suggests your need for variety in your life. You need to look at a situation\/relationship from a different perspective or angle.<\/p>"
    },
    {
        "title": "Spiderman",
        "desc": "<p>To see or dream that you are Spiderman indicates that you need to draw on your own inner strength and willpower in order to overcome adversity. Things will happen if you set your mind to it.<\/p>"
    },
    {
        "title": "Spider",
        "desc": "<p>To see a spider in your dream indicates that you are feeling like an outsider in some situation. Or perhaps you want to keep your distance and stay away from an alluring and tempting situation. The spider is also symbolic of feminine power or an overbearing mother figure in your life. Alternatively, a spider refers to a powerful force protecting you against your self-destructive behavior. If you kill a spider in your dream, then it symbolizes misfortune and bad luck. To see a dead spider in your dream implies that you have overcome some strong feminine temptation.<\/p><p>Dreaming of a multi-colored or rainbow-colored spider points to a situation that you should avoid.<\/p><p>To see a spider spinning a web in your dream signifies that you will be rewarded for your hard work. You will be promoted in your job or recognized for your achievement in a difficult task. Spiders are also a symbol of creativity due to the intricate webs they spin. On a negative note, spiders may indicate a feeling of being entangled or trapped in a sticky or clingy relationship.It represents some ensnaring and controlling force. You feel that someone or some situation is sucking the life right out of you. Alternatively, if a spider is spinning a web in your dream, then it could be a metaphor for the world wide web and global communication.<\/p><p>To see spider eggs in a web suggest that you are not able to fully acknowledge your potential. You are being held back from expressing yourself.<\/p><p>To see a spider climbing up a wall in your dream denotes that your desires will be soon be realized.<\/p><p>To dream that a spider is coming down on you from the ceiling indicates that you are unable to escape from some relationship. If you dream of baby spiders, then they symbolize a new or recent relationship.<\/p><p>To dream that you are bitten by a spider represents a conflict with your mother or some dominant female figure in your life. The dream may be a metaphor for a devouring mother or the feminine power to possess and entrap. Perhaps you are feeling trapped by some relationship.<\/p><p>To eat a spider or dream that a spider is in your mouth symbolizes your control over a situation. You are not afraid to exert your dominance in a relationship.<\/p><p>If you dream about a spider with multiple eyes, then it highlights female intuition. Trust your gut feeling.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=spiderdream1\">Noisy Spider<\/a>&quot;.<\/p>"
    },
    {
        "title": "Spike",
        "desc": "<p>To see spikes in your dream suggest that your defenses are up. You feel the need defend or protect yourself from verbal attacks or emotional abuse.<\/p>"
    },
    {
        "title": "Spill",
        "desc": "<p>To dream that you spill something represents your carelessness and inconsideration of someone's feelings. You are not paying enough attention to those around you and as a result are offending and upsetting them. Alternatively, the dream may be a metaphor for something that you are dying to say, as in &quot;spill it.&quot;<\/p><p>To dream that you spill some foodindicates that you need to eliminate that food from your diet.<\/p><p>To dream that you spill a drink at a party symbolizes your social ineptness and awkwardness in a social situation.<\/p>"
    },
    {
        "title": "Spin The Bottle",
        "desc": "<p>To play spin the bottle in your dream suggests that you need to take a chance at love.<\/p>"
    },
    {
        "title": "Spinach",
        "desc": "<p>To see or eat spinach in your dream indicates your need to be reenergized or revitalized. It is synonymous with strength and power. Alternatively, the dream may simply be telling you that you need to eat better and lead a more healthier lifestyle.<\/p>"
    },
    {
        "title": "al Fluid",
        "desc": "<p>If you have a dream involving spinal fluid, then it refers to your creative energy flow. Thus to dream that you are leaking spinal fluid means a lack of creativity.<\/p>"
    },
    {
        "title": "Spindle",
        "desc": "<p>To see a spindle in your dream represents life and longevity. It suggests that history repeats itself. Whatever comes around goes around.<\/p>"
    },
    {
        "title": "Spine",
        "desc": "<p>To dream about yours or someone else's spine, represents your support system, your strength, stamina and responsibilities. You need to keep your head high even in difficult times. Alternatively, the spine suggests that you need to stay true to your own convictions and be firm. The spine is symbolic of strength. The dream may be one of the contrary and thus suggests that you are &quot;spineless.&quot;<\/p>"
    },
    {
        "title": "Spinning",
        "desc": "<p>To dream that you are spinning signifies confusion. You are feeling out of control. Alternatively, the dream means that you are going nowhere.<\/p><p>Dreaming that your car is spinning means you are not being productive in some area of your life. You are not moving toward any goals.<\/p><p>To dream that something is spinning around you indicates that you are feeling overwhelmed by circumstances beyond your control.<\/p>"
    },
    {
        "title": "Spinning Wheel",
        "desc": "<p>To see a spinning wheel in your dream symbolizes creativity. You have the ability to create something out of seemingly nothing. The dream may also be telling you to work on putting together the pieces and looking at the broader picture.Alternatively, a spinning wheel may be a metaphor for how the world turns or revolves.<\/p>"
    },
    {
        "title": "Spiral",
        "desc": "<p>To see a spiral in your dream indicates that some situation in your waking life is spinning out of control. Alternatively, a spiral represents your creative power and new idea. You are surrounded with creative energy.<\/p>"
    },
    {
        "title": "Spire",
        "desc": "<p>To see a spire in your dream represents ambition, hope, goals and success. This symbol also has phallic connotations.<\/p>"
    },
    {
        "title": "Spirits",
        "desc": "<p>To see or talk to spirits in your dream signify your fears about death. The spirits may be trying to guide you through some waking issues or problems. Pay close attention to what the spirits are trying to convey. Alternatively, the dream may be a pun on your enthusiasm and uplifted spirit for some matter or occasion.<\/p><p>*Please Also See: <a href=\"#Alcohol\">Alcohol<\/a>.<\/p>"
    },
    {
        "title": "Spit",
        "desc": "<p>To spit in your dream signifies an aspect of yourself that you need to get rid of. Spitting represents anger, spite and contempt. Alternatively, the dream implies that you have something that you want to say. Spit it out!<\/p><p>Dreaming that someone spits on you implies that you are feeling guilty or unworthy. Or you may be feeling disrespected in some area of your life. Alternatively, the dream indicates that you have some hidden agenda and are fearful that others can see right through it.<\/p>"
    },
    {
        "title": "Splash",
        "desc": "<p>To dream that you are being splashed by water means that you need to be more expressive with your feelings. It also indicates your need to be revitalized.<\/p><p>To dream that you splash someone implies that you want to share your excitement with those around you. If some gets angry or complains about being splashed, then it means that you need to better contain your your emotions.<\/p>"
    },
    {
        "title": "Splash Mountain",
        "desc": "<p>To dream that you are on Splash Mountain suggests that you need to take a chance on a relationship and make that that emotional plunge.<\/p>"
    },
    {
        "title": "Spleen",
        "desc": "<p>To dream about your spleen suggests that you need to express your anger or sadness. You need to lighten up and show your humorous side.<\/p>"
    },
    {
        "title": "Splice",
        "desc": "<p>To dream that you are splicing something represents your ability to connect with others in a special and significant way.<\/p><p>If you splice a rope in your dream, then it indicates that you are reaching out to someone who needs your help.<\/p>"
    },
    {
        "title": "Splinter",
        "desc": "<p>To dream that you have a splinter suggests that you are letting petty and trivial matters upset you. As a result, you are hindering your own progress. Try not to take other's opinions and remarks personally.<\/p>"
    },
    {
        "title": "Split Ends",
        "desc": "<p>To dream that you have splits ends suggests that the best way to solve some problem is to cut it out of your life.<\/p>"
    },
    {
        "title": "Splits",
        "desc": "<p>To dream that you are doing the splits signify some struggle or division within your social circle. There is some disagreement and dissension that needs to be addressed. The dream may also be a pun to &quot;split&quot;, as in to leave or get out of a situation. Perhaps, the dream is telling you to go.<\/p>"
    },
    {
        "title": "Spoiled",
        "desc": "<p>To dream that food has spoiled indicates that you are not tending to your emotional needs.<\/p>"
    },
    {
        "title": "Sponge",
        "desc": "<p>To see or use a sponge in your dream suggests that you are receptive and are able to easily absorb new knowledge and information. The dream may also be a metaphor that you are &quot;sponging off someone&quot; or that someone is &quot;sponging&quot; off you. Perhaps you are becoming too dependent and need to find your own path.<\/p>"
    },
    {
        "title": "Spool",
        "desc": "<p>To see a spool in your dream symbolizes your need for order and structure. Things have to be neat. Alternatively, spools represent complications in your life.<\/p>"
    },
    {
        "title": "Spoon",
        "desc": "<p>To see a spoon in your dream refers to a reciprocal relationship where you need to give and receive nourishment. You or someone is being given special treatment. Also consider the phrase &quot;born with a silver spoon in your mouth&quot; to mean that you have a life of privilege.<\/p>"
    },
    {
        "title": "Sport Utility Vehicle",
        "desc": "<p>If you don't drive a sport utility vehicle in real life and dream of seeing or driving one, then it relates to some burden or responsibility that you are carrying around. Alternatively, the dream indicates your inner desires to deviate from some set path. Your goals in life have changed.<\/p>"
    },
    {
        "title": "Sport",
        "desc": "<p>To dream that you are playing a sport signifies the learning of rules, recognition of your talents, and the achieving of your goals. It also highlights the importance of cooperation, harmony, and teamwork.Perhaps the dream is a pun on how you need to be more of a &quot;sport&quot;. Alternatively, playing sports represent your perspective about sex as an aggressive act.<\/p><p>To dream that you are watching a sports competition represents two opposing viewpoints or conflicting opinions.<\/p><p>To play or watch extreme sports in your dream suggests that you may be pushing yourself too hard. You need to consider the risks involved and if it is still worth it to pursue further.<\/p><p>If you dream of playing a sport that you used to play, then it means that you need to acknowledge your old talents or ignite some of your younger spirit that you may have lost along the way. Consider the time that you played, how it made you feel, and what was going on in your life. Your dream is trying to recapture an aspect of that time period.<\/p>"
    },
    {
        "title": "Sports Car",
        "desc": "<p>To see a sports car in your dream refers to your desire to live life in the fast lane. You like to show off what you have. The dream may also be telling you that you are moving too fast. Alternatively, a sports car symbolizes wealth, power, and luxury.<\/p>"
    },
    {
        "title": "Spot",
        "desc": "<p>To see a spot in your dream suggests that something is bothering you. It is affecting your mood and attitude. Alternatively, a spot represents imperfections. You need to learn to accept your own flaws, as well as the flaws of others. Nobody is perfect.<\/p>"
    },
    {
        "title": "Spotlight",
        "desc": "<p>To dream that you are in the spotlight indicates your need to be noticed and to be the center of attention. Perhaps you are feeling overlooked in your waking life and the dream is a compensatory one.<\/p>"
    },
    {
        "title": "Spray Can",
        "desc": "<p>To see or use a spray can in your dream indicates that you are under some sort of pressure. You are looking for release in some area of your waking life.<\/p>"
    },
    {
        "title": "Spring",
        "desc": "<p>To dream of the season of spring signifies hope, new beginnings and creative endeavors. It is also a symbol of warmth, virility and fruitfulness.<\/p><p>To see a water spring in your dream symbolizes your emotional energy and expressiveness. You make your feelings and opinions known. Alternatively, a water spring denotes your ability to draw on your inner resources.<\/p><p>To see a metal spring in your dream indicates that you are feeling tense. You are under some tremendous pressure. Alternatively, the dream may also be a metaphor on your need to &quot;spring&quot; into action.<\/p>"
    },
    {
        "title": "Sprinklers",
        "desc": "<p>To see sprinklers in your dream indicate enlightenment, rejuvenation and cleansing. Light is being shed on a situation or relationship. Your emotional wounds are beginning to heal.<\/p>"
    },
    {
        "title": "Sprinkles",
        "desc": "<p>To see or eat sprinkles in your dream represent joy, pleasure, satisfaction and appreciation for how your life is proceeding. The dream may also be a metaphor for how your life is topped off with a bit of sweetness. Enjoy it.<\/p>"
    },
    {
        "title": "Sprinkling",
        "desc": "<p>To dream that it is sprinkling symbolizes the birth of something new. Something that has been incubating for a while is ready to be unveiled.<\/p>"
    },
    {
        "title": "Spy",
        "desc": "<p>To dream that you are a spyindicates your mistrust of others and your tendency to be in everyone's business and affairs. Perhaps you have recently stumbled upon some information that was not meant for your eyes.<\/p><p>To dream that someone is spying on you represents your impulsive behavior. This dream may also serve as a warning that you are being watched, investigated, or evaluated. Someone is looking over you.<\/p>"
    },
    {
        "title": "Square",
        "desc": "<p>To see a square in your dream signifies strength, solidity and stability. Alternatively, a square indicates that you are limited in expressing yourself. Consider the idiom of \"being square\". Perhaps you are being too conventional, unhip or dull. To see a square in your dream may also mean that you are &quot;back to square one&quot;. You need to start over and go back to the beginning.<\/p>"
    },
    {
        "title": "Squash",
        "desc": "<p>To play squash in your dream suggests that you are trying to overcome certain obstacles in your waking life. You are displaying your aggressive nature. Alternatively, the dream may be a metaphor for wanting to &quot;squash&quot; something or somebody. You want to bring them down and put them in their place.<\/p><p>To see or eat squash in your dream signifies fertility and abundance.<\/p>"
    },
    {
        "title": "Squeegee",
        "desc": "<p>To see or use a squeegee in your dream means that you are seeking clarity in a situation. You are trying to not let your emotions cloud your judgment.<\/p>"
    },
    {
        "title": "Squeeze",
        "desc": "<p>To dream that you are squeezing something suggests that you need to make more space for other things in your life. You need to stop dwelling on your past emotions and clear them away. Alternatively, the dream may mean that you are putting the &quot;squeeze' on somebody. You or someone may be feeling pressured or stressed. The dream may also be a pun on your &quot;main squeeze&quot; or your mate. Perhaps the dream trying to comment about the relationship.<\/p>"
    },
    {
        "title": "Squid",
        "desc": "<p>To see a squid in your dream suggests that you are feeling subconsciously threatened. Your judgment may also be clouded. Perhaps you are not seeing things too clearly at the moment. Alternatively, a squid symbolizes greed. You go after what you want without any regard for others.<\/p><p>To dream that you are eating squid indicates that you are feeling self-conscious and worrying about how others perceive you. You may be find it easier to isolate yourself instead of risking judgment from others. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Squint",
        "desc": "<p>To dream that you are squinting your eyes suggests that there is some situation or relationship that you need to examine closer. A situation may be unclear or hazy. You are confused about some aspect of this situation. Alternatively, the dream indicates that you are refusing to see the facts of a situation or are in denial about something.<\/p>"
    },
    {
        "title": "Squirrel",
        "desc": "<p>To see a squirrel in your dream suggests that you are hoarding something. You are holding on to too much and need to learn to let go. On the other hand, a squirrel may also mean that you need to reserve your time and energy. Alternatively, a squirrel indicates that you are pursuing empty and fruitless endeavors. It is time to give up on this dead-end relationship or unprofitable projects.<\/p><p>To dream that you are trying to run over squirrels with a lawn mower suggest that you are trying to change your beliefs and alter your ideas in order to conform to others. You are looking for some form of acceptance.<\/p><p>To dream that you are feeding a squirrel denotes that comfort will come about through hard work, diligence and prudence.<\/p><p>To see a white squirrel in your dream symbolizes perseverance.<\/p>"
    },
    {
        "title": "Stab",
        "desc": "<p>To dream that you have been stabbed signifies your struggle with power. You are experiencing feelings of inadequacy and defensiveness. Alternatively, the dream suggests that you are feeling betrayed as reflected by the popular phrase, &quot;being stabbed in the back&quot;.<\/p><p>To dream that you stab someone indicates your fear of betrayal and your untrusting nature. You are being overly defensive.<\/p><p>To see someone get stabbed in your dream represents sexual domination.<\/p>"
    },
    {
        "title": "Stable",
        "desc": "<p>To dream that you are at a stable represents your sexuality and your ability to control your sexual urges and energies. Alternatively, the dream may be a pun on&quot; your sense of stability&quot; in your waking life, either financially, mentally or emotionally.<\/p>"
    },
    {
        "title": "Stadium",
        "desc": "<p>To see or dream that you are in a stadium represents your determination to succeed and achieve your goals. You need to be more active, aggressive, and bold.<\/p>"
    },
    {
        "title": "Staff",
        "desc": "<p>To see a staff in your dream indicates that you are looking for reassurance and support for your decisions. Alternatively, a staff represents a journey, either spiritually or physically.<\/p><p>To dream that you are part of a staff represents teamwork and the role you play in a larger entity. If you see or interact with some staff member in your dream, then it relates to an aspect of yourself that you are slowly learning about or acknowledging.<\/p>"
    },
    {
        "title": "Stag",
        "desc": "<p>To see a stag in your dream symbolizes male sexuality and virility. Depending on the context of your dream, the stag could also mean grace, agility, regeneration and growth. The dream may also be a metaphor for &quot;going stag&quot; or going to some event by yourself.<\/p>"
    },
    {
        "title": "Stage",
        "desc": "<p>To dream that you are on a stage represents your behavior, manipulation of and relationships with others. It is telling of your interactions with society.You are putting up an act and not being who you really are. There is a saying that goes, &quot;all the world is your stage&quot; and the dream may thus refer to your desire to be the center of attention. Also consider how your stage performance parallels a waking situation.<\/p><p>To dream that you are on a side stage reflects your introverted personality. This dream is telling you that you need to be more confident and self-assured.<\/p>"
    },
    {
        "title": "Stage Diving",
        "desc": "<p>To dream that you are stage diving implies that you are taking a chance on something and putting your full trust in those around you.<\/p>"
    },
    {
        "title": "Stagecoach",
        "desc": "<p>To see a stagecoach in your dream symbolizes the emotional or physical burdens you are carrying around with you.<\/p><p>Dreaming that you are riding in a stagecoach indicates that you are ready to move to a new stage of your life.<\/p>"
    },
    {
        "title": "Stain",
        "desc": "<p>To see a stain in your dream symbolizes a superficial and reversible mistake in your life. Consider and analyze the substance, color and location of the stain. If you cannot remove the stain, then it represents guilt or your unwillingness to forgive and forget.<\/p>"
    },
    {
        "title": "Stained Glass",
        "desc": "<p>To see stained glass in your dream signifies spiritual healing and enlightenment. You are seeking guidance from a higher source. Consider the dominant color in the stained glass to determine how you need to incorporate the symbolism of that color into your Self.<\/p>"
    },
    {
        "title": "Staircase",
        "desc": "<p>To see a staircase in your dream symbolizes change and transformation.<\/p><p>To dream of an incomplete staircase or that there are steps missing from the staircase implies that you are trying to move on to the next phase or stage without accomplishing all the necessary steps. You are trying to take shortcuts.<\/p>"
    },
    {
        "title": "Stairlift",
        "desc": "<p>To see a stairlift in your dream points to a long spiritual journey where you need some support and guidance. You can not do it on your own and are looking for help.<\/p>"
    },
    {
        "title": "Stairs",
        "desc": "<p>To dream that you are walking up a flight of stairs indicate that you are achieving a higher level of understanding. You are making progress into your spiritual, emotional or material journey. The dream is also analogous to material and thoughts that are coming to the surface.<\/p><p>To dream that you are walking down a flight of stairs represents your repressed thoughts. You are regressing back into your subconscious. It also refers tothe setbacks that you are experiencing in your life. If you are afraid of going down the stairs, then it means that you are afraid to confront your repressed emotions and thoughts. Is there something from your past that you are not acknowledging?<\/p><p>To dream that you slip or trip on the stairs signify your lack of self confidence or conviction in the pursuit of some endeavor. If you slip going up the stairs, then it means that you are moving too fast toward attaining your goals. If you slip going down the stairs, then it suggests that you are moving too quickly in delving into your subconscious. You may not be quite ready to confront your subconscious or repressed thoughts.<\/p><p>To see spiral or winding stairs signify growth and\/or rebirth.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=stairsdream1\">Up The Staircase<\/a>&quot;<\/p>"
    },
    {
        "title": "Stallion",
        "desc": "<p>To see a stallion in your dream symbolizes power, strength, masculinity, courage, and independence. If you are riding the stallion, then it signifies that you will or have achieve power and courage.<\/p><p>* Please See: <a href=\"#Horse\">Horse<\/a>.<\/p>"
    },
    {
        "title": "Stalk",
        "desc": "<p>To dream that you are being stalked indicates some difficulty or issue which you are not confronting. These problems are not going to go away just because you are ignoring them. If you are being stalked in real life, then this fear may be carried over into your dream state.<\/p><p>To dream that you are a stalker represents your shadow and the negative part of your Self. It is also symbolic of a bad habit which you have unsuccessfully tried to break.<\/p><p>*Please See Also Dream Moods' Common Dreams: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/chase.htm\">Chase Dreams<\/a>.<\/p>"
    },
    {
        "title": "Stampede",
        "desc": "<p>To see a stampede in your dream signifies wild and erratic behavior. You need to show more restraint in some situation.<\/p><p>To dream that you are in a stampede indicates that you are rushing into some decision.<\/p>"
    },
    {
        "title": "Stamps",
        "desc": "<p>To see stamps in your dream represent a need for communication. Consider what is depicted on the stamp and the amount. A stamp may also be a pun on &quot;stamping&quot; your feet. Perhaps, you need to show more fortitude, enthusiasm and confidence in some waking situation.<\/p><p>To see a stamp collection in your dream signifies issues and concerns with money and\/or security.<\/p>"
    },
    {
        "title": "Standing",
        "desc": "<p>To dream that you are standing suggests that you are asserting yourself and making your thoughts and feelings known.Be proud. You need to make a &quot;stand&quot;. Alternatively, the dream means that you are detached from your surroundings.<\/p>"
    },
    {
        "title": "Staples",
        "desc": "<p>To see staples in your dream indicate that you need to organize your life and keep things in order. Learn to sort out your feelings and express them. The dream may also be a pun on the &quot;staples&quot; or basic essentials of your life.<\/p>"
    },
    {
        "title": "Starfish",
        "desc": "<p>To see a starfish in your dream suggests a period of healing and regeneration. Alternatively, it indicates that you have many options to weigh and decisions to make.<\/p>"
    },
    {
        "title": "Star Fruit",
        "desc": "<p>To see or eat star fruit in your dream represents the sweet taste of success. The dream serves as a reaffirmation of your decisions and indicates that you are moving in the right direction.<\/p>"
    },
    {
        "title": "Staring",
        "desc": "<p>To dream that you are staring at something or someone indicates that you need to take a much closer look at some situation or relationship. Perhaps you need to approach a situation from another perspective or viewpoint. Alternatively, staring represents your passivity. It is time to start taking action.<\/p><p>To dream that someone is staring at you suggests that you are hoping someone would look your way more often. It may also represent anxiety or pride.Alternatively, the dream suggests that you feel overly scrutinized for your actions and behavior.<\/p>"
    },
    {
        "title": "Star Of David",
        "desc": "<p>To see the Star Of David in your dream represents the merging power of love and creativity. It also signifies the union of heaven and earth.<\/p>"
    },
    {
        "title": "Stars",
        "desc": "<p>To see stars in your dream symbolize excellence, success, aspirations or high ideals. You are putting some decision in the hands of fate and luck. Perhaps you are being too &quot;starry eyed&quot; or idealistic. Or the stars may represent a rating system. You are you trying to evaluate a situation or establishment. Alternatively, the stars signify your desire for fame and fortune.<\/p><p>To see an upside down star where the point is facing downward) signifies conflict, negativity and aggression. Since it is often associated with Satan and evil, the dream may also imply that you are you feeling guilty about something. Alternatively, it represents the physical world and your preoccupation with materialistic gains.<\/p>"
    },
    {
        "title": "Starvation",
        "desc": "<p>To dream about starvation indicates that you are lacking in some mental or emotional area of your life. You may be ignoring or avoiding an important family\/emotional issue. Starvation dreams are not uncommon in individuals who are dieting or who have an eating disorder.<\/p>"
    },
    {
        "title": "State Capital",
        "desc": "<p>To dream about a state capital or about remembering a state capital is a pun on some money matter. You need to evaluate your financial situation. Consider also any personal significance of that state.<\/p>"
    },
    {
        "title": "Static",
        "desc": "<p>To feel static in your dream depicts your magnetic personality and how you are able to draw things to you. Alternatively, the dream may represent friction, stemming from disagreements or from different ways of doing things.<\/p><p>To hear static in your dream indicates that there is a lack of clarity and understanding. Something is not being communicated properly or clearly.<\/p>"
    },
    {
        "title": "Station",
        "desc": "<p>To dream that you at a station represents a transitional period in your life. You need to take a short break to reassess your situation and determine your path and goals.<\/p>"
    },
    {
        "title": "Statistics",
        "desc": "<p>To see statistics in your dream suggest that some decision is weighing on you. You are considering the positives and negatives of a situation. Perhaps you are having doubts about a choice you've made.<\/p>"
    },
    {
        "title": "Station Wagon",
        "desc": "<p>To see or drive a station wagon in your dream refers to your family and issues surrounding your inner circle.<\/p><p>To dream that you are unable to roll up the windows of your station wagon represents your anxieties about being able to protect and provide for your family. You are showing some hesitation and reservation about the direction that you are taking in life or the path that you have chosen.<\/p>"
    },
    {
        "title": "Statue",
        "desc": "<p>To see people you know as statues in your dream symbolize a lack of communication with that person You feel that the relationship is inflexible, unyielding or going nowhere. Alternatively, it may represent someone you idealize and admire. You are putting someone on a pedestal. Perhaps the dream is analogous to their statuesque and nice figure.<\/p><p>To dream that you are a statue signifies that your true self is out of touch with reality.<\/p><p>To see a weeping or crying statue in your dream represents some miracle. You have accomplished something that you thought was impossible. Alternatively, the weeping statue symbolizes passion and devotion.<\/p>"
    },
    {
        "title": "Statue Of Liberty",
        "desc": "<p>To see the Statue of Liberty in your dream signifies personal and\/or cultural freedom. You have found your own independence and are learning to stand on your own. It is also a symbol of free enterprise and patriotism.<\/p>"
    },
    {
        "title": "Steak",
        "desc": "<p>To dream that you are eating a steak represents your animal instincts. The dream may be telling you to trust your instincts or that you need to utilize your instincts more. The dream could also be a pun on &quot;stake&quot;, as in having a claim to something.<\/p>"
    },
    {
        "title": "Stealing",
        "desc": "<p>To dream that you are stealing suggests that you are feeling deprived. The locale (at home, the office, at school, etc) of where the stealing takes placeis indicative of your neediness. Alternatively, stealing signifies unrealized and unfulfilled goals. You may have set your goals too high.<\/p><p>To dream that someone is stealing something from you indicates that you are experiencing an identity crisis or are suffering from some sort of loss in your life. Alternatively, the dream means that someone has stolen your success or has taken credit for something you did. Perhaps you feel that you have been treated unfairly.<\/p>"
    },
    {
        "title": "Stealth Bomber",
        "desc": "<p>To see a stealth bomber in your dream refers to a hidden danger that is lurking over you.<\/p>"
    },
    {
        "title": "Steam",
        "desc": "<p>To see or hear steam in your dream denotes your intense emotional state regarding an issue or situation. You are headstrong about proceeding forth on an issue. Perhaps you are angry with someone or at something as in the metaphor &quot;letting out steam&quot;. Alternatively, it signifies a new idea or some &quot;steamy&quot; situation.<\/p>"
    },
    {
        "title": "Steam Engine",
        "desc": "<p>To see a steam engine in your dream indicates that you are channeling your anger into positive and productive energy.<\/p>"
    },
    {
        "title": "Steamroller",
        "desc": "<p>To see a steamroller in your dream represents your determination. You are not letting anyone stand in the way of your goals.<\/p><p>To dream that you are driving a steamroller means that you are paving the way and putting in the hard work so that others will have it easier.<\/p>"
    },
    {
        "title": "Steel",
        "desc": "<p>To see steel in your dream symbolizes toughness, willpower, determination and strength. The dream may also be a pun on stealing.<\/p>"
    },
    {
        "title": "Steep",
        "desc": "<p>To dream that you are going up a steep incline signifies success and significant progress toward your life goals. It's all about hard work. If you are going down a steep incline, then you are on a quick downward slide. You are headed in the wrong direction.<\/p>"
    },
    {
        "title": "Steer",
        "desc": "<p>To see a steer in your dream refers to sexual contact or masculine energy. The steer may also be symbolic of several deities and gods. Or it may also be a pun on &quot;steering&quot; in the right direction.<\/p><p>*Please See Also: <a href=\"#Bull\">Bull<\/a>.<\/p>"
    },
    {
        "title": "Steering Wheel",
        "desc": "<p>To see a steering wheel in your dream represents control over the direction you are taking in life.<\/p>"
    },
    {
        "title": "Stem",
        "desc": "<p>To see the stem of a flower in your dream represents your support system. You are trying to maintain a delicate balance. If you dream that the stem of the flower is broken or bent, then it points to your stress level or to your vulnerability. Perhaps you are near your breaking point.<\/p>"
    },
    {
        "title": "Stencil",
        "desc": "<p>To see or use a stencil in your dream indicates a lack of freedom in some aspect of your waking life. You are bounded by barriers and obstacles. Someone is not letting you do what you want or be who you are. Alternatively, stenciling means that you are looking for some guidance and direction in some decision.<\/p>"
    },
    {
        "title": "Stepdaughter",
        "desc": "<p>To see your stepdaughter in your dream suggests that you are trying to establish some boundaries without stepping over anybody's toes. It is important to consider your own waking relationship with your stepdaughter and your feelings towards her. If you do not have a stepdaughter, then the dream may really be about your daughter or some young female figure in your life. It could also point to the feminine aspect within yourself.<\/p>"
    },
    {
        "title": "Stepfather",
        "desc": "<p>To see your stepfather in your dream symbolizes authority and protection. Consider also your waking relationship with your stepfather and how aspects of his character may be incorporated within yourself.If you do not have a stepfather in real life, then the dream may represent some unresolved issues and tension with your actual father.<\/p>"
    },
    {
        "title": "Stepmother",
        "desc": "<p>To see your stepmother in your dream suggests that you are trying to cope with a mothering figure in your life. You are either feeling smothered or neglected. If you do not have a stepmother in real life, then the dream may represent some unresolved issues and tension with your actual mother. Or the dream could be a pun that you or someone is &quot;stepping&quot; all over your mother. Show her some appreciation and compassion for all the work that she does.<\/p>"
    },
    {
        "title": "Stepsister",
        "desc": "<p>To see your stepsister in your dream usually represents your waking relationship with her. Your dream of her may be triggered because you are feeling threatened or overlooked.<\/p>"
    },
    {
        "title": "Stepping Stone",
        "desc": "<p>To see or walk on a stepping stone in your dream suggests that you need to take things one step at a time in order to achieve your goals. Alternatively, the dream may be showing you the steps you need to take toward your goals. Follow the dream course and see where it takes you.<\/p>"
    },
    {
        "title": "Steps",
        "desc": "<p>To see steps in your dream represent your efforts in achieving your goals, ambitions and material gains. The dream may be telling you to take things one at a time. Or that you need to take a chance and take that first step toward your goals or dreams.Alternatively, the dream signifies your closeness to your spirituality or religious beliefs.<\/p><p>To dream that you are sitting on the steps suggests that you need to pause from life's demands and reevaluate your decisions, challenges, goals, and path before continuing on.<\/p>"
    },
    {
        "title": "Stepson",
        "desc": "<p>To see your stepson in your dream suggests that you are trying to establish some boundaries without stepping over anybody's toes. It is important to consider your own waking relationship with your stepson and your feelings towards him. If you do not have a stepson, then the dream may really be about your son or some young male figure in your life. It could also point to the masculine aspect within yourself.<\/p>"
    },
    {
        "title": "Stereo",
        "desc": "<p>To see or listen to a stereo in your dream signifies great harmony and heightened awareness toward some situation. What you hear through the stereo may represent messages from your subconscious and may be some form of ESP or telepathic communication.<\/p>"
    },
    {
        "title": "Sterilize",
        "desc": "<p>To dream that you are sterilizing something suggests that you are in need of deep cleansing, either spiritually or emotionally.<\/p>"
    },
    {
        "title": "Steroids",
        "desc": "<p>To use steroids in your dream indicates that you are looking for a quick and easy way to get things done or to accomplish your goals.<\/p>"
    },
    {
        "title": "Stethoscope",
        "desc": "<p>To see or use a stethoscope in your dream suggests that you need to pay better attention to some health advice. You need to improve your diet and take better care of yourself.<\/p>"
    },
    {
        "title": "Stew",
        "desc": "<p>To make or eat stew in your dream signifies aspects of yourself that are being joined together as a whole. In particular, to see or eat beef stew in your dream indicates that you need to incorporate aspects of your childhood into your adult life. You need to be more light-hearted. Alternatively, the dream may also be a pun on someone who is named Stew\/Stu.<\/p>"
    },
    {
        "title": "Stewardess",
        "desc": "<p>* Please See: <a href=\"#Flight%20Attendant\">Flight Attendant<\/a>.<\/p>"
    },
    {
        "title": "Stick",
        "desc": "<p>To see a stick in your dream symbolizes the phallus and your attitude toward sex. Alternatively, the dream may be a pun on a &quot;sticky&quot; situation or how you need to &quot;stick up&quot; for yourself and your beliefs.<\/p>"
    },
    {
        "title": "Stick Figure",
        "desc": "<p>To dream that you are depicted as a stick figure represents your simplistic needs and desires. Alternatively, the dream may be highlighting your weaknesses and shortcomings.<\/p>"
    },
    {
        "title": "Sticker",
        "desc": "<p>To see stickers in your dream suggest your tendency to hold on and cling to your childhood. Pay attention to what is depicted on the sticker as it may offer you a clue to what particular aspect of yourself you are refusing or having trouble letting go. Alternatively, the dream refers to a sexual innuendo and may be on pun on &quot;stick her&quot;.<\/p><p>If the stickers in your dream are scented, then consider what the scent reminds you of and the memory it brings back. There may be an unresolved issue from your past. If the stickers are squishy or have a tactile quality, then the dream maybe telling you that you need to take a more hands on approach in addressing the unfinished issues in your childhood.<\/p>"
    },
    {
        "title": "Stigmata",
        "desc": "<p>To dream that you or someone has stigmata refers to the sacrifices you made and the difficulties you endured. Time will heal the pain. Alternatively, it symbolizes your passion and the intensity of what you believe in.<\/p>"
    },
    {
        "title": "Stiff",
        "desc": "<p>To dream that you are stiff suggests that there is some anxiety or tension in your waking life. You are feeling withdrawn or overly judgmental.<\/p>"
    },
    {
        "title": "Stiletto",
        "desc": "<p>To see or wear stilettos in your dream signify female sexuality and domination.<\/p>"
    },
    {
        "title": "Stillborn",
        "desc": "<p>To dream of a stillborn denotes your lost of trust in someone or something. It may also refer to loss innocence.Alternatively, a stillborn indicates a sudden or unexpected end to something.<\/p>"
    },
    {
        "title": "Stilts",
        "desc": "<p>To dream that you are walking on stilts indicate that you are feeling insecure. A situation or relationship is unstable. You are doing your best trying to balance various aspects of your life.<\/p><p>To dream that you fall off a pair of stilts suggest that you should not put all your trust in one person.<\/p>"
    },
    {
        "title": "Sting",
        "desc": "<p>To dream that you are stung represents some hurtful action or remark. The dream may be a pun on some &quot;stinging remark&quot;. Although you are not letting it show how it has affected you, the pain is making its way into your dreamscape. Alternatively, the dream may also be a metaphor for being in love.<\/p>"
    },
    {
        "title": "Stingray",
        "desc": "<p>*Please See: <a href=\"#Manta%20Ray\">Manta Ray<\/a>.<\/p>"
    },
    {
        "title": "Stinks",
        "desc": "<p>To dream that something stinks suggest that you are not being supported by your social circle or your environment. Alternatively, the dream refers to your suspicions.<\/p>"
    },
    {
        "title": "Stitch",
        "desc": "<p>To dream that you have stitches represent your responsibility in keeping and holding a situation or relationship together. You fear that this situation or relationship is falling apart and it is up to you to mend it. Consider also the symbolism of where the stitches are on the body for additional significance.<\/p><p>To dream that you are stitching indicates that you need to take extra care in adding your personal care and special touch to some situation.<\/p>"
    },
    {
        "title": "Stock Market",
        "desc": "<p>To dream about the stock market represents the ups and downs of your life. You are one who is willing to take risks.<\/p><p>To dream that the stock market crashed indicates a major blow to your hopes and dreams. Your goals are being sidetracked.<\/p>"
    },
    {
        "title": "Stockings",
        "desc": "<p>To wear stockings in your dream represent your sense of understanding. You are well-grounded and supported by those around you. If the stockings are torn or have a run, then it signifies lacking self esteem and reduced self confidence.The dream may also be a pun on the word &quot;stalking&quot;. Are you devoting too much attention to someone or something?<\/p><p>To see someone put on stockings relates to some sexual situation.<\/p><p>To see a Christmas stocking in your dream symbolizes expectations and a need for recognition and acknowledgement. On the other hand, the dream means that you need to be more giving.<\/p>"
    },
    {
        "title": "Stolen",
        "desc": "<p>To dream that something of yours have been stolen indicates that you are experiencing an identity crisis or are suffering from some sort of loss in your life. Alternatively, the dream means that someone has stolen your success or has taken credit for something you did. Perhaps you feel that you have been treated unfairly.<\/p>"
    },
    {
        "title": "Stomach",
        "desc": "<p>To see your own stomach in your dream refers to the beginning of new changes in your life. The dream may highlight the difficulties you have with accepting these changes. It is also indicative of how you can no longer tolerate or put up with a particular situation, relationship, or person, as in being able to &quot;stomach&quot; something. Alternatively, the stomach is often seen as the center of emotions. Thus the dream may be about how you process or handle your emotions.<\/p><p>To see or touch someone's stomach in your dream indicates that this person is trying to reach out to you. He or she is trying to connect o you on an emotional level.<\/p><p>To dream that you have sticks stuck through your stomach is a pun on sticking to your guts. If you pull out the sticks, then it means that you are going against your gut instincts.<\/p>"
    },
    {
        "title": "Stomachache",
        "desc": "<p>To dream that you have a stomachache indicates that you are experiencing a high level of stress. You tend to take on more than you can handle. Alternatively, a stomachache refers to some painful emotion that you are refusing to confront.<\/p>"
    },
    {
        "title": "Stonehenge",
        "desc": "<p>To see Stonehenge in your dream suggests that you are undergoing some spiritual enlightenment. Light has been shed on something that was once confusing. Alternatively, the dream is symbolic of a mysterious and powerful force.<\/p>"
    },
    {
        "title": "Stones",
        "desc": "<p>To see a stone in your dream symbolizes strength, unity, and unyielding beliefs. Look at the shape, texture and color of the stone for additional significance. If the stones are rough, then it represents your quest in recognizing and developing your self-identity. Part of this quest is to also become aware of your subconscious and suppressed thoughts.To place a circle of stones around yourself suggests that you are channeling a higher energy. You are contemplating an important decision. Consider the common phrase &quot;etched in stone&quot; which suggest permanence and unchanging attitudes. Some stones also carry sacred and magical meanings. Alternatively, stones relate to issues of moral judgment and\/or guilt. Or the dream may also be a metaphor for &quot;being stoned&quot; or under the influence of drugs.<\/p><p>To dream that you are carrying a bag of stones refers to your inner strength and fortitude that you have yet to unleash and reveal to others.<\/p><p>To dream that you are throwing stones suggests that have a tendency to look at the faults and shortcomings of others without looking at yourself first.<\/p><p>To dream that you have turned into stone suggests that you are in a rut. You are not doing the things that you really want to do. You feel that there is no way out of a relationship or situation that you are in. If you dream that someone or something has turned to stone, then it represents permanence and longevity. Alternatively, it refers to how time has stool still. Perhaps you feel that you have plenty of time on your hands.<\/p><p>For various cultures, stones have spiritual significance. Consider the Black Stone of Mecca in the Muslim culture which was sent down by God as a marker for where the Ka'abah should be built.<\/p>"
    },
    {
        "title": "Stoning",
        "desc": "<p>To dream that you are stoning someone implies your sense of superiority. You feel you are above other people. Alternatively, stoning someone in your dream symbolizes pent up anger and aggression, especially within your personal relationship.<\/p><p>Dreaming that you are being stoned suggests that you are punishing yourself. You feel that you are being judged and are tired of pleasing others. Alternatively, being stoned parallels the insults and negativity directed at you in your waking life.<\/p><p>To see someone getting stoned to death is a reminder of the consequences of your own actions.<\/p>"
    },
    {
        "title": "Stool",
        "desc": "<p>To see or sit on a stool in your dream indicates that you need to take a break to decompress or reenergize.<\/p>"
    },
    {
        "title": "Stop Sign",
        "desc": "<p>To see a stop sign in your dream suggests that you need to stop what you are doing and rethink about the situation before moving forward. You need to proceed with care and caution. Alternatively, a stop sign signifies barriers and difficulties in your path.<\/p><p>To dream that you run a stop sign indicates that you are not considering the consequences of your action. It may also refer to your reckless habits.<\/p>"
    },
    {
        "title": "Stoplight",
        "desc": "<p>To see a stoplight in your dream suggests that you feel you are being held back from pursuing your goals. Your forward progress is being controlled by someone or by some outside forces. In other words, you are not in control of your own life. Alternatively, the dream represents the pressure to succeed or else be left behind. If the traffic is green, then it indicates that you have been given the go-ahead to follow whatever path you have chosen or whatever decision you have made.<\/p><p>To dream that you are running a red stoplight indicates that you are doing something despite being told not to do it. You are going against the rules.<\/p>"
    },
    {
        "title": "Stopwatch",
        "desc": "<p>To see or use a stopwatch in your dream implies that you need to utilize better time management. The dream may also be telling you that you are running out of time.<\/p>"
    },
    {
        "title": "Storage",
        "desc": "<p>To dream that you are putting items in storage is symbolic of suppressing your own needs or feelings. You tend to put other's needs ahead of your own. Alternatively, dreaming of things in storage represents memories that you are holding onto.<\/p>"
    },
    {
        "title": "Store",
        "desc": "<p>To see or be in a grocery or convenience store in your dream suggests that you are emotionally and mentally strained. Alternatively, the dream means that you are brainstorming for some new ideas or looking at the various choices out there for you. The dream may be a pun on something that is in &quot;store&quot; for you. It could signify the inevitable.<\/p><p>*Please Also See: <a href=\"#Market\">Market<\/a>.<\/p>"
    },
    {
        "title": "Stork",
        "desc": "<p>To see a stork in your dream symbolizes motherly love, faithfulness, new birth or fertility. Perhaps you are expecting a new baby into your family. The birth may also be a symbolic birth to mean the fruition of some idea. Alternatively, the stork represents creativity and cleansing.<\/p>"
    },
    {
        "title": "Storm",
        "desc": "<p>To see a storm in your dream signifies some overwhelming struggle, shock, loss or catastrophe in your waking life. The storm also represents unexpressed fears or emotions, such as anger, rage, turmoil, etc. On a more positive note, the storm symbolizes your rising spirituality. It may signal rapid changes ahead for you.<\/p><p>To dream that you take cover in a storm foretells that whatever disturbance or problems is occurring in your life will quickly blow over. Consider also the phrase &quot;weather the storm&quot;, which refers to your ability and strength to withstand whatever comes."
    },
    {
        "title": "Story",
        "desc": "<p>To write a story in your dream represents your creativity and imagination. Alternatively, it signifies feelings that you are unable to verbally express or communicate openly. You are trying to convey your emotions through the story.<\/p><p>To tell or read a story in your dream indicates that there is some life lesson or moral that you need to learn or recognize.<\/p>"
    },
    {
        "title": "Storyteller",
        "desc": "<p>To see or be a storyteller in your dream suggests that you need to hold onto the past and learn from it. You need to appreciate tradition and the lessons of the past.<\/p>"
    },
    {
        "title": "Stove",
        "desc": "<p>To see a stove in your dream symbolizes a developing awareness.If the stove is broken and does not light, then it refers to an emotional issue you are facing in some waking relationship. You may be neglecting this relationship. Alternatively, the dream means that you need to focus your attention to something that you have placed on the back burner.<\/p>"
    },
    {
        "title": "Stowaway",
        "desc": "<p>To see or dream that you are a stowaway suggests you are involved in some underhanded activity. It also refers to your lacking sense of belonging.<\/p>"
    },
    {
        "title": "Straddle",
        "desc": "<p>To dream that you are straddling something suggests that you are undecided about some issue or choice. You remain uncommitted to any one side for fear of alienating or distancing yourself from the other side. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Strainer",
        "desc": "<p>To see or use a strainer in your dream indicates that you are unable to keep your emotions contained. Alternatively, the dream suggests that you need to separate your feelings from a situation and try to be more objective. The strainer may also represent something in your waking life that is causing you some stress. Consider the significance of what is being strained.<\/p>"
    },
    {
        "title": "Strait Jacket",
        "desc": "<p>To see or wear a strait jacket in your dream indicates that you are feeling limited or restricted in some aspect of your life. You are feeling helpless.<\/p>"
    },
    {
        "title": "Stranded",
        "desc": "<p>To dream that you are stranded represents your feelings of isolation and loneliness. You are seeking out for someone to help and rescue you from your situation.<\/p>"
    },
    {
        "title": "Strange",
        "desc": "<p>To dream that you are in a strange place represents change in your life. Consider how you feel about the surrounding. If you are afraid or lost, then it indicates that you are not ready for the change. You are not ready to leave the past behind. If you are excited or happy in this unknown place, then it suggests that you are ready for change.<\/p>"
    },
    {
        "title": "Stranger",
        "desc": "<p>To see a stranger in your dream signifies a part of yourself that is repressed and hidden. Alternatively, it symbolizes the archetypal dream helper who is offering you insight and advice.<\/p><p>To dream that you are kissing a stranger represents acknowledgement and acceptance of the repressed aspect of yourself.<\/p><p>To dream that a stranger is pretending to be someone you know means that this person who you know is not who you thought they were.<\/p><p>To dream that you are inside a stranger's house indicates that there is something that you have yet to discover about yourself. It may mean that there are repressed memories, fears or emotions that you are not confronting.<\/p>"
    },
    {
        "title": "Strangle",
        "desc": "<p>To dream that you or someone else is being strangled indicates that you are repressing or denying a vital aspect of your expression.<\/p>"
    },
    {
        "title": "Straw",
        "desc": "<p>To see or use a straw in your dream indicates that you may have been taking some things for granted. Once you pay more attention to the people around you, you will find that you will have stronger and more meaningful bonds with them.Alternatively, the dream means that you need to better direct your feelings and express it in a healthy way. Or perhaps the dream may be a metaphor for &quot;the last straw&quot;. You have reached your breaking point.<\/p><p>To dream that you are buying straw suggests that you are trying to buy your way into a situation or relationship.<\/p>"
    },
    {
        "title": "Strawberry",
        "desc": "<p>To see or eat strawberries in your dream signify your sensual desires and temptations. Strawberries are often associated with feminine qualities and female sexuality. Alternatively, to see strawberries in your dream indicate that your ideas and goals will soon be realized.<\/p>"
    },
    {
        "title": "Stray",
        "desc": "<p>To see a stray animal in your dream suggests that you are feeling unwanted, lost, or out of touch with society. The dream may also be a metaphor indicating that you are &quot;straying&quot; away from some commitment or relationship.<\/p><p>To dream that you adopt or take in a stray animals indicate that you are wallowing in your loneliness.<\/p>"
    },
    {
        "title": "Streaking",
        "desc": "<p>To dream that you or someone is streaking refers to your fleeting desires of being wild, free and spontaneous.<\/p>"
    },
    {
        "title": "Stream",
        "desc": "<p>To see a stream in your dream represents a flow of fresh and profound ideas. The stream is also symbolic of the flow of your emotions. Alternatively, the dream may be a pun on something that is &quot;streaming&quot; in at a steady pace. Perhaps you need to be patient.<\/p><p>To see a frozen stream in your dream indicates that your emotions are cold and hardened. You need to confront and deal with your hurt feelings<\/p>"
    },
    {
        "title": "Street",
        "desc": "<p>To see a street in your dream symbolizes your life's path. The condition of the street reflects how much control you have over the direction of your life. Consider also the name on the street as it may offer some significance or advice to the meaning of the dream.<\/p><p>To see or travel on side streets in your dream refer to a need to explore an alternative way of life.<\/p><p>*Please see also: <a href=\"#Road\">Road<\/a>.<\/p>"
    },
    {
        "title": "Streetcar",
        "desc": "<p>*Please See: <a href=\"#Trolley\">Trolley<\/a>.<\/p>"
    },
    {
        "title": "Streetlight",
        "desc": "<p>*Please See: <a href=\"#Lamppost\">Lamppost<\/a>.<\/p>"
    },
    {
        "title": "Street Sweeper",
        "desc": "<p>To see or drive a street sweeper in your dream means that you need to clear up some things in your life in order to be able to move forward with your life. Excess things are hindering you from your goals.<\/p>"
    },
    {
        "title": "Strength",
        "desc": "<p>To dream that you have great strength or little strength represents your level of power in some situation of your waking life.<\/p>"
    },
    {
        "title": "Stress",
        "desc": "<p>To dream that you are under stress reflects the actual stress that you are experiencing in your waking life. The stress has carried over into your dream state where even in your sleep, you are unable to relax. The dream may call attention to some setbacks, obstacles, self-doubts, or criticism that you are facing in some waking situation or relationship. You are on the verge of breaking down and need to take some leisure time off to distance yourself from these issues.<\/p>"
    },
    {
        "title": "tch Marks",
        "desc": "<p>To see or dream that you have stretch marks suggest that you are overextending yourself to others and are not paying enough attention to your own needs. You need to learn that you cannot be everything to everybody. Perhaps you are experiencing some emotional imbalance and tension. Alternatively, stretch marks represent a sense of failure or that you are not measuring up to others expectations.<\/p>"
    },
    {
        "title": "Stretcher",
        "desc": "<p>To dream that you are lying on a stretcher indicates your need to be rescued from some situation or relationship. Perhaps you need to take time out and confront your emotional demons.<\/p><p>To see a stretcher in your dream suggests that there is trouble ahead for you in the near future.<\/p>"
    },
    {
        "title": "Stretching",
        "desc": "<p>To dream that you are stretching suggests that you are in need of some relaxation. Alternatively, the dream may be a metaphor that you are &quot;stretching&quot; yourself too thin, either financially, physically, emotionally or time-wise.<\/p>"
    },
    {
        "title": "ike",
        "desc": "<p>To dream that you are going on strike suggests that you are feeling under-appreciated. Perhaps you feel that you are being forced to do something that you don't really want to.<\/p>"
    },
    {
        "title": "String",
        "desc": "<p>To see a string in your dream represents binding, cohesion, or joining, depending on the context of the dream. It relates to the strength of your involvement in a project, situation, or relationship. Perhaps, you are having concerns about your ability to hold some situation or relationship together. Alternatively, the dream indicates that you need to use your position and leverage to get what you want. Consider the phrase &quot;pulling strings.&quot;<\/p><p>To dream that you are tying a string indicates something you have forgotten to do.<\/p><p>To dream that you are untangling a string suggests that there is some issue in your waking life that you need to straighten.<\/p>"
    },
    {
        "title": "String Lights",
        "desc": "<p>To see or hang string lights in your dream implies flexibility in how you see things.<\/p>"
    },
    {
        "title": "Strip Club",
        "desc": "<p>To dream that you are in a strip club signifies repressed sexual thoughts or ideas that you are yearning to let out. You are ready to explore aspects of your own sexuality.<\/p>"
    },
    {
        "title": "Stripes",
        "desc": "<p>To see stripes in your dream suggest that you are making a bold and daring statement. Horizontal stripes represent your directness and straightforwardness, while vertical stripes indicate that you are a non-conformist. In particular, black and white vertical stripes signify your close-mindedness and limited way of thinking.<\/p>"
    },
    {
        "title": "Stripper",
        "desc": "<p>To see a stripper in your dream signifies your desires to be more sexually open.<\/p>"
    },
    {
        "title": "Stripper Pole",
        "desc": "<p>To see a stripper pole in your dream suggests that you need to be more comfortable with your body. The stripper pole is also a phallic symbol.<\/p>"
    },
    {
        "title": "Stripping",
        "desc": "<p>To dream that you are stripping indicates repression of your personal and physical desires. You are yearning for greater self-expression and exploration of your sexuality. Alternatively, the dream may be a pun on being &quot;stripped&quot; of something that you valued or cherished.<\/p>"
    },
    {
        "title": "Strobe Light",
        "desc": "<p>To see a strobe light in your dreamrepresents chaos in your waking life. Your perspective is skewed and you are not seeing things clearly. Alternatively, the dream suggests that you need to take on a different perspective or viewpoint.<\/p>"
    },
    {
        "title": "Stroke",
        "desc": "<p>To dream that you have a stroke refers to your inability to function in a certain situation of your waking life. You may be dealing with issues of acceptance\/rejection and approval\/disapproval.<\/p><p>To see someone suffering from a stroke represents your own repressed fears. Consider how aspects of that person has been repressed within your own self.<\/p>"
    },
    {
        "title": "Stroller",
        "desc": "<p>*Please See: <a href=\"#baby%20carriage\">Baby Carriage<\/a>.<\/p>"
    },
    {
        "title": "Strongman",
        "desc": "<p>*Please See: <a href=\"#Body%20Builder\">Body Builder<\/a>.<\/p>"
    },
    {
        "title": "Structure",
        "desc": "<p>To see Asian-style structures in your dream refers to feelings that are foreign to you, particularly if you are not of Asian descent.<\/p>"
    },
    {
        "title": "Struggle",
        "desc": "<p>To dream of a struggle indicates that you are experiencing some internal conflict. You are making a bigger issue out of something than it needs to be.<\/p>"
    },
    {
        "title": "Stubble",
        "desc": "<p>To feel stubble on someone's face implies that there is a situation that you should avoid. It is best not to get involved.<\/p><p>To dream that you have stubble means that you are ignoring or avoiding a situation.<\/p>"
    },
    {
        "title": "Stucco",
        "desc": "<p>To see of dream of stucco symbolizes your hard protective shell. You are putting up an emotional barrier.<\/p>"
    },
    {
        "title": "Stuck",
        "desc": "<p>To dream that you are stuck representsa feeling of helplessness and not being able to escape from life's problems or stresses. You have lost confidence in yourself and in your ability to move ahead in your life. Your lack of clear goals and low self-esteem may be a common cause for such dreams.<\/p>"
    },
    {
        "title": "Student",
        "desc": "<p>To dream that you are a student indicates that you need better understanding of something. There is some learning you need to do in order to get ahead in life. If you are a student in real life, then the dream may just be a reflection of who you are and bear no significance.<\/p>"
    },
    {
        "title": "Studying",
        "desc": "<p>To dream that you are studying signifies that your intellect and knowledge will catapult you into a path of success and wealth. Alternatively, studying indicates that you need to study more or increase your self-knowledge.<\/p>"
    },
    {
        "title": "Stuffed Animal",
        "desc": "<p>To see a stuffed animal in your dream represents an immature attitude. You are trying to escape from your daily responsibilities and problems. Alternatively, a stuffed animal indicates your need to relax and be less serious. You need to let your mind and body to rejuvenate.A stuffed animal may also mean security, love, comfort, support and unconditional or unquestioned love.<\/p><p>To dream that a stuffed animal is choking you indicates that something that was originally emotionally comforting is now giving you much stress. You are feeling emotionally restricted and unable to communicate how you feel especially in matters of the heart.<\/p><p>To dream that your stuffed animal is getting run over by cars implies a lost of innocence. You have been hit with a hard with some painful truth or shocking experience that your childhood can no longer shield you from.<\/p><p>Dreaming of masturbating a stuffed animal refers to your inexperience or immature attitude about sex. Alternatively to dream that you are giving a stuffed animal a hand job indicates an unsatisfied or unfulfilled sex life.<\/p>"
    },
    {
        "title": "Stumble",
        "desc": "<p>To dream that you stumble on something indicates that something is out of order with your life. As you are facing minor obstacles, you find that things are not going as smoothly as anticipated.Alternatively, the dream may be a metaphor that you are about to make a mistake in some waking decision.<\/p>"
    },
    {
        "title": "Stump",
        "desc": "<p>To see a tree stump in your dream indicates that something or someone is preventing your growth or forward progress. Alternatively, the dream may be a pun on &quot;being stumped&quot; on some problem or issue. The dream may be offering a solution to your problem.<\/p>"
    },
    {
        "title": "Stun Gun",
        "desc": "<p>To dream that you have been hit by a stun gun suggests that you are in need of a jolt or a shot of energy in your life. Alternatively, the dream is a warning that you need to stop and think about what you are doing. Perhaps you need to be knocked into your senses.<\/p>"
    },
    {
        "title": "Stunt",
        "desc": "<p>To dream that you are performing a stunt indicates that you are trying too hard to get attention. You are resorting to tricks and superficial means to get ahead, instead of on your merit and accomplishments.<\/p>"
    },
    {
        "title": "Stutter",
        "desc": "<p>To dream that you stutter indicates your inability to make yourself heard and express yourself clearly. You are hiding how you really feel. Alternatively, the dream suggests that you are nervous about what you are saying.<\/p>"
    },
    {
        "title": "Styrofoam",
        "desc": "<p>To see Styrofoam in your dream indicates that you are undergoing some form of transition in your life. In particular, to see a Styrofoam cup in your dream suggests that you are feeling somewhat insecure or instable in a relationship.<\/p>"
    },
    {
        "title": "Submarine",
        "desc": "<p>To see a submarine in your dream indicates that you are cautiously exploring your emotions and subconscious feelings. You are guarded about certain emotional issues. Alternatively, the submarine indicates that you need to adapt a different perspective and new understanding of an issue. The submarine is a metaphor that you need to get down to the core of some situation or problem.<\/p>"
    },
    {
        "title": "Subtitle",
        "desc": "<p>To have subtitles in your dream indicate that what you are saying in your dream lacks clarity. The subtitles are drawing direct attention to what you are trying to say and convey. Or the dream is highlighting a lesson or advice that you need to take with you when you wake up.<\/p>"
    },
    {
        "title": "Suburbia",
        "desc": "<p>To dream of suburbia represents potential, growth, and prosperity. It is also symbolic of family and an idyllic life. Alternatively, suburbia refers to sameness and monotony. The dream may be telling you that you need to break out of the mold.<\/p>"
    },
    {
        "title": "Subway",
        "desc": "<p>To dream that you are in the subway denotes that you are reaching your goal via subconscious methods. By recognizing the hidden aspects of yourself, you are able to move forward in life. Alternatively, a subway suggests that you are making a hasty decision.<\/p>"
    },
    {
        "title": "Success",
        "desc": "<p>To dream about success represents confidence and a positive outlook. The dream is trying to motivate you and helping you achieve your goals. In order to have success and make it happen, you need to be able to visualize it.<\/p>"
    },
    {
        "title": "Succubus",
        "desc": "<p>To see a succubus in your dream signifies subconscious sexual desires. The dream may also indicate jealousy.<\/p>"
    },
    {
        "title": "Succulents",
        "desc": "<p>To see succulents in your dream refer to your thirst for knowledge or information. If the succulents are in bloom, then it means that your old thoughts and outdated beliefs are dying. You are letting go of your negative attitudes or resentment toward others.<\/p>"
    },
    {
        "title": "Sucking",
        "desc": "<p>To dream that you are sucking on something indicates that you need emotional nurturance. You are expressing a desire to escape from your daily responsibilities. Alternatively, the dream refers to low self-esteem and feelings of inferiority. The dream may also be a metaphor for &quot;sucking up&quot; to someone or that you are a &quot;sucker&quot; in some waking situation.<\/p><p>To dream that someone is sucking on you suggests that you are feeling drained, physically and\/or emotionally.You feel that you are too much of a giver in a situation or relationship.<\/p>"
    },
    {
        "title": "Suction Cup",
        "desc": "<p>To see or dream that you are using a suction cup points to some uncertainty or lack of commitment.<\/p><p>Dreaming that a suction cup is not adhering to the surface suggests that you are looking for a quick and easy fix to a problem and it's not working.<\/p>"
    },
    {
        "title": "Suede",
        "desc": "<p>To see or feel suede in your dream indicates that you have a soft, but still tough persona. You may have a gentle facade, but you are still rugged on the inside. Alternatively, the dream eludes to your instinctual and animalistic nature and thus, have sexual connotations.<\/p>"
    },
    {
        "title": "Suffocating",
        "desc": "<p>To dream that you are suffocating signifies that you are feeling smothered or oppressed by some situation or relationship. Something or someone is holding your back. You are experiencing a lot of stress and tension.<\/p><p>To suffocate someone in your dream indicates that you want to dominate or overpower this person in your waking life. This person may also represent an aspect of your own self that you are trying to control.<\/p>"
    },
    {
        "title": "Sugar",
        "desc": "<p>To see or eat sugar in your dream represents the pleasures and enjoyment that you are denying yourself in your life. Sometimes, you need to indulge yourself and not worry about the consequences.<\/p><p>To see a sugar cube in your dream suggests that you need to lighten up and quit being so serious.<\/p>"
    },
    {
        "title": "Sugar Cane",
        "desc": "<p>To dream that you are eating sugar cane signifies vitality, health and prestige.<\/p>"
    },
    {
        "title": "Suicide",
        "desc": "<p>To dream that you commit suicide represents your desperate desire to escape from your waking life. You may be harboring feelings of guilt that you cannot get over and thus turning the aggression on yourself. You need to start approaching problems from a different angle. Alternatively, the dream suggests that you are saying good-bye to one aspect of yourself and hello to a whole new you. It is symbolic of a personal transformation or a new stage in your life.<\/p><p>To see someone commit suicide in you dream highlights your concerns for that person. Consider what characteristics and qualities in that person you may be trying to &quot;kill&quot; and annihilate in your own self. Perhaps you hope that you are not like this person and are making attempts to get rid of those traits within your own self.<\/p>"
    },
    {
        "title": "Suit",
        "desc": "<p>To dream that you are wearing a suit indicates that you want to be acknowledged and recognized for your abilities and skills. You do not want your power to go unnoticed.<\/p>"
    },
    {
        "title": "Suitcase",
        "desc": "<p>To see a suitcase in your dream indicates that you are a very composed, together person. You keep your attitudes and behavior in check. Alternatively, a suitcase symbolizes your need for a much needed vacation or break. You need a change of scenery in your life.<\/p>"
    },
    {
        "title": "Sulfur",
        "desc": "<p>To see sulfur in your dream represents a higher level of reasoning. You need to trust your intuitive side as well as your rational side.<\/p>"
    },
    {
        "title": "Sultan",
        "desc": "<p>To see a sultan in your dream refers to responsibilities and expectations. Alternatively, the sultan may be symbolic of a controlling father.<\/p><p>To dream that you are a sultan refers to your desires to lead. You feel that others look up to you. The dream may also be telling you that you are being too pushy with your beliefs and views on others.<\/p>"
    },
    {
        "title": "Summer",
        "desc": "<p>To dream about summer represents growth, knowledge, high productivity, tolerance and maturity. You are expanding your realm of understanding. It is important to keep your hope alive. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Summit",
        "desc": "<p>To see or dream that you are on a summit symbolizes your ambitions and goals. Consider your perspective and what you see when you are on the summit.<\/p><p>To dream that you are at a summit meeting refers to your worldly views and political opinions.<\/p>"
    },
    {
        "title": "Sumo",
        "desc": "<p>To see a sumo wrestler in your dream suggests that you are throwing your weight and power around. You are not afraid to let others know that you are in charge.<\/p><p>To watch sumo wrestling in your dream indicates that you are dealing with a big problem in your waking life. You feel that the problem has a stronghold on you.<\/p>"
    },
    {
        "title": "Sun",
        "desc": "<p>To see the sun in your dream symbolizes peace of mind, enlightenment, tranquility, fortune, goodwill, and insight. It also represents radiant energy and divine power. Generally, the sun is a good omen, especially if the sun is shining in your dream. The sun may also be a metaphor for your &quot;son&quot;.<\/p><p>To dream that the sun has a creepy, harsh glare represents a significant disruption or serious problem in your life. The sun is considered a life-giver and thus, any abnormalities and peculiarities to the sun's appearance represents some sort of pain or chaos occurring in your waking life.<\/p><p>To dream that the sun is exploding signifies a traumatic or devastating end to a situation or relationship. You feel that an important aspect of your life is over.<\/p>"
    },
    {
        "title": "Sunbird",
        "desc": "<p>To see a sunbird in your dream indicates that you are being underestimated because of your size or appearance.<\/p>"
    },
    {
        "title": "Sunburn",
        "desc": "<p>To dream that you have a sunburn indicates that there is an emotional situation or problem that you can no longer avoid. Some urgent matter is literally burning through to your soul and demanding your immediate attention.<\/p>"
    },
    {
        "title": "Sundae",
        "desc": "<p>To see or eat a sundae in your dream symbolizes joy, pleasure, togetherness and satisfaction with your waking life. You are happy with how things are going in your waking life and are giving yourself a sweet reward. The dream may also be a pun on Sunday. Perhaps there is some occasion or appointment that you need to remember on Sunday.<\/p>"
    },
    {
        "title": "Sunday",
        "desc": "<p>To dream about Sunday signifies spiritual enlightenment, relaxation and appreciation.<\/p>"
    },
    {
        "title": "Sundial",
        "desc": "<p>To see a sundial in your dream indicates that something in your waking life does not feel quite real. You may be trying to live up to unrealistic expectations or goals. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Sunflower",
        "desc": "<p>To see a sunflower in your dream symbolizes warmth, abundance, longevity, and prosperity. The sunflower also serves to point you in the right direction and is a source of spiritual guidance. Even through difficult times, you will persevere. Alternatively, the sunflower denotes haughtiness. You may be deceived by the false appearance of someone.<\/p>"
    },
    {
        "title": "Sunglasses",
        "desc": "<p>To dream that you are wearing sunglasses indicates your poor perception of some issue. You tend to be pessimistic and see the dark or negative side of things. Perhaps you don't want to see or be seen.<\/p><p>To see someone wear sunglasses in your dream suggests that you are having a hard time getting to know this person. He or she is hard to read.<\/p>"
    },
    {
        "title": "Sunrise",
        "desc": "<p>To see the sunrise in your dream represents new beginnings, renewal of life and energy, and fulfillment of your goals and purpose. You are about to embark on a new adventure in your personal life.<\/p>"
    },
    {
        "title": "Sunroof",
        "desc": "<p>To see or open a sunroof in your dream represents enlightenment. You are receiving guidance from a higher source. The dream also highlights your connection to your spirituality. If you are closing the sunroof, then it indicates that you are not in tune with your spiritual side.<\/p>"
    },
    {
        "title": "Sunroom",
        "desc": "<p>Dreaming that you are in a sunroom refers to your new found spiritual awakening. It may also point to a strong connection with your spirituality.<\/p>"
    },
    {
        "title": "Sunscreen",
        "desc": "<p>To see or apply sunscreen in your dream suggests that you are refusing to see the truth in some matter. You are rejecting some advice or message. Alternatively, the dream is symbolic of an emotional wall that you are putting up. You feel the need to protect yourself against negative influences.<\/p>"
    },
    {
        "title": "Sunset",
        "desc": "<p>To see the sunset in your dream indicates the end of a cycle or condition. It is a period of rest, contemplation and evaluation.<\/p>"
    },
    {
        "title": "Sunshine",
        "desc": "<p>To dream of sunshine indicates that you are experiencing some sort of emotional or situational breakthrough. The dream is offering you reassurance that you are headed on the right track.<\/p>"
    },
    {
        "title": "Suntan",
        "desc": "<p>To dream that you have a suntan signifies the shadow aspect of yourself and your primal instincts and natural senses. It is also indicative of hard work. You are owning up to your duties and responsibilities.<\/p><p>To dream that someone else has a suntan suggests that you are not properly acknowledging a quality or aspect of that person within your own self.<\/p>"
    },
    {
        "title": "Super Soaker",
        "desc": "<p>To see or play with a super soaker in your dream suggests that you are directing your aggression toward one person. You are upset at this person, but are not expressing your anger in an appropriate manner. Alternatively, the dream may be analogous to the sexual act. Or the dream may be a pun on &quot;soak her&quot;.<\/p>"
    },
    {
        "title": "Supercar",
        "desc": "<p>To see or drive a supercar in your dream indicates that you are moving ahead in life on your own terms. It also means that you want others to pay attention to you. Alternatively, driving a supercar in your dream may mean that you are moving too aggressively and too fast in some area of your life.<\/p><p>Dreaming that you win a supercar suggests that you are living beyond your means.<\/p>"
    },
    {
        "title": "Superhero",
        "desc": "<p>To dream that you are a superhero represents your above-average talents, ideas, and other hidden abilities that you may not realize you possessed. Alternatively, the dream parallels some extraordinary problem or issue that you are trying to deal with in your waking life.You need to approach the issue head on.<\/p><p>To dream that a superhero has weak powers suggests that no one is invincible; everyone has their weaknesses. This superhero in your dream may represent someone in your waking life who you idolize and who you thought was always so strong. Perhaps this person disappointed you or this person suddenly fell ill.<\/p>"
    },
    {
        "title": "Superman",
        "desc": "<p>To see Superman in your dream represents the heroic male figure in your life. It is also a symbol of power, strength, and masculinity.<\/p><p>To dream that you are Superman suggests that you are taking on too many responsibilities. You feel that you are going above and beyond your expectations. Because of Superman's ability to fly, perhaps you are expressing an subconscious desire to fly off and get away from it all.<\/p>"
    },
    {
        "title": "Supermarket",
        "desc": "<p>*Please see: <a href=\"#Market\">Market<\/a>.<\/p>"
    },
    {
        "title": "Supernova",
        "desc": "<p>To see a supernova in your dream represents something brilliant, new and great. Alternatively, the dream may indicate shattered hopes. Although what you may be experiencing is destructive or difficult, it will work out to be a good thing in the long run.<\/p>"
    },
    {
        "title": "Superpower",
        "desc": "<p>To dream that you have a superpower implies that you always look at the positives of even a bad situation. You have limitless energies. You are also feeling empowered and confident about your abilities. Consider the significance of your superpower and how it applies to a situation or relationship in your waking life. If you dream that you can fly, then it means that you are on top of the situation. If you dream that you can make things move by waving your hand, then the dream is telling you that you need to put your ideas into action. It could also indicate that things in life have come a little easy for you. If you dream that you can read other people's minds, then it signifies that you have clarity in some situation or problem. You are experiencing peace of mind.<\/p>"
    },
    {
        "title": "Supervillain",
        "desc": "<p>To see or dream that you are a supervillain indicates that you are thriving on the negative aspects of your own self. You are letting negative emotions rule your actions and behavior.<\/p>"
    },
    {
        "title": "Supper",
        "desc": "<p>*Please See: <a href=\"#Dinner\">Dinner<\/a>.<\/p>"
    },
    {
        "title": "The Supremes",
        "desc": "<p>To see the Supremes in your dream signifies your achievements. The Supremes may also be a metaphor for being supreme or being at the top of some situation or circumstance.<\/p>"
    },
    {
        "title": "Surfboard",
        "desc": "<p>To see or ride a surfboard in your dream suggests that you are going with the flow of things. You have given in to the existing rhythm and are just along for the ride. The dream may also be trying to tell you that you need to take more initiative in where you want to go and what you want to do. Alternatively, riding a surfboard refers to your leisurely pursuits.<\/p>"
    },
    {
        "title": "Surfing",
        "desc": "<p>To dream that you are surfing parallels the ups and downs of some emotional situation or relationship. You may feel overwhelmed. One minute you can be in control of your emotions and the next minute you are not. Alternatively, the dream means that you are going with the flow. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Surgery",
        "desc": "<p>To dream that you or someone else is undergoing surgery signifies the opening of the Self and\/or the need for emotional healing. You need to &quot;cut out&quot; or eliminate something from your life. Alternatively, a surgery suggests that you are feeling the influence of some authority figure. You are being swayed to act and behave a certain way. A more literal interpretation of this dream may reflect your concerns about upcoming surgery or about your health.<\/p>"
    },
    {
        "title": "Surgical Mask",
        "desc": "<p>To see or wear a surgical mask in your dream indicates a fear of change. You are refusing to see any other viewpoint. Alternatively, the dream highlights your inability to speak your mind. Perhaps you are not able to effectively vocalize your feelings.<\/p>"
    },
    {
        "title": "Surprise",
        "desc": "<p>To dream that you are pleasantly surprised indicates that you are open to acknowledging and confronting your subconscious feelings.<\/p><p>To dream that you are unpleasantly surprised suggests fear of the unexpected and unknown. You do not want to face your feelings.<\/p>"
    },
    {
        "title": "Surrender",
        "desc": "<p>To dream that you surrender suggests that you need to rid yourself of past emotions and habit. It is time to let go. Alternatively, the dream indicates that you are giving up something important. Perhaps you are having second thoughts.<\/p>"
    },
    {
        "title": "Surrogate",
        "desc": "<p>To dream that you or someone is a surrogate indicates that you are trying to compensate for something that is missing in your life. You are looking to replace or substitute a missing aspect of your life.<\/p>"
    },
    {
        "title": "Surroundings",
        "desc": "<p>*Please See: <a href=\"#Landscape\">Landscape<\/a>.<\/p>"
    },
    {
        "title": "Surveillance Camera",
        "desc": "<p>Tosee or dream that you are on a surveillance camera reflects your feelings of being scrutinized. You feel all eyes are on you and have a tendency to please others.<\/p>"
    },
    {
        "title": "Survey",
        "desc": "<p>Todream that you are taking a survey suggests that you are trying to assess your abilities and evaluate a situation. You need to determine if you have what it takes to achieve your goals. You are being put through some sort of test. Consider the type of questions being asked in the survey and how it applies to your waking life.<\/p>"
    },
    {
        "title": "Survivor",
        "desc": "<p>To dream that you are a survivor of some disaster or accident means that you will prevail over your current problems. You need to look at the bright side of things no matter how bleak things may be at the moment.<\/p>"
    },
    {
        "title": "Sushi",
        "desc": "<p>To see or eat sushi in your dream indicates that you need to acknowledge your spiritual side. It is food for thought. Or it may symbolize certain raw emotions that you have yet to deal with. Alternatively, sushi means that you need to adapt a more healthier lifestyle.<\/p>"
    },
    {
        "title": "Suspended",
        "desc": "<p>To dream that you are suspended from school indicates that you are feeling disconnected. You may be questioning your identity and who you are. Perhaps you are questioning your future. Alternatively, the dream refers to feelings of guilt and shame from your actions. You need to clear your conscience.<\/p>"
    },
    {
        "title": "Suspenders",
        "desc": "<p>Tosee or wear suspenders in your dream indicates that you are doing your best to hold yourself up in some situation. Alternatively, the dream may be a pun on being left hanging.<\/p>"
    },
    {
        "title": "Suspicious",
        "desc": "<p>Todream that you are suspicious about something signifies your intuition and your insecurities about a situation or relationship. You feel that you are left in the dark about some information. Alternatively, the dream suggests that you are feeling unprepared. You fear the unknown.<\/p>"
    },
    {
        "title": "S.W.A.T. Team",
        "desc": "<p>To see a S.W.A.T. team in your dream refers to an emotional situation or personal relationship that you need to handle carefully. The S.W.A.T team may also symbolize protection of some emotionally painful subconscious material. Your own mind is trying to prevent you from confronting the pain.<\/p>"
    },
    {
        "title": "Swab",
        "desc": "<p>To see or use a swab in your dream represents your need for healing and\/or cleansing.<\/p>"
    },
    {
        "title": "Swaddle",
        "desc": "<p>To dream that you or someone is swaddled means that you are seeking a sense of security. You want to feel protected. Alternatively, the dream indicates that you are feeling helpless in a situation.<\/p>"
    },
    {
        "title": "wallow",
        "desc": "<p>To dream that you swallow something indicates that you are holding back your feelings or words. You may feel unable to express your anger. Alternatively, the dream may be a metaphor that you need to swallow your pride in some situation.<\/p><p>To see a swallow in your dream symbolizes purity, renewal, never-ending joy and fresh beginnings.<\/p>"
    },
    {
        "title": "Swamp",
        "desc": "<p>To see a swamp in your dream symbolizes the repressed and dark aspects of yourself. You may be feeling insecure. The dream may also be a pun on feeling swamped from work, a relationship, or other emotional burden.<\/p><p>To dream that you are walking through a swampy area foretells that you will find yourself in an adverse situation. You may experience setbacks and disappointments in love. Alternatively, walking through a swamp in your dream denotes the attainment of prosperity and pleasure through dangerous and underhanded means.<\/p>"
    },
    {
        "title": "Swan",
        "desc": "<p>To see a white swan in your dream symbolizes grace, purity, beauty, dignity, wealth and prestige. Something or someone that may initially be unappealing can turn out to be quite attractive. It is important not to prejudge a situation or person based on the surface.<\/p><p>To see a black swan in your dream signifies mystery and the unknown. It represents something that is alluring, yet forbidden.<\/p><p>To dream that you are flying on a swan's back over a rough ocean implies that you are dealing with some emotional issue as graceful as you can.<\/p>"
    },
    {
        "title": "Swap Meet",
        "desc": "<p>To dream that you are at a swap meet suggests that you are feeling undervalued or under- appreciated. You are selling yourself short. Consider the symbolism of the item you are buying and how you feel about it in the dream. Alternatively, the dream may be interpreted literally and represents something occurring in your life that needs to be &quot;swapped&quot; or exchanged.<\/p>"
    },
    {
        "title": "Swarm",
        "desc": "<p>To see a swarm in your dream symbolizes some negative energy or influence in your waking life. You feel that others are working against you, especially if the swarm is coming toward you. Alternatively, a swarm represents a team effort. The dream highlights your power as a group.<\/p>"
    },
    {
        "title": "Swastika",
        "desc": "<p>To see the swastika in your dream symbolizes hatred, evil, cruelty, and destruction. It is commonly associated with the Nazis.<\/p>"
    },
    {
        "title": "Swearing",
        "desc": "<p>To dream that you are swearing suggests that you need to stop allowing others to harass you. You need to stand up for yourself and don't allow yourself to be taken advantage of.<\/p><p>To hear someone swear in your dream indicates that you have overlooked an urgent matter or situation. Perhaps someone is in need of rescue from some circumstance and it is your job to protect them.<\/p>"
    },
    {
        "title": "Sweat",
        "desc": "<p>To dream that you are sweating suggests that you are experiencing some overwhelming anxiety, stress, fear, or nervousness in your life. This dream may serve to remind you that in order to achieve success, you need to endure the struggle and efforts that go along with success. Alternatively, sweating signifies a kind of cleansing or ridding of bad karma. You may be going through an emotional cool-off period.<\/p>"
    },
    {
        "title": "Sweatshirt",
        "desc": "<p>To see or wear a sweatshirt in your dream indicates your need to relax and escape from work or school. It denotes a laid back attitude.<\/p>"
    },
    {
        "title": "Sweatshop",
        "desc": "<p>To dream that you are in a sweatshop signifies your waking unhappiness and discontentment at work. Alternatively, you may also be feeling undervalued or stifled in some area of your life.<\/p>"
    },
    {
        "title": "Sweater",
        "desc": "<p>To see or wear a sweater in your dream symbolizes warmth and love. You have a strong connection to your family and home life. Alternatively, a sweater represents innocence, immaturity, and\/or naive thinking.<\/p><p>To dream that you are knitting a sweater symbolizes your creativity. It may also indicate that you need practice patience.<\/p>"
    },
    {
        "title": "Sweeping",
        "desc": "<p>To dream that you are sweeping implies that you are clearing your mind of emotional and mental clutter. Get rid of all the minor annoyances in your life and focus on the more important things. You need to take a new stance and have a fresh attitude toward life. Alternatively, sweeping means that you are ignoring some important facts and are going against what your gut and intuition is saying.<\/p>"
    },
    {
        "title": "Sweet",
        "desc": "<p>To taste something sweet in your dream suggests that life is going well for you. You are expressing your satisfaction with life. Alternatively, the dream may be giving approval to move forward with some decision or action. Sometimes, you need to indulge yourself and not worry about the consequences.<\/p>"
    },
    {
        "title": "Sweet Potato",
        "desc": "<p>To see or eat a sweet potato in you dream suggests that your libido is stronger than the person that you are with or vice versa. You need to try and compromise aspects of yourself in order to make the relationship comfortable and satisfying for both.<\/p>"
    },
    {
        "title": "Sweetgum Tree",
        "desc": "<p>To see a sweetgum tree in your dream symbolizes fertility, abundance and longevity.<\/p><p>Dreaming about the ball or seed of a sweetgum tree represents protection. Alternatively, a sweetgum ball may be analogous to a prickly situation where you are unable to detach yourself from.<\/p>"
    },
    {
        "title": "Sweets",
        "desc": "<p>To see or eat sweets in you dream represent indulgence, sensuality, and forbidden pleasure. Perhaps you have been depriving yourself of some joy or pleasure and the dream is a way for you to reward yourself. Alternatively, the dream symbol is a metaphor for your sweetie or the special someone in your life.<\/p><p>To dream that you are giving sweets to a loved one refers to your desires to connect to this person in a more loving way. Or it may mean that you want to spread joy to those around you.<\/p>"
    },
    {
        "title": "Swelling",
        "desc": "<p>To dream that you are swelling up symbolizes a growing problem or issue. You need to address the situation before it gets out of hand. Consider the object or body part that is swollen for additional significance. Alternatively, the dream may be a pun on something that is going &quot;swell&quot;. Or it may be a metaphor of your over-inflated ego.<\/p>"
    },
    {
        "title": "Swimming",
        "desc": "<p>To dream that you are swimming suggests that you are exploring aspects of your subconscious mind and emotions. The dream may be a sign that you are seeking some sort of emotional support. It is a common dream image for people going through therapy.<\/p><p>To dream that you are swimming underwater suggests that you are completely submerged in your own feelings. You are forcing yourself to deal with your subconscious emotions.<\/p><p>To dream that you are swimming away from someone or something indicates that you are avoiding some deep emotional issue. You are refusing to acknowledge and confront your feelings because it may be too painful or too fresh. In particular, if you are swimming away to escape danger or death, then it suggests that you are letting fear take over your actions. You are afraid of change.<\/p><p>To see children swimming in your dream indicates that you need to adapt a more carefree attitude.<\/p>"
    },
    {
        "title": "Swimming Gear",
        "desc": "<p>To dream that you are wearing swimming gear (swim goggles, swimming cap, swimming armbands, swim socks) implies that you are ready to confront some painful emotion.<\/p>"
    },
    {
        "title": "Swimming Pool",
        "desc": "<p>To see a swimming pool in your dream symbolizes relaxation, calmness, luxury and ease. You need to take a break. Alternatively, a swimming pool suggests that you need to acknowledge and understand your feelings. It is time to dive in and deal with those emotions. You need to cleanse yourself and wash away past hurts. Consider the depth of the pool. If you were swimming on the deep end, then it means that those emotions are deeply seated and may be harder to confront. You will need to work through it, no more matter how difficult. If you are swimming on the shallow end, then it implies that you should be able to easily deal with your feelings.<\/p><p>To see an empty swimming pool in your dream suggests that you are literally feeling empty and devoid of emotions.<\/p><p>To dream that the swimming pool is filled with trash indicates that you are leading a lifestyle of excess. You need to tone it down and discard some of the negative emotions in your life.<\/p><p>To dream of a rooftop swimming pool indicates spiritual cleansing. It may also mean that you are enjoying all your successes.<\/p>"
    },
    {
        "title": "Swimsuit",
        "desc": "<p>To dream that you are wearing a swimsuit suggests that you are feeling exposed or emotionally vulnerable. Consider how you feel in the swimsuit. If you are comfortable in the swimsuit, then it signifies a life of ease, relaxation and leisure. If you feel uncomfortable, then it represents a lack of self confidence. If you are wearing a swimsuit in an inappropriate occasion, then it has similar significance as being<a href=\"http:\/\/dreammoods.com\/cgibin\/nakeddreams.pl?method=exact&amp;header=dreamid&amp;search=nakedintro\">naked in a dream.<\/p>"
    },
    {
        "title": "Swing",
        "desc": "<p>To dream that you are on a swing suggests that you are experiencing great satisfaction and freedom in your waking life. It also symbolizes cycles and movement. Alternatively, a swing signifies a desire for sexual variety. The dream may be a pun on being a &quot;swinger.&quot;<\/p><p>To see a swing set in your dream indicates memories from childhood. You want to escape from your current responsibilities and be worry free.<\/p><p>To dream that you are swinging suggests that you are going back and forth in some situation or decision. You need to make up your mind.<\/p>"
    },
    {
        "title": "Swiss",
        "desc": "<p>To see or eat Swiss cheese in your dream may be a metaphor for holes or flaws in your way of thinking. Alternatively, the dream represents someone who is Swiss.<\/p><p>*Please Also See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c2.htm#Cheese\">Cheese.<\/p>"
    },
    {
        "title": "Swiss Army Knife",
        "desc": "<p>To see or use a Swiss Army Knife in your dream implies that you are adept to various situations. If you are looking or buying a Swiss Army Knife, then it means that you are lacking a certain skillset to accomplish a task. You need to seek help from others.<\/p>"
    },
    {
        "title": "witch",
        "desc": "<p>To see a switch in your dream represents the status of a situation or relationship in your life, depending on whether the switch is on or off. The dream may also be a pun on something that has been &quot;switched&quot;, changed or exchanged.<\/p><p>In particular, to dream that a light switch is broken or that you cannot find the switch indicates a lack of insight and perspective on a situation.<\/p>"
    },
    {
        "title": "Switchblade",
        "desc": "<p>To see or use a switchblade in your dream represents hidden danger. Alternatively, the appearance of a switchblade in your dream implies that you need to make a quick decision.<\/p>"
    },
    {
        "title": "Sword",
        "desc": "<p>To dream that you are wielding a sword represents your strength, ambition, competitive nature decisiveness and willpower. You are looking to hold a position of prestige, authority, and distinction. Alternatively, the sword may be seen as a phallic symbol and thus represent masculine power.<\/p>"
    },
    {
        "title": "Swordfish",
        "desc": "<p>To see a swordfish in your dream represents your ability to cut through your emotions and break through the emotional barriers. Alternatively, the swordfish symbolizes masculine sexuality.<\/p>"
    },
    {
        "title": "Sycamore",
        "desc": "<p>To see a sycamore tree in your dream represents a person who you want to emulate. Who is standing under or near the tree?<\/p>"
    },
    {
        "title": "mbol",
        "desc": "<p>To see an unknown symbol in your dream indicates your ambivalence, confusion, or ignorance in a situation. Consider the shape of the symbol and what it reminds you of for additional significance.<\/p>"
    },
    {
        "title": "Sympathy",
        "desc": "<p>To feel or be sympathetic in your dream is a dream of the contrary and means that you are lacking sympathy in your walking life. You are emotionally distant or cold. Perhaps you feel that you cannot relate to others or that others do not understand you.<\/p>"
    },
    {
        "title": "Symphony",
        "desc": "<p>To dream that you are attending a symphony represents harmony and cooperation in a situation or relationship. The dream serves as a form of inspiration and renewal. You are feeling emotionally and mentally uplifted.<\/p>"
    },
    {
        "title": "Synthesizer",
        "desc": "<p>To see or play a synthesizer in your dream signifies harmony. The dream may also be a metaphor that you need to incorporate, adapt, and &quot;synthesis&quot; various aspects of yourself in order to achieve success and harmony in your life.<\/p>"
    },
    {
        "title": "Syringe",
        "desc": "<p>To see a syringe in your dream symbolizes health issues, illness, or drug use. Alternatively, the dream may be a metaphor that you need to inject more enthusiasm, fun, or determination into your life. Consider also the contents of the syringe and how it would affect you.<\/p><p>From a Freudian perspective, the needle and its contents represent the penis and sexual intercourse.<\/p><p>To dream that you are removing syringes from your arm means that you need to rid yourself of the toxic influences in your life.<\/p><p>*Please see also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/i.htm#injection\">Injection.<\/p>"
    },
    {
        "title": "Synagogue",
        "desc": "<p>To see or dream that you are in a synagogue represents your need for spiritual nourishment and enlightenment. It is time to explore your spiritual side. Alternatively, the dream suggests that you are looking for a place of refuge and a place to keep things that are dear to you.<\/p>"
    },
    {
        "title": "Syrup",
        "desc": "<p>To see syrup in your dream symbolizes sentimentality and nostalgia. Alternatively, the dream means that you have found yourself in a sticky situation. Or the dream may be a metaphor for some situation or something that is moving slowly.<\/p>"
    }
]