[
    {
        "title": "T",
        "desc": "<p>To see the letter T in your dream represents your stubbornness and your refusal to change your attitudes and opinions.Alternatively, the dream is analogous to a fork in the road and the two choices or directions.<\/p>"
    },
    {
        "title": "Table",
        "desc": "<p>To see a table in your dream represents social unity and family connections. If the table is broken, wobbly or not functional, then it suggests some dissension in a group. It may also refer to a sense of insecurity. Perhaps there is something you cannot hold inside any longer and need to bring it out in the open.<p>To dream that you are setting the table suggests that you laying the groundwork for a plan or personal endeavor. It also implies confidence.<\/p><p>To see a round table in your dream indicates evenness, sharing, cooperation, equal rights and opportunities for all. It also symbolizes honesty, loyalty, and chivalry.<\/p><p>To dream that you are lying on a table indicates your need for nourishment and relaxation. It relates to health concerns and anxieties about your well-being.<\/p><p>To dream that a table is walking or moving by itself signifies that you will undergo some changes in your life which will relieve you of some dissatisfaction.<\/p><p>If you see a very long table in your dream, then it suggests that you are feeling isolated even though you are surrounded by family and friends. Everything around you is moving ahead, but you are unable to keep up.<\/p>"
    },
    {
        "title": "Table Tennis",
        "desc": "<p>To see or play table tennis in your dream suggests that you are going back and forth between two choices. You are confused over an important decision in your life. Alternatively, the dream also indicates commitment issues. You are having difficulty committing to a decision, to a relationship or social obligation.<\/p>"
    },
    {
        "title": "Tablecloth",
        "desc": "<p>To see a soiled tablecloth in your dream signifies disobedience and quarrels.<\/p>"
    },
    {
        "title": "Tablet",
        "desc": "<p>*Please See: <a href=\"#Pill\">Pill<\/a>.<\/p>"
    },
    {
        "title": "Tackle",
        "desc": "<p>To dream that you are being tackled represents obstacles that are standing in your way toward your goals. Something or someone is preventing you from achieving your goals.<\/p>"
    },
    {
        "title": "Tacks",
        "desc": "<p>To see tacks in your dream symbolize annoyances in your life. You are becoming confrontational and quarrelsome.<\/p><p>To dream that you are pushing or driving a tack represents some pressing matter. The dream may also be a pun on things that you are &quot;tacking&quot; onto your schedule.Perhaps, there is something that you need to remember.<\/p>"
    },
    {
        "title": "Taco",
        "desc": "<p>To see or eat a taco in your dream signifies warmth and comfort. Consider the type of taco shell, as this is analogous to your demeanor and attitude in your waking life. If it is a hard shell taco, then it represents your brash and &quot;hard&quot; exterior. If it is a soft shell taco, then it signifies your adaptability and yielding persona.<\/p>"
    },
    {
        "title": "Tadpole",
        "desc": "<p>To see tadpoles in your dream suggest that you have not reached your full potential. If you are a woman and dream of tadpoles, then the dream may indicate your desire to be pregnant.<\/p>"
    },
    {
        "title": "Taffy",
        "desc": "<p>To see or eat taffy in your dream implies that you are enjoying the rewards of your hard work.<\/p>"
    },
    {
        "title": "Tag",
        "desc": "<p>To dream that you are playing tag represents your level of determination and agility toward achieving your goals. If you are the one being chased, then the dream means that you are trying to dodge some responsibility. If you are the one who is doing the chasing, then it signifies your instincts and your determination to go after what you want. The dream may be telling you that &quot;you're it!&quot; You are the chosen one or the one that is chosen for the job.<\/p>"
    },
    {
        "title": "Tail",
        "desc": "<p>To see only the tail of an animal in your dream signifies annoyances and complications in a situation where pleasure was expected. If the tail is wagging, then it symbolizes excitement, thrills, and joy. If the tail is between the legs, then it represents fear and humiliation. Alternatively, the dream represents balance. Or it may be a pun on &quot;being tailed&quot; as in being followed or chased.<\/p><p>To dream that you have grown a tail represents an aspect of the past that still lingers with you.<\/p>"
    },
    {
        "title": "Tailor",
        "desc": "<p>To see a tailor in your dream represents your abilities and creativity. The dream may also be a pun on the need to &quot;tailor&quot; your actions or behavior in order to fit in.<\/p>"
    },
    {
        "title": "Taj Mahal",
        "desc": "<p>To see or dream that you are at the Taj Mahal represents calmness. You are putting an issue or situation to rest.<\/p>"
    },
    {
        "title": "Takeout",
        "desc": "<p>To dream that you are ordering or eating takeout food implies that you are looking for some sort of emotional support. You are not spending enough time confronting your feelings or you have avoided your feelings for too long. Alternatively, the dream may be a metaphor that there is something that you need to &quot;take out&quot; or &quot;take away&quot; from your life.<\/p><p>To dream that you are dressed as a Chinese takeout container means that you are lacking some sort of social life. Perhaps you want someone to take you out.<\/p>"
    },
    {
        "title": "Talent Show",
        "desc": "<p>To dream that you are in a talent show indicates that you are recognizing and using your potential and skills. You are acknowledging your abilities and moving toward a new stage in your life. Consider the reaction and behavior of the audience as they symbolize your social circle and support system. If the audience reacts negatively, then it suggests that your friends and family are not supportive of you. Conversely, if the audience reacts positively, then it means that you have a support system to lean on.  To dream that you are watching a talent show suggests that you are not utilizing your full potential. You are watching your own talents go to waste.<\/p>"
    },
    {
        "title": "Talisman",
        "desc": "<p>To dream that you are wearing a talisman indicates that you are in need of protection. Sometimes you need to put away your pride and know when to ask for outside help.<\/p>"
    },
    {
        "title": "Talk Show",
        "desc": "<p>To watch a talk show or dream that you are on a talk show indicates that there is a topic or issue that you want to discuss, but do not know how to bring it up.<\/p>"
    },
    {
        "title": "Talking",
        "desc": "<p>To dream that you are talking does not have any significance unless it is unusual or bizarre. What are you saying specifically. Consider also if what you say evoke strong feelings or behavioral reactions. The dream may simply be highlighting your need improve your communication skills or learn to express yourself more clearly.<\/p><p>If you dream that you cannot talk or have difficulties speaking, then it means that you are not expressing yourself effectively. Perhaps you feel that your opinion or words mean nothing to others.<\/p>"
    },
    {
        "title": "Tall",
        "desc": "<p>To dream that you are taller than someone indicates that you may be looking down on that person. You feel that you are above her or him. Alternatively, the dream represents authority and pride.<\/p><p>To dream that others are taller than you suggests that you have a tendency to overlook things. Perhaps you feel that a higher power is always looking over you and judging your actions. Alternatively, the dream denotes low self-esteem issues. You are looking down on yourself.<\/p>"
    },
    {
        "title": "Tallow",
        "desc": "<p>To see tallow in your dream signifies that love and wealth will quickly vanish if you are not cautious and continue to carry on your careless way.<\/p>"
    },
    {
        "title": "Talons",
        "desc": "<p>To see talons in your dream symbolize something that is within your grasp. You need to be more decisive and go for what you want. Alternatively, the dream indicates that you are feeling defensive about something.<\/p>"
    },
    {
        "title": "Tamale",
        "desc": "<p>To eat or make tamales in your dream symbolize togetherness and spiritual bonding. Alternatively, the dream represents the importance of learning from past generations.<\/p>"
    },
    {
        "title": "Tamarind",
        "desc": "<p>To see a tamarind tree in your dream signifies faithfulness. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Tambourine",
        "desc": "<p>To see or play a tambourine in your dream symbolizes the rhythm and beat of your life. You are in control of the various aspects of life that you partake or join in.<\/p>"
    },
    {
        "title": "Tame",
        "desc": "<p>To dream that you are taming an animal symbolizes your control over your animalistic urges. You are experiencing balance and harmony.<\/p><p>To dream that you are being tamed indicates that you need to exercise better control in your life. Show more restraint.Alternatively, the dream may mean that you are accepting aspects of yourself that you had previously rejected.<\/p>"
    },
    {
        "title": "Tampon",
        "desc": "<p>To see or wear a tampon in your dream signifies aggression. You are experiencing some tension that needs to be released. Alternatively, the dream may also be analogous to the phallus.<\/p>"
    },
    {
        "title": "Tan",
        "desc": "<p>*Please See Dream Moods' interpretation of <a href=\"#Suntan\">Suntan<\/a>.<\/p>"
    },
    {
        "title": "Tan Lines",
        "desc": "<p>To dream that you have tan lines in your dream represent the positives and negatives of a situation. You need to look at the pros and cons.<\/p>"
    },
    {
        "title": "Tandem",
        "desc": "<p>To dream that you are doing something in tandem with someone else symbolizes a strong and solid partnership. This may refer to a business partnership, marital partnership or just plain teamwork. Alternatively, the dream suggests that you cannot always do things on your own. Sometimes you need to seek the help of others in order to accomplish some mutual goal.<\/p>"
    },
    {
        "title": "Tangerine",
        "desc": "<p>To see or eat a tangerine in your dream implies that you are in need of a quick and easy boost of energy.<\/p>"
    },
    {
        "title": "Tangle",
        "desc": "<p>To dream that you are tangled up in something symbolizes confusion or chaos in your waking life. Pay attention to how you untangle yourself in the dream and apply it to your real life situation. The dream may also be a pun on &quot;doing the tango&quot;.<\/p>"
    },
    {
        "title": "Tango",
        "desc": "<p>To dream that you are dancing the tango signifies sensuality, intensity, and drama. Perhaps you need to exhibit these qualities in your work or relationship. Also consider the proverb &quot;it takes two to tango&quot; which refers to mutual cooperation and teamwork.<\/p>"
    },
    {
        "title": "Tank",
        "desc": "<p>To see a tank filled with water in your dream signifies prosperity and satisfaction with the current state of your life. You have complete control over your emotions. If there is a faceless human\/fish-like creature inside the tank, then it implies that you are keeping an aspect of your emotions bottled up. You are afraid of confronting your own feelings.<\/p><p>To see a military tank in your dream represents the need to defend yourself and stand up for your beliefs, even if it means being confrontational or violent. You are not letting anything or anybody stand in your way toward your goals. Alternatively, the tank symbolizes a threat.<\/p><p>Dreaming of a tank car on a train indicates that your feelings are predictable. Alternatively, seeing tank cars in your dream mean that you tend to not let your emotions get in the way of your decisions. You know how to stay objective.<\/p>"
    },
    {
        "title": "Tannery",
        "desc": "<p>To see a tannery in your dream refers to your perseverance and thick-skinned nature. Despite what life throws at you, you remain tough and steadfast.<\/p><p>To dream that you are a tanner suggests that sometimes you still have to do something even though is it not what you want to do.<\/p>"
    },
    {
        "title": "Tanning Bed",
        "desc": "<p>To see or lay on a tanning bed in your dream symbolizes your vanity and your preoccupation with beauty. Alternatively, the dream may be calling attention to your primal instinct or dark side.<\/p>"
    },
    {
        "title": "Tantrum",
        "desc": "<p>To dream that you are throwing a tantrum implies that you are behaving immaturely in some waking situation. You are expressing your anger in an ineffective way.<\/p><p>To dream that someone is throwing a tantrum suggests that you are not confronting your anger. You are projecting your negative feelings onto someone else.<\/p>"
    },
    {
        "title": "Tanzanite",
        "desc": "<p>To see or wear tanzanite in your dream suggests that an important message or vision will be made known to you. Alternatively, tanzanite refers to spiritual healing, fresh beginnings and new awareness. The blue color of the tanzanite represents clarity, cleansing and spirituality.<\/p>"
    },
    {
        "title": "Tap",
        "desc": "<p>*Please See: <a href=\"#faucet\">Faucet<\/a>.<\/p>"
    },
    {
        "title": "Tap Dancing",
        "desc": "<p>To dream that you are tap dancing indicates that you need to keep up with life or else you will be left behind. The franticness and speed of the tapping parallels how chaotic or calm your life is.<\/p><p>To see someone tap dancing in your dream represents the rhythm of life.<\/p>"
    },
    {
        "title": "Tape",
        "desc": "<p>To see or use tape in your dream represents your limitations. On the other hand, the dream may be telling you that you need to show more restraint in some aspect of your life.<\/p>"
    },
    {
        "title": "Tape Measure",
        "desc": "<p>*Please See: <a href=\"#Measuring%20Tape\">Measuring Tape<\/a>.<\/p>"
    },
    {
        "title": "Tape Recorder",
        "desc": "<p>To see or use a tape recorder in your dream suggests that there is a message that you need to absorb and incorporate in your daily life. Alternatively, it indicates that there is a past message that you may have overlooked.<\/p>"
    },
    {
        "title": "Tapestry",
        "desc": "<p>To see tapestry in your dream represents your past and your current life experiences. The tapestry is also symbolic of luxurious living and pleasurable surroundings.<\/p><p>To see a torn and ragged tapestry in your dream refers to a lack resources needed to satisfy your needs and desires.<\/p>"
    },
    {
        "title": "Tapeworm",
        "desc": "<p>To have or see a tapeworm in your dream forewarns of poor health. You need to reevaluate your diet and lifestyle.<\/p>"
    },
    {
        "title": "Tapping",
        "desc": "<p>To dream that you are tapping your fingers or your toes indicates idleness. You may have lost your direction or lost sight of your goals. Alternatively, to tap your fingers or toes in your dream points to some nervous energy. There is a problem that you cannot solve or a decision that is weighing on your mind.<\/p>"
    },
    {
        "title": "Tar",
        "desc": "<p>To see tar in your dream signifies your dependency on something or someone. You need to be more self-reliant. Tar is also symbolic of the subconscious and the negative aspect of the Self.<\/p><p>In particular, to dream that you are tarred and feathered symbolizes pent up anger, hostility and shame. You are punishing yourself.<\/p>"
    },
    {
        "title": "Tar Pit",
        "desc": "<p>To see a tar pit in your dream indicates that your subconscious material is threatening to rise to the surface.<\/p>"
    },
    {
        "title": "Tarantula",
        "desc": "<p>To see a tarantula in your dream represents your dark and sinister side. A tarantula is also symbolic of a woman figure in your life.<\/p>"
    },
    {
        "title": "Target",
        "desc": "<p>To dream that you are shooting at a target indicates that you have your sights clearly set on a goal. The dream may also be trying to motivate you along. If you missed the target, then it symbolizes missed chances, missed opportunities, or missed judgment calls. If you hit the target, then the dream is telling you that you are on the mark or that you are on the right track.<\/p>"
    },
    {
        "title": "Tarot Cards",
        "desc": "<p>To dream of a tarot reading indicates your current situation and state of mind. You are open to exploring your subconscious thoughts and feelings. Pay attention to what the Tarot Cards reveal. Consider the following general meanings of the four Tarot suits: The Wands represent fire, inspiration, spirituality, action, initiative, and the Psyche. The suit of the Swords signify air, determination, strength, faith, and conquering of fear. The Cups symbolize water, emotions, purity, and your outlook toward life and the future. The Pentacles denote finances, social influence, worldly knowledge, and your connection with nature and earth.<\/p>"
    },
    {
        "title": "Tart",
        "desc": "<p>To see or eat a tart in your dream suggests that things are going well for you. Alternatively, the dream may also be a pun for a woman who looks like a tart? If you are a woman, then the dream may mean that you need to loosen up a little bit and not be so uptight.<\/p>"
    },
    {
        "title": "Tartan",
        "desc": "<p>To see or wear tartan in your dream suggests that some of your conservative views are in conflict with your liberal and wild side. The tartan may also mean that you are being too unyielding about something.<\/p>"
    },
    {
        "title": "Taser",
        "desc": "<p>To dream that you have been hit by a Taser suggests that you are in need of a jolt or a shot of energy in your life. Alternatively, the dream means that you need to stop and think about what you are doing. Perhaps you need to be knocked into your senses.<\/p>"
    },
    {
        "title": "Tassels",
        "desc": "<p>To see tassels in your dream signify some spiritual transition.<\/p>"
    },
    {
        "title": "Taste",
        "desc": "<p>To taste something bad in your dream suggests that you need to reconsider some situation, relationship or decision. Give it a second chance. For specific taste, please see: <a href=\"#Sour\">Sour<\/a>, <a href=\"#Sweet\">Sweet</a> or <a href=\"#Salt\">Salty<\/a>.<\/p>"
    },
    {
        "title": "Tater Tots",
        "desc": "<p>To see or eat tater tots in your dream implies that you are focusing too much on petty matters.<\/p>"
    },
    {
        "title": "Tattoo",
        "desc": "<p>To dream that you have tattoos represent your sense of individuality and the desire to stand out in a crowd. You want to be unique and different from everybody else, particularly if you do not have any tattoos in real life. Consider also what the tattoo is and what significance it has in your life. It may represent something that has left a lasting impression on you. Alternatively, to dream that you have a tattoo suggests that a waking situation or decision is having a much longer lasting effect that you had expected.<\/p><p>To dream that your significant other has a tattoo that they don't have in real life suggests that he or she is trying to express himself or herself in the relationship. He or she wants to get your attention and communicate some important message. Perhaps you have been overlooking or ignoring something in the relationship.<\/p><p>To dream that you are a tattoo artist suggests that your exotic tastes and strange experiences may turn off those around you. If you are a tattooist in real life, then the dream is just a reflection of who you are.<\/p><p>To dream that you are getting a dragon tattoo on your wrist implies that you are looking for attention. You want to be acknowledged and awarded for your efforts and positive actions.<\/p><p>Dreaming of getting a tattoo of the ace of diamonds means that you are proud of your past accomplishments and want to share it with those around you.<\/p>"
    },
    {
        "title": "Taurus",
        "desc": "<p>To dream that someone is a Taurus represents determination, practicality, stubbornness, perseverance and willpower. Perhaps you need to incorporate these qualities into yourself. It also refers to your love of beauty and your gentleness. Alternatively, the dream points to some issues with your neck or throat.<\/p>"
    },
    {
        "title": "Tavern",
        "desc": "<p>*Please See: <a href=\"#Pub\">Pub<\/a>.<\/p>"
    },
    {
        "title": "Taxes",
        "desc": "<p>To dream that you are paying taxes represent the price you are paying for the way you live. The dream may be stemming from some sort of self-guilt and the debt that you owe to society.Alternatively, the dream may be a metaphor for something that is physically or mentally &quot;taxing&quot; on you. You are feeling overburdened.<\/p><p>To refuse to pay taxes in your dream indicates that you are rebelling against society or the government. You are a non-conformist.<\/p>"
    },
    {
        "title": "Taxi",
        "desc": "<p>*Please See: <a href=\"#cab\">Cab<\/a>.<\/p>"
    },
    {
        "title": "Taxidermy",
        "desc": "<p>To see taxidermy in your dream suggests that you need to give new life to some relationship or situation that you previously thought was forgotten or dead.<\/p>"
    },
    {
        "title": "Tea",
        "desc": "<p>To dream that you are making or drinking tea represents satisfaction and contentment in your life. You are taking your time with regards to some relationship or situation.Alternatively, the dream signifies tranquility, serenity, calmness, and respect.<\/p><p>To dream that you are reading tea leaves means that you need to look pass the superficial and get to the core of the situation.<\/p><p>To attend or watch a tea ceremony in your dream signifies unity, togetherness, respect and family.<\/p>"
    },
    {
        "title": "Tea Bag",
        "desc": "<p>To see a tea bag in your dream suggests that you need for more calmness in your life. Take a rest! If the tea bag is in use, then refer to the interpretation for tea.<\/p>"
    },
    {
        "title": "Tea House",
        "desc": "<p>To dream that you are at tea house symbolizes your social life. It is time to call up old friends and catch up with what they are all up to.<\/p>"
    },
    {
        "title": "Teacher",
        "desc": "<p>To see your teacher (past or present) in your dream suggests that you are seeking some advice, guidance, or knowledge. You are heading into a new path in life and are ready to learn by example or from a past experience. Consider your own personal experiences with that particular teacher. What subject was taught? Alternatively, a teacher relates to issues with authority and seeking approval. You may be going through a situation in your waking life where you feel that you are being treated like a student or in which you feel you are being put to a test.Also pay attention to the demeanor and attitude of the teacher in your dream. If the teacher in your dream is mean, then it implies that you may be putting too much pressure on yourself to succeed.<\/p><p>To dream that you are a teacher indicates that you are in a position of disseminating your knowledge and wisdom to others. The dream may imply how you are &quot;teaching someone a lesson&quot; and giving them a hard time about something. If you are a teacher in real life, then the dream is just a reflection of who you are and is about your work.<\/p><p>To dream that you are having sex with a teacher implies that there are still things you need to learn when it comes to sex.<\/p><p>*Please see also: <a href=\"#school\">School<\/a>.<\/p>"
    },
    {
        "title": "Teacups",
        "desc": "<p>To see teacups in your dream indicate that you need to be more spiritual.<\/p>"
    },
    {
        "title": "Teal",
        "desc": "<p>*Please See: <a href=\"#Duck\">Duck<\/a> or See: <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/colors.htm#Teal\">Dream Moods' Dream Themes: Colors<\/a>.<\/p>"
    },
    {
        "title": "Teakettle",
        "desc": "<p>To see a teakettle or tea pot in your dream symbolizes the mundane aspect of your life. Perhaps you are taking certain things for granted or are overlooking something or someone.<\/p>"
    },
    {
        "title": "Team",
        "desc": "<p>To dream that you are part of a team indicates the importance of working together. The dream may be a metaphor that you have your life in order. If you are unhappy in the team, then it suggests that you are having issues in some area of your waking relationship. You may not be getting along with some work colleague or family member.<\/p>"
    },
    {
        "title": "Tear Gas",
        "desc": "<p>To come in contact with tear gas in your dream suggests that you are feeling suffocated and smothered by some relationship. You need to cleanse yourself and get rid of past pain.<\/p>"
    },
    {
        "title": "Tears",
        "desc": "<p>To dream that you are in tears signify that you are undergoing a period of healing in your life. The tears symbolize compassion, emotional healing and spiritual cleansing. Alternatively, tears indicate pain.<\/p><p>To dream that someone is in tears indicate that you need to rethink your actions and how your behavior may be affecting those around you.<\/p><p>To see a teardrop in your dream represents some previous wisdom that you have learned or recalled.<\/p>"
    },
    {
        "title": "Teasing",
        "desc": "<p>To dream that you are being teased suggests that you are behaving or acting inappropriately in some waking situation. You are not taking your actions seriously. Alternatively, the dream indicates that you are feeling victimized by others or by circumstances.Teasing may also be a metaphor for someone who is being &quot;a tease&quot;, perhaps even yourself.<\/p><p>To dream that you are teasing another person indicates that you are having a problem accepting an aspect of your own character as represented by the person being teased. They may highlight your own insecurities and self-doubt.<\/p>"
    },
    {
        "title": "Teddy Bear",
        "desc": "<p>To see or receive a teddy bear in your dream suggests a regression to an earlier state. You may be reminiscing about early childhood memories. Or it may symbolize lost security, comfort, and companionship. You need to be reassured and taken care of. Alternatively, a teddy bear signifies an immature relationship.<\/p>"
    },
    {
        "title": "Teenager",
        "desc": "<p>If you are beyond your adolescence and you dream that you are a teenager, then the dream suggests that you are acting immaturely. An aspect of yourself may still need some developing in order to achieve fulfillment. Alternatively, to dream that you are a teenager suggests that you are struggling for your independence and autonomy.<\/p>"
    },
    {
        "title": "Teepee",
        "desc": "<p>To see or dream that you are living in a teepee signifies your ability to adapt to any situation or circumstance. You tend to just go with the flow. Alternatively, dream about a teepee indicates that you are temporarily shielding yourself from a situation. Sooner or later, you will not to confront the issue at hand. The dream may refer to the initials T.P.<\/p>"
    },
    {
        "title": "Teeth",
        "desc": "<p>To dream that you have rotting or decaying teeth implies that you may have said something that you shouldn't have. You may have uttered some false or foul words and those words are coming back to haunt you.<\/p><p>To dream that your teeth is sparkling or gleaming signifies happiness and fulfilled wishes.<\/p><p>Dreaming of brushing your teeth suggests that you are feeling defensive about any criticism directed towards you. You are putting up a shield or barrier to protect yourself from potential hurt. Alternatively, the dream means that you are preoccupied with your appearance and are worried about how others perceive you. It refers to your level of confidence, your struggles and your aggressiveness. You need to look out for yourself and your own interest. Perhaps, you feel that your position is shaky.<\/p><p>To dream that you don't want to brush your teeth implies that you tend to speak your mind even if it may offend others.<\/p><p>To dream that your teeth has fallen out and you try to refit them back into the mouth signifies a lack of self-confidence and embarrassment. You are afraid that others will know of your short-comings. If you acted calmly in your dream, then it may point to how can make the best out of any situation. You are able to rise above unfavorable circumstances.<\/p><p>Dreaming that there are teeth growing all over inside your mouth from the roof of your mouth to under your tongue means that you are on the defensive about something and may be a little overly aggressive about it.<\/p><p>If you dream that your teeth is broken or that it has been knocked out, then it means that you have misspoken about some matter. It is also refers to the consequences of your words and\/or what you say about others.<\/p><p>To dream that you are pulling teeth out of your mouth and it hurts refers to something that you do not want to do. If you dream of pulling teeth out of your mouth and it does not hurt, then it means that a situation was not as difficult or tedious as you had initially assumed.<\/p><p>If you have a dream that you are carrying a tooth, then it is symbolic of money or lack of in your pocket. You are experiencing some financial issues.<\/p><p>*For an in depth analysis, click on Dream Moods' section on: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/teeth-dreams.html\">Common Dreams: Teeth<\/a><\/p>"
    },
    {
        "title": "Telegram",
        "desc": "<p>To dream that you receive a telegram represents an important message from your subconscious. Receiving a telegram may be an indirect and non-confrontational approach to which you can better deal with some suppressed matters.<\/p><p>To dream that you are sending a telegram indicates that you are trying to make an aspect of yourself known without being too direct about it.<\/p>"
    },
    {
        "title": "Telekinesis",
        "desc": "<p>To dream that you are telekinetic represents a higher level of awareness and consciousness. You are not utilizing your full potential and need to start putting your stored energy levels and mental abilities to use. In other words, you need to put your thoughts into action. For some, dreams of telekinetic powers may indicate your latent paranormal abilities.<\/p>"
    },
    {
        "title": "Telepathy",
        "desc": "<p>To dream that you have telepathy signifies a personal and highly spiritual message from your subconscious. Your telepathic abilities suggest that you need to pay more attention to what people are telling you and conveying to you. The dream may also indicate that you need to better connect with people. Your telepathic dreams can help and show you how to talk to certain people; it is like a &quot;rehearsal&quot; of sorts.<\/p><p>To dream that someone has telepathy indicates fear of exposure. You are keeping something inside and don't want others to know about it.<\/p>"
    },
    {
        "title": "Telephone",
        "desc": "<p>To see or hear a telephone in your dream signifies a message from your subconscious or some sort of telepathic communication. You may be forced to confront issues which you have been avoiding. Alternatively, the telephone represents your communication and relationship with others. If there is no dial tone or the phone is left off the hook, then the dream indicates that you are shutting yourself out. You are experiencing difficulties in getting your thoughts and feelings across. To hear a dial tone in your dream means that you are receptive to new ideas and open to other's opinions.<\/p><p>To dream that you do not want to return a call or answer a ringing telephone indicates a lack of communication. There is a situation or relationship that you are trying to keep at a distance. To dream that the telephone is constantly ringing means that some message is not coming through properly.<\/p><p>To dream that you are having a telephone conversation with someone you know signifies an issue that you need to confront with that person. This issue may have to do with letting go some part of yourself.If you are put on hold, then the dream is a metaphor for being taken for granted or being unable to freely express yourself.<\/p><p>To dream that you dial the wrong number means that you are experiencing difficulties in relating to others. You have trouble expressing yourself and over-think things.<\/p><p>To dream that your telephone has been tapped indicates that aspects of your subconscious must be confronted. Alternatively, it implies that you have a fear of being exposed. There is something you are hiding.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=telephonedream1\">Can't Make Phone Call<\/a>&quot;<\/p>"
    },
    {
        "title": "Telephone Book",
        "desc": "<p>To see or use a telephone book in your dream suggests that &quot;you need to reach out and touch someone&quot;. Perhaps there is someone from your past that you need to reconnect with. Or the dream may be a metaphor telling you that there is some issue that you need to &quot;address&quot;.<\/p>"
    },
    {
        "title": "Telephone Booth",
        "desc": "<p>To see or dream that you are inside a telephone booth refers to a message or advice that comes with a price. It may also point to your communication or relationship with someone and how it is taking a toll on you in some way.<\/p><p>Dreaming that the the phone booth is out of order implies that you are being shut out . You are having difficulties connecting to others or you are unable to get your thoughts across in an effective way.<\/p>"
    },
    {
        "title": "Telephone Charger",
        "desc": "<p>To see or use a telephone charger in your dream suggests that you are feeling drained or empty. Thus the dream may be metaphor that you need to be &quot;recharged&quot; and revitalized. Alternatively, the dream indicates that you are disconnected from others. Perhaps you are isolating yourself.<\/p>"
    },
    {
        "title": "Telephone Number",
        "desc": "<p>To see a phone number in your dream suggests that you need to make contact with someone or reach out for help.<\/p><p>To dream that you cannot remember or find a phone number suggests that you need to start being more independent and responsible.<\/p><p>To dream that you cannot dial a phone number correctly suggests that you are having difficulties in getting through to someone in your waking life. Consider whose phone number you are trying to dial. Perhaps he or she is not taking your advice or listening to what you have to say.<\/p><p>To dream that you are giving someone your telephone number means that you need to take the initiative and reach out to others. You need to make the first move.<\/p>"
    },
    {
        "title": "Telephone Pole",
        "desc": "<p>To see a telephone pole in your dream symbolizes some spiritual communication. If you see a row of telephone poles, then it represents your connections to others. Perhaps there is someone who you need to reach out to.<\/p>"
    },
    {
        "title": "Teleportation",
        "desc": "<p>To teleport in your dream represents your desires to escape your current situation or to move more faster and easier through it. You may be expressing some frustrations with how your waking life is proceeding and the slow speed that it is moving at.<\/p>"
    },
    {
        "title": "Teleprompter",
        "desc": "<p>To dream that you are reading from a teleprompter implies that you are not saying what you really feel. Instead you are saying what others want to hear.<\/p>"
    },
    {
        "title": "Telescope",
        "desc": "<p>To see a telescope in your dream suggests that you need to take a closer look at some situation. It may also indicate that you are going through a period of uncertain changes. As a result, you are feeling anxious. Alternatively, the dream may be a metaphor and that you need to extend or reach out to something or someone.<\/p><p>To dream that you are looking through a telescope at the stars and planets signifies pleasurable but costly journeys. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Television",
        "desc": "<p>To dream that you are watching television represents your mind and its flowing thoughts. The dream reflects how you are receiving, integrating, and expressing your ideas and thoughts. The programs you dream of watching are an objective view of the things that are in your mind.<\/p><p>To dream that you are on TV suggests that there is something that you want to broadcast to the whole world. You have the desire to express yourself. Alternatively, the dream means that you are trying to take a more objective view on your life issues. If you dream that the TV show is your reality, then it means that you are avoiding some responsibility.<\/p><p>To dream that the television is broken or that the picture is fuzzy suggests that you are looking at a problem all wrong. You need to re-evaluate an issue.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=televisiondream1\">Roswell<\/a>&quot; &amp; &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=televisiondream2\">TV Dream<\/a>&quot;<\/p>"
    },
    {
        "title": "Temperature",
        "desc": "<p>To dream that you or someone is taking your temperature suggests that you need to keep your temper in check. If the temperature is high, then it indicates that feelings of anger or hatred or threatening to come to your consciousness. If the temperature is low or normal, then it indicates that you are able to remain calm and cool under pressure.<\/p>"
    },
    {
        "title": "Tempest",
        "desc": "<p>To dream that you are caught in a tempest indicates a violent emotional outbreak. You are experiencing a lot of anger, rage and turmoil.<\/p><p>*See: <a href=\"#Storm\">Storm<\/a> or: <a href=\"#Cyclones\">Cyclones<\/a>.<\/p>"
    },
    {
        "title": "Temple",
        "desc": "<p>To see a temple in your dream represents inspiration, spiritual thinking, meditation and growth. It is also symbolic of your physical body and the attention you give it. Perhaps you need to pamper yourself. Alternatively, the dream suggests that you are looking for a place of refuge and a place to keep things that are dear to you.<\/p>"
    },
    {
        "title": "Temptation",
        "desc": "<p>To dream of a temptation represents a conflict between your Self and your desires and between instant gratification and long term goals. You are trying to weigh some life decision.<\/p>"
    },
    {
        "title": "Ten Commandments",
        "desc": "<p>To dream of the ten commandments suggest that you will be rewarded if you behave and follow the rules.<\/p>"
    },
    {
        "title": "Tenant",
        "desc": "<p>To dream that you are a tenant indicates a lack of responsibility for the way you are living.The dream may also be a metaphor that you are overstepping someone else's boundaries.<\/p><p>To dream that you have a tenant suggests that you are ready for a committed relationship.<\/p>"
    },
    {
        "title": "Tennis",
        "desc": "<p>To dream that you are playing tennis represents changes or challenges in your life. You need to actively assert yourself and prove yourself time and time again. Alternatively, playing or watching tennis indicates that you are unable to commit to a situation or decision. You are literally going back and forth between two choices. Perhaps the dream is trying to tell you that &quot;the ball is in your court.&quot; It is your turn to make the next move. meanings by DreamMoods.com<\/p><p>Since one of the score in tennis is denoted as &quot;love&quot;, then the game of tennis may be a metaphor for a romantic relationship or a courtship.<\/p>"
    },
    {
        "title": "Tennis Court",
        "desc": "<p>To see a tennis court in your dream implies that you need to choose a side in some challenge or argument.<\/p>"
    },
    {
        "title": "Tent",
        "desc": "<p>To dream that you are in a tent indicates that you need a temporary change to your daily routine. You need to take time off and get away from the daily grind. Alternatively, the dream may mean instability and insecurity in your current situation. You do not want to settle down. Dreaming that you are in a tent may be a pun on your &quot;in-tent&quot; or intentions.<\/p>"
    },
    {
        "title": "Tent Pegging",
        "desc": "<p>To dream that you are tent pegging represents the small accomplishments you make along the way toward a bigger goal. Alternatively the dream is analogous to your sexual conquests.<\/p>"
    },
    {
        "title": "Tentacles",
        "desc": "<p>To see tentacles in your dream symbolize unknown danger lurking from the depths of your subconscious. Your subconscious is trying to pull you in so you can address the issues that you have been refusing to confront or acknowledge. Alternatively, the dream refers to a very clingy relationship.<\/p>"
    },
    {
        "title": "Tequila",
        "desc": "<p>To dream that you are drinking tequila represents your relaxed state of mind. You want to let go of life's daily problems.<\/p>"
    },
    {
        "title": "Terminal",
        "desc": "<p>To dream that you are at the terminal represents relationships and situations that you are leaving behind. It signifies a transitional phase where you are approaching a new direction in life. Consider if the train or flight was delayed, early or on time. The dream may also be a metaphor to symbolize someone who is &quot;terminally&quot; ill or your own fears of death.<\/p>"
    },
    {
        "title": "Termite",
        "desc": "<p>To see termites in your dream represent an attack to your soul or to your being. Alternatively, the dream refers to the end of a phase in your life.<\/p>"
    },
    {
        "title": "Terrarium",
        "desc": "<p>To see a terrarium in your dream indicates that you are keeping aspects of yourself a secret and protecting yourself from others. Alternatively, the terrarium symbolizes fertility, creativity, and the birth of new ideas.<\/p>"
    },
    {
        "title": "Terror To dream that you are in terror indicates unresolved fears or doubts that needs to be confronted. Terrorist",
        "desc": "<p>To see or dream that you are a terrorist suggests that your frustrations is giving way to your violent tendencies. You are feeling disempowered, resentful, and frustrated. You need to redirect your energy in a more positive manner.<\/p>"
    },
    {
        "title": "Test",
        "desc": "<p>To dream that you are taking a test indicates that you are being put to the test or being scrutinized in some way. If you fail the test, then it suggests that you are feeling inadequate or insecure about some aspect of your waking life. If you ace the test, then it means that you are prepared and ready for the task at hand. There is also the notion that if you visualize success, then you will achieve success. Thus, this dream may be a &quot;practice exercise&quot; for you to visualize success in your real life. Alternatively, the dream may be a pun on &quot;feeling testy&quot; and irritated.<\/p><p>*Please see Dream Moods' <a href=\"http:\/\/www.dreammoods.com\/commondreams\/test-dreams.html\">Common Dreams: Exam<\/a>.<\/p>"
    },
    {
        "title": "Test Tube",
        "desc": "<p>To see or use a test tube in your dream refers to your reaction to some situation. Alternatively, the dream suggests that you need to be more willing to experience new things.<\/p>"
    },
    {
        "title": "Testicles",
        "desc": "<p>To see testicles in your dream symbolize raw energy, power, fertility or sexual drive. The dream may refer to anxiety about your sexual prowess. Alternatively, it indicates that you will need a lot of nerve to achieve some task.<\/p>"
    },
    {
        "title": "Testify",
        "desc": "<p>To dream that you are testifying in your dream represents your quest for the truth.<\/p>"
    },
    {
        "title": "Tetherball",
        "desc": "<p>To dream that you are playing tetherball implies that you are on a set path and are unable to veer off course. You feel limited in what you can do. Alternatively, the dream suggests that you are getting wound up over some issue.<\/p>"
    },
    {
        "title": "Tetris",
        "desc": "<p>To dream that you or someone is playing Tetris indicates that you are juggling various responsibilities in your life. You are overwhelmed with trying to fit everything into your busy schedule. The dream is analogous to sorting out and organizing the different aspects of your life.<\/p>"
    },
    {
        "title": "Texas",
        "desc": "<p>If you have never been to Texas, but dream of this state, then the dream means that you need to think big and keep an open mind. If you live in Texas, then the dream may just be a reflection of your reality.<\/p>"
    },
    {
        "title": "Text Message",
        "desc": "<p>To dream that you are sending or receiving a text message represents your connection to others and your network of friendships. The dream may also allude to romance.Alternatively, text messages represent messages from your subconscious.<\/p><p>Dreaming that you are unable to send out a text message means that you are having difficulties getting your thoughts and feelings across. Perhaps you feel that you are not getting through to others or that they are not understanding you.<\/p>"
    },
    {
        "title": "Textbook",
        "desc": "<p>To see textbooks in your dream indicate that you still have a lot of learning to do and knowledge to gain. Consider the subject of the textbook for additional clues.<\/p>"
    },
    {
        "title": "Texture",
        "desc": "<p>To notice textures in your dream is indicative of the degree of difficulty you are experiencing in some waking situation. To see or feel a smooth texture implies ease, while rough texture means a difficult situation. To dream of a gritty texture symbolizes hesitance or tentativeness about a decision, situation or relationship. If you dream of a soft or fuzzy texture, then it implies a warm and welcoming situation.<\/p>"
    },
    {
        "title": "Thanks",
        "desc": "<p>To dream that you are thanking someone indicates that you are acknowledging and accepting some aspect of that person within your own self.<\/p>"
    },
    {
        "title": "Thanksgiving",
        "desc": "<p>To dream about Thanksgiving represents togetherness, family reunions, festivities, and your sense of community. The dream is a reflection on your life and the connections that you have made. Alternatively, this dream may be a metaphor that you need to thank somebody. You may be indebted to someone. Consider also your own associations and traditions with Thanksgiving.<\/p>"
    },
    {
        "title": "Thatch",
        "desc": "<p>To dream that you are thatching a roof indicates that you are putting up a barrier between your conscious and subconscious state. You are not ready to confront issues from your subconscious.<\/p>"
    },
    {
        "title": "Thaw",
        "desc": "<p>To see ice thawing in your dream indicates that you are slowly warming up to an idea, person or situation. You may have come to terms with old ideals or past demons.<\/p><p>To dream that you are thawing food refers to emotions that you have repressed, but are ready to confront.<\/p>"
    },
    {
        "title": "Theater",
        "desc": "<p>To dream that you are in a theater signifies your social life. Consider how the performance parallels to situations in your waking life. Observe how the characters relate to you and how they may represent an aspect of yourself. You may be taking on a new role.Alternatively, the dream is a metaphor that you are being too theatrical or too melodramatic. Are you being a dream queen?<\/p><p>To dream that you are laughing and\/or applauding in a theater indicates that you are choosing pleasure and instant gratification over working on future goals.<\/p><p>To dream that the theater is on fire signifies risky new projects that you are tying to undertake.<\/p>"
    },
    {
        "title": "Theme Park",
        "desc": "<p>*Please See: <a href=\"#Amusement%20Park\">Amusement Park<\/a>.<\/p>"
    },
    {
        "title": "Therapist",
        "desc": "<p>To see a therapist in your dream signifies wisdom from your subconscious. The therapist may appear to help you work through your problems, things that you are not seeing, or issues you are refusing to confront head on.Alternatively, the dream suggests that you are lacking an outlet to express your feelings. You have no one to talk to and the dream therapy session may be a way to provide relief.<\/p>"
    },
    {
        "title": "Thermometer",
        "desc": "<p>To see or read a thermometer in your dream represents your emotions, whether you are frigid, emotionally cold, warm, or hot. It also symbolizes your reaction to a situation or relationship.<\/p>"
    },
    {
        "title": "Thermos",
        "desc": "<p>To see or use a thermos in your dream suggests that you are trying to keep a certain feeling or hope alive. Negatively, you may be trying to hold onto something for too long. It is time to let go.<\/p>"
    },
    {
        "title": "Thermostat",
        "desc": "<p>To see or adjust the thermostat in your dream represents control over your emotions. You are keeping your temper in check.<\/p>"
    },
    {
        "title": "Thief",
        "desc": "<p>To dream that you are a thief suggests that you are afraid of losing what you have. Perhaps you feel that you are undeserving of the things you already have. Alternatively, to dream that you are a thief indicates that you are overstepping your boundaries in some situation or relationship.<\/p><p>To dream that you are a witness to a theft or a victim of theft indicates that someone is wasting your time and\/or stealing your energy and ideas. Perhaps you feel robbed in some way.<\/p>"
    },
    {
        "title": "Thigh",
        "desc": "<p>To see your thigh in your dream symbolizes stamina and endurance. It refers to your ability to perform and do things. If you are admiring your thigh in your dream, then it signifies your adventurous and daring nature. However you need to be careful with your conduct.<\/p>"
    },
    {
        "title": "Thimble",
        "desc": "<p>To use a thimble in your dream indicates that you need to tend to the needs of others instead of pursuing your own self-pleasures. If you are looking for a thimble in your dream, then it refers to some domestic issue.<\/p>"
    },
    {
        "title": "Thin",
        "desc": "<p>To dream that something or someone is thin represents a lacking strength and integrity. You feel that you are unable to hold your own or stand up for yourself. Alternatively, the dream indicates flexibility and agility. You are able to adapt to any situation.<\/p>"
    },
    {
        "title": "Thirst",
        "desc": "<p>To dream that you are thirsty symbolizes an unmet need. There is an emotional void in your life. Or you may be seeking for some inspiration, motivation or just an extra push.<\/p><p>To quench your thirst in your dream indicates that you have the ability to succeed and fulfill your desires.<\/p>"
    },
    {
        "title": "Thistle",
        "desc": "<p>To see thistle in your dream represents your need to feel protected. You are putting up an emotional barrier around you and as a result, pushing the people away.<\/p>"
    },
    {
        "title": "Thong",
        "desc": "<p>To see or wear a thong in your dreamrepresents satisfaction with your body image and your sexuality. Alternatively, the dream denotes your readiness to expose or reveal an aspect of yourself that was previously private. You are opening yourself up to others.<\/p><p>If your thong is showing from under your pants, then it denotes a lack of respect or taste. You are committing some indiscretion.<\/p><p>*Please See Dream Mo0ds' interpretation for: <a href=\"#Underwear\">Underwear<\/a>.<\/p>"
    },
    {
        "title": "Thorns",
        "desc": "<p>To see thorns in your dream suggest that there is a prickly situation that you need to overcome. Thorns also symbolize past trauma or some physical suffering. You may be putting up your defenses. Also consider if someone is being a pain or a &quot;thorn by your side.&quot;<\/p>"
    },
    {
        "title": "Thread",
        "desc": "<p>To see thread in your dream symbolizes your life path and destiny. It also represents a connection to your thoughts and ideas. Consider also the color of the thread and look up the significance in Dream Moods' <a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/colors.htm\">Dream Themes: Colors<\/a>.<\/p>"
    },
    {
        "title": "Threaten",
        "desc": "<p>To dream that you threaten someone suggests that you need to assert and stand up for yourself in your waking life. Don't let anyone boss you around.<\/p><p>To dream that you are being threatened indicates that you have internalized some fear. You are feeling inadequate or oppressed.<\/p>"
    },
    {
        "title": "3D Glasses",
        "desc": "<p>To see or wear 3D glasses in your dream means that you need to look at some problem or something from a new perspective. You need to consider all the views.<\/p>"
    },
    {
        "title": "Threesome",
        "desc": "<p>To dream that you are involved in a threesome indicates that there is a missing component in your sex life. Pay attention to the gender of the participants in the threesome. If mostly female, then the dream implies that the missing component may pertain to some emotional aspect of sex. If mostly male, then the dream implies that some physical aspect of sex is lacking. Note that the dream does not necessarily mean that you want a threesome in your waking life.<\/p>"
    },
    {
        "title": "Threshing",
        "desc": "<p>To dream that you are threshing grain signifies satisfaction in your professional and personal relationships.<\/p>"
    },
    {
        "title": "Threshold",
        "desc": "<p>To dream that you are crossing or being carried over or a threshold symbolizes a new relationship, fresh beginnings or possible marriage. You are entering a new phase of your life.<\/p>"
    },
    {
        "title": "Thrift Shop",
        "desc": "<p>To dream that you are at a thrift shop suggests that there are things from your past experiences that you can still learn from. Don't underestimate something that is seemingly worthless. The thrift shop may also symbolize ideas or skills that you have forgotten and can draw from in a current situation.<\/p>"
    },
    {
        "title": "Throat",
        "desc": "<p>To see your throat in your dream symbolizes the ability to express yourself and communicate your thoughts and ideas.<\/p><p>To dream that you have a sore throat or have throat problems suggest that you are having problems saying what you really think. You are having difficulties experiencing how you feel and conveying your thoughts. You may feel threatened or vulnerable when you express yourself. Alternatively, your dream may be telling you that you need to swallow your pride.<\/p><p>Dreaming of having a string attached to something caught in your throat represents something that you regret saying and wished that you can somehow take it back.<\/p><p>If you dream that someone's throat is slit, then it forewarns that this person is unable to keep a secret.<\/p>"
    },
    {
        "title": "Throne",
        "desc": "<p>To dream that you are sitting on a throne symbolizes power, leadership and authority. You are in control of all aspects of your life.Alternatively, a throne represents your achievements and goals.<\/p><p>To see an empty throne in your dream signifies your unwillingness to accept some responsibilities.<\/p>"
    },
    {
        "title": "Throw",
        "desc": "<p>To dream that you are throwing something indicates that there is someone or something that you need to rid yourself of from your life. Consider the object that you are throwing. Alternatively, the dream may be a pun that you are &quot;throwing&quot; or fixing a game or situation. Are you working against the objective?<\/p><p>To dream that someone is throwing something at you implies that there is something that you have overlooked and need to pay closer attention. Perhaps you need to be on the alert for something that is headed your way. Consider how hard the throw is and what is being thrown at your for additional significance.If it was a hard throw, then it means that you may be in for a surprise.<\/p>"
    },
    {
        "title": "Thumb",
        "desc": "<p>To see a thumb in your dream indicates that you need to get a grip on things. It is symbolic of power and ability. If you are giving the thumbs up, then it represents approval and that you are &quot;okay&quot; to proceed. If you are giving the thumbs down, then it means disapproval.<\/p><p>To dream that you have no thumbs denotes poverty and loneliness.<\/p><p>To dream that you have an abnormally large thumb signifies a rapid rise to success.<\/p><p>To dream that your thumb has a very long nail signifies that some negative force is luring you toward some illicit activity.<\/p>"
    },
    {
        "title": "Thumbtack",
        "desc": "<p>To see a thumbtack in your dream symbolizes issues or responsibilities at work. You may be taking on too many responsibilities.Alternatively, the dream refers to something that you need to remember.<\/p>"
    },
    {
        "title": "Thumb Wrestling",
        "desc": "<p>To dream that you are thumb wrestling suggests that you are trying to assert your power in a non-threatening manner.<\/p>"
    },
    {
        "title": "Thunder",
        "desc": "<p>To hear thunder in your dream signifies a violent eruption of anger and aggression. Alternatively, thunder is an indication that you need to pay attention and learn some important life lesson.<\/p>"
    },
    {
        "title": "Thunderbird",
        "desc": "<p>To see a thunderbird in your dream suggests that you cannot go against what is natural. Sometimes you have to go with the flow instead of fighting it. Alternatively, the dream signifies changes and transformation.<\/p>"
    },
    {
        "title": "Thursday",
        "desc": "<p>To dream that it is Thursday means that you need to listen up. There is a situation that needs your full attention.<\/p>"
    },
    {
        "title": "Thyme",
        "desc": "<p>To see thyme in your dream indicates that you need to muster up more courage. It may also be a pun on &quot;time&quot;. Perhaps you feel that time is running out for you or that there is some deadline that you need to be mindful of.<\/p>"
    },
    {
        "title": "Thyroid",
        "desc": "<p>To dream about your thyroid represents your overall well-being. It relates to concerns about your health.<\/p><p>If you dream that you have an enlarged thyroid, then it suggests that you are feeling nervous or excited about something. Alternatively, an enlarged thyroid may be a way for your subconscious to draw attention to some communication issue that you are experiencing.<\/p>"
    },
    {
        "title": "Tiara",
        "desc": "<p>To see or wear a tiara in your dream symbolizes feminine power and mystique.You know how to use your femininity to get your way.<\/p>"
    },
    {
        "title": "Tic Tac Toe",
        "desc": "<p>To dream that you are playing tic tac toe represents your strategy for success. You need to line up your plan in order to achieve success. Alternatively, the dream symbolizes X's and O's or hugs and kisses.<\/p>"
    },
    {
        "title": "Ticket",
        "desc": "<p>To see a ticket in your dream represents the price you need to pay to attain your goals. You have decided on your path in life. A ticket signifies the start of a new endeavor. Consider also the type of ticket. A bus or train ticket symbolizes the price you pay to get ahead in life, while a movie ticket represents your need to be more objective in a situation.<\/p><p>To dream that you lose a ticket denotes confusion and ambiguity in the direction of your life.<\/p>"
    },
    {
        "title": "Tickle",
        "desc": "<p>To dream that you are being tickled indicates a need for humor and laughter in your life. You are taking things too seriously. Alternatively, the dream may be a metaphor for someone that &quot;tickles&quot; your fancy. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Ticks",
        "desc": "<p>To see or be bitten by a tick in your dream indicates that something or someone is slowly draining the energy and strength out of you. A relationship, your job, or a situation is sucking the life and energy out of you. Ask yourself what in your life is causing you much exhaustion. Alternatively, the dream may be a pun on being &quot;ticked off&quot; and thus represent your feelings of being annoyed or irritated.<\/p>"
    },
    {
        "title": "Tidal Wave",
        "desc": "<p>To see a tidal wave in your dream represents an overwhelming emotional issue that demands your attention. You may have been keeping your feelings and negative emotions bottled up inside for too long. On a positive note, the tidal wave symbolizes the clearing away of old habits. If you are carried away by the tidal wave, then it means that you are ready to make a brand new start in a new place.<\/p><p>To dream that you can create a tidal wave with your mind is analogous to your ability to control your emotions and keep them in line.<\/p>"
    },
    {
        "title": "Tides",
        "desc": "<p>To see or hear the tides in your dream represents a need for emotional and spiritual cleansing. Low tides indicate that you energies are being drained, whereas high tides symbolize high energy. Alternatively, the tides symbolize your emotional ups and downs.<\/p>"
    },
    {
        "title": "Tie",
        "desc": "<p>To see or wear a tie in your dream represents your obligations and relational bonds. The dream may also be a pun on feeling tied down to a situation or relationship. If the tie is loose fitting around your neck, then it suggests that you have some unfinished business to tend to. If the tie is too tight-fitting, then it denotes that you feel trapped or suffocated in a situation or condition.<\/p><p>To dream that you are tying something represents your network and connection to others. Alternatively, the dream may be a metaphor of your family ties.<\/p>"
    },
    {
        "title": "Tie Dye",
        "desc": "<p>To see or wear a tie dye in your dream suggests that you are feeling upbeat and groovy. You are in a happy mood. It is also symbolic of free love. Perhaps the dream is welcoming a new relationship. You need to open up yourself to love.<\/p>"
    },
    {
        "title": "Tiger",
        "desc": "<p>To see a tiger in your dreamrepresents power and your ability to exert it in various situations. The dream may also indicate that you need to take more of a leadership role. Alternatively, the tiger represents female sexuality, aggression, and seduction.<\/p><p>In particular, if you dream of a white tiger, then it indicates that a state of tranquility. Despite whatever chaos is surrounding you, you are able to block it out and achieve peace with yourself. Alternatively, a white tiger symbolizes restraint. You are in full control of your emotions and your actions.<\/p><p>To dream that you are attacked by a tiger refers to the emotions that you have repressed because you were afraid of confronting them.<\/p><p>To see a caged tiger in your dream suggests that your repressed feelings are on the verge of surfacing.<\/p><p>To see rugs made of tiger skins symbolize a life of luxury and ease.<\/p>"
    },
    {
        "title": "Tiger's Eye",
        "desc": "<p>To see or wear tiger's eye in your dream signifies insight and meditative thought. You are looking for clarity in some situation.<\/p>"
    },
    {
        "title": "Tightrope",
        "desc": "<p>To dream that you are walking on a tightrope indicates that you are in a very precarious situation. You need to proceed carefully and weigh all the pros and cons of some important decision.<\/p>"
    },
    {
        "title": "Tights",
        "desc": "<p>To dream that you are wearing tights suggest that you are feeling at ease in exposing aspects of your Self.<\/p>"
    },
    {
        "title": "Tiki",
        "desc": "<p>To see a Tiki in your dream symbolizes spirituality and vitality. You are reflecting on your life experiences and relationships. Alternatively, the dream may indicate that you are acting too stiff.<\/p>"
    },
    {
        "title": "Tile",
        "desc": "<p>To see tiles in your dreams indicate that you are too rigid in your thinking. Alternatively, it suggests that your life is monotonous or repetitive. You need some excitement.<\/p><p>To dream that you are laying tile or tiling something indicates that you need to remodel and change an aspect of yourself. If you are working on home improvement projects, then the dream may be a literal depiction of your ongoing projects.<\/p>"
    },
    {
        "title": "Till",
        "desc": "<p>To dream that you are tilling the ground suggests that you need to work on cultivating and recognizing new opportunities.<\/p>"
    },
    {
        "title": "Timber",
        "desc": "<p>To see timber in your dream symbolizes prosperity, strength, durability and creativity. Alternatively, it refers to making a fresh start for yourself.<\/p>"
    },
    {
        "title": "Time",
        "desc": "<p>To dream about time indicates your fears of not being able to cope with the pressures and stresses of everyday life.If time is flying or moving slowly, then it is analogous to aging and growing old.<\/p><p>To dream that you do not have enough time signifies stress, anxiety and fear. You may feel that time is running out in a business or personal matter.<\/p>"
    },
    {
        "title": "Time Capsule",
        "desc": "<p>Tosee or put something in a time capsule suggests that some current knowledge or information will help you or someone in the future. What you learn today will be beneficial for you in the future.<\/p><p>To dream that you are digging up a time capsule refers to the exploration of your subconscious. You are literally unearthing some deep content.<\/p>"
    },
    {
        "title": "Time Travel",
        "desc": "<p>To dream about time travel indicates your wish to escape from your present reality. You want to go back into the past or jump forward to the future to a period where your hopes are realized. This dream also represents your romantic tendency and or your desire to romanticize everything.<\/p>"
    },
    {
        "title": "Timer",
        "desc": "<p>To see or use a timer in your dream means that you are under a time crunch. Perhaps you are under the pressure of some deadline.<\/p>"
    },
    {
        "title": "Tin",
        "desc": "<p>To see tin in your dream represents mental and intellectual expansion. You are broadening your mind and opening yourself to new experiences. Alternatively, tin symbolizes your adaptability to your surroundings.<\/p>"
    },
    {
        "title": "Tingling",
        "desc": "<p>To feel a tingling sensation in your dream<span style=\"color: rgb(0, 0, 0); font-family: Arial, helvetica, sans-serif; font-size: medium; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none;\"><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">may actually be your arm or leg losing blood flow. Perhaps your arm or leg is positioned in a certain way where it is losing circulation. Sometimes your actual bodily sensations or discomfort may incorporate themselves into your dream, as well as noises in your surrounding.<\/p>"
    },
    {
        "title": "Tinkerbell",
        "desc": "<p>To see Tinkerbell in your dream is a sign that you need to be more open about your emotions and express how you really feel.<\/p>"
    },
    {
        "title": "Tinsel",
        "desc": "<p>Tosee tinsel in your dream indicates festivities, togetherness and joy. Alternatively, the dream represents glitz, glamour and fame. You have lofty aspirations and idealistic goals.<\/p>"
    },
    {
        "title": "Tipsy",
        "desc": "<p>To dream that you are tipsy signifies your carefree nature and jovial disposition. Alternatively, the dream suggests that your inhibitions are hindering your creativity. You need to let loose.<\/p><p>To see someone tipsy in your dream denotes that you need to be careful with who you associate yourself with.Their actions may reflect on your own character.<\/p>"
    },
    {
        "title": "Tiptoe",
        "desc": "<p>To dream that you are tiptoeing highlights your grace and poise in a situation or circumstance. You have a careful understanding of the smaller and minor details in your life. Alternatively, the dream indicates your reservation and hesitance in pursuing toward some path.<\/p>"
    },
    {
        "title": "Tired",
        "desc": "<p>To dream that you are tired suggests that you are feeling emotionally drained and stressed. Dreams about being tired usually reflect how you really feel in your waking state.<\/p>"
    },
    {
        "title": "Tires",
        "desc": "<p>To see tires in your dream suggest that you are dwelling too much in the past and need to move on toward the future. It also refers to your emotional health and your ability to bounce back from adversity. You are able to carry yourself from one situation to another with confidence.<\/p><p>To see or dream that you have a flat tire indicates that you are feeling emotionally drained and weary. Your goals are temporarily hindered and as a result, you are unable to progress any further.<\/p><p>Dreaming that you are changing a tire implies that you are reevaluating your goals. You are pursuing a new or different path.<\/p><p>To dream that the tires are missing or stolen from your car indicates that you are being prevented from achieving your goals. Some current issue that you are experiencing is not allowing you to move forward.<\/p><p>To dream that your tires have no more tread suggests that are unable to get any traction toward achieving your goals.<\/p><p>To see tire tracks in your dream denote that you are stuck in a rut.<\/p>"
    },
    {
        "title": "Tissue",
        "desc": "<p>To see or use tissue in your dream indicates that it is time to let go of the past and move on. You need to confront your current problems in order to progress forward.<\/p>"
    },
    {
        "title": "Titanic",
        "desc": "<p>Tosee the Titanic in your dream suggests that you are in conflict with your subconscious. You are going against your instinct. Alternatively, the dream indicates that you will be let down by your high expectations.<\/p>"
    },
    {
        "title": "Titans",
        "desc": "<p>To see titans in your dreams indicate that you have the power to make things happen. Be in control of your own destiny.<\/p>"
    },
    {
        "title": "Toads",
        "desc": "<p>To see a toad in your dream suggests that you are trying to hide your true Self. You need to let the beauty from within shine through.<\/p><p>To kill a toad in your dream signifies that you will be criticized for your decision.<\/p>"
    },
    {
        "title": "Toast",
        "desc": "<p>To see or eat toast in your dream signifies your appreciation for the simple things in life. If the toast is burnt, then it suggests that your passion may consume you.<\/p><p>Tomake a toast in your dream suggests that you need to look at the brighter side of things. Consider what you are toasting to. The dream may be a pun for something that is toast or done. Or it may mean being toasted or intoxicated.<\/p>"
    },
    {
        "title": "Toaster",
        "desc": "<p>To see a toaster in your dream suggests that you are quick witted and quick-thinking. It refers to your continuous flow of ideas.<\/p>"
    },
    {
        "title": "Tobacco",
        "desc": "<p>To dream that you are smoking tobacco and you do not smoke in waking life suggests that you are trying to escape life's problems.You may be trying to rebel against something. If you are a smoker, then tobacco represents your need for comfort and calm.<\/p><p>To dream that tobacco is stuck in your teeth or mouth implies you are holding back some negative feelings or comments.<\/p>"
    },
    {
        "title": "Tocsin",
        "desc": "<p>To hear a tocsin being sounded in your dream indicates that you will win over an argument.<\/p>"
    },
    {
        "title": "Toddler",
        "desc": "<p>To dream that you are a toddler implies that you are developing a new sense of Self. You are exploring a new environment and testing your boundaries.<\/p>"
    },
    {
        "title": "Toddy",
        "desc": "<p>To see a toddy in your dream signifies that a recent turn of events will soon change your way of life.<\/p>"
    },
    {
        "title": "Toes",
        "desc": "<p>To see your toes in your dream represent the way you move and walk through life, either with grace and poise, or the lack of. It also signifies your path in life. Alternatively, toes represent the minor details of life and how you deal with them.<\/p><p>To dream that you lose or gain a toe(s), suggests that you are lacking determination and energy needed to move forward in some situation.<\/p><p>To dream that you hurt your toe or that there is a corn or abrasion on it means that you are feeling anxious about moving forward with some pan or decision.<\/p><p>To dream that someone is kissing your toe indicates that someone is trying to reassure and reaffirm your progress forward.They are motivating you to do better.<\/p>"
    },
    {
        "title": "Toenail",
        "desc": "<p>To dream that you are painting your toenails refers to your confidence in your pursuits and where you are headed in life. Alternatively, the dream means that you care about how you present yourself to others. In other words, you tend to worry about what people think of you.<\/p><p>To dream that your toenail falls off suggests that you are overlooking a small but important issue.<\/p><p>To dream that you are trimming your toenails means that you are reevaluating your path in life.<\/p><p>If you dream that your toenails are dark and discolored, then it indicates regret in some decision you made or in some action that you took.<\/p><p>To dream that your toe nails are growing symbolize an extension of your understanding in a particular matter. If your toenails are extremely long, then it suggests that you are reluctant to move forward in some endeavor.<\/p><p>If you dream of trimming or cutting someone else's toenails, then it indicates that you are trying to be on your best behavior around this person. You do not want to offend this person or overstep your boundaries.<\/p><p>Dreaming that someone is cleaning your toenails suggests that this person is indebted to you in some way.<\/p>"
    },
    {
        "title": "Tofu",
        "desc": "<p>To see or eat tofu in your dream presents your versatility and adaptability to almost any situation. More directly, dreaming of tofu suggests that you need to start adapting a more healthier lifestyle.<\/p>"
    },
    {
        "title": "Toga",
        "desc": "<p>To see or wear a toga in your dream signifies serenity, peace, love and fate.<\/p>"
    },
    {
        "title": "Toga Party",
        "desc": "<p>To dream that you are at a toga party represents your overindulgences and excesses. You are celebrating your sensuality.<\/p>"
    },
    {
        "title": "Toilet",
        "desc": "<p>To see a toilet in your dream symbolizes a release of emotions. You need to get rid of something in your life that is useless. Seeing a toilet in your dream may also be a physical manifestation brought about by a full bladder. The dream is attempting to get you up and to the bathroom. If you are cleaning the toilet, then it means that you are starting to shed your outer wall or lose your inhibitions.<\/p><p>To see a clogged toilet in your dream suggests that you are holding and keeping your feelings to yourself. Your emotions have been pent up too long and you need to let go of the negative feelings.<\/p><p>To see an overflowing or flooded toilet in your dream denotes your desires to fully express your emotions.<\/p><p>Dreaming about a flood with mud and\/or garbage spilling out of the toilet indicates that your feelings are repeatedly being belittled, undermined or unacknowledged. You feel disrespected.<\/p>"
    },
    {
        "title": "Toilet Paper",
        "desc": "<p>To see or use a roll of toilet paper in your dream represents the aftermath of some emotional release. You are ready to heal from your emotional outburst. If you dream of black colored toilet paper, then it means that you are in denial about some of your true feelings.<\/p><p>To dream that your house has been toilet papered suggests that your personal space has been violated. You feel victimized emotionally. If you are toilet papering someone else's house, then it indicates that what may be seemingly harmless can have serious repercussions.<\/p>"
    },
    {
        "title": "Toilet Seat",
        "desc": "<p>To dream that the toilet seat is broken or missing suggests that you are emotionally distant.<\/p><p>To dream that the toilet seat is up implies that you are opening up your emotions to others.<\/p><p>To dream that the toilet seat is down indicates that you are guarded when it comes to expressing your emotions.<\/p>"
    },
    {
        "title": "Toilet Seat Cover",
        "desc": "<p>To see or use a toilet seat cover in your dream means that you are not ready to address your emotions directly. Something or someone is still preventing you from fully letting go of your feelings.<\/p>"
    },
    {
        "title": "Token",
        "desc": "<p>Tosee or use a token in your dream symbolizes your limited resources. Consider what the token is used for and what access it gives you.<\/p>"
    },
    {
        "title": "Toll Booth",
        "desc": "<p>To dream that you see or pass a toll booth refers to a sense of entitlement that you have over some area of your life. If you pay the toll, then it signifies your appreciation for the things you have and the things you have access to. If you drive pass the toll booth without paying, then it indicates defiance.<\/p>"
    },
    {
        "title": "Toll Road",
        "desc": "<p>To dream that you are on a toll road signifies the price you have to pay in order to get ahead in life. There is no such thing as a free ride.<\/p>"
    },
    {
        "title": "Tom Cruise To dream about Tom Cruise suggests that you have gone off the deep end in some aspect of your life. You are not thinking clearly about your actions. Alternatively, the dream may be a pun on how you are &quot;cruising&quot; along through some situation in your life. If you dream of a Tom Cruise movie, then consider the title or plot of the movie and how it parallels your waking situation.",
        "desc": "<p>Tomatoes<\/p><p>To see a tomato in your dream symbolizes domestic happiness and harmony.<\/p><p>To dream that you are eating tomatoes foretells of good health.<\/p>"
    },
    {
        "title": "Tomb",
        "desc": "<p>To see tombs in your dream signify aspects of yourself which you have kept hidden and buried away.<\/p><p>To dream that you see your own tomb indicates that you are about to venture into parts of your personality which have been forgotten or have thought to be dead.<\/p><p>To dream that you are trapped in a tomb suggests that you are still being held back by past pain and old fears. You are stuck. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Tombstone",
        "desc": "<p>To see your tombstone in your dream indicates a major change occurring in some aspect of your life.<\/p>"
    },
    {
        "title": "Tongs",
        "desc": "<p>To see or use a pair of tongs in your dream suggest that you need to keep your distance from some matter or situation. It is time to mind your own business.<\/p>"
    },
    {
        "title": "Tongue",
        "desc": "<p>To see your own tongue in your dream represents the things you say and express. You may have either said too much or you may need to express yourself more. If you dream that your tongue is unusually long, then it suggests that you are not being truthful and are lying to yourself about something. If your tongue is sore or looks unusual, then it indicates that you are talking negatively about somebody. The dream may also be a metaphor that you are tongue-tied. You are nervous about verbalizing or communicating some feeling or thought.<\/p><p>To dream that your tongue is hairy or that there is hair on your tongue indicates that you are regretting what you said. Something you said could be leaving a strange taste in your mouth.<\/p><p>To dream that you rip someone else's tongue out indicates that you are extremely upset with something that this person has said, but you are not able to appropriately express your anger. Because you tend to keep your emotions inside, it is finding expression in your dreams in a violent way.<\/p><p>To dream that someone is sticking out their tongue at you refers to some sexual connotation. The tongue is sometimes connected with sexuality and maybe seen as a phallic symbol. Alternatively, the dream symbolizes some sort of insult.<\/p><p>To dream that you have a forked tongue means that you are lying about something or that you are being a hypocrite. Similarly, if you dream that someone has a forked tongue, then it suggests that you cannot trust this person.<\/p>"
    },
    {
        "title": "Tongue Depressor",
        "desc": "<p>To see or use a tongue depressor in your dream suggests that you are not expressing yourself effectively. You are holding back on what you really want to say.<\/p>"
    },
    {
        "title": "Tonsils",
        "desc": "<p>To see your tonsils in your dream suggest that you are ready to share an aspect of yourself.<\/p>"
    },
    {
        "title": "Tool Belt",
        "desc": "<p>To see or wear a tool belt in your dream implies that you need to rethink the choices that you are making in you life. Perhaps you are headed in the wrong direction. Alternatively, the dream represents your high level of confidence. You want everybody to know about your talents and skills. You may even be a little too boastful or arrogant. Also consider the significance of the types of tools in the tool belt.<\/p>"
    },
    {
        "title": "Toolbox",
        "desc": "<p>To see or carry a toolbox in your dream refers to a situation that is in need of repair or attention.<\/p>"
    },
    {
        "title": "Tools",
        "desc": "<p>To see or use tools in your dream represent your self-expression, skills and abilities. You are using the resources that are available to you. It is also a symbol of masculinity. Perhaps you need to create and move toward a different direction. Alternatively, to see tools in your dream suggest that a situation or relationship is in need of some damage control or attention. According to the Freudian school of thought, tools are symbolic of the penis and thus tools being used refer to intercourse.<\/p><p>The tool in your dream may also be a pun on how you are acting like a tool or that someone who is a tool. The dream may also be telling you that you are being taken advantaged of or that you are blindly following others.<\/p>"
    },
    {
        "title": "Tooth Fairy",
        "desc": "<p>To see a tooth fairy in your dreamindicates that you will be rewarded or recognized for your current hardships and difficulties.<\/p>"
    },
    {
        "title": "Toothbrush",
        "desc": "<p>To see or use a toothbrush in your dream suggests that you are feeling defensive about any criticism directed towards you. You are putting up a shield or barrier to protect yourself from potential hurt. Alternatively, the dream means that you are preoccupied with your appearance and are worried about how others perceive you.<\/p><p>To dream that you don't want to brush your teeth implies that you tend to speak your mind even if it may offend others.<\/p>"
    },
    {
        "title": "Toothless",
        "desc": "<p>To dream that you are toothless signifies your inability to reach your goals and advance toward your interests.Bad news and ill health will prevent you from achieving your desires.<\/p><p>To dream that someone is toothless indicates that your rivals are attempting to bring down your good name.<\/p><p>*Please See Also Dream Moods' <a href=\"http:\/\/dreammoods.com\/cgibin\/teethdreams.pl?method=exact&amp;header=dreamid&amp;search=teethintro\">Common Dreams: Teeth<\/a>.<\/p>"
    },
    {
        "title": "Toothpaste",
        "desc": "<p>To see or use a toothpaste in your dream suggests that you need to clean your mouth. Perhaps you have been saying mean or nasty things about others. More directly, the dream may very well be telling you that you need to take better care of your teeth. You are expressing concerns about your appearance.<\/p>"
    },
    {
        "title": "Toothpick",
        "desc": "<p>To see a toothpick in your dream suggests that you are too picky. Perhaps you are dwelling too much on minor flaws, faults, and other small issues.<\/p><p>To dream that you are using a toothpick indicates that you are unable to verbalize some emotion or feeling. Your words are stuck in your mouth.<\/p>"
    },
    {
        "title": "Top",
        "desc": "<p>To see or spin a top in your dream represents idleness.You are not going anywhere in life and are wasting your time away on frivolous pleasures.<\/p><p>To dream that you are on top signifies your goals, aspirations and ideals. You are seeking higher understanding and knowledge.<\/p>"
    },
    {
        "title": "Top Hat",
        "desc": "<p>To see or wear a top hat in your dream signifies male elegance, formality and\/or a flamboyant flair. You are trying to connect to the elegance of the past. Alternatively, a top hat refers to your aspirations for wealth and status.<\/p>"
    },
    {
        "title": "Topaz",
        "desc": "<p>To see a topaz in your dream signifies calmness, warmth and relaxation. You need to restore balance in your life. Alternatively, topaz symbolizes faithfulness, friendship and forgiveness.<\/p>"
    },
    {
        "title": "Topiary",
        "desc": "<p>To see or shape a topiary in your dream means that you are forcing your opinion or ideas on others. Dreaming of people-shaped topiaries highlights your influence and power over others. If you dream of animal-shaped topiaries, then it points to your control over your subconscious desires. However if your dream that the topiary is moving and has a life of its own, then it indicates that you are losing your influence.<\/p>"
    },
    {
        "title": "Topless",
        "desc": "<p>To dream that you are topless signifies your way of showing and exhibiting love. You may be inviting love toward your direction.<\/p><p>*Please See Also Dream Moods' <a href=\"http:\/\/dreammoods.com\/cgibin\/nakeddreams.pl?method=exact&amp;header=dreamid&amp;search=nakedintro\">Common Dreams: Naked<\/a>.<\/p>"
    },
    {
        "title": "Toque",
        "desc": "<p>To see or wear a toque in your dream refers to your confidence in your abilities. You are in control of your emotions.<\/p>"
    },
    {
        "title": "Torch",
        "desc": "<p>To see a torch in your dream represents self confidence, ability to succeed, enlightenment and spiritual confidence.<\/p><p>To dream that you are carrying a lit torch symbolizes love. The dream may be a metaphor that you are carrying a torch for someone or that you have some sort of crush on them. Alternatively, the dream denotes your struggles and desires to break free.<\/p>"
    },
    {
        "title": "Tornado",
        "desc": "<p>To see a tornado in your dream suggests that you are experiencing some emotional outbursts and\/or anger issues. You are lashing out at those around you. Is there a situation or relationship in your life that may be potentially destructive?<\/p><p>To dream that you are in a tornado means that you are feeling overwhelmed and out of control. You have too many things going on in your life. If you dream that you come out of the tornado with no injuries, then it implies that the rough times are temporary and you will come out of it stronger and happier.<\/p><p>To see several tornadoes in your dream represents people around you who are prone to violent outbursts and shifting mood swings. It may also symbolize a volatile situation or relationship.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=tornadodream1\">Tornado<\/a>&quot;<\/p>"
    },
    {
        "title": "Torpedo",
        "desc": "<p>To see a torpedo in your dream suggests that you need to be more direct and honest with your feelings. Or on the other hand, you may be too direct and blunt. The torpedo also has phallic connotations and signify masculine aggression or power.<\/p>"
    },
    {
        "title": "Torrent",
        "desc": "<p>To see a torrent in your dream signifies unexpected trouble. You are going through some major emotional turmoil. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Torso",
        "desc": "<p>To notice yours or someone else's torso in your dream is an emphasis on your feeling. It also symbolizes pride and confidence.<\/p>"
    },
    {
        "title": "Tortilla",
        "desc": "<p>To see or eat a tortilla in your dream represents wholeness.<\/p>"
    },
    {
        "title": "Tortoise",
        "desc": "<p>To see a tortoise in your dream symbolizes perseverance, determination, and longevity. You need to take some chances in order to get ahead in life. The opportunities for advancement are opened to you, but you need to take the next step. Alternatively, the tortoise represents the need to be sheltered or protected from life's problems.<\/p>"
    },
    {
        "title": "Torture",
        "desc": "<p>To dream that you are being tortured indicates that you are feeling victimized or helpless in some relationship or situation. You feel that you cannot do anything. Alternatively, the dream suggests that you may exhibit some sadomasochistic desires.<\/p><p>To dream that you are torturing someone or see others being tortured suggests that you are punishing yourself for your own negative or bad habits. You are projecting yourself onto the person or animal being tortured. Consider the symbolism of who is being tortured. Alternatively, the dream indicates repressed feelings of revenge which you are not able to act on in your waking life.<\/p>"
    },
    {
        "title": "Totem Pole",
        "desc": "<p>To see a totem pole in your dreamrepresents your need to feel protected. It is symbolic of strength and power. Alternatively, a totem pole symbolizes respect and familial solidarity.<\/p>"
    },
    {
        "title": "Toucan",
        "desc": "<p>To see a toucan in your dream denotes paradise, relaxation and ease. This dream symbol may also appear as a pun on &quot;two can&quot;. In other words, two can do it. It is about a partnership, collaboration or teamwork. You cannot do everything yourself, but two can do it.<\/p>"
    },
    {
        "title": "Touching",
        "desc": "<p>Todream that you are touching someone or something indicates that you are trying to communicate your feelings and your need for contact. You may be trying to evaluate a situation and gather information about your environment.<\/p><p>To dream that you are being touched represents your closeness and\/or relationship with a particular person. It may also mean that you are connected and well in tune with an aspect of yourself. Alternatively, being touched may be a metaphor that you are feeling emotional and sensitive.<\/p>"
    },
    {
        "title": "Touchscreen",
        "desc": "<p>To see or use a touchscreen in your dream implies that you need to take a more active or more hands-on approach in order to move forward in some endeavor.<\/p>"
    },
    {
        "title": "Toupee",
        "desc": "<p>*Please see: <a href=\"#Hairpiece\">Hairpiece<\/a>.<\/p>"
    },
    {
        "title": "Tour",
        "desc": "<p>To dream that you are on a travel tourindicates that you are ready to explore hidden and unknown aspects of yourself. You are welcoming any new changes that occur.<\/p><p>To dream that you are a concert tour represents your aspirations for fame. Having to be in a different city every other day may mean that you are feeling uprooted. You are lacking a sense of belonging.<\/p>"
    },
    {
        "title": "Tourist",
        "desc": "<p>To see a tourist in your dream indicates how you are in a position to provide help to others.<\/p><p>To dream that you are a tourist suggests that you are unsure of your surroundings and environment. Perhaps you are feeling a little lost in the world. Alternatively, it indicates that you are ready to explore hidden and unknown aspects of yourself. You are welcoming the changes that are occurring.<\/p>"
    },
    {
        "title": "Tourmaline",
        "desc": "<p>To see or wear tourmaline in your dream symbolizes healing, potential, and purity. It represents your higher Self. Consider the color of the tourmaline for additional significance.<\/p>"
    },
    {
        "title": "Tourniquet",
        "desc": "<p>To dream that you are using a tourniquet indicates that you are feeling drained. You need to concentrate your energy on your strengths and not your weaknesses.<\/p>"
    },
    {
        "title": "Tow",
        "desc": "<p>To dream that you are towing a vehicle or heavy object suggests that you are overworked and overburdened. You feel that others are not pulling their own weight at work, at home, or in a personal relationship. You also feel that you are giving more than you are receiving.<\/p>"
    },
    {
        "title": "Tow Truck",
        "desc": "<p>To see a tow truck in your dream represents your burdens and responsibilities. Alternatively, it signifies an aspect of your life where you need a little assistance. You need someone to help &quot;pick&quot; you up and get you on the right track again.<\/p><p>To dream that you are driving a tow truck means that you feel others are overly dependent on you. You are feeling burdened or overwhelmed.<\/p>"
    },
    {
        "title": "Towel",
        "desc": "<p>To see or use a towel in your dream suggests that you need to deal with your emotions in order to move forward in your life. You need to find some sort of a resolution. Alternatively, it represents completion, a fresh start and new transition.<\/p>"
    },
    {
        "title": "Tower",
        "desc": "<p>Tosee a tower in your dream signifies high hopes and aspirations. If you are looking down from a tower, then it indicates that you have a perceived superiority over others. Your ego is inflated. Alternatively, a tower symbolizes the phallus.<\/p><p>To see a water tower in your dream suggests that you are keeping your emotions inside. You may be unable to express your true feelings, especially feelings of love. Alternatively, a water tower indicates a false sense of security.<\/p><p>To dream that you are climbing a tower denotes your quest for spirituality and subconscious ideas that may be surfacing.<\/p><p>To dream that a tower is falling or crumbling heralds a drastic change ahead.<\/p>"
    },
    {
        "title": "Tower Crane",
        "desc": "<p>To see a tower crane in your dream represents your ability to balance your goals and your family life. You will achieve great success.<\/p>"
    },
    {
        "title": "Town",
        "desc": "<p>To see a busy town in your dream signifies warmth and compassion. You are sociable and get along with others.<\/p><p>To see an abandoned or empty town in your dream suggests that you are feeling rejected by society. You may be isolating yourself from others.<\/p>"
    },
    {
        "title": "Toxins",
        "desc": "<p>* Please See: <a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p4.htm#Poison\">Poison<\/a>.<\/p>"
    },
    {
        "title": "Toy Box",
        "desc": "<p>To see a toy box in your dream indicates that you are putting your childish ways behind you. Alternatively, the dream represents your need to sort out unresolved issues from your childhood.<\/p>"
    },
    {
        "title": "Toys",
        "desc": "<p>Tosee or play with toys in your dream symbolize childhood, domestic joy and harmony. You may be searching for the comfort and security of home. It also represents playful attitudes and your childish ways. Alternatively, the dream may be a metaphor that you are &quot;toying&quot; with somebody's feelings, especially if you are playing together with someone in the dream. Perhaps you are leading someone on.<\/p><p>To dream that you are giving away toys denote that you are being acknowledged for your good deeds.<\/p><p>To see or play with broken toys in your dream suggest that you are trying to make the best out of a negative situation. If you or someone breaks a toy, then it indicates a lack of joy, harmony, or security in your life. You are no longer deriving as much joy from some aspect of your life as you used to. Consider the type of toy and its significance to you.<\/p>"
    },
    {
        "title": "Tracheotomy",
        "desc": "<p>To see or dream that you have a tracheotomy implies that you are looking for an outlet to relieve some of your pent up tension and anxiety.<\/p>"
    },
    {
        "title": "Track",
        "desc": "<p>To dream that you are tracking something or someone suggests that you need to get in touch with some aspect of yourself. The dream may be a pun for some goal, person, or ideal which you have lost track of.<\/p><p>To dream that you are being tracked indicates that you need to be more careful and stand up for yourself. You need to be on guard and on the defensive.<\/p><p>To dream that you are running around a track implies that you are going in circles. You feel that your life is headed no where. It is time to reevaluate your goals.<\/p><p>*Please see also: <a href=\"#Racetrack\">Racetrack<\/a>.<\/p>"
    },
    {
        "title": "Tractor",
        "desc": "<p>To see or ride a tractor in your dream represents your resourcefulness and ingenuity. You set your sights on something and you go for it.<\/p>"
    },
    {
        "title": "Trade",
        "desc": "<p>Todream that you are trading symbolizes an exchange of ideas.<\/p>"
    },
    {
        "title": "Traffic",
        "desc": "<p>To dream that you are in traffic signifies the frustrations that you are experiencing in your life. Things are not going as smoothly as you would like it to. You feel stuck at where you are in life.<\/p><p>To see traffic in your dream indicates the hustle and bustle of everyday life. Sometimes you feel like you are just going with the flow. Things have become too routine.<\/p><p>To dream that you are directing traffic implies that you have power and control over the path or destinations of others. The dream may be highlighting your anxieties about exercising that control.<\/p>"
    },
    {
        "title": "Traffic Cone",
        "desc": "<p>To see traffic cones in your dream suggest that you need to slow down. You may be experiencing some delays or setbacks toward your goals. Perhaps the dream is telling you that you need to take a different approach.<\/p>"
    },
    {
        "title": "Traffic Light",
        "desc": "<p>To see a traffic light in your dream suggests that you feel you are being held back from pursuing your goals. Your forward progress is being controlled by someone or by some outside forces. In other words, you are not in control of your own life. Alternatively, the dream represents the pressure to succeed or else be left behind. If the traffic light is green, then it indicates that you have been given a seal of approval to follow whatever path you have chosen or whatever decision you have made.<\/p>"
    },
    {
        "title": "Tragedy",
        "desc": "<p>To dream of a tragedy indicates that you are experiencing some form of grief or remorse. It is also symbolic of regret.<\/p>"
    },
    {
        "title": "Trail",
        "desc": "<p>To dream that you are on a trail signifies your progress in life. Consider the difficulty and condition of the trail. The dream may also be a metaphor that you are &quot;trailing behind&quot; on some task, some competition or some endeavor.<\/p>"
    },
    {
        "title": "Trailer",
        "desc": "<p>To see a trailer in your dream suggests that you are feeling overburdened. You are carrying more weight on your shoulders than you need to. The dream may also indicate that you are more of a follower than a leader.<\/p><p>In particular, dreaming of a horse trailer means that you are underutilizing your power and strength. You may be waiting for the right moment to exert your power.<\/p>"
    },
    {
        "title": "Trailer Home",
        "desc": "<p>To dream that you live in a trailer home suggests that you are feeling insignificant and undervalued. On the other hand, it may mean that you have a flexible self-image. You are able to adapt to any situation or circumstance.<\/p>"
    },
    {
        "title": "Train",
        "desc": "<p>To see a train in your dream represents conformity. You are just going along with what everyone else is doing. Alternatively, a train means that you are very methodical. You need to lay things out specifically and do things in an orderly and sequential manner. In particular, if you see a freight train, then it refers to the burdens and problems that you are hauling around. It is also symbolic of manual labor. If you see a passenger train, then it relates to mental work. If you see or play with a model train in your dream, then it indicates that you want more control and power over your own life and where it is headed. Dreaming of trains may also be a metaphor that you are &quot;in training&quot; for some event, job or goal. According to Freud, a train is analogous to the male penis.<\/p><p>To dream that you are on a train symbolizes your life's journey. It suggests that you are on the right track in life and headed in the right direction. Alternatively, the dream means that you have a tendency to worry needlessly over a situation that will work out in the end.<\/p><p>To see or dream that you are in a train wreck suggests chaos. The path to your goals are not going according to the way you planned it out. You are lacking self-confidence and having doubt in your ability to reach your goals.If you dream that a train collides with a car, then it indicates that your life goals are in conflict with your belief system. Perhaps someone wants you to pursue a goal that you are not passionate about.<\/p><p>To dream that someone is hit by a train implies that they are on the wrong path in life. Perhaps you need to guide them in the right direction. Such dreams may also be a projection of your own Self. In other words, you are on the wrong life path and need to alter your course.<\/p><p>To dream that you are the engineer signifies that you are in complete control of a particular situation in your waking life.<\/p><p>To dream that you miss a train denotes missed opportunities. It also suggests that you are ill-prepared for a new phase in your life. You may be procrastinating or putting things off that should have already been completed.<\/p><p>To dream about the train on a dress signifies your legacy and what you want to be remembered for. The length of the train symbolizes your importance to those around you.<\/p><p>Hearing a train in your dream means that something is passing you by. You have missed or lost an opportunity.<\/p>"
    },
    {
        "title": "Train Station",
        "desc": "<p>To dream that you at a train station represents a transitional period in your life. You need to take a short break to reassess your situation and determine your path and goals.<\/p>"
    },
    {
        "title": "Train Tracks",
        "desc": "<p>* Please See: <a href=\"#Railroad\">Railroad<\/a>.<\/p>"
    },
    {
        "title": "Trainer",
        "desc": "<p>To see or dream that you have a personal trainer suggests that you need to push yourself to do better in all that you do. Do not take the easy way out. Alternatively, the dream indicates that you are seeking guidance and help in improving your self image.<\/p><p>To see or dream that you are a dog trainer indicates that you need to keep your negative behavior in check. You need to show more restraint.<\/p>"
    },
    {
        "title": "Training",
        "desc": "<p>To dream that you are training for something suggests that you are lacking self-confidence and are having anxieties about your ability. The dream may also reflect a desire to change your status or position in life.<\/p>"
    },
    {
        "title": "Traitor",
        "desc": "<p>To dream that you are or accused of being a traitor signifies self guilt. Something is eating you up inside. You may have done something that you are not proud of.<\/p><p>To see a traitor in your dream suggests that you are feeling let down. Someone has disappointed you or let you down in some way.<\/p>"
    },
    {
        "title": "Tram",
        "desc": "<p>To see a tram in your dream suggests that you need to be more disciplined in certain aspects of your life.<\/p>"
    },
    {
        "title": "Tramp",
        "desc": "<p>To dream that you are a tramp indicates that you are not owning up to your responsibilities. You are lacking the initiative to do something with your life. Perhaps you are trying to escape from life's responsibilities and burdens or you just want to be free of any worries. Alternatively, the dream represents low self esteem and a poor self-image. You have not realized or recognized your full potential. The dream may also be a pun on some woman who is behaving or acting like a tramp.<\/p><p>To offer help or assistance to a tramp suggests that you are ready to accept life's responsibilities.<\/p>"
    },
    {
        "title": "Trampoline",
        "desc": "<p>To dream that you are jumping on a trampoline represents your resilience and your ability to bounce back from difficult and emotional situations.<\/p><p>To see a trampoline in your dream symbolizes the ups and downs of life.<\/p>"
    },
    {
        "title": "Trance",
        "desc": "<p>To dream that you are in a trance suggests that you need to look within yourself in order to acknowledge a higher insight. Explore your emotions and open yourself up to others. Alternatively, the dream indicates a lack of concentration. You are zoning out and can not see something that may be obviously wrong.<\/p>"
    },
    {
        "title": "Tranquilizer",
        "desc": "<p>To take a tranquilizer in your dream implies that you are avoiding some issue, responsibility or situation that is causing you emotional distress. You need to confront the issue and stop relying on outside help. Alternatively, the dream may be a metaphor and your ability to calm others down.<\/p>"
    },
    {
        "title": "Transfiguration",
        "desc": "<p>To dream of transfiguration represents an elevated sense of awareness or sudden clarity. The dream highlights a strong sense of spirituality and divinity.Pay special attention to the details of the dream.<\/p>"
    },
    {
        "title": "Transformation",
        "desc": "<p>To dream that you are undergoing a transformation indicates a need for change or a deviation from your normal routine. Expect some major changes ahead. Alternatively, a transformation refers to your expanded awareness and a deep-level personality development.<\/p><p>*Please see also: <a href=\"#Metamorphosis\">Metamorphosis<\/a>.<\/p>"
    },
    {
        "title": "Transfusion",
        "desc": "<p>To dream that you have a blood transfusion indicates that you need to be revitalized and reenergized. You may be lacking inspiration and need some new motivation in life.<\/p>"
    },
    {
        "title": "Translate",
        "desc": "<p>To dream that you are translating something refers to your ability to get others to agree with your ideas or beliefs.<\/p><p>To have something translated for you in your dream suggests that there is an issue or problem that you are having difficulties understanding. The dream may be telling you to seek help from others.<\/p>"
    },
    {
        "title": "Transmission",
        "desc": "<p>To dream that you are repairing a transmission suggests that you need to better pace yourself and learn to adjust to your surroundings and situations. Perhaps you are going too fast or not keeping up.<\/p>"
    },
    {
        "title": "Transmission Tower",
        "desc": "<p>To see a transmission tower in your dream symbolizes a distribution of power. You do not need to always be in full control. You need to delegate responsibilities and duties. Alternatively, the dream symbolizes industry and modernity.<\/p>"
    },
    {
        "title": "Transparent",
        "desc": "<p>To dream that something is transparent indicates feelings of vulnerability. You are able to see things and see through people and their motives. Thus the dream may be symbolic of your actions and your true intentions. Alternatively, if something is transparent, then it represents clarity and understanding.<\/p>"
    },
    {
        "title": "Transplant",
        "desc": "<p>To dream that you have an organ transplant suggest that an aspect of yourself is worn out. You are seeking a fresh start and new beginning. Consider the significance of the specific organ.<\/p>"
    },
    {
        "title": "Transsexual",
        "desc": "<p>To dream that you are transsexual symbolizes your anxieties or ambivalence about masculine\/feminine roles or passive\/aggressive behavior. You may be reluctant in dealing with these issues. If you are considering or awaiting transsexual surgery, then the dream may represent your anxieties and fears about the surgery, recovery, and life after surgery.<\/p><p>To see a transsexual in your dream indicates that the feminine and masculine aspects of your Self have been damaged. You may be unwilling to confront your shadow self. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Transvestism",
        "desc": "<p>*Please See: <a href=\"#Cross%20Dressing\">Cross Dressing<\/a><\/p>"
    },
    {
        "title": "Trap",
        "desc": "<p>To dream that you are setting a trap indicates that you are trying desperately to hold onto a relationship, to some old habits or to your former ways. Alternatively, the dream signifies your readiness to take action.<\/p><p>To dream that you are trapped or caught in a trap suggests that you are feeling confined and restricted in your job, career, health, or a personal relationship. You may be in a rut and are tired of the same daily monotony.<\/p>"
    },
    {
        "title": "Trapdoor",
        "desc": "<p>To find or see a trapdoor in your dream represents unexpected opportunities that will come your way. Don't be afraid to explore those opportunities. Alternatively, a trapdoor symbolizes discovery of something that you have repressed or stored in the subconscious.<\/p>"
    },
    {
        "title": "Trapeze",
        "desc": "<p>To see a trapeze act in your dream signifies a carefree attitude toward life. You are trying to escape from your daily responsibilities and take some time out to relax. Alternatively, the dream represents your high aspirations and ideals.<\/p><p>To dream that you are swinging on a trapeze indicates a desire or wish for sexual variety and adventure. Alternatively, the dream symbolizes indecisiveness. You are going back and forth on some choice.<\/p>"
    },
    {
        "title": "Trapezoid",
        "desc": "<p>To see a trapezoid in your dream signifies limitations or restraints.<\/p><p>If you are drawing a trapezoid shape in your dream means that you are unable to fully express your opinion about something. You are censoring yourself or holding back.<\/p>"
    },
    {
        "title": "Trash",
        "desc": "<p>*Please See: <a href=\"#Garbage\">Garbage<\/a>.<\/p>"
    },
    {
        "title": "Trash Can",
        "desc": "<p>*Please see: <a href=\"#Garbage%20Can\">Garbage Can<\/a>.<\/p>"
    },
    {
        "title": "Trash Compactor",
        "desc": "<p>To see or use a trash compactor suggest that you are in denial about some issue or problem. Alternatively, the dream means that you are looking at your problems from a different perspective. You are trying to look at things in a more acceptable or presentable way.<\/p>"
    },
    {
        "title": "Traveling",
        "desc": "<p>To dream that you are traveling represents the path toward your life goals. It also parallels your daily routine and how you are progressing along. Alternatively, traveling signifies a desire to escape from your daily burdens. You are looking for a change in scenery, where no one has any expectations of you. Perhaps it is time to make a fresh start. If your travels come to an end, then it symbolizes successful completion of your goals.<\/p><p>To dream that you are traveling in a car filled with people signifies new friends and exciting adventures.<\/p>"
    },
    {
        "title": "Tray",
        "desc": "<p>To see a tray in your dream indicates your senseless spending. You need to be more thrifty. Alternatively, a tray suggests that you are in support of some cause or group. You are supporting someone in an emotional or financial way.<\/p><p>To dream that food is served to you on a tray represents your need to be nurtured and cared for.<\/p><p>To drop a tray in your dream indicates disappointments. You are letting someone down.<\/p>"
    },
    {
        "title": "Treadmill To dream that you are on a treadmill indicates that you are stuck in the same old routine. You are not going anywhere despite your hard work and efforts. It is time to break free from the monotony.",
        "desc": "<p>Treason<\/p><p>To dream that you commit treason indicates conflict between yourself and the society you live in. You are going against what is acceptable.<\/p>"
    },
    {
        "title": "Treasure Chest",
        "desc": "<p>To see a treasure chest in your dream represents your hidden talents. It also refers to a sense of security and belonging. You are content with where you are in a situation or relationship.<\/p><p>To dream that you are looking inside the treasure chest suggests that you are trying to recapture something valuable from your past.<\/p>"
    },
    {
        "title": "Treasures",
        "desc": "<p>To dream that you find treasures indicate that you have unveiled some hidden skill or talent. It also symbolizes your self worth and what you have to offer to the world. Alternatively, the dream may be a metaphor for something or someone that your value or &quot;treasure&quot;.<\/p><p>To dream that you are burying treasure suggests that you are thinking ahead to the future. Perhaps there is some talent or skill that you want to keep secret from others.<\/p>"
    },
    {
        "title": "Trees",
        "desc": "<p>To see lush green trees in your dream symbolize new hopes, growth, desires, knowledge, and life. It also implies strength, protection and stability. You are concentrating on your own self-development and individuation.<\/p><p>To dream that you are climbing a tree signifies achievement of your career goals and attainment of higher positions in life. The speed at which you climb the tree will parallel the speed of your achievement of these goals. If you are sitting under a tree alone, then it indicates a time for reflection. You are contemplating an important decision. If you are sitting under a tree with someone else, then it means that you are evaluating the relationship. The dream may also mean satisfaction with your current situation.<\/p><p>To dream that you chop or cut down a tree indicates that you are wasting your energy, time, and money on foolish pursuits. Alternatively, the dream may be a comment on your sexual fear or guilt.<\/p><p>To see a falling tree in your dream means that you are feeling off balance and out of sync. Perhaps, you are off track and headed in the wrong direction.<\/p><p>To see a withered or dead tree in your dream indicates that your hopes and desires have been dashed. You are experiencing some instability and setback in your life. Alternatively, the dead tree represents infertility or a lack of virility. Perhaps it signals an end to a familial line (as in a family tree).<\/p><p>To see bare trees in your dream indicate used up energy. You have put your all into some relationship or project and now you are exhausted. Perhaps you are even feeling depressed. Alternatively, the dream signifies the cycle of life or the passage of time.<\/p><p>To see crows perched on the dead tree symbolizes the end of some cycle or behavior. It is representative of death.<\/p><p>Dreaming of a tree that is bleeding refers to someone who is devoid of any emotion. Perhaps this person has experience a lot of hurt in their life. Alternatively, a bleeding tree symbolizes the cycle of life and death. If you dream of a forest of bleeding trees, then it highlights the transition from the beginning of something to the end or vice versa.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=treedream1\">Scissors In The Forest<\/a>&quot;<\/p>"
    },
    {
        "title": "Tree House",
        "desc": "<p>To see or dream that you are in a tree house indicates that you are trying to escape from your waking problems. You are blocking off the harsh reality of daily life.<\/p><p>To dream that you are building a tree house suggests that you are working hard to realize your hopes and goals. The dream is about self-development and maximizing your own potential.<\/p>"
    },
    {
        "title": "Tree Of Life",
        "desc": "<p>To see the Tree of Life in your dream represents your connection to all living kind. The dream is a reminder that you are not alone in the world. Alternatively, the dream may suggest that you are feeling insignificant in some relationship or scenario.<\/p>"
    },
    {
        "title": "Trellis",
        "desc": "<p>To see a plant trellis in your dream symbolizes your support system.<\/p>"
    },
    {
        "title": "Trenches",
        "desc": "<p>To see trenches in your dream indicate that you are putting up some form of defense. You are being defensive about something and are drawing a line where you do not want others to cross. Figure out what you are trying to hide.<\/p>"
    },
    {
        "title": "Trespass",
        "desc": "<p>To dream that you are trespassing suggests that you are forcing your beliefs on others. You are also being overly attentive or overly possessive, especially in a relationship. You need to give someone their breathing room.<\/p>"
    },
    {
        "title": "Trial",
        "desc": "<p>To dream that you are on trial indicates that you need to be more accepting of yourself and less judgmental of others. You may be too harsh on yourself or of others. Alternatively, a trial suggests that you are feeling guilty about something in your waking life.<\/p>"
    },
    {
        "title": "Triangle",
        "desc": "<p>To see a triangle in your dream symbolizes your aspirations, potential and truth. It represents your spirituality: the body, mind, and spirit.If the triangle is pointing upward, then it signifies the masculine while a downward pointing triangle signifies the feminine. Alternatively, seeing a triangle serves as some sort of warning or caution, especially if the triangle is yellow. The dream may also be a metaphor for a love triangle in your waking life.<\/p>"
    },
    {
        "title": "Tribe",
        "desc": "<p>To see a tribe in your dream suggests that you are being confronted by some unknown people, situation or idea which you are afraid of. You are not sure about how to approach the issue. If you join the tribe in the dream, then it indicates that you are experiencing doubts about going along with a certain decision.<\/p>"
    },
    {
        "title": "Trick",
        "desc": "<p>To play a trick on someone in your dream indicates that you are not being honest with yourself. You are trying to divert attention elsewhere, other than yourself. Alternatively, the dream may be a metaphor for &quot;turning tricks.&quot;<\/p><p>To dream that you have been tricked suggests that your plans are about to backfire.<\/p>"
    },
    {
        "title": "Trick or Treating",
        "desc": "<p>To dream that you are trick or treating represents the rewards you get when you set your mind to pursue your goals. The dream is also telling you that you need to learn to verbalize your desires in order for others to know what you want.<\/p><p>To dream that trick or treaters are knocking on your door denotes your desire to share your indulgences with others.<\/p>"
    },
    {
        "title": "Trickster",
        "desc": "<p>To see a trickster in your dream signifies deceit. Alternatively, the trickster symbolizes the cruel and cynical side of your own character. The trickster may appear in your dream to create havoc in your life. Or it is trying to break the monotony of your daily life.<\/p>"
    },
    {
        "title": "Tricycle",
        "desc": "<p>To see a tricycle in your dream symbolizes simplicity and a carefree nature. You are experiencing an alleviation from tension and stress.<\/p>"
    },
    {
        "title": "Trident",
        "desc": "<p>To see or use a trident in your dream symbolizes the God of the Sea. Because of the relation to the sea, it relates to some emotional issue. Also consider the symbolism of water and the ocean. Alternatively, a trident is indicative of your creative energy and sensitivity.<\/p>"
    },
    {
        "title": "Trifle",
        "desc": "<p>To see or eat a trifle in your dream symbolizes the various layers and multiple dimensions that make up your life. Perhaps the dream is a reminder that there are many depths to your personality. Or that you need some more pizzazz to your life.<\/p>"
    },
    {
        "title": "Trimming",
        "desc": "<p>To dream that you are trimming something represents growth. You need to get rid and cut away at your old habits and former ways in order to progress forward. Get rid of what you no longer need.<\/p>"
    },
    {
        "title": "Trinket",
        "desc": "<p>Dreaming about a trinket suggests that you are holding onto something or someone that you should let go. In particular, if the trinket is made of glass, then it indicates that you are too concerned with trivial matters. You are dwelling on little details and need to look at the large overall picture. Also consider any personal significance, shape or purpose of the trinket.<\/p>"
    },
    {
        "title": "Trip",
        "desc": "<p>To dream that you trip on something indicates that something is out of order in your life. Things are not going as smoothly as you want, especially when you are faced with obstacles.The dream may forewarn that you are about to make a mistake in some waking decision.<\/p><p>To dream that you are going on a trip suggests that you are in need of a change of scenery. You are feeling overworked and need to take time out for yourself for some fun and relaxation.Alternatively, the dream means that you are looking to explore a different aspect of yourself.<\/p><p>To dream that you are on a business trip suggests that you are having a difficult time trying to relax and being at ease. You may be feeling overwhelmed.<\/p>"
    },
    {
        "title": "Tripe",
        "desc": "<p>To dream that you are eating tripe foretells that you will experience disappointments in some important matter.<\/p>"
    },
    {
        "title": "Triplets",
        "desc": "<p>To see triplets in your dream suggest that you need to consider the physical, the emotional and the spiritual aspects of a situation or decision. Also think about the significance of things that may appear in threes in your waking life.<\/p>"
    },
    {
        "title": "Tripod",
        "desc": "<p>To see a tripod in your dream represents stability and swiftness.<\/p>"
    },
    {
        "title": "Triquetra",
        "desc": "<p>To see a triquetra in your dream refers to a trilogy, as in the past, present, and future or father, mother, and child or body, mind, and soul, etc. It may also hold some spiritual significance for you and thus represents the father, son and holy spirit. Alternatively, a triquetra symbolizes divine power, longevity, eternal love, protection and\/or unity. It is a very positive dream symbol.<\/p>"
    },
    {
        "title": "Troll",
        "desc": "<p>To see a troll in your dream suggests that you have an inferior self-image about yourself. You are belittling yourself or others. The troll in your dream may also represent someone in your waking life who you need to avoid.<\/p><p>*Please See Also: <a href=\"#Dwarf\">Dwarf<\/a>.<\/p>"
    },
    {
        "title": "Trolley",
        "desc": "<p>To see or ride a trolley in your dream indicates that you are open-minded about the new journey or phase in your life. You are taking little steps toward your goals and pacing yourself.<\/p>"
    },
    {
        "title": "Trombone",
        "desc": "<p>To see or play a trombone in your dream represents success in love.<\/p>"
    },
    {
        "title": "Trophy",
        "desc": "<p>To see a trophy in your dream symbolizes recognition for your hard work. The dream may be trying to motivate you.<\/p>"
    },
    {
        "title": "Tropical",
        "desc": "<p>To dream about a tropical place signifies growth, creative energy and positive change. It also indicates a desire to escape from your daily problems.<\/p>"
    },
    {
        "title": "Trouble",
        "desc": "<p>To dream that you are getting in trouble is a reflection of guilt that you are feeling. You are not being completely honest about something and fear being exposed.<\/p>"
    },
    {
        "title": "Trough",
        "desc": "<p>To see or drink from a trough in your dream represents some emotional or sexual issue that must be confronted.<\/p>"
    },
    {
        "title": "Trousers",
        "desc": "<p>To see trousers in your dream signify temptation or sexual allure. Alternatively, the dream suggests that you are questioning your role in some situation.<\/p><p>To dream that you put on your trousers the wrong way signify your gravitation for oddness and peculiarity.<\/p>"
    },
    {
        "title": "Trout",
        "desc": "<p>To see a trout in your dream symbolizes increase prosperity and fortune.<\/p><p>To dream that you are eating trout signifies your cheerful attitude towards life.<\/p><p>To dream that you catch a trout represents joy and pleasure. If it falls back into the water, then your happiness will be short-lived.<\/p><p>To dream that a trout swallowed your lip balm implies that you are trying to take back something you said.<\/p>"
    },
    {
        "title": "Trowel",
        "desc": "<p>To see a trowel in your dream refers to the spreading of kindness and affection.<\/p>"
    },
    {
        "title": "Truck",
        "desc": "<p>To see a truck in your dream suggests that you are overworked. You are taking on too many tasks and are weighed down by all the responsibilities. Pregnant women often dream of trucks or driving trucks. This may be a metaphor of the load they are carrying or an expression of their changing bodies.<\/p><p>To see a truck crash in your dream implies that you are feeling overloaded and are in danger or burring yourself out if you don't slow down.<\/p>"
    },
    {
        "title": "Truck Stop",
        "desc": "<p>To dream that you are at a truck stop suggests that you need to reenergize and recharge yourself. You need to take some time off to rest.<\/p>"
    },
    {
        "title": "Truffle",
        "desc": "<p>To eat a truffle in your dream suggests that you need to allow yourself to be a little self-indulgent sometimes. You deserve it!<\/p>"
    },
    {
        "title": "Trumpet",
        "desc": "<p>To see or hear a trumpet in your dreamsignifies some sort of warning or danger that you have found yourself in. It may be a way for your subconscious to get your attention.<\/p>"
    },
    {
        "title": "Trunk",
        "desc": "<p>To see a trunk in your dream represents old memories, ideals, hopes, and old emotions. It indicates issues and feelings that you have not dealt with.<\/p><p>To see the trunk of a car in your dream signifies the things that you are carrying around with you.<\/p><p>To see the trunk of a tree in your dream signifies your personality, your character, and your inner sense of well being. It is symbolic of your backbone and the things that hold you up. If the trunk is thick and large, then it denotes that you are a strong, rugged and durable person. If the trunk is thin and narrow, then it suggests that you are a highly sensitive person.<\/p>"
    },
    {
        "title": "Trust",
        "desc": "<p>To dream about trust symbolizes self-acceptance. You need to work on integrating aspects of yourself.<\/p>"
    },
    {
        "title": "Truth Or Dare",
        "desc": "<p>To dream that you are playing truth or dare indicates that you need to hold true to your words and do what you say you are going to do.<\/p><p>To dream that you have to tell the truth, then it means that you need to come clean about something that has been nagging on your mind. You need to release some guilt or clear your conscious.<\/p><p>To dream that you dare someone to do something suggests that you are being too dominating. If someone dared you to do something, then it indicates that you will find yourself in some embarrassing or compromising position.<\/p>"
    },
    {
        "title": "T-Shirt",
        "desc": "<p>To see or wear a T-shirt in your dream suggests that you need to take it easy and relax. Alternatively it represents your honesty and genuineness, especially in your personal relationships. Consider also if there is a design or saying on the T-shirt.<\/p><p>To dream that someone is tossing t-shirts into the crowd means that you need to slow down and enjoy the moment.<\/p>"
    },
    {
        "title": "Tsunami",
        "desc": "<p>To see a tsunami in your dream means that you are being overwhelmed by some repressed feeling or subconscious material that is rising up to the surface. You are experiencing some unhappiness and emotional instability in a waking situation.<\/p>"
    },
    {
        "title": "Tuba",
        "desc": "<p>To see or play a tuba in your dream indicates that there is an important message that you need to convey. Alternatively, the dream suggests that you want to make your presence known and stand out from the crowd.<\/p>"
    },
    {
        "title": "Tubing",
        "desc": "<p>To dream that you are tubing suggests that you are on experiencing emotional ups and downs.<\/p>"
    },
    {
        "title": "Tuesday",
        "desc": "<p>To dream that it is Tuesday means that it is time to set up your goals and put your plan into action. The dream is also telling you to stay focus.<\/p>"
    },
    {
        "title": "Tug Of War",
        "desc": "<p>To dream that you are playing tug of war suggests that you need to balance various aspects of your personality. You need to learn to compromise.<\/p>"
    },
    {
        "title": "Tugboat",
        "desc": "<p>To see a tugboat in your dream indicates that you take pride in your work, even if it is menial or minor work. Alternatively, the dream means that you are looking for a some guidance and direction in confronting your emotions.<\/p>"
    },
    {
        "title": "Tulips",
        "desc": "<p>To see tulips in your dream indicate fresh new beginnings. You are loving life! Tulips are also symbolic of faith, charity, hope, perfection, idealistic love and fertility. Consider the pun &quot;two lips&quot;. Perhaps it is hinting to a kiss?<\/p>"
    },
    {
        "title": "Tumbleweed",
        "desc": "<p>To see a tumbleweed in your dream refers to your feelings of loneliness and emptiness. You are lacking direction in your life. Alternatively, the tumbleweed symbolizes the passage of time.<\/p>"
    },
    {
        "title": "Tumbling",
        "desc": "<p>To see or dream that you are tumbling represents your ability to balance aspects of your life. You are able to land on your feet and overcome difficulties with grace. Alternatively, the dream signifies carelessness. Tumbling may also be a metaphor that you have taken a &quot;tumble&quot; or a misstep.<\/p>"
    },
    {
        "title": "Tumor",
        "desc": "<p>Todream that you or someone has a tumor suggests that some repressed memory or feeling remains unsettled and is threatening to emerge into your consciousness. You need to confront these issues. Consider where in the body is this tumor is located for additional symbolism.<\/p>"
    },
    {
        "title": "Tuna",
        "desc": "<p>To see tuna in your dream symbolizes stamina and agility. Through your life experiences, you will build character and become stronger.<\/p>"
    },
    {
        "title": "Tuning Fork",
        "desc": "<p>To see or use a tuning fork in your dream suggests that you are &quot;in tune&quot; with your conscious or your instinct. Keep on doing whatever you are doing.<\/p>"
    },
    {
        "title": "Tunnel",
        "desc": "<p>To see a tunnel in your dream represents the vagina, womb, and birth. Thus it may refer to a need for security and nurturance.<\/p><p>To dream that you are going through a tunnel suggests that you are exploring aspects of your subconscious. You are opening yourself to a brand new awareness. Alternatively, it indicates your limited perspective as in the phrase &quot;tunnel vision&quot;. Are you being close minded or narrow minded in some issue?<\/p><p>To see the light at the end of a tunnel symbolizes hope. You will navigate through life and all its difficulties with great success. Alternatively, it also indicates the end of your journey and the realization of your goals.<\/p>"
    },
    {
        "title": "Tupperware",
        "desc": "<p>To see Tupperware in your dream represents feelings or issues from the past that you are still holding on to.<\/p><p>Dreaming that you are having a Tupperware party symbolizes your practical thinking.<\/p>"
    },
    {
        "title": "Turban",
        "desc": "<p>To see or dream that you are wearing a turban suggests that you are feeling confined by what society considers normal.<\/p>"
    },
    {
        "title": "Turf",
        "desc": "<p>To see green turf in your dream symbolizes happy times.<\/p>"
    },
    {
        "title": "Turkey",
        "desc": "<p>To see a turkey in your dream indicates that you are being foolish. You are not thinking clearly. Alternatively, a turkey is symbolic of Thanksgiving and thus, a time of togetherness and family.<\/p><p>To see a sick or dead turkey in your dream denotes an attack to your pride.<\/p><p>To see a flying turkey in your dream foretells of a rapid rise from obscurity to a position of prominence.<\/p><p>To dream that you are hunting or shooting a turkey, suggests that your success is achieved through dishonest and underhanded means.<\/p>"
    },
    {
        "title": "Turmeric",
        "desc": "<p>To see or taste turmeric in your dream symbolizes passion and zest for life. You are looking for a stimulation of your senses.<\/p>"
    },
    {
        "title": "Turn Signal Light",
        "desc": "<p>To see or use the turn signal light in your dream means that you are looking for validation or approval. If the turn signal light does not work, then it indicates that you are experiencing some hesitation about the decision you have made or the direction that you have taken.<\/p>"
    },
    {
        "title": "Turnips",
        "desc": "<p>To see or eat a turnip in your dream indicates that you will overcome your current problems. It is symbolic of compassion, wealth, or a bright outlook. Alternatively, the dream suggests that whatever you are looking for will &quot;turn up&quot;.<\/p><p>To dream that someone gives you a turnip signifies an offering of friendship, compassion, and kindness.<\/p>"
    },
    {
        "title": "Turnstile",
        "desc": "<p>To see or walk through a turnstile in your dream indicates that you are entering a new phase or transition in your life. You are receptive to changes. Alternatively, the dream may be a pun on your need to turn or change your style.<\/p>"
    },
    {
        "title": "Turquoise",
        "desc": "<p>To see turquoise in your dream symbolizes luck, success and fortune. The turquoise possess healing energy and acts to unify forces between the spirits of the earth and the air.Alternatively, the dream indicates an evil or negative force that you are trying to ward off.<\/p><p>As a color, turquoise is symbolic of healing power and natural energy. It is often associated with the sun, fire, and masculine power.If you have negative feelings toward this color, then it indicates that you are shutting off your emotions and not letting people in. You fear change.<\/p>"
    },
    {
        "title": "Turret",
        "desc": "<p>To dream that you are in a turret implies that you need to get all the facts and see the full picture before making a decision or taking action.<\/p><p>Seeing a turret in your dream indicates that you are feeling defensive about something.<\/p>"
    },
    {
        "title": "Turtle",
        "desc": "<p>To see a turtle in your dream symbolizes wisdom, faithfulness, longevity, and loyalty. It also suggests that you need to take it slow in some situation or relationship in your life. With time and patience, you will make steady progress. Alternatively, a turtle indicates that you are sheltering yourself from the realities of life. You are putting forth a hard exterior and not letting others in. As a result, you are feeling withdrawn.<\/p><p>To dream that you are being chased by a turtle indicates that you are hiding behind a facade, instead of confronting the things that are bothering you.<\/p>"
    },
    {
        "title": "Tusk",
        "desc": "<p>To see an elephant tusk in your dream symbolizes sexual desires.<\/p>"
    },
    {
        "title": "Tutor",
        "desc": "<p>To dream that you are a tutor suggests that you need to share and impart your knowledge on others. Alternatively, the dream may also be a pun on &quot;toot her&quot;. In other words, you need to get the attention of some girl.<\/p><p>To see or have a tutor in your dream indicates that you are seeking some personal advice or guidance. There is something that you still need to learn.<\/p>"
    },
    {
        "title": "Tutu",
        "desc": "<p>To see or wear a tutu in your dream symbolizes your femininity or issues with your feminine side. You are struggling with gender roles and what is acceptable. Alternatively, the dream may be a pun on the number 2 or 22. Consider the significance of the number in your waking life.<\/p>"
    },
    {
        "title": "Tuxedo",
        "desc": "<p>To see or wear a tuxedo in your dream represents culture, sophistication, and\/or grace. It refers to a cultivated passion and your desires for the finer things in life. Alternatively, a tuxedo suggests that you want to amount to something in your life. You want to make a name for yourself and establish your reputation.<\/p>"
    },
    {
        "title": "Tweezers",
        "desc": "<p>To see tweezers in your dream indicate that you need to look at a situation much more closely. There is something that requires precision and accuracy.<\/p>"
    },
    {
        "title": "Twigs",
        "desc": "<p>To see twigs in your dream represent small or minor growth that is occurring in your life.<\/p>"
    },
    {
        "title": "Twilight",
        "desc": "<p>To see the twilight in your dream refers to some old habit, condition, or situation.<\/p>"
    },
    {
        "title": "Twine",
        "desc": "<p>To see twine in your dream represents your connection and attachment to others. Twine also symbolizes what is holding your relationship together. meanings by DreamMoods.com<\/p>"
    },
    {
        "title": "Twins",
        "desc": "<p>To see twins in your dream signify ambivalence, dualities or opposites. You are either in harmony with or in conflict with your ideas and decisions. Alternatively, twins represent security in business, faithfulness, and contentment with life.<\/p><p>To see twins fighting in your dream represent a conflict between the opposites of your psyche. One twin signifies emergence of subconscious material and suppressed feelings, while the other twin represents the conscious mind. There is some situation that you are not confronting.<\/p><p>To dream that you are giving birth to twins implies that your creative mind is clashing with your personal beliefs. Something or someone is pulling you in opposite directions.<\/p><p>Dreaming of giving birth to identical twins means that you are experiencing a surge in creativity. You are feeling inspired.<\/p>"
    },
    {
        "title": "Twisty Tie",
        "desc": "<p>To see or use a twisty tie in your dream suggests that you need to put closure on a relationship or situation. It is time to move on. The dream may be analogous to how you are wound up or how your thinking is &quot;twisted&quot;.<\/p>"
    },
    {
        "title": "Twitch",
        "desc": "<p>*Please See: <a href=\"#Jerk\">Jerk<\/a>.<\/p>"
    },
    {
        "title": "Twitter",
        "desc": "<p>To twitter in your dream represents your desires to stay connected with others. Perhaps you are expressing concerns about losing touch with someone around you. Alternatively, the dream implies that you need to be more concise in how you express yourself.<\/p><p>If you are following someone on twitter in your dream, then it may mean that you need to learn to think for yourself. You need to be a leader instead of a follower. Alternatively, if you dream that others are following you on twitter, then it highlights your leadership skills.<\/p>"
    },
    {
        "title": "Typewriter",
        "desc": "<p>To see a typewriter in your dream indicates that you need to open the lines of communication with someone in your life.<\/p>"
    },
    {
        "title": "Typing",
        "desc": "<p>To dream that you are typing symbolizes your communication skills. It may indicate the difficulties you have in verbally expressing your thoughts. Alternatively, the dream may be a pun on a &quot;type&quot; of something. Perhaps you are being typecast or that you are looking for your type.<\/p>"
    },
    {
        "title": "Typhoid",
        "desc": "<p>To dream that you have typhoid signifies that you need to be cautious of your surroundings and be on alert for rivals meant to do you harm.<\/p>"
    },
    {
        "title": "Typhoon",
        "desc": "<p>To see a typhoon in your dream indicates sudden unexpected changes occurring in your life. You may be experiencing some destructive and powerful emotions.<\/p><p>To dream that you are swept up in a typhoon suggests that both your mental and emotional forces are building up inside and making themselves known. You are being consumed by your emotions. Alternatively, the dream indicates that you are being pressured and pushed against your will toward something you do not want to do.<\/p>"
    },
    {
        "title": "Tyrannosaurus Rex",
        "desc": "<p>To see tyrannosaurus rex in your dream symbolizes your biggest fears. Alternatively, the dream means that you are behaving and acting tyrannical. You may be tearing people down and belittling them in some way.<\/p><p>To dream that you are being attached or chased by a tyrannosaurus indicates that you are being belittled by others. You feel you are being taken for granted.<\/p>"
    },
    {
        "title": "Tyrant",
        "desc": "<p>To dream that you are a tyrant implies that you are too controlling. Alternatively, if you see a tyrant in our dream, then it may represent an aspect of your father's character and his strictness.<\/p>"
    }
]