[
    {
        "title": "U",
        "desc": "<p>To see the letter &quot;U&quot; in your dream is a pun on &quot;you&quot; and how you act and behave in your waking life. Consider what you are doing and how you are feeling in the dream for additional significance. Alternatively, the dream signifies a restart. You need to go back and redo something all over again.<\/p>"
    },
    {
        "title": "U-Turn",
        "desc": "<p>To make a u-turn in your dream indicates that you are altering the course of your life. You are changing directions and starting on a completely different path. Alternatively, the dream means that you have made a wrong decision or choice.<\/p><p>To see a no u-turn sign in your dream suggests that you cannot take back what has already been done. There is no turning back on the choices you have made.<\/p>"
    },
    {
        "title": "UFO",
        "desc": "<p>To see an UFO in your dream signifies your desires to find your spiritual purpose in life. Alternatively, it indicates that you are feeling alienated from those around you. The dream may also be a metaphor that you are acting &quot;spacey&quot; or &quot;spaced out&quot;. You need to be more grounded and come back to reality.<\/p><p>Dreaming that an UFO is invading or attacking the house of someone who passed away indicates that this person was suddenly taken away from you too soon. It also suggests that this person was mentally deteriorating.<\/p><p>*Please see also: <a href=\"#Spaceship\">Spaceship<\/a>.<\/p>"
    },
    {
        "title": "Ugly",
        "desc": "<p>To dream you or someone is ugly signifies aspects of yourself that disgusts and repulses you. These may be feelings you have rejected or repressed.<\/p>"
    },
    {
        "title": "Ukulele",
        "desc": "<p>To see or play a ukulele in your dream refers to your carefree and laid back attitude. It is time to relax.<\/p>"
    },
    {
        "title": "Ulcer",
        "desc": "<p>To dream that you have an ulcer indicates some emotional difficulty that can only be overcome through some pain. It is a rite of passage. Alternatively, an ulcer suggests that you are worrying too much over things that are beyond your control. You need to acknowledge your problems so you can move on.<\/p>"
    },
    {
        "title": "Ultrasound",
        "desc": "<p>To dream that you are getting an ultrasound signifies a new and developing phase in your life. Perhaps you are starting a new relationship, switching jobs or relocating. The dream may also reflect your actual concerns about a pregnancy or your desires to have children.<\/p>"
    },
    {
        "title": "Ultraviolet Light",
        "desc": "<p>To see something under ultraviolet light or black light in your dream means that you are not seeing things that are happening around you. You are turning a blind eye and refusing to see the truth. Alternatively, dreaming of ultraviolet light represents your intuition.<\/p>"
    },
    {
        "title": "Umbilical Cord",
        "desc": "<p>To see an umbilical cord in your dream represents your lack of individuality. You may be expressing some anxiety about being on your own and supporting yourself. Alternatively, an umbilical cord symbolizes your maternal ties. Perhaps you are too emotionally bonded to your mother.<\/p><p>To dream that you are cutting an umbilical cord indicates that you need to be self-sufficient and stand on your own two feet. It is time to pull yourself back up and get back into the swing of things.<\/p>"
    },
    {
        "title": "Umbrella",
        "desc": "<p>To see an umbrella in your dream symbolizes emotional security. You are putting up a shield against your emotions and are trying to avoid dealing with them. If the umbrella is leaking or broken, then it indicates that you are unprepared with facing your problems.<\/p><p>To dream that you cannot open your umbrella and it is raining, then it suggests that you are open to confronting your own feelings and letting your emotions come to the surface.<\/p><p>If you dream that you are carrying an open umbrella while inside, then it indicates that your emotional needs are not being met.<\/p>"
    },
    {
        "title": "Umpire",
        "desc": "<p>To see an umpire in your dream suggests that you are playing unfairly in some waking situation. You have crossed some boundary. If the umpires calls you out, then it signifies self-guilt. Your conscience is in inner turmoil.<\/p>"
    },
    {
        "title": "Uncle",
        "desc": "<p>To see your uncle in your dream represents some aspect of your family heritage and trait. It also symbolizes new ideas and emerging awareness. Consider the idiom &quot;say uncle&quot; to mean surrender or admit defeat.<\/p><p>To dream that you dead uncle calls to tell you that he is digging graves indicates that your subconscious is telling you about some hidden truth or family secret that needs to be uncovered.<\/p>"
    },
    {
        "title": "Unauthorized",
        "desc": "<p>To dream about something unauthorized means that you have copied contents of this dream dictionary without permission from dee-em. This is not a real interpretation.<\/p>"
    },
    {
        "title": "Unconscious",
        "desc": "<p>To dream that you are unconscious indicates your helplessness and inability to function in some given situation. You are not prepared for the major changes that are happening around you. Alternatively, being unconscious suggests that you are oblivious to your surroundings or ignorant of some situation. The dream may be a pun on your unconscious mind and its suppressed content.<\/p>"
    },
    {
        "title": "Undead",
        "desc": "<p>To see the undead in your dream represents your fears and the rejected aspects of yourself. You are refusing to acknowledge those negative parts. If you are being chased or are surrounded by the undead, then it symbolizes unresolved issues that you are not confronting. Things that you thought or assume were put to rest is coming back to haunt you.<\/p><p>To dream that you are undead represents your inability to express yourself. You are feeling disconnected with others. Alternatively, the dream suggests that you have relapsed back to your old habits and ways.<\/p>"
    },
    {
        "title": "Under",
        "desc": "<p>To dream that you are under something indicates low self-esteem and lack of confidence. You are devaluing yourself.<\/p><p>To see objects or find things underneath represents aspects of your subconscious. What you see or what you find is a clue of what is emerging from your subconscious.<\/p>"
    },
    {
        "title": "Underarm",
        "desc": "<p>*Please See: <a href=\"#Armpit\">Armpit<\/a>.<\/p>"
    },
    {
        "title": "Undercover",
        "desc": "<p>To dream that you are undercover indicates that you are hiding your true feelings or true nature. Perhaps the dream is trying to tell you that you are being someone that you are not.<\/p><p>In particular, to dream that you are an undercover cop implies that you are going against your conscience.<\/p>"
    },
    {
        "title": "Underground",
        "desc": "<p>To dream of going or living underground indicates that you are trying to force certain thoughts and issues into your subconscious mind. You really need to confront and explore your unconscious. Alternatively, the dream suggests that you are expressing a desire to go unnoticed or to lie low.<\/p><p>To dream that you are riding in an underground railway signifies anxiety and distress arising from a peculiar situation.<\/p>"
    },
    {
        "title": "Understudy",
        "desc": "<p>To dream that you are an understudy represents your ambition. You are trying to emulate someone you admire. However, you need to eventually be your own person and not try too hard to be someone else.<\/p>"
    },
    {
        "title": "Undertaker",
        "desc": "<p>To see an undertaker or dream that you are one represents your need to take charge of your life and the responsibilities that come with it. Alternatively, an undertaker signifies a new beginning.<\/p>"
    },
    {
        "title": "Undertow",
        "desc": "<p>To dream that you are caught in an undertow implies that your emotions are overwhelming you at the moment. You are being pulled toward the depths of your subconscious. It is time to confront these suppressed issues.<\/p>"
    },
    {
        "title": "Underwater",
        "desc": "<p>To dream that you are underwater suggests that you are being overcome with emotions and are in over your head regarding some situation. You need to gain greater control of your life.<\/p><p>To dream that you are breathing underwater represents a retreat back into the womb. You want to return to a state where you were dependent and free from responsibilities. Perhaps you are feeling helpless, unable to fulfill your own needs and to care for yourself. Alternatively, breathing underwater is analogous to being submerged in your own emotions.<\/p><p>To see houses under water implies that you are very comfortable with your own emotions. Alternatively, the dream may be a reflection of your housing situation. Perhaps you are &quot;underwater&quot; in your mortgage.<\/p><p>To dream of an underwater city represents your subconscious. Through deeper understanding of yourself, you find commonality and shared experiences with others.<\/p><p>To see objects underwater in your dream symbolizes your suppressed feelings as represented by the objects. The objects may trigger some emotional memory which you still need to confront and work through. For example, children's toys or bicycles refer to an emotion that you suppressed in childhood. To see a car underwater in your dream points to feelings of regret or sadness over an abandoned goal.<\/p><p>Dreaming that you are flying underwater represents control over your emotions. You are comfortable with confronting your feelings directly.<\/p>"
    },
    {
        "title": "Underwear",
        "desc": "<p>To dream that you are in your underwear signifies a situation that has created a loss of respect for you. Alternatively, it symbolizes some aspect of yourself that is private. If you feel ashamed of being seen in your underwear, then it indicates your hesitance in revealing your true feelings, attitudes, and other hidden habits\/ideas. If you are not bothered by being in your underwear, then it suggests that you are ready to reveal or expose something that was previously hidden.<\/p><p>To dream that you are not wearing any underwear signifies fear that your secrets will be revealed.<\/p><p>To dream that someone is in their underwear signifies an embarrassing and inexplicable situation. Alternatively, the dream means that you are seeing this person for who he or she really is.<\/p><p>To see dirty or torn underwear suggests that you are not comfortable in your own skin and have feelings of inadequacy. You are uncomfortable about your sexuality and are overly critical about yourself.<\/p><p>*Please see also: <a href=\"#Panties\">Panties<\/a>.<\/p>"
    },
    {
        "title": "Undress",
        "desc": "<p>To dream that you are undressing suggests that you need to reveal your true feelings and be open about them. Alternatively, undressing indicates your connection and comfort level with your sexuality.<\/p><p>To see someone undressing in your dream indicates that you need to be aware of other people's feelings. If you are undressing someone else, then it suggests you are trying to gain a better understanding of that person.<\/p><p>Dreaming that someone is undressing you implies that you are placing complete trust in this person. You are opening yourself up to a new situation and allowing yourself to be vulnerable.<\/p>"
    },
    {
        "title": "Unemployed",
        "desc": "<p>To dream that you are unemployed represents your lack of self-worth or lack of inspiration. The dream may highlight feelings of insecurity or inadequacy. You feel that you are not good enough. Alternatively, the dream means that you are not utilizing your fullest potential. As a result, you are going nowhere in life.<\/p>"
    },
    {
        "title": "Unfaithful",
        "desc": "<p>*Please See Dream Moods' Interpretation for: <a href=\"#Cheating\">Cheating<\/a>.<\/p>"
    },
    {
        "title": "Unfortunate",
        "desc": "<p>To dream that you are unfortunate is a dream of the contrary and indicates a turn of good luck will come your way. Alternatively, the dream means that you are too quick to blame something or someone else for your own shortcomings and problems.<\/p>"
    },
    {
        "title": "Unhappy",
        "desc": "<p>Please See: <a href=\"#Sad\">Sad<\/a>.<\/p>"
    },
    {
        "title": "Unibrow",
        "desc": "<p>To dream that you have a unibrow indicates that you are feeling insecure about your physical appearance. Alternatively, the dream suggests that you are not expressing your feelings enough. Perhaps you are keeping too much of your emotions inside. There is something you are trying to hide.<\/p>"
    },
    {
        "title": "Unicorn",
        "desc": "<p>To see a unicorn in your dream symbolizes high ideals, hope and insight in a current situation. It also symbolizes power, gentleness, and purity. Alternatively, it may represent your one-sided views.<\/p>"
    },
    {
        "title": "Unicycle",
        "desc": "<p>To dream that you are riding a unicycle signifies that you are in total control of a situation and are exercising authority in both personal and business matters.<\/p>"
    },
    {
        "title": "Uniform",
        "desc": "<p>To dream that you or someone is in uniform signifies your need to belong or be part of a group. Alternatively, the dream may suggest that you are conforming too much to the beliefs of others. Learn to think for yourself and be your own person.<\/p><p>In particular, to see a nurse's uniform in your dream indicates cleanliness, compassion, and properness. To see a school uniform means how you are identifying with your school and your classmates. It may bring attention to some issue you have at school. To see people in strange uniforms signify disruption and chaos.<\/p>"
    },
    {
        "title": "Union",
        "desc": "<p>To dream that you are in a union represents collective action. You are doing something that will be good for everybody.<\/p>"
    },
    {
        "title": "United Nations",
        "desc": "<p>To dream about the United Nations signifies world peace, worldly issues and unity. The dream may mean that you are seeking harmony within your own surroundings.<\/p>"
    },
    {
        "title": "Universe",
        "desc": "<p>To see the universe in your dream signifies the endless possibilities. You need to look at the overall big picture. Alternatively, the dream brings to your attention that we are all interconnected in some way.<\/p>"
    },
    {
        "title": "University",
        "desc": "<p>*Please See: <a href=\"#College\">College<\/a>.<\/p>"
    },
    {
        "title": "Unknown",
        "desc": "<p>To see an unknown person in your dream signifies a part of yourself that is repressed and hidden. Alternatively, it symbolizes the archetypal dream helper who is trying to offer some insight and advice.<\/p><p>To see an unknown place in your dream represents change in your life. Consider how you feel about the surrounding. If you are afraid or lost, then it indicates that you are not ready for the change. You are not ready to leave the past behind. If you are excited or happy in this unknown place, then it suggests that you are ready for change.<\/p>"
    },
    {
        "title": "Unmarried",
        "desc": "<p>Please See: <a href=\"#Single\">Single<\/a>.<\/p>"
    },
    {
        "title": "Unprepared",
        "desc": "<p>To dream that you are unprepared for something indicates that you are experiencing anxiety and fear over an upcoming task or event in your waking life. Such dreams depict your lack of self confidence and self-esteem. You are afraid that you will not meet others' expectations of you.<\/p>"
    },
    {
        "title": "Unwrap",
        "desc": "<p>To unwrap a gift in your dream means that you are recognizing your unused potential and talents. You are ready to use the hidden abilities you have locked up inside you.<\/p><p>To find your gift already unwrapped in your dream indicates that someone in your life is taking advantage of your talents and abilities.<\/p>"
    },
    {
        "title": "UPC Barcode",
        "desc": "<p>To see a UPC barcode in your dream symbolizes automation, simplification and ease. Alternatively, the dream represents an impersonal relationship in your waking life. You are feeling alienated.<\/p>"
    },
    {
        "title": "Up",
        "desc": "<p>To dream of being or moving up suggests that you are emerging from some depressing or negative situation. You may be feeling high or euphoric. The dream may also compensate for your waking feelings of sadness. Alternatively, it signifies that your ego is inflated. Or that you are experiencing upward mobility or progressing toward your goals.<\/p><p>According to Jung, the dream parallels some material or repressed thoughtsthat may be emerging from your unconscious.<\/p>"
    },
    {
        "title": "Upholstery",
        "desc": "<p>To dream that you are upholstering something suggests that you are renewing or updating your self image. The dream may also be a metaphor that you are &quot;covering up&quot; something.<\/p>"
    },
    {
        "title": "Uproot",
        "desc": "<p>To see uprooted plants in your dream indicate that you are out of balance. You may be feeling disconnected or distant from others. It may also represent broken family connections or failed attempts in reestablishing familial ties.<\/p>"
    },
    {
        "title": "Upside Down",
        "desc": "<p>To dream that you are upside down suggests that there is some situation or problem in your waking life that you need to straighten up. It may also mean that your initial assumptions were completely opposite of what you thought.<\/p>"
    },
    {
        "title": "Upstairs",
        "desc": "<p>To dream that you are upstairs of a building refers to your higher level of understanding. It symbolizes your rational thinking and objectivity. Alternatively, being upstairs means that you hold yourself in high regard.<\/p>"
    },
    {
        "title": "Uranium",
        "desc": "<p>To see uranium in you dream represents your potential. You have it within yourself to succeed and achieve your goals. Alternatively, seeing uranium in your dream suggests that you are harboring some pent up anger or aggression. You do not let people in your life easily.<\/p>"
    },
    {
        "title": "Uranus",
        "desc": "<p>To see Uranus in your dream represents originality, unconventional thinking, independence, freedom, and individualism. You may be rebelling against some situation in your waking life. Alternatively, Uranus indicates that something unexpected is about to occur.<\/p>"
    },
    {
        "title": "Urban",
        "desc": "<p>*Please See: <a href=\"#City\">City<\/a>.<\/p>"
    },
    {
        "title": "Urinal",
        "desc": "<p>To see a urinal in your dream signifies disorder in your personal relationships.<\/p><p>*Please Also See: <a href=\"#Toilet\">Toilet<\/a>.<\/p>"
    },
    {
        "title": "Urination",
        "desc": "<p>To see urine in your dream represents the feelings you have rejected. Alternatively, the dream may be a pun on your &quot;pissy&quot; attitude.<\/p><p>To dream that you are urinating symbolizes a cleansing and a release of negative or repressed emotions. Depending on your dream context, urination is symbolic of having or lacking basic control of your life. You are literally &quot;pissed off&quot; and not expressing yourself in a positive or constructive manner.<\/p><p>To dream that you are urinating in public symbolizes a lack of privacy in some personal matter. Alternatively, the dream means that you are trying to establish your boundary and &quot;mark your territory.&quot;<\/p><p>To dream that someone is urinating on you means that you are feeling the emotional burden of this person. They are dumping all their feelings on you. Alternatively, the dream symbolizes your lacking sense of self-worth. If you dream that you accidentally urinated on yourself or wet your pants, then it implies that you are on the verge of an emotional outburst. You are desperate to release all the feelings that you have kept bottled up inside of you.<\/p>"
    },
    {
        "title": "Urn",
        "desc": "<p>To see an urn in your dream represents feelings that have burned out or that you are feeling burnt out and exhausted. An urn also symbolizes the past.<\/p>"
    },
    {
        "title": "U.S. Mailbox",
        "desc": "<p>*Please See: <a href=\"#Mailbox\">Mailbox<\/a>.<\/p>"
    },
    {
        "title": "U.S. Visa",
        "desc": "<p>To dream that you are granted a U.S. visa represents how you feel about the United States and what it stands for to you. For example, if, for you, the U.S. stands for freedom, then being granted a visa from the U.S. may parallel a life situation in which you experience some new found freedom. You may be going through a period of self-exploration.<\/p>"
    },
    {
        "title": "USB Drive",
        "desc": "<p>To see a USB Drive in your dream refers to ideas and advices that you need to look at incorporating into a waking situation or some aspect of your life. Dreaming of using a USB Drive means that you are able to easily convey your feelings, beliefs or ideas to others. Also consider what kind of files are on the USB Drive.<\/p>"
    },
    {
        "title": "Usher",
        "desc": "<p>To see an usher in your dream indicates that you are in need for some guidance in your life.<\/p>"
    },
    {
        "title": "Utensils",
        "desc": "<p>To see utensils in your dream indicate innovation. It also signifies your willingness to help others and lend a hand.<\/p>"
    },
    {
        "title": "Uterus",
        "desc": "<p>To see a uterus in your dream represents your desire for children or your nervousness about a pending birth. Metaphorically, the dream may symbolize a creative project in the making.<\/p>"
    },
    {
        "title": "Utopia",
        "desc": "<p>To dream about utopia symbolizes your ideals and your strive for perfection. The dream may be warning you against trying to achieve unattainable goals. You are expecting too much out of others. Alternatively, the dream is one of wish-fulfillment where you wish that all your difficulties problems are gone. You are looking for an escape from your daily life.<\/p>"
    }
]