[
    {
        "title": "V",
        "desc": "<p>To see the letter V in your dream symbolizes victory, success or peace. As a Roman Numeral, it could represent the number 5.<\/p>"
    },
    {
        "title": "Vacant",
        "desc": "<p>To see a vacant lot or property in your dream suggests that you need your own space, either emotional space or physical space. You need some distance and time to yourself in order concentrate on your own needs. Alternatively, a vacancy represents something that is missing or lacking in your life.<\/p>"
    },
    {
        "title": "Vacation",
        "desc": "<p>To dream that you are on vacation indicatesthat you need a break to recharge your energies and revitalize yourself. You need to break out of your daily routine and do something different. Alternatively, dreaming of a vacation represents your achievements. You are giving yourself a pat on the back and are deserving of a reward for your hard work.<p>To dream that you are having a bad or awful vacation suggests that you are not able to escape from the daily responsibilities of your waking life. You are having difficulties coping with life's problems and issues.<\/p>"
    },
    {
        "title": "Vaccination",
        "desc": "<p>To dream that you are getting vaccinated suggests that you need to overcome your vulnerabilities. Things that may initially hurt you will be beneficial to you in the long run.You need to take better care of yourself.<\/p><p>To dream that someone is getting vaccinated indicates that you are being influenced by the beliefs and wishes of others.<\/p>"
    },
    {
        "title": "Vacuum",
        "desc": "<p>Tosee a vacuum in your dream refers to feelings of emptiness. You may be experiencing a void in your life. Alternatively, the dream indicates that you need to clean up your act and your attitude. It is time to rid yourself of your outdated ideas and negative habits.<\/p><p>To dream that you are vacuuming signifies a loss of control. You feel that you are being sucked up by some problem. Alternatively, the dream represents your desires to keep up appearances. Things may look fine on the surface, but some problem still persists underneath.<\/p>"
    },
    {
        "title": "Vagina",
        "desc": "<p>If you are a woman and you see your vagina in your dream, then it refers to your femininity and\/or attitude toward sex. Alternatively, dreaming about your vagina means fertility, life, softness and warmth.<\/p><p>To see another woman's vagina in your dream signifies your sexual needs or urges. It may also suggest that a new project or idea is coming to fruition.<\/p>"
    },
    {
        "title": "Vagrant",
        "desc": "<p>To dream that you are a vagrant suggests that you are trying to escape from the confines of social expectations. It may also indicate your current condition of poverty and misery.<\/p><p>To speak and give to a vagrant in your dream symbolizes your generosity. You are surrounded by valuable friends.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/chasedreams.pl?method=exact&amp;header=dreamid&amp;search=chasedream7\">A Vagrant Is Chasing Me&quot;<\/p>"
    },
    {
        "title": "Valedictorian",
        "desc": "<p>To dream that you are a valedictorian symbolizes your accomplishments and the high goals you have set for yourself. You are reflecting back on your success.<\/p>"
    },
    {
        "title": "Valentine",
        "desc": "<p>To dream that you are sending valentines indicate your need to express more love and affection.<\/p><p>To dream that you are receiving a valentine represents your likeability, compassion and good-hearted nature.<\/p><p>To see a box of valentines in your dream signify that an old lover may come back into the picture.<\/p>"
    },
    {
        "title": "Valentine's Day",
        "desc": "<p>To dream about Valentine's day indicates a new and blossoming relationship. Your current relationship will also take a positive turn. The dream may also be an ultimate expression of love for you. Perhaps you need to tell someone that you love them.<\/p>"
    },
    {
        "title": "Valet",
        "desc": "<p>To dream that you are a valet indicates that you arelacking your own direction in life. You are always helping others with their goals.<\/p><p>To dream that a valet parks your car suggests that you are letting other people dictate your direction in life. Or you are putting the goals of others ahead of your own.<\/p>"
    },
    {
        "title": "Valley",
        "desc": "<p>To dream that you are in a valley symbolizes fertility, abundance, or your need to be sheltered and protected. If you are entering or walking through a valley, then it is analogous to your issues of death and dying. This death may be symbolic as in an end to something in your life. In other words, you are going through a transitional phase. Alternatively, the dream represents life's struggles and hardships before you can achieve some spiritual enlightenment or epiphany.<\/p><p>To dream that you are looking down over a valley implies that you have overcome your difficulties and\/or limitations.<\/p>"
    },
    {
        "title": "Valve",
        "desc": "<p>To see a valve in your dream suggests that you need to keep your cool especially when under pressure. Remain calm and don't panic.<\/p>"
    },
    {
        "title": "Vampire",
        "desc": "<p>To see a vampire in your dream symbolizes seduction and sensuality, as well as fear and death. The vampire represents contrasting images of civilized nobility and aggression\/ferocity. It may depict someone in your waking life whose charm may ultimately prove harmful. Deep down inside, you know that this person is bad for you, yet you are still drawn to her or him. Vampires also sometimes relate to decisions about sex and losing your virginity. Alternatively, to see a vampire suggests that you are feeling physically or emotionally drained. The vampire may also be symbolic of someone who is addicted to drugs or someone in an obsessive relationship.<\/p><p>To dream that you are a vampire signifies that you are sucking in the life energy of others for your own selfish benefit.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=vampiredream1\">Fighting Vampires &amp;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=vampiredream2\">Alluring Vampires&quot;<\/p>"
    },
    {
        "title": "Van",
        "desc": "<p>To see or drive a van in your dream symbolizes convenience and\/or practicality. Consider the load that you are carrying and what you can handle. Don't stress yourself out.<\/p><p>To dream that you drive your van into a body of water or that it rolls into water implies that you are in for an emotional journey.<\/p>"
    },
    {
        "title": "Vandalism",
        "desc": "<p>To dream that you commit vandalism signifies repressed anger. You feel that you are being treated unjustly.<\/p><p>To witness vandalism in your dream represents your passive aggressive tendencies. The dream is telling you that you need to express yourself more constructively.<\/p>"
    },
    {
        "title": "Vanilla",
        "desc": "<p>To taste or smell vanilla in your dream indicates a welcoming experience or inviting situation. Alternatively, it symbolizes purity and innocence.<\/p>"
    },
    {
        "title": "Vanish",
        "desc": "<p>*Please see<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d2.htm#Disappear\">Disappear.<\/p>"
    },
    {
        "title": "Vanity",
        "desc": "<p>To see a vanity in your dream suggests that there is something that you need to prepare for. You need to put your best face forward. A more direct interpretation may mean that you are being too vain.<\/p>"
    },
    {
        "title": "Vape",
        "desc": "<p>To dream that you are vaping means that you should let out your feelings of anger.<\/p><p>If you do not vape in real life, but dream that you are vaping, then it indicates that you are being passive aggressive. You are subconsciously rebelling against authority.<\/p>"
    },
    {
        "title": "Varnishing",
        "desc": "<p>To dream that you are varnishing something suggests that you are trying to cover up some imperfection or mistake. It may also mean that you are putting up a front. You are trying to be someone that you are really not.<\/p>"
    },
    {
        "title": "Vase",
        "desc": "<p>To see a vase in your dream symbolizes the womb and all things feminine. You are open to criticism or suggestions. Alternatively, the dream represents creativity. If the vase is ornate, expensive, or fancy, then it indicates that you like to be the center of attention.<\/p><p>To dream that a vase is cracked or broken represents past, forgotten, or lost love.<\/p>"
    },
    {
        "title": "Vasectomy",
        "desc": "<p>If you are a man and dream that you have a vasectomy, then it indicates that you are expressing some dissatisfaction about your sex life. Alternatively, it suggests some self-doubt or issues with your self-image.<\/p>"
    },
    {
        "title": "Vaseline",
        "desc": "<p>To see or apply Vaseline in your dream indicates that there is some issue that requires a soothing touch. Alternatively, Vaseline means that you are ready to heal from some emotional hurt or wound. It is time to move on.<\/p>"
    },
    {
        "title": "Vat",
        "desc": "<p>To see a vat in your dream symbolizes the womb and a sense of security. Consider the significance of what is inside the vat. This may offer clues as to how you feel you are being treated in a particular relationship or situation. If the vat is empty, then the dream may be a metaphor about feeling empty inside.<\/p>"
    },
    {
        "title": "Vatican",
        "desc": "<p>To see the Vatican in your dream represents hope, renewal and deep spiritual awareness. Alternatively, the Vatican denotes unexpected gain due to the action of others.<\/p>"
    },
    {
        "title": "Vault",
        "desc": "<p>To see a vault in your dream symbolizes the subconscious, your personal resources and hidden potential. The dream may be telling you that you need to start using your inner reserves, skills and underutilized energies, instead of keeping them locked and stored away.<\/p>"
    },
    {
        "title": "Vaulting",
        "desc": "<p>To dream that you or someone perform a vault represents your determination and drive toward your goals. You are trying to overcome some obstacle or difficulty. Consider the performance and degree of difficulty of your vault as it indicates your level of confidence.<\/p>"
    },
    {
        "title": "VCR",
        "desc": "<p>To see a VCR in your dream refers to something that needs to be documented or recorded. There may be something that you have overlooked. A VCR also refers to memories and lessons of the past and the insights that you can still gain from it. The dream may also be calling attention to the impression you leave behind and what others may think of you.<\/p>"
    },
    {
        "title": "Veal",
        "desc": "<p>To dream that you are eating veal implies that you are behaving immaturely. It also points to inexperience. The meaning of veal will also depend largely on your personal views about eating veal or if you are a vegetarian. Perhaps there is something you find repulsive.<\/p>"
    },
    {
        "title": "Vegetables",
        "desc": "<p>To see vegetables in your dream signify your need for spiritual nourishment. It may also indicate that you are lacking in a particular nutrient. Look up the specific vegetable for additional interpretation.<\/p><p>To see withered vegetables in your dream denotes sadness. The dream may also be a metaphor that you are &quot;vegging&quot;.You need to get up and be more active.<\/p>"
    },
    {
        "title": "Vegetarian",
        "desc": "<p>If you are not a vegetarian in your waking life and dream that you are a vegetarian, then it refers to your strict self discipline.Alternatively, the dream may also mean that you are lacking substance in some area of your life.<\/p>"
    },
    {
        "title": "Vegetation",
        "desc": "<p>To see vegetation in your dream represents obstacles that you have to overcome in order to grow as a person and move forward.<\/p>"
    },
    {
        "title": "Vehicle",
        "desc": "<p>To dream that you are riding in a vehicle (<a href=\"http:\/\/www.dreamdictionary.com\/dreamdictionary\/c.htm#Car\">car,<a href=\"http:\/\/www.dreamdictionary.com\/dreamdictionary\/b2.htm#Boat\">boat,<a href=\"http:\/\/www.dreamdictionary.com\/dreamdictionary\/t3.htm#Train\">train, etc.) signifies the level and type of control you have over your life. Alternatively, the dream means that someone is exerting their power over you, depending on who is in the driver's seat.<\/p><p>To dream that you are thrown from a vehicle refers to your hastiness and quick temper.<\/p><p>Consider the specific vehicle for additional meaning.<\/p>"
    },
    {
        "title": "Veil",
        "desc": "<p>To dream that you or someone is wearing a veil represents something that you wish to hide or conceal. Things may not be what it appears to be. In particular, if you are a man and dream you are wearing a veil, then it signifies the feminine aspects of your character. Perhaps, you need to acknowledge your feminine side. Alternatively, a veil symbolizes humility, coyness or innocence.<\/p>"
    },
    {
        "title": "Veins",
        "desc": "<p>To see your veins in your dream represent a challenge that will test your character and ability. The dream also suggests that you should not take things for granted, especially if they seem to come easily.<\/p>"
    },
    {
        "title": "Velcro",
        "desc": "<p>To see Velcro in your dream refers to a sticky situation. Alternatively, Velcro represents something that you need to access quickly and easily. Consider the significance of where the Velcro is used. If the Velcro is on a shoe, then it implies that you are looking for a shortcut to success.<\/p>"
    },
    {
        "title": "Velociraptor",
        "desc": "<p>To see a velociraptor in your dream suggests that you are dwelling in the past. You let an opportunity pass you by because you did not react fast enough.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d2.htm#Dinosaur\">Dinosaur.<\/p>"
    },
    {
        "title": "Velvet",
        "desc": "<p>To dream that you are wearing velvet signifies distinction and honor. It also represents you sensuality and emotions.<\/p><p>To dream that you are wearing velvet pants signifies your sensual side.<\/p>"
    },
    {
        "title": "Velvet Rope",
        "desc": "<p>To see a velvet rope in your dream symbolizes access. You feel special and privileged. Alternatively, the dream implies that the path that you have chosen for yourself can easily be altered. Don't feel obligated to keep on the same path if you are no longer have passion for it.<\/p>"
    },
    {
        "title": "Vending Machine",
        "desc": "<p>To see a vending machine in your dream represents the things that are just outside of your grasp or reach. You need to invest a little more effort before your goals come to fruition. Consider what is inside the vending machine for further significance.<\/p>"
    },
    {
        "title": "Veneer",
        "desc": "<p>To dream that you are veneering signifies deception. You are being someone you are not.<\/p>"
    },
    {
        "title": "Venereal Disease",
        "desc": "<p>To dream that you have a venereal disease indicates some sort of contamination, either physical or emotional. You may feel vulnerable or victimized in a waking relationship. Alternatively, the dream signifies a fear of sex or an imbalance in sexual energy.<\/p>"
    },
    {
        "title": "Venom",
        "desc": "<p>To come in contact with venom in your dream represents pent-up anger and hostility you may be expressing or experiencing from others. Perhaps, your feelings of hate are beginning to show through. Alternatively, the dream is indicative of a lack of self-esteem, lack of self-love, or insecurities you have.<\/p>"
    },
    {
        "title": "Vent",
        "desc": "<p>To see a vent in your dream symbolizes a release of emotions. You are looking for an outlet to express your feelings. If the vent is dusty, then it implies that you are avoiding certain feelings.<\/p>"
    },
    {
        "title": "Ventriloquist",
        "desc": "<p>To see a ventriloquist in your dream symbolizes deception, fraud or some treasonable matter affecting you in a negative way.<\/p><p>To dream that you are a ventriloquist signifies dishonorable conduct and deception towards people who trusted you. There is a part of yourself that you are not revealing. Alternatively, the dream means that you are trying to influence, manipulate, or control people around you.<\/p>"
    },
    {
        "title": "Venus",
        "desc": "<p>To see Venus in your dream symbolizes love, desire, fertility, beauty, and femininity.It also represents the things you value and cherish in life.<\/p>"
    },
    {
        "title": "Venus Flytrap",
        "desc": "<p>To see a Venus flytrap in your dream symbolizes the devouring female. It refers to a powerful or overbearing woman in your life. Alternatively, the dream may be a metaphor that you are feeling &quot;snappy.&quot;<\/p><p>To dream that you are being eaten by a Venus flytrap indicates that you are being overwhelmed by some dominant female in your waking life.<\/p>"
    },
    {
        "title": "Veranda",
        "desc": "<p>To dream of being on a veranda indicates that you will successfully overcome a problem that was giving you much anxiety. Alternatively, the dream represents your outlook in life.<\/p>"
    },
    {
        "title": "Verdict",
        "desc": "<p>To hear a verdict in your dream indicates that it is time for you to face the truth. The dream also means that you are being judged and criticized for your actions.<\/p>"
    },
    {
        "title": "Vermin",
        "desc": "<p>To see vermin crawling in your dream signifies sickness and trouble. You will be faced with many disappointments and obstacles. Alternatively, the dream refers to some dirty situation.<\/p>"
    },
    {
        "title": "Vertical",
        "desc": "<p>To dream of a vertical line or something that is vertical symbolizes the spiritual realm and the supernatural.<\/p>"
    },
    {
        "title": "Vertigo",
        "desc": "<p>To dream that you have vertigo indicates an imbalance and lack of confidence in some situation. You are experiencing feelings of anxiety and discomfort.<\/p>"
    },
    {
        "title": "Vessels",
        "desc": "<p>To see a vessel in your dream symbolizes labor, industry and activity.Alternatively, a vessel refers to a major emotional issue.<\/p>"
    },
    {
        "title": "Vest",
        "desc": "<p>To dream that you are wearing a vest represents your compassion for others. Alternatively, the dream may be a pun on being &quot;vested&quot; in something or someone.<\/p>"
    },
    {
        "title": "Veterinarian",
        "desc": "<p>To see a veterinarian in your dream indicates that you need to tame your instinctive behavior and subconscious self so that it is more socially acceptable.<\/p>"
    },
    {
        "title": "Vex",
        "desc": "<p>To dream that you are vex about something parallels waking issues that are bothering you.You need to address these issues or else they will continue to recur in your dreams.<\/p>"
    },
    {
        "title": "Vibrate",
        "desc": "<p>To feel a vibration in your dream suggests that you need to pay more attention to your intuition and to your emotional side. Alternatively, the dream refers to some sexual need.<\/p>"
    },
    {
        "title": "Vibrator",
        "desc": "<p>To see or use a vibrator in your dream signifies your desires to awaken your sexuality.<\/p>"
    },
    {
        "title": "Vicar",
        "desc": "<p>To see a vicar in your dream suggests that you need to recognize your spiritual needs.<\/p>"
    },
    {
        "title": "Victim",
        "desc": "<p>To dream that you are a victim suggests that you are being oppressed and overpowered by others. Such dreams suggest that you are feeling powerless and helpless in a waking situation. Alternatively, the dream indicates that you are unwilling to take responsibility for your choices.<\/p>"
    },
    {
        "title": "Victorian",
        "desc": "<p><span>To dream that you are in the Victorian period indicates that you are feeling sexually repressed. You feel you are unable to full express yourself. If you are wearing Victorian style clothes, then it means that you are feeling confined or restricted in some way. The dreaming mind likes to play word games and so the dream may point to someone in your life who is named &quot;Vicky&quot; or &quot;Victoria&quot;. Or it can signify victory!<\/p>"
    },
    {
        "title": "Victory",
        "desc": "<p>To dream of victory over something represents confidence in your abilities. You are seeking motivation in the course that you are taking. Sometimes you need to imagine or visualize success before actually achieving it.<\/p>"
    },
    {
        "title": "Video",
        "desc": "<p>To dream that you are editing a video means that you are manipulating how someone views you. You are trying to keep up appearances and act as if everything in your life is going smoothly.<\/p>"
    },
    {
        "title": "Video Chat",
        "desc": "<p>To dream that you are on video chat refers to your desires to connect with someone on an emotional and mental level. You want to convey your feelings to them. Alternatively, the dream means that you need to keep your distance from some situation or relationship.<\/p>"
    },
    {
        "title": "Video Camera",
        "desc": "<p>To dream that you are using a video camera suggests that you need to be more objective in your decisions. Focus on the task at hand and try not to let your emotions cloud your judgment.<\/p><p>To dream that someone is using a video camera indicates that you are reflecting back on your past and old memories. You may be trying to learn from previous mistakes or relive the good and bad times.<\/p>"
    },
    {
        "title": "Video Game",
        "desc": "<p>To dream that you are playing a video game represents your ability to manipulate others into doing what you want them to do. Alternatively, playing a video game suggests that you are trying to escape from the problems in your real life, instead of confronting it. Consider the type of video game and video game character for additional insights.<\/p><p>To see or dream that you are a character in a video game suggests that you are feeling controlled and manipulated by others. You feel that you have no control over your actions or are not taking responsibility for them.<\/p><p>To dream that your real life has turned into a video game implies that you are lacking any ambition and drive. You don't have any direction in life and what you want to do. Alternatively, the dream may mean that you need to always be on the alert.<\/p>"
    },
    {
        "title": "Video Store",
        "desc": "<p>To dream that you are in a video store represents the various chapters and aspects of your life. It is a summary of your life experiences. Consider the title of the video that you are looking for or that you are renting and how it relates to your waking life.<\/p>"
    },
    {
        "title": "Videotape",
        "desc": "<p>To watch a videotape in your dream indicates that you need to stop and relax. Take a break from life and let your mind rest. Consider the title of the videotape or what you are watching and determine how it relates to your waking life. It may also represent past memories or repressed thoughts that are playing out as the dream videotape.<\/p><p>If you are rewinding the videotape, then it suggests that you are experiencing regret or remorse over your past actions.<\/p><p>If you are forwarding the videotape, then it suggests that you are trying to escape from some current situation.<\/p>"
    },
    {
        "title": "Vigil",
        "desc": "<p>To dream that you attend a vigil suggests that you are looking for comfort and mutual understanding, especially with a difficult situation.<\/p>"
    },
    {
        "title": "Viking",
        "desc": "<p>To see a Viking in your dream indicates that you are feeling violated or conflicted in some way. You are facing a confrontational situation.<\/p><p>To dream that you are a Viking represents exploration of your subconscious thoughts. It also means that you are taking a chance at some emotional relationship.<\/p>"
    },
    {
        "title": "Viking Hat",
        "desc": "<p>To see or wear a Viking hat in your dream refers to your desire to stand out from the rest. You are looking for attention. Alternatively, the dream suggests that you are looking to break out of your shell.<\/p>"
    },
    {
        "title": "Village",
        "desc": "<p>To dream that you are in a village represents restrictions. You need to follow the rules. Alternatively, a village signifies community, simplicity, and tradition.<\/p>"
    },
    {
        "title": "Villain",
        "desc": "<p>To see a villain in your dream symbolizes the negative aspects of your own self that you are ashamed about or not proud of.<\/p>"
    },
    {
        "title": "Vinegar",
        "desc": "<p>To see or drink vinegar in your dream suggests that you are feeling sour about some situation. It may denote a relationship that has gone sour. Alternatively, the dream may be telling you to make the best out of a bad situation. You are worrying too much.<\/p>"
    },
    {
        "title": "Vines",
        "desc": "<p>To see vines in your dream represent your hopes ambitious thoughts or ideas. Alternatively, vines symbolize a clingy relationship. Perhaps you feel trapped and are searching to break free. Your emotions could be holding you back.<\/p><p>To see grape vines in your dream symbolize rewards, prosperity, and spirituality. Grape vines signify sexuality and sensuality.<\/p>"
    },
    {
        "title": "Vineyard",
        "desc": "<p>To see a vineyard in your dream represents the fruits of your labor and your life experiences.You hard work and effort will pay off in the long run.<\/p>"
    },
    {
        "title": "Vinyl",
        "desc": "<p>To wear vinyl in your dream represents your lackof freedom and limited abilities. You are feeling restricted in some area of your life. Alternatively, the dream symbolizes a shield that you have put up to protect yourself against some emotional hurt.<\/p><p>To see something vinyl in your dreamsuggests that you are not being genuine and true to yourself.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/r.htm#Record\">Record.<\/p>"
    },
    {
        "title": "Viola",
        "desc": "<p>To see or viola in your dream represents your deeper, darker and more melancholy feelings.<\/p><p>Playing the viola in your dream signifies control over your emotions.<\/p>"
    },
    {
        "title": "Violated",
        "desc": "<p>Tofeel or dream that you have been violated represents feelings of being oppressed by others or by situations in your life. You feel that you do not have the power to change the path that your life is taking on. Try not to blame yourself for circumstances that are beyond your control.<\/p>"
    },
    {
        "title": "Violence",
        "desc": "<p>To see violence in your dream indicates unexpressed anger or rage. You need more discipline in your life. If you enjoy the violence, then it points to your aggressive or sadomasochistic tendencies. The dream may also reflect repressed memories of child abuse.In particular, to dream that the violence is directed to yourself represents self punishment and guilt. You may be feeling helpless or vulnerable in some area of your life. Violence toward others in your dream suggests that you may be fighting or struggling against aspects of your own Self.<\/p>"
    },
    {
        "title": "Violets",
        "desc": "<p>To see violets in your dream signify passion, joy and bliss. It also indicates enlightenment, spirituality and humility. Alternatively, the dream represents your shyness. You tend to hide in the background.<\/p>"
    },
    {
        "title": "Violin",
        "desc": "<p>To see or hear a violin in your dream symbolizes peace and harmony in your waking life. If the violin is broken, then it signifies separation, sadness, and bereavement.<\/p><p>To play a violin in your dream denotes honor, distinction and refinement. You will be well recognized for your work.<\/p>"
    },
    {
        "title": "Viper",
        "desc": "<p>To see a viper in your dream represents hidden fears and worries that are threatening you. Alternatively, the dream may be a metaphor for someone who is malicious or dangerous. You need to be on the watch for ruthless people working against you.<\/p>"
    },
    {
        "title": "Virgin",
        "desc": "<p>To dream that you are a virgin symbolizes purity and potential. Note that the dream may not necessarily mean actual physical virginity, but could also represent emotional innocence. In particular, if you are not a virgin but dream that you are one, then it signifies past regret or remorse. You need to stop dwelling on the past and look toward the future.<\/p><p>To dream that someone is a virgin indicates integrity and honesty. You may have an ideal that you are tying to attain.<\/p><p>To dream that you are losing your virginity refers to your desires for intimacy and closeness. You are looking to fulfill your needs for physical and emotional love. The dream may also be brought on by your waking thoughts of losing your virginity. Your mind is preoccupied by how it will be and what it would be like.<\/p>"
    },
    {
        "title": "Virgin Mary",
        "desc": "<p>To see the Virgin Mary in your dream signifies selfless love, compassion, spiritual harmony and ideal motherhood. Alternatively, the Virgin Mary represents a repressed fear of sex and difficulties in personal relationships.<\/p>"
    },
    {
        "title": "Virgo",
        "desc": "<p>To dream that someone is a Virgo denotes cautiousness, purity and perfection. You are detail-oriented and are always striving toward perfection. Alternatively, the dream symbolizes release of emotions.<\/p>"
    },
    {
        "title": "Virus",
        "desc": "<p>To dream that a computer has a virus or has crashed suggests that something in your life that is out of control. It may parallel something in your life that has come to a crashing end. If you dream that your computer has a sentient computer virus that would create random or strange artwork, then it depicts your subconscious desires. The artwork may also be a reflection of a situation in your life that you are ignoring. In particular, if the artwork is of a little boy smearing X's with his poop on a calendar, then it indicates past regrets or remorse.<\/p><p>To dream that you have a viral infection or contracted a virus suggests that you are experiencing an unpleasant change or an emotional breakdown in your waking life. The virus may be symbolic of your inability to cope with a situation and you see that being sick is a way out. On a more direct note, the dream may signal you to pay close attention to your health, especially to the area of body revealed in the dream.<\/p>"
    },
    {
        "title": "Vise",
        "desc": "<p>To see or use a vise in your dream suggests that you are feeling confined and restricted. You feel that you cannot fully express yourself.<\/p>"
    },
    {
        "title": "Vishnu",
        "desc": "<p>To see Vishnu in your dream symbolizes love, mercy, grace, and truth. His appearance in your dream may be an indication that you need time for contemplation.<\/p>"
    },
    {
        "title": "Vision",
        "desc": "<p>To dream that your vision is obstructed indicates that you are about to make an error in judgment. There is something that you are not seeing clearly.<\/p><p>To see visions in your dream indicate that your mind is free from any restraint and free to wander without any inhibitions. Such dreams are said to have a different feel. Some of these vision dreams may be described as<a href=\"http:\/\/www.dreammoods.com\/dreaminformation\/dreamtypes\/#EpicDreams\">epic dreams.<\/p>"
    },
    {
        "title": "Visit",
        "desc": "<p>To visit someone in your dream suggests that you need to reconnect with this person in your waking life. Perhaps you have been neglecting that relationship.<\/p>"
    },
    {
        "title": "Visitor",
        "desc": "<p>To have a visitor in your dream signifies that some important news or information will soon be revealed to you. It may also suggest that love is just around the corner. Alternatively, a visitor indicates that you are experiencing a new phase in your life. If the visitor is unwelcome, then it indicates your refusal to change.<\/p><p>To dream that you are a visitor suggests that you need to look at the overall picture on some issue. You need to gain a wider perspective on things.<\/p>"
    },
    {
        "title": "Vitamins",
        "desc": "<p>To see or take a vitamin in your dream indicates that you need to strengthen your willpower and stand up for yourself. Alternatively, taking vitamins point to your waking eating habits and that you need to add certain nutrients to your diet.<\/p>"
    },
    {
        "title": "Vivisection",
        "desc": "<p>To dream of a vivisection suggests that there is something that you are desperate to eliminate from your life. Consider the qualities of the animal being vivisected and how it relates to an aspect of your character.<\/p>"
    },
    {
        "title": "Vizier",
        "desc": "<p>To see a vizier in your dream indicates that you need to question certain authority. Do not follow blindly.<\/p><p>Dreaming that you are a vizier refers to your influence over others.<\/p>"
    },
    {
        "title": "Vlogging",
        "desc": "<p>To dream that you are vlogging indicates that you are looking for an outlet to express your personal thoughts and experiences. You need someone to talk to about your problems. Alternatively, dreaming that you are vlogging refers to the frustration of having a one-sided conversation. You feel you are talking to yourself.<\/p>"
    },
    {
        "title": "Voguing",
        "desc": "<p>To dream that you are voguing refers to your attitude and confidence. Maybe you are being too idealistic and things. The dream may also be a metaphor to mean that you are in style or in fashion.<\/p>"
    },
    {
        "title": "Voice Mail",
        "desc": "<p>To dream that you have a voice mail symbolizes some important advice that you may have overlooked, but need to heed. Pay attention to the message and how it applies to your waking life.<\/p>"
    },
    {
        "title": "Voiceless",
        "desc": "<p>To dream that you are voiceless represents a loss of identity and a lack of personal power. You are unable to speak up and stand up for yourself.<\/p>"
    },
    {
        "title": "Voice",
        "desc": "<p>To hear voices in your dream signify a message from the subconscious or spiritual realm. Alternatively, the dream may be a metaphor that you need to &quot;voice&quot; your opinions more loudly. Speak your mind!<\/p>"
    },
    {
        "title": "Volcano",
        "desc": "<p>To see a volcano in your dream indicates that you are unable to control your emotions, particularly if the volcano is erupting.You are ready to burst. The outcome may be damaging and hurtful, especially to those around you. If the volcano is dormant, then it represents past issues that have been resolved and put to the rest.<\/p>"
    },
    {
        "title": "Voldemort",
        "desc": "<p>To see Voldemort in your dream symbolizes an ever-present evil force working against you.<\/p><p>To dream that you are Voldemort represents the darker, sinister side of your personality. You are capable of accomplishing great feats, but with questionable motives and methods.<\/p>"
    },
    {
        "title": "Volleyball",
        "desc": "<p>To dream that you are playing volleyball represents your indecisiveness and your inability to commit. Alternatively, playing volleyball indicates the importance of cooperation and teamwork. You need to learn to rely on others instead of doing everything yourself.<\/p>"
    },
    {
        "title": "Volume",
        "desc": "<p>To dream that you are turning up the volume suggests that you are demanding to be heard. No one is paying attention to what you are saying. You are feeling overlooked or overshadowed in some waking situation.<\/p><p>To dream that you are turning down the volume indicates that there is something that you are refusing to hear. You may be rejecting what your inner voice or instinct is trying to convey.<\/p><p>To dream that the volume is too loud indicates that you are forcing your opinions and views on others. You are too overbearing and\/or confrontational.<\/p><p>To dream that the volume is too low suggests that you are not paying enough attention to what someone is trying to tell you. You are not picking up on the cues.Alternatively, the dream signifies missed opportunities or feeling left out.<\/p>"
    },
    {
        "title": "Volunteer",
        "desc": "<p>To dream that you volunteer for something or are a volunteer represents the value of helping others in need.Perhaps someone or some situation calls for your help. It also implies charity and your willingness to offer your assistance. Alternatively, the dream indicates that you need to take more initiative and get involved with the way your life is going.<\/p>"
    },
    {
        "title": "Vomiting",
        "desc": "<p>To dream that you are vomiting indicates that you need to reject or discard an aspect of your life that is revolting. There are some emotions or concepts that you need to confront and then let go.<\/p><p>To see someone vomiting in your dream signifies the false pretenses of people who are trying to take advantage of you.<\/p>"
    },
    {
        "title": "Voodoo",
        "desc": "<p>To dream that you are practicing voodoo suggests that you are subconsciously trying to ward off some surrounding negative energy.<\/p><p>To see a voodoo doll in your dream represents a primitive and shadowy aspect of yourself.<\/p>"
    },
    {
        "title": "Vortex",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/w2.htm#Whirlwind\">Whirlwind.<\/p>"
    },
    {
        "title": "Vote",
        "desc": "<p>To dream that you are casting a vote signifies your desire to belong to a larger group or to develop an aspect of your character on a more public level. You or someone is looking for support, approval and acceptance. The dream may also mean that you are speaking your mind and letting your voice be heard. You are demanding a say in how you should live your own life.<\/p>"
    },
    {
        "title": "Voting Booth",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p4.htm#PollBooth\">Poll Booth.<\/p>"
    },
    {
        "title": "Voucher",
        "desc": "<p>To see a voucher in your dream symbolizes the effort and work that you have invested into some project or cause. New opportunities are being made available to you.<\/p>"
    },
    {
        "title": "Vow",
        "desc": "<p>To dream that you are making a vow represents a promise you made that will affect others. The dream is a reaffirmation of your promise and to not let someone down. In particular, to dream that you are listening or making marriage vows signifies a commitment to your life partner.<\/p>"
    },
    {
        "title": "Voyage",
        "desc": "<p>To dream that you are making a voyage signifies profits, self-discovery or progress. You are going through a phase of emotional self-discovery. The scenery you see on your voyage and the method of travel is reflective of your feelings, mood and circumstances that you are currently experiencing.<\/p>"
    },
    {
        "title": "Voyeurism",
        "desc": "<p>To dream that you are a voyeur suggests that you are afraid of your own desires and fantasies. You may also be afraid of getting close to some relationship or situation.<\/p>"
    },
    {
        "title": "Vulture",
        "desc": "<p>To see a vulture in your dream symbolizes purification and insight. It suggests that your past experiences will provide you with invaluable insight into a current situation or problem. Learn from your past. Alternatively, a vulture indicates that you or someone is being opportunistic. Someone is watching you and is waiting for you to take a misstep. You feel that someone is taking advantage of you or is using you. Consider the metaphor of someone who is a &quot;vulture&quot;. Sometimes a vulture is also a symbol of death, doom or rebirth.<\/p>"
    }
]