[
    {
        "title": "W",
        "desc": "<p>To see the letter &quot;W&quot; in your dream is a reiteration of &quot;you&quot;. You need to focus on you and only you.<\/p>"
    },
    {
        "title": "Wadding",
        "desc": "<p>To dream of installing wadding into something indicates your need for security and to be protected. Alternatively, the dream may be analogous to your fears of gaining weight or getting fat.<\/p>"
    },
    {
        "title": "Wading",
        "desc": "<p>To dream of wading in water symbolizes your power and control over your emotions.<p>Consider the depth and clarity of the water to determine how much power and control you have over the circumstances and situations in your life.<\/p>"
    },
    {
        "title": "Wafers",
        "desc": "<p>To dream that you are eating a wafer suggests that you need more diversity and spontaneity. You need to gain a better understanding of various facets in your life and incorporate them together. Alternatively, the wafer symbolizes something or some situation that you need to handle with care.<\/p>"
    },
    {
        "title": "Waffle",
        "desc": "<p>To dream of eating a waffle indicates that you need to come down from your lofty ideals and approach life from a more pragmatic perspective.The dream may also be a metaphor that you are &quot;waffling&quot; or undecided over some matter.<\/p><p>To dream that you are waffling over a topic suggests that you need to think things more clearly and learn to express yourself with more assurance and conviction.<\/p>"
    },
    {
        "title": "Wager",
        "desc": "<p>To dream that you are wagering on something represents a risk that you are taking in some waking situation. Sometimes life is a gamble.<\/p>"
    },
    {
        "title": "Wages",
        "desc": "<p>To dream that you are paying out wages suggest that you are indebted to someone. Alternatively, it indicates that you are giving more than you are getting back.You feel that a relationship is too one-sided. As a result, you are feeling emotionally exhausted.<\/p><p>To dream that you are receiving wages symbolize a reward for a job well done.Alternatively, it signifies receipt of love.<\/p>"
    },
    {
        "title": "Wagon",
        "desc": "<p>To see a covered wagon in your dream is symbolic of difficulties and difficulties that you are carrying with you. It signifies your thrifty nature and your unwillingness to take risks.The dream may also be a metaphor that you have &quot;fallen off the wagon&quot;. You have broken a resolution or promise to yourself.<\/p><p>To see a red wagon in your dream represents childhood joy and light-hearted fun.<\/p><p>To see an empty and abandoned wagon in your dream signifies loss and dissatisfaction with the current state of your life.<\/p>"
    },
    {
        "title": "Wagtail",
        "desc": "<p>To see a wagtail in your dream suggests that you are always alert. You are in tune with your surroundings. Alternatively, a wagtail may imply joy, contentment and happiness.<\/p>"
    },
    {
        "title": "Waif",
        "desc": "<p>To see or dream that you are a waif indicates feelings of insecurity. You are feeling unsure of yourself and where you are headed.<\/p><p>To see a waif model in your dream represents the unrealistic goals you have for yourself. Alternatively, it highlights your issues with weight.<\/p>"
    },
    {
        "title": "Wail",
        "desc": "<p>To hear a wail in your dream symbolizes some sadness, pain or suffering of someone around you. If you are wailing, then the dream may serve as an avenue in which you can freely release such emotions that may not be appropriate in your waking life.<\/p>"
    },
    {
        "title": "Waist",
        "desc": "<p>To notice your waist in your dream suggests that you are concerned about your diet or weight. The dream may also be a pun on &quot;wasting&quot; time, money, or some aspect of your life.<\/p>"
    },
    {
        "title": "Waiter\/Waitress",
        "desc": "<p>To dream that you are a waiter or waitress indicates that you are too busy catering to the needs and demands of others, instead of your own. You feel that you are underappreciated as you wait on others hand and foot. You need to be more assertive and stand up for yourself. Consider the quality of service that you are giving for additional significance.<\/p><p>To see a waiter in your dream indicates that you need to be nurtured and to feel special. The dream may also be a pun to be patient. Learn to wait.<\/p>"
    },
    {
        "title": "Waiting",
        "desc": "<p>To dream that you are waiting is indicative of issues of power\/control and feelings of dependence\/independence, especially in a relationship. Consider how you feel in the dream while you were waiting. If you are patient, then you know things will happen at their own pace. If you are impatient, then it means that you are being too demanding or that your expectations are too high.<\/p><p>Alternatively, the dream may denote your expectations and anxieties about some unknown situation or decision. You are experiencing a sense of anticipation or uneasiness.<\/p><p>To dream that you keep someone else waiting implies that you are taking advantage of this person. You Alternatively, the dream indicates that you are not spending enough time with this person in your waking life. You are too busy doing your own thing that you have overlooked this person.<\/p>"
    },
    {
        "title": "Waiting Room",
        "desc": "<p>To dream that you are in a waiting room symbolizes your patience. You have an ability to remain calm, even during a crisis.<\/p>"
    },
    {
        "title": "Wake",
        "desc": "<p>To dream that you attend a wake refers to your grieving process. You need to find closure. It is okay to seek the support in order to help you get through a difficult time. Alternatively, the dream suggests that it is time to celebrate the positive qualities of someone who is no longer in your life.<\/p><p>To dream that you are waking up in your dream indicates that something is missing or lacking in your life. There is an aspect of your life that you are not utilizing to its fullest potential. You are not recognizing your abilities. The dream is literally telling you to open your eyes and wake up! Alternatively, waking up in your dream may be a signal of a <a href=\"http:\/\/www.dreammoods.com\/dreaminformation\/dreamtypes\/luciddreams.htm\">lucid dream<\/a>.<\/p>"
    },
    {
        "title": "Walker",
        "desc": "<p>To see or use a walker in your dream implies that you are not letting any hardships or obstacles stand in your way. The walker is symbolic of your determination and perseverance. Alternatively, the walker represents mobility.<\/p>"
    },
    {
        "title": "Walkie Talkie",
        "desc": "<p>To see or use a walkie talkie in your dream suggests that you need to be both receptive and communicative in some waking work situation or personal relationship. Remember that communication is two-way. You need to learn to speak and to listen. The clarity of the message is symbolic of how poorly or how well you are communicating your feelings, ideas, or thoughts. Alternatively, the dream is a metaphor telling you that if you walk the walk, you need to talk the talk.<\/p>"
    },
    {
        "title": "Walking",
        "desc": "<p>To dream that you are walking with ease signifies a slow, but steady progress toward your goals. You are moving through life in a confident manner. Consider your destination.<\/p><p>To dream that you have difficulties walking indicates that you are reluctant and hesitant in proceeding forward in some situation. You may also be trying to distance yourself from certain life experiences. The difficulty in walking is a reflection of your current situation and the obstacles that you are experiencing.<\/p><p>To dream that you are walking on air refers to your carefree and upbeat attitude. It also signifies confidence; you feel almost invincible. You achieve your goals with relative ease. This dream is a variant of a <a href=\"http:\/\/dreammoods.com\/cgibin\/flyingdreams.pl?method=exact&amp;header=dreamid&amp;search=flyingintro\">flying dream<\/a>. Alternatively, the dream may be telling you that you have lost grasped of reality.<\/p><p>If you are walking on rocks in your dream, then it indicates that you are on shaky ground. You may be involved in an uneasy situation. The dream may also be telling you not to get too comfortable or too arrogant.<\/p><p>Dreaming that you are walking on all fours suggests that you are not measuring up to others' expectations of you. You may be lowering yourself or your standards. Alternatively, being on all fours means that you need to trust your instincts. To see someone on all fours in your dream indicates that you are looking down on them.<\/p>"
    },
    {
        "title": "Walking Stick",
        "desc": "<p>To see or use a walking stick in your dream suggests that you are in need of support. Don't be afraid to ask for help.<\/p>"
    },
    {
        "title": "Walkman",
        "desc": "<p>To see or use a walkman in your dream represents a message from your subconscious that you need to place close attention to. Alternatively, listening to a walkman symbolizes relaxation, pleasure, and ease. You are enjoying life and its beat. The dream may be a pun on how you need to &quot;walk&quot; more and be active. Stop sitting around.<\/p>"
    },
    {
        "title": "Wall",
        "desc": "<p>To see a wall in your dream signifies limitations, obstacles and boundaries. There is a barrier obstructing your progress. Alternatively, the wall indicates that you are too accustomed to your old habits and way of thinking. You feel stuck. If you dream of blood on the walls, then it is a warning of sorts. There is a situation that you need to confront. You can not avoid it any longer.<\/p><p>To dream that you jump over a wall suggests that you are able to confront tough obstacles and get around barriers with success and ease.<\/p><p>To dream that you demolish or break down a wall indicates that you are breaking through obstacles and overcoming your limitations. It also means that you desire some freedom and independence. If you see a wall crumble, then it suggests that you have risen above your problems and overcame your barriers.<\/p><p>To dream that you are building a wall refers to a bad relationship or childhood trauma. You are trying to keep others out for fear of getting hurt again. Alternatively, the dream suggests that you have accepted your limitations.<\/p><p>To dream that you are hiding behind a wall suggests that you ashamed in acknowledging your connections.<\/p><p>To dream that you are being thrown or shot through a wall means that you need to literally breakdown those walls that you have put up around you. You need to venture out and explore.<\/p><p>To dream that a house has no walls represents a lack of privacy. You feel that everyone is looking over your shoulder or up in your business.<\/p>"
    },
    {
        "title": "Wallet",
        "desc": "<p>To see your wallet in your dream symbolizes your self-identity or financial security.<\/p><p>To dream that your wallet has been stolen indicates that someone may be trying to take advantage of you. Perhaps someone has &quot;stolen&quot; your heart away.<\/p><p>To dream that you lose your wallet suggests that you need to be more cautious and careful about your spending and finances. You need to be more responsible with your money.Alternatively, losing your wallet indicates that you are losing touch with your true identity. You are experiencing some anxiety over changes and uncertainties happening in your life. If you find a wallet, then it indicates that you have regained financial stability.<\/p><p>To see an empty wallet in your dream represents financial worries. Alternatively, it refers to an emotional void or inner emptiness.<\/p><p>Dreaming that someone gives you a wallet with money in it means that you are looking for acceptance.<\/p>"
    },
    {
        "title": "Wallpaper",
        "desc": "<p>To dream that you or someone is hanging up wallpaper signifies that you are putting up a barrier or some sort of shield between yourself and others. It also suggest that you are covering something up or that you are hiding a secret. Alternatively, the dream may mean something that needs beautifying. Consider the color and pattern of the wallpaper, as it will offer clues as to the kind of barrier, secret or feeling that you are putting up.<\/p><p>To dream that you are peeling or stripping off wallpaper denotes that you are beginning to let your guard down. You are breaking down your barrier one layer at a time. It also indicates that you are revealing aspects of yourself that have been kept well hidden.<\/p>"
    },
    {
        "title": "Walnut",
        "desc": "<p>To see walnuts in your dream indicate that too much mental activity is being expended towards a task at hand. You are wasting your time. Alternatively, walnuts represent joy and abundance.<\/p><p>To dream that you crack a walnut foretells that your expectations will collapse.<\/p>"
    },
    {
        "title": "Walrus",
        "desc": "<p>To see a walrus in your dreamrepresents your display of dominance in some situation or relationship. You are always on the lookout for anybody who is trying to out-maneuver, out-rank, or out-wit you. Alternatively, the walrus represents your protective shell and thick-skin. You do not let the comments\/criticism of others get to you.<\/p><p>For Eskimos and Native Americans in the North, the walrus symbolizes supernatural ability and power.<\/p>"
    },
    {
        "title": "Waltz",
        "desc": "<p>To see a waltz in your dream represents class and sophistication.<\/p><p>To dream that you are waltzing refers to your prim and proper behavior. Alternatively, the dream suggests that you are the object of much admiration.<\/p>"
    },
    {
        "title": "Wand",
        "desc": "<p>To see or wave a wand in your dream represents your power and influence over others. You are only limited by your imagination. If someone else is holding the wand, then it signifies their power over the situation.<\/p>"
    },
    {
        "title": "Wander",
        "desc": "<p>To dream that you are wandering suggests that you are searching for some direction in your life. You are lacking motivation. Alternatively, the dream represents a transformation.<\/p><p>Dreaming that your mind wanders indicates that you are lacking focus or that you are feeling detached from a situation.<\/p>"
    },
    {
        "title": "Want",
        "desc": "<p>To dream that you are in want represents the wants and desires that you have suppressed in your waking life. Alternatively, the dream may signify your potential to achieve and to do something with yourself.<\/p>"
    },
    {
        "title": "Wanted",
        "desc": "<p>*Please See: <a href=\"#Fugitive\">Fugitive<\/a>.<\/p>"
    },
    {
        "title": "War",
        "desc": "<p>To dream of a war signifies disorder and chaos in your waking life You are experiencing some internal conflict or emotional struggle which is tearing you up inside. Alternatively, the dream indicates that you are either being overly aggressive or that you are not being assertive enough. Perhaps you need to be prepared to put up a fight in some area of your life. On a more direct level, the dream may be reflection of current wars around the world and your personal feelings about it.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=wardream1\">Drafted Into War<\/a>&quot;<\/p>"
    },
    {
        "title": "Warden",
        "desc": "<p>To see a warden in your dream symbolizes an authority figure or guardian who keeps you in check. The warden may appear to monitor or question your behavior and actions.<\/p>"
    },
    {
        "title": "Wardrobe",
        "desc": "<p>To see a wardrobe in your dream represents a transitional period or phase in your life. Alternatively, the dream may highlight issues with your self-image and how you portray yourself to the outside world.<\/p>"
    },
    {
        "title": "Warehouse",
        "desc": "<p>To see a warehouse in your dream represents stored energy or hidden resources. The warehouse also refers to memories. Alternatively, the warehouse means that you are putting your ambitions and goals on hold.<\/p><p>To see an abandoned or empty warehouse indicates that your inner resources have been depleted. You need to take some time off to restore your energy and replenish your resources.<\/p><p>To dream that you are leasing or renting an empty warehouse represents your receptiveness and your open-mindedness to new things.<\/p>"
    },
    {
        "title": "Warmth",
        "desc": "<p>To feel warmth in your dream signifies contentment and satisfaction in your current state. You are happy with where you are. Alternatively, feeling warmth is analogous to hope and unconditional love.<\/p>"
    },
    {
        "title": "Warning",
        "desc": "<p>To receive a warning in your dream indicates that something in your waking life is in need of your attention. The dream may serve to make you stop and rethink the consequences of your action or decision.<\/p><p>To dream that you are warning someone suggests that you need to recognize the dangers or negatives of some situation. You need to bring this to the surface.<\/p>"
    },
    {
        "title": "Warrant",
        "desc": "<p>To dream that a warrant is being served on you indicates that you will be involved in some important matter or decision. Consider the type of warrant that is being serves. If it is a search warrant, then you need to take a second look at your motives and actions. If it is an arrest warrant, then you need to stop what you are doing and take a different course of action.<\/p><p>To dream that a warrant is served on someone else refers to a misunderstanding.<\/p>"
    },
    {
        "title": "Warrior",
        "desc": "<p>To see or dream that you are a warrior represents your ability to confront life challenges.<\/p>"
    },
    {
        "title": "Warthog",
        "desc": "<p>To see a warthog in your dream suggests that you need to take charge of your life.<\/p>"
    },
    {
        "title": "Warts",
        "desc": "<p>To dream that you or someone has a wart suggests that you need to learn to acknowledge the beauty within you. The dream also indicates self-punishment. You are unwilling to forgive yourself.<\/p>"
    },
    {
        "title": "Wash Bowl",
        "desc": "<p>To see a wash bowl in your dream suggests that you are ready to was away past hurts or emotional scars that you are carrying.<\/p>"
    },
    {
        "title": "Washboard",
        "desc": "<p>To see or use a washboard in your dream refers to hard work . You are feeling emotional and\/or physically drained. Alternatively, the dream may refer to your physique.<\/p>"
    },
    {
        "title": "Washerwoman",
        "desc": "<p>To see or dream that you are a washerwoman in your dream implies that you need help to clean up your act. You need to accept assistance. Remember that you can not do everything all by yourself.<\/p>"
    },
    {
        "title": "Washing",
        "desc": "<p>To dream that you are washing yourself indicates that you are proud of your social life and personal endeavors. You may even receive some recognition and prestige. Alternatively, the dream represents the cleansing away of unhappy experiences or neglected emotions in your life. You are ready to make a fresh new start.<\/p><p>To dream that you are washing your feet indicates that you are ready to make a big change in your life.<\/p><p>To dream that you are washing your hands suggests that there is a worrisome issue that you need to work through. Alternatively, the dream suggests that you are not taking responsibility for some matter. You need to let go of old emotions and past relationships. It is time to get the negativity out of your system.<\/p><p>To dream that you are washing your car suggests that your problems will soon pass. You are ready to go through life with a fresh new outlook and attitude.<\/p>"
    },
    {
        "title": "Washing Machine",
        "desc": "<p>To see or use a washing machine in your dream suggests that you need to resolve issues of the past in order to be able to make a clean, new start for yourself.<\/p>"
    },
    {
        "title": "Wasp",
        "desc": "<p>To see a wasp in you dream signifies evil, anger and negative feelings. Alternatively, the wasp represents someone who is a WASP or White Anglo-Saxon Protestant. Perhaps you are dealing with some aspects of society or politics.To dream that a white wasp is chasing you represents a Caucasian figure who may be looking for a relationship with you.<\/p><p>To dream that you are stung by a wasp indicates that there is some hatred directed toward you. It also refers to envy.<\/p><p>To dream that you kill a wasp signifies your fearlessness in fighting off your opponents, while maintaining your ethics and rights.<\/p>"
    },
    {
        "title": "Waste",
        "desc": "<p>To see waste in your dream indicates that you are overexerting yourself or investing too much of your energy on something that may not be worthwhile. Alternatively, the dream may be telling you that you are being wasteful and thus need to reevaluate certain aspects of your life. You are literally wasting away. The dream may be a metaphor for &quot;being wasted&quot; or intoxicated.<\/p><p>If you dream of toxic waste or hazardous waste, then it points to some negative or harmful feelings that you are harboring. Alternatively, the dream indicates that a waking relationship is unhealthy. This may be a work relationship, family relationship or personal relationship. The dream may also be a metaphor for &quot;being wasted&quot; or intoxicated.<\/p>"
    },
    {
        "title": "Wastebasket",
        "desc": "<p>*Please see: <a href=\"#Garbage%20Can\">Garbage Can<\/a>.<\/p>"
    },
    {
        "title": "Watch",
        "desc": "<p>To see or wear a watch in your dream suggests that you need to be more carefree and spontaneous. Your life is too structured. Or you are feeling limited and constrained. Alternatively, the watch symbolizes the ticking of the human heart and thus is indicative of the emotional side of your life.The dream may also be a metaphor to indicate that you need to &quot;watch out&quot;.<\/p><p>To see a broken watch in your dream indicates that you are unsure of your own feelings or how to express yourself. You are experiencing an emotional standstill.Alternatively, a watch suggests that you have poor time management. You have lost track of what you have to do.<\/p>"
    },
    {
        "title": "Watching",
        "desc": "<p>To dream that you are watching someone or something indicates your passiveness. You lack initiative to take a position or to take action. It may reflect upon your real life and how you are watching life pass you by, instead of participating in it. You need to take more initiative. Alternatively, the dream symbolizes your neutrality in some situation. You do not want to take a side.The dream may also be a metaphor warning you to &quot;watch it!&quot;<\/p><p>To dream that you are being watched suggests that you are feeling confined in your work environment or personal relationship. You are lacking privacy and feel you are being scrutinized or criticized.<\/p>"
    },
    {
        "title": "chman",
        "desc": "<p>To dream that you are a watchman suggests that you need to be on the look out for something or someone out to do you harm. Keep your guard up.<\/p>"
    },
    {
        "title": "Water",
        "desc": "<p>To see water in your dream symbolizes your subconscious and your emotional state of mind. Water is the living essence of the psyche and the flow of life energy. It is also symbolic of spirituality, knowledge, healing and refreshment. To dream that water is boiling suggests that you are expressing some emotional turmoil. Feelings from your subconscious are surfacing and ready to be acknowledged.You need to let out some steam.<\/p><p>To see calm, clear water in your dream means that you are in tune with your spirituality. It denotes serenity, peace of mind, and rejuvenation.<\/p><p>To see muddy or dirty water in your dream indicates that you are wallowing in your negative emotions. You may need to take some time to cleanse your mind and find internal peace. Alternatively, the dream suggests that your thinking\/judgment is unclear and clouded. If you are immersed in muddy water, then it indicates that you are in over your head in a situation and are overwhelmed by your emotions.<\/p><p>To dream that water is rising up in your house suggests that you are becoming overwhelmed by your emotions.<\/p><p>To hear running water in your dream denotes meditation and reflection. You are reflecting on your thoughts and emotions.<\/p><p>To dream that you are walking on water indicates that you have total control over your emotions. It also suggests that you need to &quot;stay on top&quot; of your emotions and not let them explode out of hand. Alternatively, the dream is symbolic of faith in yourself.<\/p><p>To dream that someone throws water at you implies that you need to show more of your emotions. You have been too disconnected from others. Alternatively, it may mean that you need to cool off.<\/p><p>To dream that a wall of water is coming towards you implies that your emotions are welling up and can potentially close you off to others.<\/p><p>To dream that you can bend water represents your ability to control your emotions. You can hide your feelings well.<\/p><p>Dreaming of a crystallized body of water indicates that you are looking for some emotional stability in your life.<\/p><p>Dreaming about fire and water together symbolizes a polarizing issue in your waking life. You are going through an emotional conflict and it is pulling you in two directions.<\/p>"
    },
    {
        "title": "Water Balloon",
        "desc": "<p>To see or throw a water balloon in your dream symbolizes an outburst of emotions. You are venting your frustrations and anger in an indirect and playful way. You have difficulties experiencing your true feelings.<\/p><p>To dream that someone throws a water balloon at you represents some negative emotions or anger that is directed at you, but you are oblivious to.<\/p>"
    },
    {
        "title": "Water Bending",
        "desc": "<p>To dream that you can bend water represents your ability to control your emotions. You can hide your feelings well.<\/p>"
    },
    {
        "title": "Water Bottle",
        "desc": "<p>To see or use a water bottle in your dream indicates that you are keeping your hopes up about something. It also means spiritual renewal and rejuvenation.<\/p><p>If the water bottle is empty, then it means that you are holding onto something for too long. Alternatively, an empty water bottle indicates a lack of spirituality in your life. There is a void that you are unable to fill.<\/p>"
    },
    {
        "title": "Water Cooler",
        "desc": "<p>To see or use the water cooler in your dream suggests that you are literally bottling up your emotions. You are looking for safe and controlled release. Alternatively, a water cooler indicates that you are seeking spiritual nourishment or just conversation. Consider the phrase &quot;water cooler talk&quot;.<\/p>"
    },
    {
        "title": "Water Fountain",
        "desc": "<p>To see or drink from a water fountain indicates that you are feeling emotionally refreshed and rejuvenated.<\/p>"
    },
    {
        "title": "Water Gun",
        "desc": "<p>To see or play with a water gun in your dream signifies you passive aggressiveness. You are expressing your anger in such a playful way that others do not recognize or acknowledge your true feelings. You are having difficulties expressing your real feelings.<\/p>"
    },
    {
        "title": "Water Heater",
        "desc": "<p>To see a water heater in your dream implies that you are keeping your anger inside, instead of expressing it. So far, you have been able to keep your feelings under control. If the water heater malfunctions or explodes, then it implies that your anger is on the verge of erupting into violent expression.<\/p><p>To see a rusty water heater in your dream means that you are avoiding or neglecting your anger.<\/p><p>Dreaming of a tankless water heater is telling you not to keep your feelings bottled up inside or to harbor any negative feelings.<\/p>"
    },
    {
        "title": "Water Hose",
        "desc": "<p>To see a water hose in your dream represents renewal, rejuvenation and cleansing. You need to heal those emotional wounds so that you can continue to grow as a person. Alternatively, a water hose may be a metaphor for sex and sexual gratification. Or it may also be a pun that you are &quot;getting hosed&quot;, trapped, or blindsided in some situation.<\/p>"
    },
    {
        "title": "Water Lily",
        "desc": "<p>To see a water lily in your dream signifies grief, sorrow, and bereavement.<\/p>"
    },
    {
        "title": "Water Park",
        "desc": "<p>To dream that you are in a water park indicates that you are expressing an emotional high point. You are feeling emotionally satisfied and fulfilled.<\/p>"
    },
    {
        "title": "Water Polo",
        "desc": "<p>To watch or play water polo in your dream represents your ability to immerse yourself in your emotions while navigating effectively toward your goals. You are able to separate your objectivity and feelings.<\/p>"
    },
    {
        "title": "Water Purifier",
        "desc": "<p>To see a water purifier in your dream means that you need to express your emotions more effectively and clearly.<\/p>"
    },
    {
        "title": "Water Skiing",
        "desc": "<p>To dream that you are water skiing represents an uplift in your spirituality and increase in your self-confidence. You are experiencing a new sense of freedom and calm.<\/p>"
    },
    {
        "title": "Water Tower",
        "desc": "<p>To see a water tower in your dream suggests that you are keeping your emotions inside. You may be unable to express your true feelings, especially feelings of love. Alternatively, a water tower indicates a false sense of security.<\/p>"
    },
    {
        "title": "Waterbed",
        "desc": "<p>To see a waterbed in our dream suggests that you are slowly acknowledging aspects of your subconscious. You are recognizing certain unexpressed energy, particularly issues dealing with sexuality, fear, aggression, etc.<\/p>"
    },
    {
        "title": "Waterfall",
        "desc": "<p>To see a waterfall in your dream is symbolic of letting go. You are releasing all those pent up emotions and negative feelings. Alternatively, the dream represents your goals and desires. In particular, if the waterfall is clear, then it represents revitalization, regeneration and renewal.<\/p><p>To dream that you are at the bottom of the waterfall suggests that you are feeling emotionally overwhelmed. You are experiencing difficulties in coping with your feelings.<\/p>"
    },
    {
        "title": "ring Hole",
        "desc": "<p>To see or drink from a watering hole means that you have your emotions in check. You are in control of your feelings and are supported by those around you.<\/p>"
    },
    {
        "title": "Watermelon",
        "desc": "<p>To see a watermelon in you dream represents emotions of love, desire, lust, and fiery passion. Pregnant women or women on the verge of their menstrual cycle often dream of watermelons due to their changing or bloated bodies. Alternatively, watermelons mean summertime ease, leisure, and relaxation.<\/p>"
    },
    {
        "title": "Watermill",
        "desc": "<p>To see a watermill in your dream suggests that you need to take advantage of the resources that are available to you. The dream is one of motivation and renewal. You need to proceed at a steady pace in realizing your goals.<\/p>"
    },
    {
        "title": "Waterslide",
        "desc": "<p>To dream that you are on or see a waterslide suggests that you are being carried away by your emotions. You are being engulfed by your subconscious. Alternatively, the dream indicates that you are going with the flow of things without any objection or resistance.<\/p>"
    },
    {
        "title": "Waterspout",
        "desc": "<p>To see a waterspout in your dream indicates that you tend to be subjective and let your feelings get in the way of your decisions. Your emotions also effect those around you.<\/p>"
    },
    {
        "title": "Waves",
        "desc": "<p>To see clear, calm waves in your dream, signify renewal and clarity. You are reflecting on some important life decision that needs to be made. Alternatively, if you are riding a wave, then it indicates that you are trying to get a handle on your emotions. Waves also symbolize potential and power.<\/p><p>To hear waves crashing in your dream indicates tenderness and relaxation. It also brings about feelings of sensuality, sexuality and tranquility.<\/p><p>To dream that you are caught in a tidal wave represents an overwhelming emotional issue that demands your attention. You may have been keeping your feelings and negative emotions bottled up inside for too long. You may be holding back tears that you are afraid to express in your waking life. On a positive note, the tidal wave symbolizes the clearing away of old habits. If you are carried away by the tidal wave, then it means that you are ready to make a brand new start in a new place.<\/p><p>To see muddy, violent waves in your dream indicate a fatal error in an important decision.<\/p><p><span style=\"color: rgb(0, 0, 0); font-style: normal; font-variant: normal; letter-spacing: normal; line-height: normal; orphans: auto; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; display: inline !important; float: none\">Dreaming that a wave hits your boat and knocks you into the water means that you are letting your emotions guide your decisions. Perhaps you are acting too irrationally.<\/p>"
    },
    {
        "title": "Waving",
        "desc": "<p>To dream that you are waving to someone represents your connection to that person. You are trying to gain their recognition or get their attention.Perhaps there is a certain aspect of this person that you need to incorporate into your own self. The dream may also signify your need to develop deeper and closer friendship ties.<\/p>"
    },
    {
        "title": "Wax",
        "desc": "<p>To see wax in your dream indicates that there is too much activity going on in your life. There is too much chaos going on. You need to slow down and take a breather. Alternatively, the dream may be a metaphor suggesting that you are impressionable and easily influenced.<\/p><p>To dream that you are waxing something suggests that you are ready to move forward in some project or endeavor. You have gained the approval of those around you.<\/p><p>To see dripping wax in your dream represents your hidden passionate emotions and spiritual cleansing.<\/p>"
    },
    {
        "title": "Way",
        "desc": "<p>To dream that you lose your way signifies the threat of failure in your endeavor.<\/p><p>To dream that you are finding your way represents the decisions and choices that you need to make in your waking life. Alternatively, the dream may be a pun on &quot;weigh&quot;. Perhaps there is a decision that you need to weigh and think through carefully.<\/p>"
    },
    {
        "title": "Weak",
        "desc": "<p>To dream that you are weak refers to your feelings of inadequacy. You need to be more firm and forceful. Stand up for yourself.<\/p>"
    },
    {
        "title": "Wealth",
        "desc": "<p>To dream that you are wealthy indicates that you have accomplished what you set out to do. The dream represents your achievements and the rewards you reap for your hard work.<\/p><p>To dream that others are wealthy suggest that you need to draw the support from those around you. Alternatively, the dream indicates that you need to watch your spending.<\/p>"
    },
    {
        "title": "Weapons",
        "desc": "<p>To see or hold a weapon in your dream indicates a need to defend and protect yourself emotionally and\/or physically. You are experiencing some conflict in your waking life. Alternatively, the dream may indicate your hidden desire to hurt someone or something. Your dream provides a safe haven for expressing these desires. In dreams, weapons also often have sexual connotations.<\/p>"
    },
    {
        "title": "Weasel",
        "desc": "<p>To see a weasel in your dream represents your lack of trust in others. It may also mean that you are acting or being deceitfully.<\/p>"
    },
    {
        "title": "Weather",
        "desc": "<p>To dream about the weather signifies your emotional state of mind. Stormy or windy weather implies conflict and aggression. Rain and hail represents depression and sadness. And rainbows and sunshine signify hope and happiness. Alternatively, weather may be a pun on &quot;whether&quot; you should do this or that. Perhaps you are trying to decide between two options.<\/p><p>To dream that the weather is ever-changing signify the passage of time.<\/p><p>To dream that you are reading the weather report means that you are about to make some major move. Alternatively, it indicates a decision that you need to make.<\/p>"
    },
    {
        "title": "Weather Vane",
        "desc": "<p>To see a weather vane in your dream indicates unpredictability and versatility. Alternatively, the dream suggests that are going around in circles. The dream may also be a pun on being vain or doing something in vain.<\/p>"
    },
    {
        "title": "Weave",
        "desc": "<p>To dream that you are getting or wearing a weave implies that you are envisioning success and accomplishing your goals. Alternatively, having a weave means that you are pretending to be someone you are not. You are trying to pass off something as your own.<\/p><p>Dreaming that you have a bad weave indicates that you are being misguided.<\/p>"
    },
    {
        "title": "Weaving",
        "desc": "<p>To dream that you are weaving something suggests that you are trying to piece together some information. You need to incorporate various components together and look at the picture as a whole. Alternatively, weaving symbolizes your creativity.<\/p>"
    },
    {
        "title": "Web",
        "desc": "<p>To see a web in your dream represents your desire to control everything around you. Alternatively, it suggests that you are being held back from fully expressing yourself. You feel trapped and do not know what to do or where to go. The dream may also be symbolic of your social network of acquaintances and associates or it may represent the world wide web.<\/p>"
    },
    {
        "title": "Web Cam",
        "desc": "<p>To dream that you are on a web cam suggests that there is a message or concept that you are trying to convey to a large network of people.<\/p>"
    },
    {
        "title": "Wedding",
        "desc": "<p>To see a wedding in your dream symbolizes a new beginning or transition in your current life.A wedding reflects your issues about commitment and independence.Alternatively, your wedding dream refers to feelings of bitterness, sorrow, or death. Such dreams are often negative and highlight some anxiety or fear. If you dream that the wedding goes wrong or ends in disaster, then it suggests that you need to address some negativity immediately.<\/p><p>If you dream that you are attending a wedding, consider how you feel at the wedding. If you are upset or sad, then it means that you are unhappy about the current status of your life. If you are happy, then you are embracing a new change in your life.<\/p><p>To dream that you are getting married to your current spouse again represents your wedded bliss and happiness. It highlights your strong commitment to each other. It may also signify a new phase (such as parenthood, new home, etc) that you are entering in your life.<\/p><p>To dream that you are planning a wedding to someone you never met is a metaphor symbolizing the union of your feminine and masculine side. It represents a transitional phase where you are seeking some sort of balance between your aggressive side and emotional side. The dream may also indicate that two previously conflicting aspects are merging together as one.<\/p><p>If you are getting married and have dreams of your pending wedding, then it highlights the stress of organizing a wedding. Conflicts over wedding details, tension with family and in-laws, fear of commitment, and loss of independence may all cause wedding anxiety dreams. Research has shown that up to 40% of brides and grooms have dreams about their ceremony and things going perfectly.<\/p><p>To dream that Santa Claus is attending your wedding highlights the jolly occasion.<\/p><p>Dreaming of a hearse at wedding represents a major transition in your life. The symbolism of both the hearse and the wedding is about an end to something and the beginning of a new phase in your life.<\/p><p>To dream that you are late to a wedding or that the wedding started without you means that you feel left behind while everyone around you is doing new things or going in new direction.<\/p><p>*Please see also: <a href=\"#merriage\">Marriage<\/a>. See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=weddingdream1\">Black Wedding<\/a>&quot;<\/p>"
    },
    {
        "title": "Wedding Cake",
        "desc": "<p>To see or cut wedding cake in your dream symbolizes harmony and domestic bliss. You are enjoying life and have a bright, happy future ahead of you.<\/p><p>To eat a wedding cake in your dream signifies your sensuality.<\/p>"
    },
    {
        "title": "Wedding Dress",
        "desc": "<p>To wear a wedding dress in your dream indicates that you are evaluating and assessing your personal relationship.<\/p><p>If you or someone is wearing a wedding dress in an inappropriate situation, then it suggests that you are feeling inferior or unworthy.<\/p><p>Dreaming that you are searching for a wedding dress on the day of your wedding means that you are tyring to find your role in a situation. You are afraid of not fitting in.<\/p>"
    },
    {
        "title": "Wedding Rehearsal",
        "desc": "<p>To dream that you are in a wedding rehearsal implies that you need to prepare yourself for an important transition in your life.<\/p>"
    },
    {
        "title": "Wedding Ring",
        "desc": "<p>To see a wedding ring in your dream represents completeness and eternal love. If you are not married and find a wedding ring, then it means that your personal relationship has reached a new level.<\/p><p>To dream that you lose your wedding ring signifies a problem or unresolved issue in your marriage.<\/p>"
    },
    {
        "title": "Wedge",
        "desc": "<p>To see a wedge in your dream symbolizes support and your ability to ask for help when you need it.<\/p>"
    },
    {
        "title": "Wedlock",
        "desc": "<p>*Please See: <a href=\"#Marriage\">Marriage<\/a>.<\/p>"
    },
    {
        "title": "Wednesday",
        "desc": "<p>To dream about Wednesday indicates that you are in misery or agony over something. You feel conflicted about a decision and are stuck in the middle. Wednesday is often referred to as &quot;hump day&quot;. Thus the dream may be a form of encouragement; you are at the halfway point of some endeavor.<\/p>"
    },
    {
        "title": "Weeds",
        "desc": "<p>To dream that you are weeding suggests that you need to rid yourself of the negativity in your life in order to move on and grow as a person. It is time to release past grudges and build on future relationships.<\/p><p>To see weeds in your dream indicate that you are feeling neglected, overshadowed or cast to the side. Weeds may also represent friendships or relationships that have gone awry.<\/p><p>To dream of cannabis denotes a loss of control. You are trying desperately to escape. The dream may be a reflection of waking drug use.<\/p>"
    },
    {
        "title": "Week",
        "desc": "<p>To dream about the week signifies your sense of time management. The dream may also be a pun on being &quot;weak&quot;.<\/p>"
    },
    {
        "title": "Weeping",
        "desc": "<p>To dream that you are weeping indicates some deep sadness in your waking life. You are suppressing your sad feelings and they are now manifesting in your dream. Bottling up these feelings are not always healthy.<\/p>"
    },
    {
        "title": "Weevil",
        "desc": "<p>To see a weevil in your dream signifies losses and deception.<\/p>"
    },
    {
        "title": "Weighing",
        "desc": "<p>To dream that you are weighing something indicates that you are trying to determine the worth of something. Or perhaps you are trying to &quot;weigh&quot; your options in some waking situation. Consider the significance of what is being weighed.<\/p>"
    },
    {
        "title": "Weight",
        "desc": "<p>To dream of your own weight represents your self-worth, self-esteem, influence or power of persuasion. It is also indicative of the burdens you carry in life. Alternatively, weight represents your preoccupation with your physical shape and appearance. The dream may also be a pun for &quot;wait&quot;.<\/p><p>To dream that you are losing weight indicates that you are no longer being weighed down by some responsibility or emotional burden. It is as if something has been lifted off your shoulders.<\/p><p>To dream that you are overweight or that you are gaining weight suggests that you are feeling over-burdened and pressured. You are carrying too many responsibilities.<\/p><p>To dream that you are underweight implies that you need to work harder at something. The dream may also be telling you that you are way out of your league in some situation.<\/p>"
    },
    {
        "title": "Weightlifting",
        "desc": "<p>To dream that you are lifting weights represents your strength and power. Do not underestimate what one person can do. Alternatively, the dream is a metaphor that you are flexing your muscle. You want others to know that you are in charge.<\/p>"
    },
    {
        "title": "Weightlifter",
        "desc": "<p>To see a weightlifter in your dream indicates that you need to hone your sense of power and use that power to your advantage.<\/p>"
    },
    {
        "title": "Welcome",
        "desc": "<p>To dream that you are being welcomed represents self acceptance. You like who you are and are proud of the person you are becoming. Alternatively, the dream suggests that you are open to new ideas.<\/p><p>To dream that you are welcoming others refers to your ability to trust others.<\/p>"
    },
    {
        "title": "Welding",
        "desc": "<p>To dream that you are welding something suggests that you need to incorporate some behavior, habit, or character into your life. You need to combine various aspects in order to feel whole.<\/p>"
    },
    {
        "title": "Welfare",
        "desc": "<p>To dream that you are on welfare indicates that you are feeling shameful of your life circumstances. Alternatively, the dream may be a pun on being &quot;well&quot; and &quot;fair&quot;. It may also be a pun on your &quot;well being&quot;.<\/p>"
    },
    {
        "title": "Well",
        "desc": "<p>To see a well in your dream represents your hidden abilities and talents that have not yet come to the surface or not yet recognized. The well is also symbolic of the depth of your emotions. It may serve as a depository for your emotions and how you are trying to suppress them. Alternatively, the dream may be a pun on how you are doing &quot;well&quot;.<\/p><p>To dream that you fall into the well indicates losing emotional control.<\/p><p>To dream that the well is dry suggests that there is an emotional void in your life. You feel empty inside and need to be fulfilled.<\/p>"
    },
    {
        "title": "Werewolf",
        "desc": "<p>To see a werewolf in your dream indicates that something in your life is not what it seems.It is symbolic of fear, repressed anger, and uncontrollable violence.<\/p><p>To dream that you are a werewolf suggests that some aspects of your personality are hurtful and even dangerous to your own well-being. You are headed down an undesirable path. Alternatively, a werewolf refers to your repressed instincts.<\/p><p>Dreaming of having sex with a werewolf means that you need to let out your inhibitions and\/or animalistic desires. Perhaps you need to be more sexually adventurous.<\/p>"
    },
    {
        "title": "West",
        "desc": "<p>To dream of going west represents fulfillment, opportunities, and growth. Alternatively, west symbolizes death, old age or an ending of something.<\/p>"
    },
    {
        "title": "Western",
        "desc": "<p>To dream that you are in the Wild West represents your resourcefulness and survival skills. Alternatively, the dream implies that you may be over-thinking a problem. Sometimes simplicity is the way to go. Being in the Wild West also indicates that you need to be more straightforward about your feelings, intentions or goals.<\/p>"
    },
    {
        "title": "Wet",
        "desc": "<p>To dream that you are wet indicates that you are overcome with emotions. It also signifies a spiritual cleansing, rebirth or renewal. Alternatively, the dream may imply sexual arousal.<\/p>"
    },
    {
        "title": "Wet Nurse",
        "desc": "<p>To see or have a wet nurse in your dream refers to your inability to provide for your family. You are feeling inadequate.<\/p><p>To dream that you are a wet nurse suggests that you need to be careful in who you trust and who you confide in.<\/p>"
    },
    {
        "title": "Wet Suit",
        "desc": "<p>To see or wear a wet suit in your dream suggests that you are slowly and safely exploring your inner feelings and emotions. You are a point where you are comfortable in acknowledging your vulnerabilities and feelings.<\/p>"
    },
    {
        "title": "Weta",
        "desc": "<p>Tosee a weta in your dream signifies your fear of the unknown.Sometimes what you don't know is a source of anxiety and stress. You are worrying too much about minor issues. Alternatively, dreaming of a weta represents your roots.<\/p>"
    },
    {
        "title": "Whale",
        "desc": "<p>To see a whale in your dream represents your intuition and awareness. You are in tuned with your sense of spirituality. Alternatively, a whale symbolizes a relationship or business project that may be too big to handle. You are feeling overwhelmed. The dream may also be a pun on &quot;wailing&quot; and a desire to cry out about something.<\/p><p>To dream that a whale is flying symbolizes an enormous sense of freedom from letting down your emotional wall. You feel that a huge weight has been lifted.<\/p><p>To see only the tail of a whale in your dream indicates that you are emotionally balanced.<\/p><p>Dreaming of a beached whale refers to a lost sense of spirituality. You are feeling misguided and are struggling to understand. If you dream that the whale is dead, then it means that you are giving up on something that you had once believed.<\/p>"
    },
    {
        "title": "Wheat",
        "desc": "<p>To see grains of wheat in your dream indicate prosperity and abundance. Opportunities and doors are being opened. You are on your way to achieving your goals. Alternatively, wheat symbolizes resurrection, reincarnation and fertility.<p>To see a field of wheat in your dream signifies success in your goals.<\/p>"
    },
    {
        "title": "Wheatgrass",
        "desc": "<p>To see or consume wheatgrass in your dream indicates issues about your health. If the wheatgrass is inside a white jar, then it symbolizes purity and cleansing of the body.<\/p>"
    },
    {
        "title": "Wheel Of Fortune",
        "desc": "<p>To dream of a wheel of fortune suggests that you are leaving too much to chance. You may be taking a risk.It is time to take control of your destiny.<\/p>"
    },
    {
        "title": "Wheelbarrow",
        "desc": "<p>To see or use a wheelbarrow in your dream represents hard work, labor, and difficulty. The wheelbarrow also symbolizes your body and the way that you are moving about through life. Consider what is inside the wheelbarrow for clues as to where you are headed.<\/p>"
    },
    {
        "title": "Wheelchair",
        "desc": "<p>If you do not use a wheelchair in your waking life and dream that you are in a wheelchair, then it suggests that you need to stop depending on others. A situation or relationship has made you feel helpless. Alternatively, a wheelchair indicates that you are literally letting others push you around. You need to start standing up for yourself.<\/p><p>If someone is able-bodied in real life, but you dream that they are in a wheelchair, then it suggests that he\/she is in need of your help. They may be afraid to ask you directly and have been dropping hints which your subconscious may have picked up on.<\/p>"
    },
    {
        "title": "Wheel",
        "desc": "<p>To see spinning wheels in your dream signify completion or continuation of a familiar situation. The dream may be telling you that your life and daily routine is becoming too repetitious. You are going around in circles and headed nowhere. You need to be more spontaneous! Alternatively, the dream symbolizes forward motion and the ability to proceed toward your goals.<\/p><p>To dream that you lose a wheel from a vehicle indicates that you are feeling lost. You do not know what direction to go or where you are headed.<\/p><p>To dream that you are inventing the wheel refers to your high aspirations. Alternatively, the dream may suggests that you are over-thinking things.<\/p>"
    },
    {
        "title": "Wheelie",
        "desc": "<p>To dream that you are doing a wheelie refers to your fast paced life as you try to balance several things at the same time.<\/p>"
    },
    {
        "title": "Whip",
        "desc": "<p>To see a whip in your dream signifies punishment, unhappiness shame and guilt. It may indicate some abusive situation or unfortunate circumstance. Alternatively, the whip means that you need to exercise more control over your life. You need to have more discipline or be more obedient. The dream also may be a metaphor for something that you need to &quot;whip&quot; up.<\/p><p>To dream that you are whipping someone suggests that you are in control. You are aware of the power you have and may even be exploiting that power. The dream may also have sexual connotations. Perhaps your sex life is in need of a little excitement. Alternatively, the dream may also be a pun on &quot;being whipped&quot;, as in either having someone who would do anything for you or that you yourself are the one who is &quot;whipped&quot;.<\/p>"
    },
    {
        "title": "Whiplash",
        "desc": "<p>To dream that you have whiplash indicates that you are butting heads with someone in your waking life. You are experiencing a conflict at school, work, family, or personal relationship. It may also be a pun on &quot;a pain in the neck&quot;. Perhaps you or someone is being a pain.<\/p>"
    },
    {
        "title": "Whipped Cream",
        "desc": "<p>To see or eat whipped cream in your dream symbolizes joy, light hearted fun, and pleasure. You are enjoying life and living it to the fullest. Alternatively, whipped cream represents your sexual desires.<\/p>"
    },
    {
        "title": "Whipping Boy",
        "desc": "<p>To see a whipping boy in your dream suggests that you are doing harm to yourself with your reckless behaviors and activities. You are on a path of self-destruction. It is time to think about what you want to do with your life and make the necessary changes.<\/p>"
    },
    {
        "title": "Whirlpool",
        "desc": "<p>To see a whirlpool in your dream signifies emotional turmoil.<\/p>"
    },
    {
        "title": "Whirlwind",
        "desc": "<p>To dream that you are in the path of a whirlwind indicates your suppressed anger that is coming to the surface and threatening to get out of control. You are being pulled unwillingly into confronting these suppressed thoughts.<\/p>"
    },
    {
        "title": "Whisk",
        "desc": "<p>To see or use a whisk in your dream points to a situation that requires swift action and quick decision.<\/p>"
    },
    {
        "title": "Whiskers",
        "desc": "<p>To see or have whiskers in your dream indicate that you are still trying to feel out some situation.<\/p>"
    },
    {
        "title": "Whisky",
        "desc": "<p>To see whisky bottles in your dream symbolize your alertness, carefulness and protective nature.<\/p><p>To dream that you are drinking whisky suggests that your selfishness will cost you your friends. Alternatively, it represents your lack of self-confidence. You are trying to escape the responsibilities of your everyday life.<\/p>"
    },
    {
        "title": "Whispering",
        "desc": "<p>To hear whispering in your dream suggests that you need to pay closer attention to something or listen to someone more carefully. Alternatively, whispering represents your insecurities and anxieties. You feel that people are talking about you behind your back.<\/p><p>To dream that you are whispering indicates that you are lacking conviction in what you are saying. Perhaps you have something to hide or are afraid of fully expressing yourself.<\/p><p>To dream that someone is whispering in your ear suggests that you need to pay closer attention to something or listen to someone more carefully. Alternatively, it represents your insecurities and anxieties that people are talking about your behind your back.<\/p>"
    },
    {
        "title": "Whistle",
        "desc": "<p>To hear a whistle in your dream represents a warning. There is something that requires your immediate attention. Alternatively, a whistle marks an end to a period of time or phase in your life.<\/p>"
    },
    {
        "title": "White Moth",
        "desc": "<p>To see a white moth in your dream forewarns of sickness and possibly death.<\/p>"
    },
    {
        "title": "White House",
        "desc": "<p>To see the White House in your dream represents your own personal feelings about the US government and its legislation. Alternatively, the dream denotes regal power and authority.<\/p>"
    },
    {
        "title": "Whiteout",
        "desc": "<p>To see or use whiteout in your dream indicates that there is something that you are suppressing. You are refusing to see a certain point of view or perspective on an issue. Alternatively, using whiteout in your dream signifies your desires to start over again. You may be expressing regrets for some past mistake.<\/p>"
    },
    {
        "title": "Whitewash",
        "desc": "<p>To dream that you are whitewashing indicates an attempt to change your old ways and habits. It also suggests that you are only pretending to change and trying to cover up your flaws.<\/p>"
    },
    {
        "title": "Whore",
        "desc": "<p>*Please See: <a href=\"#Prostitute\">Prostitute<\/a>.<\/p>"
    },
    {
        "title": "Wicker",
        "desc": "<p>To see something made of wicker in your dream symbolizes your support system and uplifting others. In order to become stronger, you need to hold up others so they will hold you up.<\/p>"
    },
    {
        "title": "Widow",
        "desc": "<p>If you are not actually a widow, but dream that you are a widow, then it represents loneliness, neglect, or sadness. You are feeling isolated or abandoned. Alternatively, the dream refers to your ability to be free and independent.<\/p>"
    },
    {
        "title": "Wife",
        "desc": "<p>To see your wife in your dream signifies discord and unresolved issues. Pay attention to how you feel in the dream as it may highlight feelings that you are not expressing in your waking life.If you do not actually have a wife, then your dream wife symbolizes the feminine aspects of yourself. Perhaps you may even be expressing a desire to be in a committed relationship. Or the dream may just be a reflection of your waking life and bear no real significance.<\/p><p>To dream about your husband's deceased wife suggests that you are trying to connect with your husband in the same way that she connected with him. You can't help comparing yourself to her.<\/p>"
    },
    {
        "title": "Wife Swapping",
        "desc": "<p>*Please See: <a href=\"#Partner%20Swapping\">Partner Swapping<\/a>.<\/p>"
    },
    {
        "title": "Wig",
        "desc": "<p>To dream that you are wearing a wig symbolizes deception, incompetence, false impressions, pretentiousness and falsehood. You are trying to pass other people's ideas, work and opinions as your own.You need to start thinking for yourself.Alternatively, the dream may be a metaphor that you are &quot;wigging out&quot; or making a big deal over some trivial matter.<\/p><p>To dream that you lose a wig indicates that you have completely lost your mind.<\/p>"
    },
    {
        "title": "Wild",
        "desc": "<p>To see something wild in your dream represents the uninhibited and animalistic aspect of your personality. In dreams, you feel freer to behave in a way that you normally would not in your waking life.<\/p>"
    },
    {
        "title": "Wild Hog",
        "desc": "<p><span>To see a wild hog in your dream symbolizes ferocity, strength, and courage. You are expressing a desire to escape from your daily life and your responsibilities, especially if the wild hog in your dream is running.<\/p><p><span>To dream that you are hunting a wild hog indicates your need for some balance in your life. You are trying to suppress your desires for independence.<\/p>"
    },
    {
        "title": "Wildcat",
        "desc": "<p>To see a wildcat in your dream represents the feminine aspects which you have neglected or overlooked. You may also be looking for excitement in your social sphere or your sex life.<\/p>"
    },
    {
        "title": "Wildebeest",
        "desc": "<p>To see a wildebeest in your dream indicates a lack of control in your life. You are letting your negative emotions get the best of you.<\/p>"
    },
    {
        "title": "Wilderness",
        "desc": "<p>To dream that you are running in the wilderness suggests that you are feeling uninhibited and free. You feel that there are no restrictions to hold you back.<\/p>"
    },
    {
        "title": "Wildflowers",
        "desc": "<p>To see wildflowers in your dream indicate that you need less complications in your life. You need to simplify your life.<\/p>"
    },
    {
        "title": "Will",
        "desc": "<p>To dream that you are making or writing a will indicates that you are looking ahead to the future. You are starting a new phase in your life.Alternatively, the dream suggests that a decision you have made is final. You cannot be swayed. The dream may also a pun on your willingness and determination to do something."
    },
    {
        "title": "To dream that something is left for you in a will represents characteristics or qualities that you can learn or adopt from your descendents.",
        "desc": "<p>To dream that a will is being read suggests that you are ready to reap the benefits of your hard work. Alternatively, the dream means that you are being rewarded for your past efforts.<\/p>"
    },
    {
        "title": "Willow",
        "desc": "<p>To see a willow tree in your dream symbolizes mourning and sadness. It also denotes a loss of someone or something. Alternatively, the willow represents survival or rebirth.<\/p>"
    },
    {
        "title": "Wilted",
        "desc": "<p>To dream that something is wilting suggests that you are feeling physically and\/or emotionally drained. You may be feeling depressed. Alternatively, the dream indicates that you are not utilizing your full potential. You are wasting away your talents.<\/p>"
    },
    {
        "title": "Win",
        "desc": "<p>To dream that you win at something indicates that you will succeed in some task. You are experiencing new found confidence in your abilities. The dream may serve to offer you encouragement and motivation. Alternatively, the dream symbolizes a sexual conquest.<\/p>"
    },
    {
        "title": "Wind",
        "desc": "<p>To dream that the wind is blowing symbolizes your life force, energy, and vigor. It reflects changes in your life.Alternatively, the dream suggests that you need to pick up your pace and work on achieving your goals more quickly and efficiently.<\/p><p>To dream of strong or gusty winds represent turmoil and trouble in your life. You are experiencing much stress in some waking situation.<\/p>"
    },
    {
        "title": "Wind Chimes",
        "desc": "<p>To see or hear wind chimes in your dream symbolize harmony and tranquility. Alternatively, wind chimes represent past memories. It refers to a passage of time.<\/p>"
    },
    {
        "title": "Windmill",
        "desc": "<p>To see a windmill in your dream symbolizes the power of the mind. It is indicative of your emotional state of mind. Alternatively, a windmill refers to your resourcefulness.<\/p>"
    },
    {
        "title": "Window",
        "desc": "<p>To see a window in your dream signifies bright hopes, vast possibilities and insight. The size of the window is reflective of your outlook; a small window suggests that you tend to not get your hopes up too high when good things happen, while a large window symbolizes your openness to new experiences. If the window of a house is dark, then it indicates a loss to your perception or vitality.<\/p><p>To dream that you are looking out the window signifies your outlook on life, your consciousness and your point of view. It also refers to your intuition and awareness. You may be reflecting on a decision. Or the dream is telling you that you need to go out into the larger world and experience life. Consider the significance of the things you see when you look out the window. If you are looking in the window, then it indicates that you are doing some soul searching and looking within yourself. It is time for some introspection. To see another face in the window in your dream suggests that you are feeling emotionally distant and physically detached. Also consider the emotion depicted on the face.<\/p><p>To see shut windows in your dream signify desertion and abandonment.<\/p><p>To see a shattered or broken window in your dream represents your distorted view and skewed outlook on life. It also refers to a state of vulnerability.<\/p><p>To dream that you are fixing or replacing a broken window indicates that you are reassessing your view and outlook on life. You are gaining a new perspective on things.<\/p><p>To see a tinted window in your dream represents your need for privacy. You are keeping some aspects of yourself hidden. You also want to remain ambiguous.<\/p><p>To dream that you are washing windows suggest that you need clarity in some matter. Something is not clear.<\/p><p>To dream that you are entering or exiting through a window suggests that you are involved in some secretive or underhanded activity. Alternatively, the dream means that you are creating your own opportunities. You make things happen instead of waiting for them to happen.If you fall or are push through a window in your dream, then it means that you are unwillingly going along with a plan. Perhaps you feel pressured into doing something that you really do not want to do. Your own vision is in conflict with someone else's. Dreaming that you are hanging from a window implies that you are trying to influence the opinions and views of others.<\/p><p>To hear a knock on a window means that you will have many good opportunities ahead for you. There are a lot of things to look forward to in the near future.<\/p><p>Dreaming of throwing something out the window implies something significant that you no longer have due to your carelessness and lack of attention.<\/p><p>*See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=airportdream1\">Online Encounter<\/a>&quot;<\/p>"
    },
    {
        "title": "Window Bars",
        "desc": "<p>To see security bars on a window in your dream represents opportunities that are in your view but still out of your grasp. Alternatively, the dream symbolizes mistrust.<\/p>"
    },
    {
        "title": "Window Shopping",
        "desc": "<p>To dream that you are window shopping suggests that you are being excluded from life's luxuries. You are feeling inadequate or unqualified.Alternatively, the dream indicates that you are looking for something that is lacking in your life. You feel unsatisfied or unfulfilled with the current direction of your life.<\/p>"
    },
    {
        "title": "Window Washer",
        "desc": "<p>To see a window washer in your dream represents your ability to clarify a situation and shed some perspective on an issue.<\/p>"
    },
    {
        "title": "Windshield",
        "desc": "<p>To look through the windshield in your dream represents what is ahead of you and the choices you make. It may also indicate that your approaching your goals in all the wrong way.<br><br>To dream that your windshield is broken or cracked indicates that you have a skewed perspective or outlook on things. You are experiencing many setbacks in the pursuit of your goals.<\/p><p>To dream that your windshield is fogged up suggests that you are not really expressing how you really feel.<\/p><p>To dream that your windshield is dirty indicates that you are confused or unclear about where you are headed in life.<\/p>"
    },
    {
        "title": "Windshield Wipers",
        "desc": "<p>To see or turn on the windshield wipers in your dream suggests that you are looking for a better perspective on something. There is a situation that you are seeking clarification. The dream may also indicate that you are doing your best to clear through some emotional turmoil.<\/p>"
    },
    {
        "title": "Windsock",
        "desc": "<p>To see a windsock in your dream suggests that you need to focus your energy toward more productive pursuits. You tend to just go with the flow of things.<\/p>"
    },
    {
        "title": "Wine",
        "desc": "<p>To dream of drinking wine symbolizes festivity, celebration, companionship, satisfaction and success. You are content with the way your life is going. The dream may also be a pun on &quot;whining&quot; and how you like to whine about things. In particular, to dream that you are drinking red wine signifies excess and sensuality.If you are drinking communion wine in your dream, then it represents some spiritual celebration or ceremony.<\/p><p>To dream that you are breaking wine bottles signify overindulgence in your desires and passion. Alternatively, the dream symbolizes the masculine.<\/p><p>To see broken wine bottles in your dream implies that you are celebrating too song. You may also be getting your hopes too high.<\/p>"
    },
    {
        "title": "Wine Cellar",
        "desc": "<p>To dream that you are in a wine cellar represents all of your past experiences - both positive and negative.<\/p>"
    },
    {
        "title": "Wine Glass",
        "desc": "<p>To see a wine glass in your dream represents happiness. It may also be symbolic of a pregnancy. If you break the wine glass, then it may denote a miscarriage.<\/p>"
    },
    {
        "title": "Wine Rack",
        "desc": "<p>To see a wine rack in your dream indicates that you are welcoming new changes. It is also symbolic of a joyous occasion.<\/p>"
    },
    {
        "title": "Winery",
        "desc": "<p>To dream that you are at a winery represents your desires to enjoy all that life has to offer. You are looking for some spiritual guidance and fulfillment.<\/p>"
    },
    {
        "title": "Wing",
        "desc": "<p>To dream that you have wings suggest new found freedom. You are on the right track and are soaring to success without limitations. Alternatively, the dream means that you are trying to escape from a difficult situation.<\/p><p>To dream that you have the wings of an angel indicate your sweet, angelic quality. Or you may be in need of some protection from life's stresses and problems.<\/p><p>To see the wings of birds in your dream indicates your desire for a freer way of life.<\/p><p>Dreaming about the wings of an insect indicate that you are unable to stay in one place for too long. You are flighty and always on the move. Alternatively, insect wings means that your ideas or way of thinking is all over the place. You need focus.<\/p><p>*Please see: <a href=\"http:\/\/www.dreammoods.com\/commondreams\/flying.htm\">Common Dream Themes: Flying<\/a><\/p>"
    },
    {
        "title": "Wingsuit",
        "desc": "<p>To see or wear a wingsuit in your dream represents your lofty aspirations and carefree attitude. You are letting the wind carry you wherever it may blow.<\/p>"
    },
    {
        "title": "Wink",
        "desc": "<p>To dream that someone is winking at you indicates that they are up to something. You are involved in some insider information. Alternatively, the dream may signal romance.<\/p>"
    },
    {
        "title": "Winter",
        "desc": "<p>To dream of winter signifies ill-health, depression, and misfortune. The dream may be analogous to how you are feeling - emotionally cold and frigid. For some, winter may mean a favorite time of the year signaling the holiday season of fun, joy, togetherness and giving. Alternatively, winter is a time of reflection and spiritual introspection.<\/p>"
    },
    {
        "title": "Wipe",
        "desc": "<p>To dream that you are wiping something suggests that you are ready to make a clean start. You want to start anew.<\/p><p>To see or use wipes in your dream indicate that you need to rid yourself of the negativity existing in your life. Consider the type of wipes. If you are using disinfecting wipes, then it means that you need to make a fresh, clean start. If you are using baby wipes, then it suggests that you need to eliminate your immature behavior or attitude.<\/p>"
    },
    {
        "title": "Wire",
        "desc": "<p>To see or work on wiring in your dream represents your energy flow. It also indicates some tension or stress in your life. Perhaps you are the live wire. Alternatively, wires represent your connection and relationship to others.<\/p><p>If the wires are old or rusty, then it symbolizes negative energy or a bad temper. The dream may also be a metaphor for feeling &quot;wired&quot;. You are excited about something.<\/p>"
    },
    {
        "title": "Wiretap",
        "desc": "<p>To dream that your telephone has been tapped indicates that aspects of your subconscious must be confronted. Alternatively, it implies that you have a fear of being exposed. There is something you are hiding.<\/p>"
    },
    {
        "title": "Wisdom Teeth",
        "desc": "<p>To dream about your wisdom teeth indicates new or emerging knowledge. You are learning something new about yourself. Alternatively, the dream may be telling you to act more smartly about a situation. Make sure to think things through clearly.<\/p>"
    },
    {
        "title": "Wise",
        "desc": "<p>To dream that you are wise represents your potential and ability to succeed and be successful. The dream may serve as a reaffirmation of the decision you are making and the path that you are taking.<\/p>"
    },
    {
        "title": "Wish",
        "desc": "<p>To dream that you are making a wish indicates that there is something that you are longing for and missing in your life. It signifies your accomplishments and hopes for the future. The dream may also be trying to reinforce your waking achievements. Alternatively, the dream may imply that you are &quot;wishy washy&quot; and indecisive. You need to be more decisive and assertive.<\/p>"
    },
    {
        "title": "Wishbone",
        "desc": "<p>To see a wishbone in your dream indicates family togetherness, celebration and hope. If you break off the larger piece of the wishbone, then you will experience a positive turn in events. If you end up with the smaller piece of the wishbone, then the dream eludes to some disappointment.<\/p>"
    },
    {
        "title": "Witch",
        "desc": "<p>To see a witch in your dream represents evil and destruction. It may point to your negative ideas of anything feminine and your experiences with dangerous or heartless women.Alternatively, a witch may be a symbol of goodness, power and enchantment depending on your feeling toward your dream witch.<\/p>"
    },
    {
        "title": "Witch's Ball",
        "desc": "<p>Dreaming about the ball or seed of a sweetgum tree (witches ball) represents protection. Alternatively, a sweetgum ball may be analogous to a prickly situation where you are unable to detach yourself from.<\/p>"
    },
    {
        "title": "Witchcraft",
        "desc": "<p>To dream about witchcraft signifies some inner transformation or changes. It may also suggest that something or someone is manipulating you and your surroundings.<\/p>"
    },
    {
        "title": "Witness",
        "desc": "<p>To witness to something in your dream represents your need to be more observant. You need to examine something more closely and look at a situation more objectively. Alternatively, the dream suggests that you are watching life pass you by. Perhaps you are emotionally detached or feel you are an outcast of society.<\/p><p>To dream that you are testifying as a witness indicates that you need to be accountable for your actions.<\/p>"
    },
    {
        "title": "Wizard",
        "desc": "<p>To see a wizard in your dream suggests that you are trying to hone your skills and exercise your power.<\/p>"
    },
    {
        "title": "Wok",
        "desc": "<p>To see or use a wok in your dream symbolizes support and warmth or the lack of. If you cook with a wok in real life, then the dream means that you are surrounded by those who stand behind your decisions. If you are unfamiliar with cooking with a wok, then the dream has the opposite meaning. You feel unsupported.<\/p>"
    },
    {
        "title": "Woke",
        "desc": "<p>*Please See: <a href=\"#Awaken\">Awaken<\/a>.<\/p>"
    },
    {
        "title": "Wolf",
        "desc": "<p>To see a wolf in your dream symbolizes survival, beauty, solitude, mystery, self-confidence and pride. You are able to keep your composure in a variety of social circumstances and blend into any situation with ease and grace. You are also a loner by choice. Negatively, the wolf represents hostility, aggression, or sneakiness.Dreaming that a wolf is attacking you reflects an uncontrollable situation or an all-consuming force in your life.This could point to an obsession, an addiction, a codependent or abusive relationship or something that is beyond your control.<\/p><p>To see a white wolf in your dream signifies valor and victory. You have the ability to see the light even in your darkest hours.To see a black wolf in your dream represents your shadow. There are characteristics of the wolf that you are refusing to acknowledge or incorporate into your Self.If you dream about fighting a black wolf, then it means that you are in deep denial and are suppressing something.<\/p><p>To dream that you kill a wolf indicates betrayal. Certain secrets will be revealed to you. If you are being chased by a wolf in your dream, thenit implies that you are unwilling to confront a problem that has been negatively impacting your life. Instead you are running away from it.<\/p><p>To hear a wolf howling in your dream represents a cry for help from somebody in your waking life.<\/p><p>To dream that you are a wolf signifies your desires to be left alone. Perhaps you are going through a tough period and want to be on your own. You are feeling anti-social.<\/p><p>To dream that a wolf turns into a puppy refers to your nurturing character. After being alone for awhile, you are looking for a relationship.<\/p><p>Dreaming that a wolf is protecting you means that you are receiving help or support from an unexpected or unlikely source. You may have perceived this person all wrong.<\/p><p>To see a pack of wolves in your dream symbolizes a family unit. It may highlight a sense of belonging and how family looks out for each other. Alternatively, a wolf pack represents a gang or an intimidating group.<\/p>"
    },
    {
        "title": "Wolverine",
        "desc": "<p>To see a wolverine in your dream symbolizes great strength, fierceness and might. Don't underestimate your abilities.<\/p><p>To dream that you are Wolverine from the X-Men refers to your animalistic nature and power. It also represents your ability to bounce back from some physical setbacks. If you dream that you have X-Men's Wolverine's claws, then it implies that nothing is holding you back. You are able to get through any obstacles on your path.<\/p>"
    },
    {
        "title": "Woman",
        "desc": "<p>To see a woman in your dream represents nurturance, passivity, caring nature, and love. It refers to your own female aspects or your mother. Alternatively, a woman indicates temptation and guilt. If you know the woman, then it may reflect concerns and feelings you have about her.<\/p><p>To see an old woman in your dream indicates your concerns about aging and growing old. Alternatively, the old woman may be an archetypal figure to symbolize wisdom, insight, and\/or feminine power. If you dream that the old woman is blind, then the dream is telling you to go with your gut instincts. Sometimes you can't see what is going on, but you still sense it.<\/p><p>Dreaming of a pregnant woman indicates that you are experiencing a closer connection to her.<\/p><p>If you are a man and dream that you are a woman, then it suggests that you need to incorporate or acknowledge certain feminine aspects into your own self. Ask yourself how you feel when you dreamed that you were a woman.<\/p>"
    },
    {
        "title": "Womb",
        "desc": "<p>To dream that you are still in the womb suggests that you are regressing into a period of time when you were safe and completely dependent. You may be trying to escape from the demands of your daily life.<\/p><p>To see the womb in your dream represents creation, childbirth, fertility and new beginnings The dream is also symbolic of fresh new ideas.<\/p>"
    },
    {
        "title": "Wombat",
        "desc": "<p>To see a wombat in your dream suggests that you need to stay more grounded. Perhaps the dream is telling you that you need to come back to reality.<\/p>"
    },
    {
        "title": "Wonder Woman",
        "desc": "<p>To see Wonder Woman in you dream refers to a strong, powerful and\/or confident woman in your life.<\/p><p>Dreaming that you are Wonder Woman means that you feel like you are on top of the world and that there is nothing you can't handle. Alternatively, being Wonder Woman in your dream suggests that you are overwhelmed with life's challenges and feel like you need to be a super hero in order to handle it all.<\/p>"
    },
    {
        "title": "Wonderland",
        "desc": "<p>*Please Refer to: <a href=\"#Alice\">Alice In Wonderland<\/a>.<\/p>"
    },
    {
        "title": "Wonton",
        "desc": "<p>To see or eat wontons in your dream symbolize warmth, family and togetherness. Alternatively, the dream may be a pun on a &quot;wanton&quot; or immoral act or behavior.<\/p>"
    },
    {
        "title": "Wood",
        "desc": "<p>To dream of wood suggests that you are feeling dead and emotionless inside. Your behavior is too automated. You are not fully thinking things through. Alternatively, the dream may be a pun on &quot;getting wood&quot; or sexual arousal.<\/p><p>To dream that you are carving or shaping a piece of wood indicates a power-giving act or creative gesture. You are molding or shaping the course of your own life. Alternatively, the carved wood symbolizes spirituality and vital energy.<\/p><p>Dreaming about a pile of wood symbolizes warmth and togetherness. It may also indicate some misunderstanding in a relationship. Alternatively the dream is about hard work, labor and diligence.<\/p>"
    },
    {
        "title": "Wood Paneling",
        "desc": "<p>To see wood paneling in your dream symbolizes your outdated surroundings and thinking. You are stuck in a time period and are looking at the world from an archaic perspective.<\/p>"
    },
    {
        "title": "Woodchuck",
        "desc": "<p>To see a woodchuck in your dream represents subconscious material that is coming to the surface. You are ready to confront some news.<\/p>"
    },
    {
        "title": "Wooden Leg",
        "desc": "<p>To dream that you have a stick leg or a wooden leg suggests that balance has been restored in your once chaotic or hectic life. You are able to stand up again with the help and support of others. Alternatively, the dream may be telling you to slow down.<\/p>"
    },
    {
        "title": "Wooden Shoe",
        "desc": "<p>To see a wooden shoe in your dream signifies solitude and unfaithfulness.<\/p>"
    },
    {
        "title": "Woodpecker",
        "desc": "<p>To see a woodpecker in your dream indicates that there is something in you waking life which you have overlooked. The woodpecker also symbolizes industry and diligence.<\/p>"
    },
    {
        "title": "Woods",
        "desc": "<p>To see the woods in your dream represent life, fertility, rejuvenation, and spring. Alternatively, the woods symbolize the unknown and the subconscious. You need to open yourself up to discovering your potential and your instinctual nature.<\/p><p>To dream that you are walking through the woods signify your return to an aspect of yourself that is innocent and spiritual. If you are walking out of the woods, then the dream may be a literal depiction of being &quot;out of the woods&quot; or being in the clear of some situation.<\/p><p>To dream that you are lost in the woods indicates that you are starting a new phase in your life. You are expressing some anxiety about leaving behind what is familiar to you.<\/p><p>To dream that the woods are dry or dying suggests that there is a situation in your life that has not yet been resolved. You are overwhelmed with a problem or issue.<br><br>"
    },
    {
        "title": "To see wool in your dream symbolizes warmth and coziness. You are seeking protection from loved ones. Alternatively, the dream indicates that you are being naive or gullible about some situation. Consider the phrase &quot;having the wool pulled over your eyes&quot;. Perhaps you have been tricked or duped.",
        "desc": "<p>Dreaming of a ball of wool signifies some project that requires your creativity and\/or imagination. If the ball of wool grows bigger and bigger, then the dream points to a strong creative energy that cannot be ignored.<\/p>"
    },
    {
        "title": "Words",
        "desc": "<p>To see random words in your dream signify some confusion in your thought process. Your mind is too cluttered. Alternatively, the dream may be a pun on how &quot;you have my word&quot;, as in a promise to be kept.<\/p><p>Dreaming of a specific word may be an acronym or an association to someone\/something in your waking life. Try using free association with that word to determine what your subconscious may be revealing.<\/p>"
    },
    {
        "title": "Work",
        "desc": "<p>To dream that you are at work indicates that you are experiencing some anxiety about a current project or task. The dream may also be telling you that you need to &quot;get back to work&quot;. Perhaps you have been slacking off and need to pick up the pace. Stop procrastinating. Alternatively, the dream reflects your success.<\/p><p>To dream that you are at your former work suggests that there is an old lesson that you need to learn and apply to your current situation.<\/p><p>To dream that you have been replaced at work represents your concern about your current job security. You feel that you are in a precarious position at work or in some group project.<\/p><p>Dreaming that you are late for work suggests that you are feeling overwhelmed or stressed at work. You feel that you are being scrutinized despite putting forth your best effort.<\/p>"
    },
    {
        "title": "Workman",
        "desc": "<p>To see workmen in your dream signify that you need to work on yourself and explore your mind. There is an aspect of yourself that has yet to be acknowledged or utilized.<\/p>"
    },
    {
        "title": "Workshop",
        "desc": "<p>To see a workshop in you dream represents the development of your skills. You are trying to understand your Self and find out who you are.<\/p>"
    },
    {
        "title": "World",
        "desc": "<p>To dream that it is the end of the world suggests that you are under a tremendous level of stress. You may be feeling vulnerable or helpless in some situation.<\/p><p>To dream that you are saving the world signifies confidence in your abilities and belief in yourself. You have a positive perspective on life and in where you are headed. Don't let someone or something prevent you from progressing forward or question your abilities.<\/p><p>**See The Meaning In Action: &quot;<a href=\"http:\/\/dreammoods.com\/cgibin\/dreambank.pl?method=exact&amp;header=dreamid&amp;search=spacedream2\">End Of The World<\/a>&quot;<\/p>"
    },
    {
        "title": "World Trade Center",
        "desc": "<p>To see the World Trade Center in your dream implies that some situation or relationship is collapsing around you. You feel you are no longer in control of your circumstances. Because the attacks on the World Trade Center touched almost everyone on some personal level, your dream may indicate that you are still dealing with your emotions brought on as a result of the attack. Or a situation in your waking life may be bringing about these similar feelings.<\/p>"
    },
    {
        "title": "Worm",
        "desc": "<p>To see a worm in your dream represents weakness, degradation, filth and general negativity. You have a very low opinion of yourself or of someone in your life.The dream may also relate to self-esteem issues or a skewed self image. Alternatively, dreaming of a worm may be a metaphor for someone who is untrustworthy or slick.<\/p><p>To dream that the worm is crawling on your body indicates that you feel someone around you is taking advantage of you and feeding off your kind heartedness.<\/p>"
    },
    {
        "title": "Wormhole",
        "desc": "<p>To dream that you are going through a wormhole means that you are feeling desperate to escape from your present reality.<\/p>"
    },
    {
        "title": "Worry",
        "desc": "<p>To dream that you are worried about something is a reflection of waking worry that has carried over to your dream state. You may be harboring some repressed thoughts,some unexpressed emotions, resentments, or hostilities which are triggering your worry dream.<\/p>"
    },
    {
        "title": "Worship",
        "desc": "<p>To dream that you are worshipping someone or something indicates that you are paying too much attention to this person or to whatever the object represents. You are being overly attentive. Alternatively, the dream means that you are open or receptive to outside influences.<\/p>"
    },
    {
        "title": "Wound",
        "desc": "<p>To dream that you are wounded signifies grief, anger, or distress. You need to slow down and take time to heal. Consider the location, size and type of wound. Alternatively, the dream may be metaphor that you are all &quot;wound up&quot; or tense about some situation.<\/p>"
    },
    {
        "title": "Wrapping",
        "desc": "<p>To dream that you are wrapping something indicates that you are trying to hide the truth You are involved in a cover-up. Alternatively, the dream suggests that you are trying to present the ugly truth in a way that is easier to accept. Consider what you are wrapping and the color or pattern of the wrapping paper.The dream may be a pun on &quot;rapping&quot; and your need to speak up about something.<\/p>"
    },
    {
        "title": "Wreath",
        "desc": "<p>To see a wreath in your dream symbolizes honor, celebration, continuity or completeness. Alternatively, a wreath represents sorrow and mourning. You are wallowing in self-pity. The dream also signals the end of some relationship.<\/p><p>To give a wreath to someone signifies the bond you have with that person.<\/p>"
    },
    {
        "title": "Wreck",
        "desc": "<p>To see a wreck in your dream represents obstacles and barriers toward your goals. You feel that you are being held back or that you are not making any progress.<\/p>"
    },
    {
        "title": "Wren",
        "desc": "<p>To see a wren in your dream symbolizes good luck.<\/p>"
    },
    {
        "title": "Wrench",
        "desc": "<p>To see or use a wrench in your dream indicates your desire to fix a situation or relationship. You feel that it is your job to repair and put things back in order.<\/p>"
    },
    {
        "title": "Wrestling",
        "desc": "<p>To dream that you are wrestling suggests that you are grappling with a problem in your personal or professional life. You are dealing with ideas and habits that need to be brought back into control.<\/p>"
    },
    {
        "title": "Wrinkle",
        "desc": "<p>To see a wrinkle in your dream represents your feelings of getting older or wiser. It also symbolizes the things you have learned from your past experiences.<\/p>"
    },
    {
        "title": "Wrist",
        "desc": "<p>To notice your wrist in your dream represents your ability to combine fun and excitement with productivity at the same time. You are able to grab the attention of others and get them involved.<\/p><p>To see an injured or bandaged wrist in your dream indicates a loss in productivity. You are in an imbalanced or one-sided relationship. In particular, if you dream that your wrists are injured, then it implies that you are not reaching out to others enough. Alternatively, the dream suggests that you are taking more than you give.<\/p><p>To dream that you cut your wrist means that you are feeling withdrawn. You are refusing help from others.<\/p>"
    },
    {
        "title": "Writing",
        "desc": "<p>To dream that you are writing signifies communication with someone or with your conscious mind. Alternatively, writing refers to an error in judgment or a mistake that you have made. The dream may also be a metaphor that you are &quot;right&quot; or that your political views are right leaning.<\/p><p>To see ancient writings in your dream suggests that there is something you need to learn and understand from the past.<\/p>"
    },
    {
        "title": "Wrong",
        "desc": "<p>To dream that you are wrong about something indicates that you are doubting yourself in the choices and decisions that you are making. Perhaps you are admitting you are wrong.<\/p><p>Dreaming that you are going the wrong way means that you are being counterproductive. Your efforts are wasted. Alternatively the dream is trying to tell you that you are misguided and are set on a negative path.<\/p>"
    }
]