[
    {
        "title": "Y",
        "desc": "<p>To see the letter Y in your dream indicates some decision that you need to make. It may represent a fork in the road or a path that you need to choose. The letter Y may also be a pun on &quot;why&quot;. Perhaps there is something that you need to start questioning.<\/p>"
    },
    {
        "title": "Yacht",
        "desc": "<p>To see a yacht in your dream symbolizes wealth, pleasure, and luxury. You are free of any worries and focused on a life of ease. The dream may also be telling you that you need to devote more time to recreational pursuits. Just take it easy for a while.<\/p>"
    },
    {
        "title": "Yak",
        "desc": "<p>To see a yak in your dream represents your uniqueness and dependability. The yak may also be a pun on &quot;yakking&quot; too much. Maybe you should stop talking and listen more.<\/p>"
    },
    {
        "title": "Yam",
        "desc": "<p>To see or eat yams in your dream signify sensuality and virility.<\/p>"
    },
    {
        "title": "Yantra",
        "desc": "<p>To see a yantra in your dream represents cosmic energy and emerging consciousness. It also indicates stability and constancy in your life.<\/p>"
    },
    {
        "title": "Yard",
        "desc": "<p>To see a neat and well-kept yard reflects your ability to maintain and organize aspects of your outside life, such as work and your social activities.<\/p><p>To see a messy and unkempt yard denotes that aspects of your life are out of your control.<\/p><p>In particular, to see your front yard represents what you choose to let other see. It is symbolic of your social personal. Consider the condition of the yard and any objects in the yard. For example, if there is a ball in the front yard, then it may mean that you want others to get to know your playful side.<\/p>"
    },
    {
        "title": "Yard Sale",
        "desc": "<p>To hold or be at a yard sale in your dream indicates that you are recycling past experiences and finding use for your old skills and ideas. You are learning from your past and making productive use of the lessons you have learned.<\/p>"
    },
    {
        "title": "Yardstick",
        "desc": "<p>To see a yardstick in your dream. symbolizes rigidity and an unyielding personality. Alternatively, a yardstick represents good judgment and acceptance.<\/p>"
    },
    {
        "title": "Yarmulke",
        "desc": "<p>To see or wear a yarmulke in your dream symbolizes Judaism and the Jewish faith. Alternatively, the dream suggests that you are trying to shield yourself from some higher spirit or force.<\/p>"
    },
    {
        "title": "Yarn",
        "desc": "<p>To see yarn in your dream symbolizes your connection and creativity. Alternatively, yarn in your dream means that you are stuck in a rut. You are going about your daily life in the same old tired pattern. If the yarn is tangled and knotted, then it implies that you are experiencing some emotional distress or confusion in a situation.<\/p>"
    },
    {
        "title": "Yawning",
        "desc": "<p>To dream that you or someone is yawning suggests that you are lacking emotional and intellectual stimulation. You are also lacking energy and vitality in your life.<\/p>"
    },
    {
        "title": "Year",
        "desc": "<p>To dream of a year signifies a passage of time. It represents a cycle of growth, learning and maturity.<\/p>"
    },
    {
        "title": "Yearbook",
        "desc": "<p>To see your yearbook in your dream represents the old friends or old flames that you have lost touch with over the years. The dream may also serve to bring you back to a time where you had less responsibilities and less worries. Consider if anybody signed your yearbook and the messages written as it may provide some important advice to follow.<\/p>"
    },
    {
        "title": "Yearn",
        "desc": "<p>To dream that you are yearning for something or someone indicates that there is a void that is lacking in your waking life. You are suppressing some old habit or denying yourself of something. What are you yearning for in your dream? You need to fulfill this void.<\/p>"
    },
    {
        "title": "Yeast",
        "desc": "<p>To see yeast in your dream indicates a spiritual quest. You may need to do some soul searching and\/or self-improvement. Alternatively, yeast is symbolic of growth,renewed energy or increased enthusiasm for an idea or project.<\/p>"
    },
    {
        "title": "Yelling",
        "desc": "<p>To dream that you or someone is yelling represents repressed anger that needs to be expressed. If you are yelling and no one hears, then it suggests that you are being overlooked in some waking situation. You feel that your voice does not matter or that your opinion does not count. In particular, hearing demonic yelling in your dream means there is something you thought you have left in the past that is still haunting you.<\/p>"
    },
    {
        "title": "Yellow Bird",
        "desc": "<p>To see a yellow bird in your dream represents a positive outlook in your professional life.<\/p>"
    },
    {
        "title": "Yes",
        "desc": "<p>To dream that you are saying &quot;yes&quot; symbolizes reaffirmation or acceptance of a condition, situation or decision. The dream may also be giving you permission to do something that you are having doubts about in your waking life.<\/p>"
    },
    {
        "title": "Yesterday",
        "desc": "<p>To dream about yesterday indicates that you need to stop reliving the past and learn to let go. Focus on the future. Alternatively, the dream symbolizes past regrets.<\/p>"
    },
    {
        "title": "Yeti",
        "desc": "<p>To see a yeti in your dream suggests that you need to learn to find balance between your reasonable, rational side and your emotional, instinctual nature.<\/p>"
    },
    {
        "title": "Yew Tree",
        "desc": "<p>To see a yew tree in your dream symbolizes mourning and death. The dream may also be a metaphor to mean &quot;you&quot;, the dreamer.<\/p>"
    },
    {
        "title": "Yield",
        "desc": "<p>To dream that you yield to someone else refers to your willingness to sacrifice your authority in order to maintain calmness in your domestic life or personal relationship.<\/p><p>To see a yield sign in your dream suggests that you need to be more flexible in your thinking. Don't be so structured or hard.<\/p>"
    },
    {
        "title": "Yin Yang",
        "desc": "<p>To see the yin yang in your dream symbolizes a balance of opposites. It represents the feminine and the masculine, the spiritual and the physical, and the emotional and the rational.<\/p>"
    },
    {
        "title": "YMCA",
        "desc": "<p>To see or dream that you are at the YMCA indicates that you are feeling spiritually and physically empowered. Alternatively, the dream may be a metaphor for &quot;why&quot;. There is something that you need to question. YMCA may also refer to the song by the Village People and thus the dream is about a specific period of time or memory that the song brings back for you.<\/p>"
    },
    {
        "title": "Yodel",
        "desc": "<p>To hear yodeling in your dream represents a cryptic message from your subconscious. Listen carefully to the tones and syllables.<\/p><p>To yodel in your dream represents the connection between your mind and your heart.<\/p>"
    },
    {
        "title": "Yoga",
        "desc": "<p>To dream that you are performing yoga symbolizes unity, balance, harmony, calmness, and self-discipline. You have complete control of your mind and body. Alternatively, the dream indicates that you are stressed and overwhelmed. You need to take a breather.<\/p>"
    },
    {
        "title": "Yogurt",
        "desc": "<p>To see or eat yogurt in your dream suggests that you need to learn to behave appropriately for the different situations and various circumstances you find yourself in.<\/p>"
    },
    {
        "title": "Yoke",
        "desc": "<p>To see a yoke in your dream signifies your unwillingness to conform to the customs and wishes of others.<\/p><p>To dream that you are yoking an oxen indicates acceptance. You need to heed the advice of others.<\/p>"
    },
    {
        "title": "Yolk",
        "desc": "<p>To see an egg yolk in your dream represents life, ideas, and creativity.<\/p>"
    },
    {
        "title": "Yorkshire Terrier",
        "desc": "<p>To see a Yorkie in your dream is telling you not to underestimate someone's small size. Alternatively, the dream may imply that you are being too loud or too vocal. You need to listen more.<\/p>"
    },
    {
        "title": "Young",
        "desc": "<p>To see young people in your dream indicates a fresh outlook on your life. It may also represent a more youthful aspect of yourself. Perhaps you need to be more playful and carefree.<\/p><p>To dream that you are young again indicates that you are behaving childish or immaturely. Alternatively, it represents your failed attempts to rectify past mistakes. You are dwelling too much on past regrets and lost opportunities. It is time to move on toward the future.<\/p>"
    },
    {
        "title": "Yourself",
        "desc": "<p>To see yourself in your dream is a reflection of how you act and behave in your waking life. Consider what you are doing and how you are feeling in the dream for additional significance.<\/p>"
    },
    {
        "title": "YouTube",
        "desc": "<p>To dream that you are watching YouTube signifies subconscious thoughts and ideas that are flowing in your mind. Consider the content of the video that you are watching. If you are watching a &quot;how to&quot; video, then it means that you want to expand your own knowledge. You are open to new experiences. If you are watching a music video, then the song or video may parallel what is going on in your waking life. Alternatively, watching YouTube means that you have control over your own thoughts.<\/p>"
    },
    {
        "title": "Yoyo",
        "desc": "<p>To see or play with a yoyo in you dream signifies the ups and downs of your life. Alternatively, the dream indicates that you are not taking life's issues and problems seriously enough. You see things too trivially.<\/p>"
    },
    {
        "title": "Yucca",
        "desc": "<p>To see a yucca plant in your dream indicates that you need to think outside the box or outside of convention. Alternately, the dream suggests that you need to be more flexible and yielding in your thinking in order to move further toward your goals.<\/p>"
    },
    {
        "title": "Yule Log",
        "desc": "<p>To see a Yule log in your dream signifies a positive turn of events in the coming year.<\/p><p>To dream of burning a Yule log warns that you should not set your sights too high. You need to be more realistic.<\/p>"
    }
]