[
    {
        "title": "Z",
        "desc": "<p>To see the letter &quot;Z&quot; in your dream suggests that you need to get more &quot;Zzzz's&quot; or rest.<\/p>"
    },
    {
        "title": "Zamboni",
        "desc": "<p>To see a Zamboni in your dream implies that you are closing yourself off to new ideas and opinions. You tend to be emotionally rigid.<\/p>"
    },
    {
        "title": "Zebra",
        "desc": "<p>To see a zebra in your dream represents perfect balance, unity and harmony. It also indicates that opposites attract. Alternatively, a zebra suggests that you are spending too much time in trivial matters. You need to establish a clear timeline and lay your groundwork for success.<\/p><p>To dream that a zebra is running implies that you are trying to escape from a dangerous relationship or situation.<\/p>"
    },
    {
        "title": "Zen",
        "desc": "<p>To dream of being Zen symbolizes yourquest for spiritual balance and harmony. You are at peace of yourself. Perhaps you need to practice meditation."
    },
    {
        "title": "Zenith",
        "desc": "<p>To dream of staring up into the zenith symbolizes your potential. You are pushing your limits and overcoming obstacles in the pursuit of your goals.<\/p><p>To dream that you have reached the zenith of your profession indicates you are in a dead-end job. It is time for a career change.<\/p>"
    },
    {
        "title": "Zephyr",
        "desc": "<p>To dream of zephyrs symbolize your desire for love and happiness over wealth and fortune. You will sacrifice fortune in order to obtain the object of your affection. Alternatively, the dream represents your satisfaction and general contentment with life.<\/p>"
    },
    {
        "title": "Zeppelin",
        "desc": "<p>*Please See<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/d2.htm#Dirigible\">Dirigible.<\/p><p>Zero<\/p><p>Zero symbolizes nothingness and emptiness. You are experiencing a void in your life. The symbol may also share the same significance as a circle and thus denotes infinity, eternity, completeness, absolute freedom and holiness. Alternatively, the dream forewarns that you are going around in circles and headed no where. Perhaps your actions have been counterproductive. It also represents timelessness and the super-conscious.<\/p><p>*Please See Also<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/c3.htm#Circle\">Circle or<a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/numbers.htm\">Number.<\/p>"
    },
    {
        "title": "Zeus",
        "desc": "<p>To see or dream that you are Zeus suggests that you have total control over your life. You are looking for better control.<\/p>"
    },
    {
        "title": "Zig-Zag",
        "desc": "<p>To see zig-zags in your dream represent your erratic behavior. It may also indicate that you are being defensive about something.<\/p>"
    },
    {
        "title": "Zinc",
        "desc": "<p>To see zinc in your dream suggests that your professional or educational pursuits will go through a process of positive renewal and energetic progress.<\/p><p>To taste zinc in your dream is your subconscious telling you that you are lacking in an essential vitamin or mineral. Be aware of developing heath problems.<\/p>"
    },
    {
        "title": "Zinnias",
        "desc": "<p>To see zinnias in your dream symbolize laughter, friendships, and joy. It is also signals summer pleasures.<\/p>"
    },
    {
        "title": "Zip Code",
        "desc": "<p>To see a zip code in your dream represents your identity and your sense of being grounded. Add up the digits of the zip code and determine the significance of that number. Refer to Dream Moods<a href=\"http:\/\/www.dreammoods.com\/dreamthemes\/numbers.htm\">Dream Themes Numbers.<\/p>"
    },
    {
        "title": "Zip Line",
        "desc": "<p>To dream that you are zip lining implies that you need to get a new perspective of some situation. The dream may literally mean an &quot;overview&quot;. If you are going too fast, then the dream is telling you that you are letting life pass you by. If you are stuck on a zip line, then it implies that you need to examine a situation more carefully.<\/p>"
    },
    {
        "title": "Ziploc Bag",
        "desc": "<p>To see or use a Ziploc bag in your dream represents a reserve a energy that you are waiting to exert. Consider the significance of the bag contents.<\/p>"
    },
    {
        "title": "Zipper",
        "desc": "<p>To see a zipper in your dream implies sexuality and sexual innuendos. If you are unzipping, then it indicates that you are opening up. If you are zipping up, then it suggests that you are closing yourself off emotionally. Alternatively, the dream may be a pun that you need to keep your mouth &quot;zipped.&quot; You are talking too much.<\/p><p>To see a broken or stuck zipper in your dream refers to your difficulties in expressing your sexual desires or feelings. You are frustrated about not being able to resolve a situation or problem.You may also have difficulty in maintaining your composure, especially in an awkward or public situation.<\/p>"
    },
    {
        "title": "Zither",
        "desc": "<p>To see or hear a zither in your dream suggests that you are seeking the truth.<\/p>"
    },
    {
        "title": "Zits",
        "desc": "<p>*Please see Dream Moods' interpretation for<a href=\"http:\/\/www.dreammoods.com\/dreamdictionary\/p3.htm#Pimples\">Pimples.<\/p>"
    },
    {
        "title": "Zodiac",
        "desc": "<p>To see the zodiac in your dream represents the various aspects of your conscious being and how you connect to the universe. Alternatively, the zodiac may appear in a dream to denote the passage of time.<\/p><p>If you dream of a particular zodiac sign, then look at the particular traits and attributes associated with the given sign.<\/p>"
    },
    {
        "title": "Zombie",
        "desc": "<p>To see or dream that you are a zombie suggests that you are physically and\/or emotionally detached from people and situations that are currently surrounding you. You are feeling out of touch. Alternatively, a zombie means that you are feeling dead inside. You are just going through the motions of daily living.<\/p><p>To dream that you are attacked by zombies indicate that you are feeling overwhelmed by forces beyond your control. You are under tremendous stress in your waking life. Alternatively, the dream represents your fears of being helpless and overpowered.<\/p><p>To see someone as a zombie implies that your feelings for them is dead. You have not emotional attachment towards them.<\/p><p>If you dream that you ate a zombie, then it means that you are holding onto a relationship that is dead. Eating a zombie in your dream may also point to how you distance yourself from others as a way of protecting your own feelings.<\/p>"
    },
    {
        "title": "Zoo",
        "desc": "<p>To dream that you are at a zoo symbolizes loss of freedom. Alternatively, a zoo suggests that your abilities and talents are going unnoticed.You or an aspect of your life feels caged in.The zoo may also represent chaos and confusion as implied by the common phrase &quot;this place is a zoo!&quot; You may need to tidy up some situation in your life.<\/p><p>To dream that animals escape from the zoo implies that your hidden desires can no longer be contained and must be acknowledged or expressed.<\/p>"
    },
    {
        "title": "Zookeeper",
        "desc": "<p>To see a zookeeper in your dream suggests that you are on the verge of losing control over some aspect of your life. Some situation or emotion is threatening to come to the surface.<\/p>"
    },
    {
        "title": "Zoomorphism",
        "desc": "<p>To dream that you are changing into the form of an animal indicates that you are becoming less civilized, less restrained and becoming more free and instinctive. You may be expressing your newfound freedom\/independence and experiencing a lack of boundaries. Alternatively, taking the form of an animal suggests that your primal desires and\/or repressed sexual urges are coming to the surface and needing to be satisfied. Consider also the animal that your turn into.<\/p>"
    }
]